[
  {
    "id": "MEM-120-14",
    "position_title": "DIGITAL EDITOR",
    "office": "Compilation of Precedents Office",
    "location": null,
    "posting_date": "2014-01-27",
    "description": "The Compilation of Precedents Office is looking for a DIGITAL EDITOR to join the office. The Digital Editor will assist the Legal Editors and the IT Director on a variety of projects relating to the publication of the precedents of the U.S. House of Representatives. The Office is nonpartisan and is affiliated with the House Parliamentarian's Office.",
    "responsibilities": [
      "Maintaining, updating, and editing the Office's SQL database for content and accuracy for publishable materials. Researching and composing reports from database to assist with Office's needs. Utilizing technological knowledge to expand and enhance the database's capabilities while maintaining accuracy and precision.",
      "Working closely with the IT Director on developing other research methods and composition techniques based on current capabilities and in accordance with Government Printing Office's technology/standards.",
      "Assisting the Legal Editors in preparation for publications of various products. This will include citation checking, basic copy editing, and style checking consistent with internal, GPO, and legal standards.",
      "Acting as a liaison between the Office and the GPO in production and distribution of products. The Digital Editor will potentially oversee work of GPO detailees and interns working on various projects for office.",
      "Creating new research reports from a variety of sources (including internal database, various government and legal databases, and working with various House staff) as needed."
    ],
    "qualifications": [
      "Bachelor's degree required.",
      "Excellent computer database management essential. Knowledge of SQL, XML, Microsoft Office, and publication software preferred.",
      "Excellent editing skills and commitment to detail essential. Legal or citation checking helpful.",
      "Commitment to nonpartisan atmosphere essential. Knowledge of Hill or legislative processes helpful, but not essential.",
      "Ability to work both independently and in a collaborative matter essential. Ability to be a self-starter also essential."
    ],
    "how_to_apply": "Please send cover letter, resume sample, and either a writing sample or digital portfolio to Andrew Neal, Compilation of Precedents Editor, by email only to Andrew.neal@mail.house.gov by March 1, 2014. Hire date April 1, 2014.",
    "salary_info": null,
    "contact": "Andrew.neal@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-119-14",
    "position_title": "Transportation Legislative Assistant",
    "office": "New Jersey Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2014-01-27",
    "description": "New Jersey Democrat is seeking a legislative assistant to handle the Member’s work on the Transportation and Infrastructure Committee. Responsibilities include: preparing and staffing the Member for committee hearings and markups, developing and advancing legislation and other policy priorities of the Member, researching and advising the Member on bills and other issues, representing the Member in meetings, and drafting constituent correspondence. Other issues to be handled include: labor, education, agriculture, and arts and humanities. The ideal candidate will have a transportation background and Hill experience.",
    "responsibilities": [
      "Preparing and staffing the Member for committee hearings and markups",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "qualifications": [
      "Transportation background",
      "Hill experience"
    ],
    "how_to_apply": "Please e-mail cover letter, resume and two brief writing samples to nj08jobs@gmail.com. Please no calls or drop-ins.",
    "salary_info": null,
    "contact": "nj08jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-118-14",
    "position_title": "Staff Assistant",
    "office": "Congressman Steven Horsford",
    "location": "North Las Vegas",
    "posting_date": "2014-01-27",
    "description": "Congressman Steven Horsford seeks Staff Assistant for District Office in North\nLas Vegas. Applicants must be motivated to serve the 4th Congressional District\nof Nevada and possess a strong work ethic. The Staff Assistant monitors and\nupdates the Congressman and District Office staff on district and local issues.\nThis position acts as a liaison for constituent requests for general information,\nquestions on community resources, and other inquiries.",
    "responsibilities": [
      "Monitors and updates the Congressman and District Office staff on district and local issues.",
      "Acts as a liaison for constituent requests for general information, questions on community resources, and other inquiries."
    ],
    "qualifications": [
      "Recent administrative experience with",
      "Strong written and verbal communication skills",
      "An understanding of, congressional office policies and procedures"
    ],
    "how_to_apply": "Electronically submit cover letter, resume, professional references, and writing sample to NV04Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NV04Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-109-14",
    "position_title": "Community Liaison/Caseworker",
    "office": "Congressman Steven Horsford",
    "location": "North Las Vegas",
    "posting_date": "2014-01-27",
    "description": "Congressman Steven Horsford seeks Community Liaison/Caseworker for District Office in North Las Vegas. Applicants must be motivated to serve the 4th Congressional District of Nevada and possess a strong work ethic. The Community Liaison/Caseworker monitors and updates the Congressman and Deputy District Director on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents.",
    "responsibilities": [
      "Monitors and updates the Congressman and Deputy District Director on district and local issues.",
      "Acts as a liaison to federal, district, and local agencies for the Congressman and constituents",
      "Answers casework correspondence and verbal communications with constituents."
    ],
    "qualifications": [
      "Recent experience with, and understanding of U.S. Military and Department of Veteran's Affairs structure, the procedures, and policies is required."
    ],
    "how_to_apply": "Electronically submit cover letter, resume, professional references, and writing sample to NV04Jobs@mail.house.gov. Application deadline is Wednesday, January 22, 2014.",
    "salary_info": null,
    "contact": "NV04Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-108-14",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2014-01-27",
    "description": "Duties include: answering telephones; assisting with the committee investigations production process; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy.",
    "responsibilities": [
      "answering telephones",
      "assisting with the committee investigations production process",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov NO PHONE CALLS PLEASE.",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-107-14",
    "position_title": "Labor Policy Counsel (Pensions)",
    "office": "House Committee Democrats",
    "location": null,
    "posting_date": "2014-01-27",
    "description": "House Committee Democrats with jurisdiction over private sector employment issues seek highly motivated counsel or advisor to handle pension and retirement policy matters, including legislative and oversight work related to defined benefit pension plans, 401(k)’s, ERISA, the Pension Benefit Guaranty Corporation (PBGC), and the Employee Benefits Security Administration (EBSA). While the core of the work will be focused on retirement issues, this position may cover additional areas within labor policy, to be determined. Candidates must have familiarity with ERISA and employment and labor law generally, with at least three years of experience working in these areas. Candidates must have excellent research and writing skills. Candidates must thrive in a fast-moving environment; be team-oriented, creative, and strategic; and have a positive, can-do attitude. Experience working on Capitol Hill is a plus. This position provides an opportunity to work for highly engaged, energetic Members of Congress and policy staff with a strong commitment to strengthening workers’ rights and working families’ retirement security.",
    "responsibilities": [],
    "qualifications": [
      "Familiarity with ERISA and employment and labor law generally, with at least three years of experience working in these areas.",
      "Excellent research and writing skills.",
      "Thrive in a fast-moving environment; be team-oriented, creative, and strategic; and have a positive, can-do attitude.",
      "Experience working on Capitol Hill is a plus."
    ],
    "how_to_apply": "Send cover letter and resume to edlabor.press@mail.house.gov.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "edlabor.press@mail.house.gov",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-106-14",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Southern conservative Democrat",
    "location": "DC",
    "posting_date": "2014-01-27",
    "description": "Southern conservative Democrat seeks a Communications Director to manage press operations in both the DC and District media markets. Responsibilities include pitching stories and responding to press inquiries; writing press releases, op-eds, and statements; coordinating in-district events; booking appearances on radio and television; ensuring an active online presence. Candidates must be proactive, team players, have excellent written and oral communications skills, substantial press experience, and the ability to work quickly and carefully under tight deadlines. Must work closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively. Knowledge of Energy and Commerce Committee issues, Southern ties, and campaign experience a plus. This position will be based in the DC office.",
    "responsibilities": [
      "Manage press operations in both the DC and District media markets.",
      "Pitch stories and responding to press inquiries.",
      "Write press releases, op-eds, and statements.",
      "Coordinate in-district events.",
      "Book appearances on radio and television.",
      "Ensure an active online presence."
    ],
    "qualifications": [
      "Proactive, team players.",
      "Excellent written and oral communications skills.",
      "Substantial press experience.",
      "Ability to work quickly and carefully under tight deadlines.",
      "Ability to work closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively.",
      "Knowledge of Energy and Commerce Committee issues, Southern ties, and campaign experience a plus."
    ],
    "how_to_apply": "Please email cover letter, resume, and at least 2 writing samples",
    "salary_info": null,
    "contact": "GA12jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-104-14",
    "position_title": "Staff Assistant",
    "office": "Office of Congressman Xavier Becerra",
    "location": "Los Angeles, CA",
    "posting_date": "2014-01-27",
    "description": "As the primary administrative staff member in the District Office, Staff Assistant duties Include (but are not limited to): answer phones; handle mail and faxes; greet and direct visitors; maintain order & efficiency of front and back offices order supplies; organize office files; coordinate with the Capitol Office to arrange tour and flag requests; coordinate vendor service needs; research the status of some legislation; draft some correspondence; assist the District Director and all District Office staff with additional tasks, as needed. In the absence of the District Scheduler, the staff assistant will serve as back-up and help facilitate any scheduling requests. Casework duties include (but are not limited to): Assist constituents with their individual cases pertaining to federal agencies. Help constituents to obtain timely consideration and cut through red tape. As the “front-line” caseworker, help constituents with nonfederal questions to find appropriate resources.",
    "responsibilities": [
      "Answer phones",
      "Handle mail and faxes",
      "Greet and direct visitors",
      "Maintain order & efficiency of front and back offices",
      "Order supplies",
      "Organize office files",
      "Coordinate with the Capitol Office to arrange tour and flag requests",
      "Coordinate vendor service needs",
      "Research the status of some legislation",
      "Draft some correspondence",
      "Assist the District Director and all District Office staff with additional tasks, as needed",
      "Serve as back-up and help facilitate any scheduling requests in the absence of the District Scheduler",
      "Assist constituents with their individual cases pertaining to federal agencies",
      "Help constituents to obtain timely consideration and cut through red tape",
      "Help constituents with nonfederal questions to find appropriate resources"
    ],
    "qualifications": [
      "Prefer some experience working directly with the community.",
      "Solid interpersonal, Writing and organizational skills are essential.",
      "The successful applicant will be a team player, have a positive attitude and the ability to work and set priorities in a fast-paced environment.",
      "Spanish language skills considered a plus."
    ],
    "how_to_apply": "Please fax or email cover letter and resume to:\nOffice of Congressman Xavier Becerra\n350 S. Bixel Street, Suite 120\nLos Angeles, CA 90017",
    "salary_info": null,
    "contact": {
      "fax": "( 213) 481-1427",
      "email": "Resume.California@mail.house.gov"
    },
    "equal_opportunity": null
  }
]