[
  {
    "id": "MEM-375-13",
    "position_title": "Communications Director",
    "office": "Congressman Aaron Schock (IL-18)",
    "location": "District and National",
    "posting_date": "2012-12-16",
    "description": "Congressman Aaron Schock (IL-18) seeks an experienced Communications Director to manage a fast-paced press operation. Strong speech writing skills are a must as duties include: working with the Congressman to help craft talking points, speeches and op-eds; writing press releases and e-newsletters; booking and pitching media outlets nationally and in district; and maintaining and updating the Member’s website. The ideal candidate has demonstrated creative writing and speech writing skills. In addition, the job requires one to be innovative and proactive in growing district and national media opportunities for the Congressman. Must have the ability to work with diverse media outlets, write well under a deadline, and have experience working in communications.",
    "responsibilities": [
      "Working with the Congressman to help craft talking points, speeches and op-eds",
      "Writing press releases and e-newsletters",
      "Booking and pitching media outlets nationally and in district",
      "Maintaining and updating the Member’s website"
    ],
    "qualifications": [
      "Demonstrated creative writing and speech writing skills",
      "Ability to work with diverse media outlets",
      "Ability to write well under a deadline",
      "Experience working in communications"
    ],
    "how_to_apply": "Qualified applicants should send resume and writing sample to IL18resumes@gmail.com.",
    "salary_info": null,
    "contact": "IL18resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-374-13",
    "position_title": "Legislative Assistant",
    "office": "Freshman Democratic Member",
    "location": "Washington, DC",
    "posting_date": "2013-12-16",
    "description": "Freshman Democratic Member seeks an organized, energetic and savvy Legislative Assistant to handle the Member’s work on the House Financial Services Committee, with a focus on economic development, affordable housing and infrastructure needs of America’s legacy cities. The selected candidate will be joining a fast-paced, team-oriented Washington, DC office.\n\nThis legislative portfolio will also include additional issues outside of the HFSC work.",
    "responsibilities": [
      "preparing and staffing the Member for committee hearings and markups",
      "monitoring legislative developments within Committees and on the House floor",
      "developing and advancing legislation and other policy priorities of the Member",
      "contributing to floor speeches and other external communications",
      "researching and advising the Member on bills and other issues",
      "representing the Member in meetings",
      "drafting constituent correspondence"
    ],
    "qualifications": [
      "superior organizational skills",
      "strong written and oral communication skills",
      "strong interpersonal skills",
      "be able to multi-task and thrive in a fast paced environment",
      "have poise, patience and a sense of humor",
      "Prior experience in economic development and community/urban planning strongly preferred.",
      "Michigan ties a plus."
    ],
    "how_to_apply": "Please email a resume and cover letter to Michigan05jobs@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-373-13",
    "position_title": "Press Assistant",
    "office": "Ohio Republican House Member",
    "location": null,
    "posting_date": "2013-12-16",
    "description": "Ohio Republican House Member seeking press assistant to join staff. Applicants should be self-starting, hard-working and creative. Must have strong writing and verbal skills and be extremely detail oriented. Job responsibilities include: managing all new media platforms (Facebook, Twitter, You Tube and Instagram), updating the web site, writing press releases and columns, creating videos and graphics, taking photos and running telephone town halls. Experience with new media, HTML, Final Cut Pro, Movie Maker and Photoshop helpful. Possibility of eventual promotion to press secretary a possibility based on job performance over time.",
    "responsibilities": [
      "Managing all new media platforms (Facebook, Twitter, You Tube and Instagram)",
      "Updating the web site",
      "Writing press releases and columns",
      "Creating videos and graphics",
      "Taking photos",
      "Running telephone town halls"
    ],
    "qualifications": [
      "Self-starting",
      "Hard-working",
      "Creative",
      "Strong writing and verbal skills",
      "Extremely detail oriented",
      "Experience with new media, HTML, Final Cut Pro, Movie Maker and Photoshop helpful"
    ],
    "how_to_apply": "Interested applicants should send cover letter, resume and writing sample to oh.ushouse.job@gmail.com.",
    "salary_info": null,
    "contact": "oh.ushouse.job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-370-13",
    "position_title": "Press Secretary",
    "office": "Senior Republican",
    "location": "DC",
    "posting_date": "2012-12-16",
    "description": "Senior Republican seeking press secretary with superior writing skills who is energetic, creative, strategic, and quick-thinking. The successful candidate is a self-starter who is politically astute and can quickly master a range of issues in time-sensitive situations.",
    "responsibilities": [
      "Drafting/distributing press releases",
      "Writing weekly newsletters, Op-Eds",
      "Maintaining and updating website content",
      "Preparation of talking points and speeches",
      "Establishing and maintaining strong relations with district and DC media and executing an aggressive earned local media campaign"
    ],
    "qualifications": [
      "New media skills are a must, including knowledge of video, audio and/or photography and editing in those mediums as well as social media"
    ],
    "how_to_apply": "Email resumes to PA.Resumes@mail.house.gov. No phone calls.",
    "salary_info": null,
    "contact": "PA.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-361-13",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Rep. Jerry McNerney",
    "location": "California",
    "posting_date": "2012-12-16",
    "description": "California Democrat (Rep. Jerry McNerney) seeks experienced communications director to develop and execute aggressive long-term media and outreach plan.\n\nCandidate must work closely with the Member and staff.\n\nIdeal candidate would be politically astute and have a good sense of humor.\n\nThis position requires non-traditional hours and travel to the District.\n\nCalifornia (District) ties and Capitol Hill experience are a plus.",
    "responsibilities": [
      "Serving as chief spokesperson",
      "Successfully pitching stories and press events to both national and local media entities",
      "Responding promptly to media inquiries",
      "Effectively messaging policy and other priorities",
      "Maintaining an aggressive new media profile",
      "Preparing the member for live interviews",
      "Writing press releases",
      "Producing op-eds, speeches, talking points, and franked mail"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Strong editing and proofreading abilities",
      "The desire to work collaboratively with a team in a fast-paced environment",
      "Political communications experience and the ability to respond to challenging situations quickly and strategically"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume and two writing samples to: McNerney.Resumes@mail.house.gov No calls or drop bys, please.",
    "salary_info": null,
    "contact": "McNerney.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-356-13",
    "position_title": "Scheduler/Office Administrator",
    "office": "Freshman Midwestern Democratic Member",
    "location": "Washington, DC",
    "posting_date": "2012-12-16",
    "description": "Freshman Midwestern Democratic Member seeks an organized, detail oriented and energetic Scheduler/Office Administrator for a fast-paced, team-oriented Washington, DC office. Primary duties include structuring and managing the Member's daily schedule; coordinating the Member's travel and logistical details of meetings; handling the Member's personal correspondence; fulfilling various administrative duties including prepare/process office payments, and ethics/disclosure compliance; and, working closely with other staff members in the district and in DC to facilitate meetings. Additionally, the Scheduler/Office Administrator will work to ensure smooth overall office operations.",
    "responsibilities": [
      "Structuring and managing the Member's daily schedule",
      "Coordinating the Member's travel and logistical details of meetings",
      "Handling the Member's personal correspondence",
      "Fulfilling various administrative duties including prepare/process office payments, and ethics/disclosure compliance",
      "Working closely with other staff members in the district and in DC to facilitate meetings",
      "Ensure smooth overall office operations"
    ],
    "qualifications": [
      "Superior organizational skills",
      "Strong oral and written communication skills",
      "Strong interpersonal skills",
      "Ability to multi-task and thrive in a fast paced environment",
      "Poise, patience and a good sense of humor",
      "Discreet, politically savvy, self-motivated, and very organized with the ability to successfully interact with different personality types",
      "Strategic thinker who can navigate competing demands to maximize the Member's time and come to anticipate the Member's needs"
    ],
    "how_to_apply": "Please email a resume and cover letter to Michigan05Jobs@gmail.com with “Scheduler/Office Administrator” in the subject line.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "Michigan05Jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-349-13",
    "position_title": "Communications Director",
    "office": "Florida Leadership House Democrat",
    "location": "Washington, DC",
    "posting_date": "2012-12-16",
    "description": "Florida Leadership House Democrat seeks highly motivated and experienced Communications Director to handle press, speech-writing and communications and messaging strategy. Candidates must have excellent writing skills, on-the-record press experience, strong political instincts, and new media experience. Candidates must thrive in a fast-moving, aggressive communications environment; be team-oriented, nimble, creative and strategic; and have a positive, can-do attitude. The Communications Director also develops working relationships with print, electronic and social media press as well as communications teams in other congressional offices and the Executive Branch to coordinate and execute the Member’s overall communication efforts. This position provides an opportunity to work for a highly engaged, energetic Member of Congress who has a successful record of improving the lives of women, children, seniors and fighting for the middle-class.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please send resume to DCResumes@mail.house.gov. No emails, phone calls or drop-bys please.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "DCResumes@mail.house.gov",
    "equal_opportunity": "Equal opportunity employer."
  }
]