[
  {
    "id": "MEM-026-26",
    "position_title": "Caseworker/Community Liaison (Bilingual Spanish)",
    "office": "Office of Congresswoman Laura Gillen",
    "location": "Garden City, NY",
    "posting_date": "2025-01-26",
    "description": "The office of Congresswoman Laura Gillen is looking for a dedicated and organized individual to join her team as a Caseworker/Community Liaison. This position requires bilingual proficiency in Spanish. The ideal candidate will act as a key point of contact for constituents, serving as a liaison between the office and intergovernmental agencies.\n\nResponsibilities include addressing constituent concerns, responding to casework correspondence, and facilitating timely resolutions to issues. Additionally, the Caseworker/Community Liaison will lead community engagement efforts and may represent the office at various community events. This position will be based in the District Office.\n\nPosition Type: Full-time",
    "responsibilities": [
      "Serves as the primary point of contact for constituents seeking assistance with federal issues by navigating intergovernmental pathways.",
      "Respond to casework correspondence (letters, emails) and manage constituent calls and inquiries.",
      "Work closely with government entities to facilitate the resolution of constituent and community issues.",
      "Manage and maintain accurate and detailed casework records to ensure efficient follow-up and reporting.",
      "Act as a representative of the office at community events. The Community Liaison is responsible for serving as the primary contact for organizations in the community."
    ],
    "qualifications": [
      "Ability to communicate clearly and interact professionally and empathetically with constituents and agencies.",
      "High attention to detail with the ability to manage multiple tasks simultaneously.",
      "Ability to work effectively in a fast-paced office environment.",
      "Experience in public service, customer service, or constituent relations is a plus."
    ],
    "how_to_apply": "Please email your resume to Sarah McCarthy, District Director at sarah.mccarthy@mail.house.gov",
    "salary_info": "$55,000/ year",
    "contact": {
      "name": "Sarah McCarthy",
      "title": "District Director",
      "email": "sarah.mccarthy@mail.house.gov"
    },
    "equal_opportunity": "The U.S. House of Representatives is an equal opportunity employer."
  },
  {
    "id": "MEM-025-26",
    "position_title": "Scheduler",
    "office": "Congressman Glenn Grothman",
    "location": "Washington, D.C.",
    "posting_date": "2026-01-26",
    "description": "Congressman Glenn Grothman has an immediate need to hire a Scheduler for the Washington, D.C. office in a full-time capacity. The Scheduler will be expected to work closely with the Chief of Staff and District Director to coordinate the Member's official schedule and arrange travel plans. The Scheduler will act as the Member's liaison with other Congressional offices, constituents, and other VIPs including executives from the public, private, and non-profit sectors.",
    "responsibilities": [
      "Collaborates with the Member, Chief of Staff, and District Director to determine and finalize the Member's daily schedule and briefing materials",
      "Acts as a liaison between the Member and other Members, committee staff, White House, government offices, and government agencies to arrange the Member's attendance at meetings",
      "Coordinates with event participants and the appropriate legislative and/or District staff to ensure that the Member is provided with briefing materials for each event",
      "Partners with the communications team and District office staff to facilitate the scheduling of radio and television press interviews",
      "Coordinates photo opportunities with constituents to maintain outstanding constituent relations",
      "Plans and books the Member's air travel, ground transportation, and lodging to coordinate official travel arrangements",
      "Reviews the Member's mail and invitations to ensure all are responded to, either by written correspondence or a personal telephone call",
      "Maintains files to monitor which of the Member's invitations have been declined, accepted, or are tentative/pending",
      "Prioritizes tasks based on the situational context to ensure work is completed in an efficient and effective manner",
      "Prepares, coordinates, and distributes daily meeting schedules in Washington, DC and the District",
      "Work with district office to schedule district tours and events",
      "Works well under pressure and tight timelines"
    ],
    "qualifications": [
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Adaptability: Adapts quickly to change or unexpected obstacles; easily considers new approaches.",
      "Decision Making: Makes sound, well-informed, and objective decisions; perceives the impact and implications of decisions. Commits to action to accomplish organizational goals. Maintains appropriate levels of confidentiality.",
      "Interpersonal Skills: Develops and maintains effective and positive relationships with staff, stakeholders, and constituents.",
      "Planning and Coordination: Organizes work and sets priorities. Coordinates with others to accomplish goals; monitors progress and evaluates outcomes."
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume and cover letter to MidwestResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "MidwestResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-26",
    "position_title": "District Director",
    "office": "Congresswoman Jennifer L. McClellan",
    "location": "Richmond, VA",
    "posting_date": "2026-01-26",
    "description": "Congresswoman Jennifer L. McClellan seeks a proactive, highly organized, and strategic leader to serve as District Director in her Richmond, VA office. This position oversees day-to-day operations of the Congresswoman's Richmond office and satellite office in Brunswick.\n\nThe District Director serves as the Member's senior staffer and primary community representative within the district. The District Director represents the Member at events and meetings throughout the community, serving as the Office's liaison with important stakeholders. The District Director also manages and oversees all district office(s) operations, workflow, assignment of responsibilities, and performance of the team. Other responsibilities include:",
    "responsibilities": [
      "Coordinating closely with the Chief of Staff, Legislative Director, Communications Director, and Director of Operations to plan in-district events and ensure alignment between the DC and District offices",
      "Planning district-based events and stakeholder engagements, in collaboration with senior staff in the DC office, and maximizing the Office's presence and visibility within the district",
      "Overseeing strategic outreach to key stakeholders and communities within the district",
      "Attending local events and representing the Congresswoman when she is in Washington, D.C.",
      "Coordinating with the Constituent Services Director to maintain a successful, impactful constituent services program",
      "Traveling throughout the district to stay abreast of local developments and priorities and facilitating information sharing between the Member's district and DC offices"
    ],
    "qualifications": [
      "Strategic decision-making skills",
      "A strong understanding of Virginia's Fourth Congressional District",
      "Previous management experience, including organizational, leadership, and motivational skills to manage staff across the district",
      "Strong relationships with local elected officials in VA-04 and Virginia broadly",
      "Excellent oral and written communication skills",
      "This position reports directly to the Chief of Staff.",
      "This is not an entry-level position."
    ],
    "how_to_apply": "Interested applicants should submit one PDF that contains a cover letter, resume, and a list of at least three references to VA04.Jobs@mail.house.gov, with the subject line \"FULL NAME District Director Application.\" Applications will be reviewed on a rolling basis. If you are selected for an interview, a staff member will contact you. No phone calls or drop-bys, please.",
    "salary_info": "The salary range is $100,000 - $110,000 commensurate with experience. This full-time position includes federal benefits such as health insurance, retirement plans, generous PTO, paid FMLA, student loan repayment assistance, and flexible work-from-home options.",
    "contact": "VA04.Jobs@mail.house.gov",
    "equal_opportunity": "Congresswoman McClellan's office is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, national origin, age, disability, or veteran status. We strongly encourage applicants from diverse backgrounds - including women, people of color, LGBTQ+ individuals, and members of other underrepresented communities - to apply."
  },
  {
    "id": "MEM-022-26",
    "position_title": "Professional Staff Member (PSM)",
    "office": "House Natural Resources Committee (HNRC), Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2025-01-26",
    "description": "The Democratic staff of the House Natural Resources Committee (HNRC) seeks a Professional Staff Member (PSM) to join the Subcommittee on Water, Wildlife and Fisheries. This role is central to planning, coordinating, and executing the legislative and oversight agenda for HNRC Democrats.\n\nThe ideal candidate is a creative, strategic thinker with a sophisticated understanding of Congress and the subcommittee jurisdiction, including endangered species, fisheries, oceans, international conservation, and climate change.",
    "responsibilities": [
      "Legislative Strategy: Partner with the Subcommittee Staff Director to draft legislation and recommend strategic positions/tactics on bills within the Subcommittee's jurisdiction.",
      "Floor Management: Guide relevant legislation through the full lifecycle, from Committee markups to the House Floor.",
      "Member Support: Prepare high-level legislative memos, talking points, and reference materials for Committee Members and senior staff.",
      "Stakeholder Engagement: Build and maintain strategic relationships with federal agencies, NGOs, and industry stakeholders.",
      "Communications & Outreach: Collaborate with the Communications team to translate complex policy work into accessible messaging for the public and relevant stakeholders.",
      "Administrative Coordination: Provide timely briefings to Member offices regarding schedules, hearing updates, and legislative developments."
    ],
    "qualifications": [
      "Subject Matter Expertise: Deep knowledge of the policies, laws, and politics surrounding U.S. ocean management, wildlife, and international conservation.",
      "Procedural Proficiency: A firm grasp of the legislative process, House organization, and Committee procedure.",
      "Communication Skills: Proven ability to draft concise briefing materials, hearing questions, and statements under tight deadlines.",
      "Commitment to Equity: A demonstrated understanding of how natural resource issues intersect with systemic racism and social inequality. We seek a candidate passionate about dismantling these systems and fostering a diverse, inclusive workplace."
    ],
    "how_to_apply": "Please submit a cover letter, resume, and two writing samples at this link. The Committee anticipates interviewing candidates the week of January 26.",
    "salary_info": "Salary Range: Commensurate with experience, $70,000-$100,000 per year.\nBenefits: Competitive health, dental, vision, and life insurance; retirement match; student loan repayment program; and transit/parking benefits.\nLocation: Washington, D.C. (In-office presence required when Congress is in session).",
    "contact": null,
    "equal_opportunity": "The House Committee on Natural Resources is an equal opportunity employer committed to a diverse and inclusive workforce. Women, LGBTQIA+, and racial/ethnic minority candidates are encouraged to apply. All applicants will be considered without regard to race, color, national origin, religion, sex, gender identity, disability, or age."
  },
  {
    "id": "MEM-020-26",
    "position_title": "Communications Director",
    "office": "Office of Rep. Gluesenkamp Perez (WA-03)",
    "location": "Washington, DC or District Office",
    "posting_date": "2025-01-26",
    "description": "The Office of Rep. Gluesenkamp Perez (WA-03), the Administrative Co-Chair of the Blue Dogs Coalition, is seeking a Communications Director to join her official staff. This position serves as a member of the senior staff team, working closely with the Member, Chief of Staff, Legislative Director, Operations Director and District Director to develop and execute an external communications plan that effectively communicates the unique district and messaging of Rep. Gluesenkamp Perez. This role oversees all press relations, an active social media operation, speeches, Franked communications, newsletters and all other communications needs of the office. This position is expected to work nontraditional hours and to regularly travel between DC and southwest Washington. Position can be based in the District or DC office.",
    "responsibilities": [
      "Implementing the Congresswoman's communications strategy, including earned media coverage, overseeing a strategic mass communications plan and executing an effective social media plan.",
      "Serving as the formal spokesperson and media liaison for the Congresswoman.",
      "Drafting speeches, press releases, media advisories, talking points, op-eds, newsletters and statements for the Member based on her existing and evolving positions.",
      "Creating and editing digital communications content, including social media copy, photography, videos, graphic design, and updates to the website.",
      "Fielding all incoming press inquiries, including interview requests for TV, print, radio, and other media and proactively pitching the Congresswoman's work to press.",
      "Briefing and staffing the Congresswoman for interviews, press conferences, and other public events.",
      "Organizing media events.",
      "Managing the Franked mass communication strategy, which includes franked radio, direct mail and digital, and all reporting requirements."
    ],
    "qualifications": [
      "Outstanding written, oral, and strategic communications skills.",
      "Keen critical thinking skills, with the ability to look beyond daily tasks to engage thoughtfully, identify patterns, and develop reasoned conclusions.",
      "Time management skills, ability to work under pressure, and comfortable balancing multiple responsibilities at once.",
      "Commitment to understanding the Member's unique voice and messaging.",
      "Sharp attention to detail.",
      "Strong visual intelligence and photography skills.",
      "Familiarity with southwest Washington a strong plus.",
      "While this is not an entry level position, a college degree is not required. Nontraditional candidates are strongly encouraged to apply."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and two writing samples to WA03jobs@mail.house.gov with the subject line: \"Full Name - Communications Director.\" Please share where you learned of this opportunity in the body of the email. Resumes will be reviewed on a rolling basis until the position is filled. Please no phone calls or drop ins.",
    "salary_info": null,
    "contact": {
      "email": "WA03jobs@mail.house.gov",
      "phone": null
    },
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-019-26",
    "position_title": "Field Representative",
    "office": "Office of Congresswoman Gluesenkamp Perez (WA-03)",
    "location": "Vancouver or Kelso, WA",
    "posting_date": "2026-01-26",
    "description": "The Office of Congresswoman Gluesenkamp Perez (WA-03) is seeking a Field Representative to be the primary person handling outreach and issues in the trades community in Southwest Washington. This position serves as a member of the Congresswoman District Office with the option to be based in the Congresswoman's Vancouver or Kelso office. This role will work closely with the Congresswoman and her team to meet with local stakeholders, businesses, and organizations--with an emphasis on focusing on trades and technical stakeholders.\n\nBackground:\nCongresswoman Gluesenkamp Perez co-owns an auto repair and machine shop with her husband and has made the trades and technical pathways a focus during her time in Congress. In D.C., she has advocated for honors-level shop class, funding for local CTE programs, and ensuring young people can use 529 plans to pay for tools instead of 4-year college. Back home, she's visited CTE programs in all seven counties in her district and has advocated for state-level changes to allow 6th graders in CTE programs. The Field Representative will help the Congresswoman engage with constituents in the trades to help inform this important work.",
    "responsibilities": [
      "Acts as a liaison between the Congresswoman, District Director, and other senior staff and stakeholders.",
      "Informs the Congresswoman and team of updates to his or her assigned issue area by screening district media and interacting with constituents.",
      "Builds durable relationships with stakeholders and provides updates to them on the Congresswoman's work.",
      "Briefs and staffs the Congresswoman at events in the district.",
      "Travels throughout the district to meet with constituents and stakeholder groups on issues related to the Congresswoman's priorities.",
      "Acts as a representative of the office at events, including updating groups on the Congresswoman's work and speaking on her behalf.",
      "Collaborates with the District Director and DC legislative staff to ensure district priorities inform the Congresswoman's legislative agenda."
    ],
    "qualifications": [
      "A college degree is not required. Non-traditional candidates are strongly encouraged to apply.",
      "Ties to Southwest Washington strongly encouraged.",
      "Individuals with a background as a tradesperson, craftsman, or skilled worker are highly encouraged to apply.",
      "Strong interpersonal and relationship-building skills, with a commitment to public service and constituent engagement.",
      "Ability to manage multiple priorities, work independently, and collaborate with a team.",
      "This full time position is expected to work non-traditional hours and to regularly travel throughout Southwest Washington."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and a paragraph each about two recent projects they've worked on to WA03jobs@mail.house.gov with the subject line: \"Full Name - Field Representative.\" Photos of recent projects are encouraged. Please share where you learned of this opportunity in the body of the email. Resumes will be reviewed on a rolling basis until the position is filled. Please no phone calls or drop ins.",
    "salary_info": "$50,000-60,000, commensurate with experience",
    "contact": "WA03jobs@mail.house.gov",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-018-26",
    "position_title": "Legislative Director",
    "office": "Congresswoman Summer L. Lee (D-Pittsburgh)",
    "location": "Washington D.C.",
    "posting_date": "2026-01-26",
    "description": "Congresswoman Summer L. Lee (D-Pittsburgh) has an immediate need to hire an experienced Legislative Director in the Washington D.C. office at a full-time capacity. Interested candidates are encouraged to submit a resume and cover letter by 2/15. The office will contact the best qualified candidates to begin our interview process on a rolling basis.\n\nThe Legislative Director plays an essential leadership role in the office by working closely with the Chief of Staff in assisting with the formulation of the Member's policy and legislative strategy. The Legislative Director will maintain status reports on all legislation affecting the district and legislation in which the Member is a principal sponsor or cosponsor. The Legislative Director may also manage and oversee the performance of the legislative team (e.g., legislative assistant, legislative correspondent). Congresswoman Lee currently sits on the House Committee on Oversight and Accountability and the House Committee on Education and the Workforce.",
    "responsibilities": [
      "Advises the Member on all legislative policy areas",
      "Assists in the development of policy positions and legislative initiatives",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation in which the member is a principal sponsor, or legislation which the Member is a cosponsor",
      "Monitors and reports floor action to the Member and the Chief of Staff",
      "Manages and supervises the Member's legislative staff",
      "Coordinates responses to all legislative mail"
    ],
    "qualifications": [
      "Experience researching public policy and preparing legislative recommendations for a Member of Congress required",
      "Deep understanding of House floor and committee procedures",
      "Strong written and verbal communication skills",
      "Politically savvy and able to navigate challenging situations",
      "Experience collaborating and forming partnerships to advance legislative agendas",
      "Comfortable making swift decisions and advising a Member of Congress on important issues",
      "Able to manage a team of staff members and accomplish desired outcomes",
      "Strong time management and organization skills",
      "Bachelor's degree or higher in government, political science, public policy, or related field",
      "A demonstrated interest in public service"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume by 2/15 to Wasi.Mohamed@mail.house.gov. Please add PA-12 Legislative Director to the subject line.",
    "salary_info": "$100,000 - $120,000, Commensurate with Experience",
    "contact": "Wasi.Mohamed@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-016-26",
    "position_title": "Press Secretary & Digital Manager",
    "office": "Office of U.S. Representative Shomari C. Figures (AL-2)",
    "location": "Washington, DC",
    "posting_date": "2025-01-26",
    "description": "The Office of U.S. Representative Shomari C. Figures (AL-2) seeks a highly organized, creative, and team-oriented Press Secretary & Digital Manager to execute a fast-paced and dynamic communications plan. The Press Secretary & Digital Manager will play a critical part in shaping, branding, and maintaining the public image of the Congressman, requiring a combination of strategic thinking, strong digital skills, and the ability to be creative and thrive under pressure. This position reports to the Deputy Chief of Staff/Communications Director and is based in the Washington, DC office. This is not an entry-level position.",
    "responsibilities": [
      "Drafting written materials, including press releases, remarks, speeches, enewsletters, talking points, and social media content",
      "Pitching and coordinating press interviews, managing press inquiries, and building and maintaining District and national press relationships",
      "Collaborating with the Legislative and District Office teams to proactively identify and execute message events and opportunities that elevate Congressman's work to residents of the 2nd District",
      "Staffing and supporting logistics for the Congressman's interviews, press conferences, and other public-facing events, both virtual and in-person",
      "Planning, managing, and creating content for Congressman's social media platforms, the website, and e-newsletter",
      "Capturing and maintaining a database of video and photos of the Congressman",
      "Staying informed about relevant current events in the 2nd District and across the country and advising on messaging strategy across key priority issue areas including, but not limited to agriculture, transportation, infrastructure, civil rights, and education",
      "Compiling daily press clips and managing a robust media monitoring and reporting process",
      "Maintaining local, national, and specialty media press lists"
    ],
    "qualifications": [
      "Previous experience on Capitol Hill and of 3-5 years of relevant experience in communications",
      "Exceptional writing, editing, and organizational skills; knowledge of AP style and communications best practices",
      "Understanding of the digital media landscape and graphic design, photography, and video editing skills",
      "Deep familiarity with social media platforms (i.e., Facebook, Instagram, Twitter, BlueSky, YouTube) and CRMs, including IQ",
      "Ability to exercise discretion in the representation of the Congressman",
      "Ability to work well under pressure and for long hours as needed",
      "Alabama state and/or district ties are a plus."
    ],
    "how_to_apply": "Qualified candidates should include a resume, cover letter, a writing sample, and a sample of social media content in their application. Please send complete applications to AL02Resumes@mail.house.gov with \"Press Secretary & Digital Manager\" in the subject line. No calls or office drop-ins, please.",
    "salary_info": "The planned salary for this position is $65,000 with a competitive benefits package.",
    "contact": {
      "email": "AL02Resumes@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-015-26",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Debbie Dingell",
    "location": "Washington, DC",
    "posting_date": "2025-01-26",
    "description": "Congresswoman Debbie Dingell (MI-06) seeks an experienced, creative, and highly motivated Communications Director to lead the office's fast-paced communications operations.\n\nThe Communications Director will lead the development and execution of a comprehensive strategy encompassing national and local press, digital and new media, and franking.\n\nThe Communications Director will work collaboratively with legislative and district staff and closely with the Member.\n\nThis is a senior-level position.",
    "responsibilities": [
      "Developing and maintaining relationships with reporters and producers",
      "Drafting press releases, talking points, speeches, and op-eds",
      "Identifying opportunities for proactive media outreach",
      "Responding to press inquiries, serving as on-the-record spokesperson",
      "Coordinating, preparing for, and staffing TV interviews and public speaking events",
      "Developing and implementing franked media plan",
      "Overseeing all digital operations, managing a DC-based Digital Director and districtbased Digital Assistant."
    ],
    "qualifications": [
      "Possess strong written and oral communications skills and the ability to work effectively in a fast-paced setting.",
      "At least 2-4 years of experience as a press secretary, communications director, or similar communications role."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, cover letter, two writing samples, and references to dingell.jobs@mail.house.gov with the subject line \"Communications Director - [Name]\" The office will contact the best qualified candidates to begin our interview process on a rolling basis. Please, no phone calls or drop ins.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": {
      "email": "dingell.jobs@mail.house.gov",
      "phone": null,
      "note": "Please, no phone calls or drop ins."
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-014-26",
    "position_title": "Chief of Staff",
    "office": "Congresswoman Rashida Tlaib",
    "location": "Washington, D.C.",
    "posting_date": "2025-01-26",
    "description": "Congresswoman Rashida Tlaib, representing Michigan's 12th Congressional District, is seeking an experienced, organized and highly motivated Chief of Staff. The Chief of Staff is a key senior advisor to the Member and is responsible for ensuring the Office meets its legislative and constituent service goals, both in Washington, D.C. and in the district. The Chief of Staff is expected to have a deep familiarity with and passion for Rep. Tlaib's core issue areas, which include racial, economic, environmental, and utility justice, affordable housing, health care, civil rights and liberties, corporate greed, affordability, just foreign policy, and government oversight and accountability.\n\nThe Chief of Staff supports staff development and manages office operations for the Member's Washington, DC office, and supports the management of the district offices. The Chief of Staff will also be responsible for cultivating and maintaining strong relationships on behalf of the office and Member with leadership, caucuses, committees, and other Member offices. The role also requires close coordination with House leadership staff, Administration staff, and various caucus staff across Capitol Hill.",
    "responsibilities": [
      "Manages the Washington DC office staff and partners with the District Director and Senior Policy Counsel in supporting operations of our Neighborhood Service Centers and district-focused advocacy;",
      "Sets office goals, policies and procedures, and has oversight responsibility for hiring and salary decisions;",
      "Manages long-term legislative goals and related district priorities of the Member in collaboration with senior leadership;",
      "Coordinates leadership team goals and needs;",
      "Advises on strategies and tactics on legislative issues; manages relationships with peer offices and elected officials in the district;",
      "Manages committee assignments and serves as liaison for leadership offices and submits office caucus certifications every term;",
      "Acts as the Member's principal liaison and representative and responds to office visits and telephone inquiries from constituents and various interest groups;",
      "Oversee the office budget in conjunction with Member with support from Financial Administrator, including submission of all member reimbursements and member security payments;",
      "Coordinates support for all office operations; manages offices operations including office hours, inventory, constituent services, leasing, etc, with District Director;",
      "Attend briefings, meetings and supports office-related events coordinated by staff in the district and DC;",
      "Support Legislative Director with annual Community Project Funding requests and Appropriation Funding requests through stakeholder engagement;",
      "Manage relationships with White House, federal agencies and all other officials and helps to coordinate meetings and engagements in the district and notices for visits with officials;",
      "Facilitates and manages office talent development and retention with onboarding and exiting process when necessary;",
      "Reviews and approves all vendor contracts including but not limited to communication materials, office supplies, etc.;",
      "Manage Member and office security in coordination with office Law Enforcement Coordinators, Sergeant Arms, etc.;",
      "Coordinates annual staff performance reviews and manages annual staff retreat planning and implementation of retreat goals;",
      "Manages all staff office leave requests and administrative needs for internal operations;",
      "Manages compliance with office employee handbook, maintaining and developing operating procedures;",
      "Assists with all member travel logistics for legislative session and member travel for official businesses, domestic and foreign, including Ethics travel reports and notifications as necessary;",
      "Provide updates for all Member opportunities available through the Committee on House Administration, SAA and other House-related agencies;",
      "Supports advancement of district priorities with Legislative Director, Senior Policy Counsel, and staff for the Congressional Mamas' Caucus and Get the Lead Out Caucus;",
      "Perform all other duties as assigned by the Member."
    ],
    "qualifications": [
      "Strong organization and attention to detail, communication and time management skills, robust leadership experience, mentorship and management abilities, proactive and creative problem-solving, and the ability to operate and deliver under tight deadlines in high-pressure situations.",
      "A strong understanding of the legislative process and relationships across Capitol Hill.",
      "At least 5-6 years of Hill experience minimum is required.",
      "Candidates without Hill experience will not be considered.",
      "Well-qualified candidates will have strong relationships with progressive stakeholders and other congressional offices, committees and caucuses.",
      "A strong commitment to progressive ideals is necessary to thrive in this role.",
      "Candidates must be able to work effectively and collaboratively in a team setting with shared senior leadership decision-making and be ready to bring the best out of a dynamic and energetic team.",
      "A demonstrated passion for human rights, economic and social justice, and grassroots organizing is also essential for this role.",
      "Ability to work a flexible schedule, including evenings and weekends.",
      "Michigan ties are highly desirable but not required."
    ],
    "how_to_apply": "Applications are due no later than January 30th 11:59PM ET. To apply, please email Rashida.Jobs@mail.house.gov (SUBJECT: Chief of Staff, YOUR NAME) with a cover letter, resume and 2-3 references.",
    "salary_info": null,
    "contact": {
      "email": "Rashida.Jobs@mail.house.gov",
      "subject": "Chief of Staff, YOUR NAME"
    },
    "equal_opportunity": "Women, people of color, LGBTQIA+, and other members of other marginalized communities are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status. This position reports directly to the Member."
  },
  {
    "id": "MEM-013-26",
    "position_title": "Communications Director",
    "office": "Rep. Raul Ruiz, M.D. Office (CA-25)",
    "location": "Washington, DC",
    "posting_date": "2025-01-26",
    "description": "Rep. Dr. Raul Ruiz's office is seeking candidates to fill an open Communications Director position (title and salary based on experience). Please pass this along to anyone you think might be interested.\n\nRep. Ruiz (CA-25), senior member of the Energy and Commerce Committee, seeks an energetic and well-organized professional to lead his communications portfolio. The position is based in Washington, DC and will travel to the district as needed. Preferred candidates will have professional fluency in both English & Spanish.\n\nPosition Overview\n\nThe Communications Director is responsible for the creation and quality of all public external communications from the Member and the office, the communications strategy plans, franking budget, and messaging that is authentic, strategic, and on brand. The Communications Director manages and coordinates all internal communications activities, assesses constituent and public sentiment, evaluates communication outcomes against objectives and goals, and acts as the Member's spokesperson and primary liaison with all media stakeholders. The Communications Director holds a leadership position within the office and is part of the leadership team.\n\nOther duties include developing messaging and talking points; overseeing all communications materials, including press releases, website content, franked mail, and social media accounts; working with policy staff to translate policy into simple, accurate and concise language; and regularly briefing and staffing the Member.\n\nCandidates should be self-motivated, diligent, and a team player, and able to develop and maintain relationships with local, state, and national press and nontraditional media stakeholders like influencers and podcasters. The ideal candidate will have a passion for inspiring people through communications, and digital organizing/communications in all formats.\n\nThis position will mentor and manage the Digital Director, all communications activities, and any press interns in all offices. This is not an entry-level position.",
    "responsibilities": [
      "Responsible for the creation and quality of all public external communications from the Member and the office, the communications strategy plans, franking budget, and messaging that is authentic, strategic, and on brand.",
      "Manages and coordinates all internal communications activities, assesses constituent and public sentiment, evaluates communication outcomes against objectives and goals, and acts as the Member's spokesperson and primary liaison with all media stakeholders.",
      "Developing messaging and talking points.",
      "Overseeing all communications materials, including press releases, website content, franked mail, and social media accounts.",
      "Working with policy staff to translate policy into simple, accurate and concise language.",
      "Regularly briefing and staffing the Member.",
      "Mentor and manage the Digital Director, all communications activities, and any press interns in all offices."
    ],
    "qualifications": [
      "Preferred candidates will have professional fluency in both English & Spanish.",
      "Strong written and oral communications skills (writing, editing, proofreading) with at least two years of political communications experience including producing op-ed's, press releases and other communications.",
      "Experience in managing, coaching, and mentoring staff.",
      "Experience in brand development and growing brand presence in the press and all digital portfolios and an ability to amplify media coverage & grow its impact.",
      "Able to create and implement comprehensive communications strategy and plans and manage budget and reports.",
      "Able to track public sentiment on issues and the Member, translate polls into communication messaging and activities.",
      "Able to learn the Member's voice and communication style including storytelling.",
      "Understanding of print, broadcast, & online social media tools/platforms (Instagram, Facebook, Twitter, Canva Pro, Adobe Premiere, etc.).",
      "Strong skills & experience producing excellent written & visual content, including graphics & video, for a variety of social media platforms and b-roll for the press.",
      "Thorough knowledge of the legislative process, procedures & organization of the House - a plus.",
      "Ability to work with the leadership team on short/long-term communications goals, identify press opportunities and mitigate threats.",
      "Ability to exercise discretion & judgment in the representation of the Congressman's position on policy issues.",
      "Must have the ability to prioritize duties & manage staff in a fast-paced work environment while meeting rapid timelines.",
      "Ability to translate complex policy issues into simple, accurate, concise language, creating talking-point summaries.",
      "Leading, managing & optimizing production needs surrounding virtual & in-person town hall meetings, public forums, & press conferences & creating graphics & media presentations when required.",
      "Creating e-newsletters & managing the franked mailers process for the office",
      "Tracking press and social media analytics",
      "This is not an entry-level position."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and two writing samples (one English and one Spanish on two different topics) to: CA25Resumes@mail.house.gov with the \"Communications Director-[NAME]\" in the subject line.",
    "salary_info": "title and salary based on experience",
    "contact": "CA25Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all identity groups to apply."
  },
  {
    "id": "MEM-011-26",
    "position_title": "Field Representative",
    "office": "Representative Zoe Lofgren (CA-18)",
    "location": "Salinas, CA",
    "posting_date": "2026-01-26",
    "description": "Representative Zoe Lofgren (CA-18) is seeking an energetic, community-oriented individual for the position of Field Representative based in the Salinas office, and under the direction of the District Director and Member of Congress.\n\nThe Field Representative will act as a liaison between constituent groups, local elected officials and Representative Lofgren, in addition to initiating community outreach and policy projects. The Field Representative will draft letters of support and respond to in-person, written and telephone inquiries from constituents, as well as make legislative and ceremonial presentations on behalf of the Representative. The Field Representative will be expected to assist with casework, administrative tasks, and other duties as assigned.",
    "responsibilities": [
      "Act as a liaison between constituent groups, local elected officials and Representative Lofgren, in addition to initiating community outreach and policy projects.",
      "Draft letters of support and respond to in-person, written and telephone inquiries from constituents, as well as make legislative and ceremonial presentations on behalf of the Representative.",
      "Assist with casework, administrative tasks, and other duties as assigned."
    ],
    "qualifications": [
      "Strong public speaking skills",
      "Flexible schedule; the ability to attend early morning, evening and weekend events",
      "Knowledge of the concerns and issues specific to the Salinas Valley and understanding of CA-18",
      "The ability to handle difficult situations with courtesy, tact and compassion",
      "Strong writing skills",
      "Problem solving abilities",
      "The ability to exercise a high degree of initiative",
      "The ability to work independently and use good judgment",
      "The ability to maintain confidentiality",
      "Spanish speaking preferred",
      "A bachelor's degree or at least 2-3 years experience in a legislative office or other equivalent environment is required.",
      "This is a full-time in-person position, with significant travel expected."
    ],
    "how_to_apply": "Qualified candidates should email a PDF copy of their cover letter, resume, and three professional references to Lofgren.resume@mail.house.gov with \"Field Representative\" in the subject line.",
    "salary_info": "The salary range for this position is $65,000 to $75,000 annually, based upon experience. The office offers a competitive package of benefits (health insurance, retirement match, student loan repayment program, generous holiday package, etc.).",
    "contact": {
      "email": "Lofgren.resume@mail.house.gov",
      "subject": "Field Representative"
    },
    "equal_opportunity": "This office is an equal opportunity employer. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-009-26",
    "position_title": "Director of Communications",
    "office": "Office of Congressman Steven Horsford",
    "location": null,
    "posting_date": "2026-01-26",
    "description": "The Office of Congressman Steven Horsford seeks an experienced and strategic Director of Communications to lead a high-volume, high-impact communications operation.\n\nThe Director of Communications leads the development and execution of the office's communications strategy, working closely across the team to shape and roll out messaging around legislation, major announcements, and public engagements.\n\nThe Director serves as the Member's media liaison, secures and manages local and national press opportunities, prepares and staffs the Member for interviews and events, and oversees all press, digital, and public-facing communications. The Director directly manages two highly skilled communications staff members and is responsible for setting clear priorities, workflows, and performance expectations to ensure a disciplined, high-functioning communications operation.\n\nThe ideal candidate is strategic, steady, and composed, with the ability to operate calmly in fast-paced, high-pressure environments. They are confident, professional, and mission-driven, with the judgment to enforce message discipline and the confidence to say \"no\" to ideas that are off-strategy. The ideal candidate is receptive to feedback, responsive to performance-based direction, and committed to continuous improvement and team accountability.",
    "responsibilities": [
      "Message Strategy & Narrative Control",
      "Earned Media Management",
      "Digital & Platform Oversight",
      "Rapid Response & Contrast",
      "Events, Briefings & Member Preparation",
      "Team Management"
    ],
    "qualifications": [
      "This is not an entry-level position. Previous communications experience is required.",
      "Previous Hill experience is a plus.",
      "Demonstrated success securing and managing national media coverage.",
      "Experience integrating press, digital, events, and legislative communications.",
      "Experience managing staff.",
      "Familiarity with House franking rules and compliance requirements.",
      "Exceptional writing, editing, and proofreading skills.",
      "Deep understanding of print, broadcast, and online media.",
      "Strong political instincts and strategic judgment."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter demonstrating relevant experience and interest in the role. All materials should be sent to the office's Chief of Staff, Yvanna Cancela at yvanna.cancela@mail.house.gov.",
    "salary_info": null,
    "contact": {
      "name": "Yvanna Cancela",
      "title": "Chief of Staff",
      "email": "yvanna.cancela@mail.house.gov"
    },
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, marital status, parental status, military status, or any other status protected by federal law."
  },
  {
    "id": "MEM-008-26",
    "position_title": "Congressional Field Representative",
    "office": "A Republican Member of Congress from South Carolina",
    "location": "Charleston, SC",
    "posting_date": "2026-01-26",
    "description": "A Republican Member of Congress from South Carolina is seeking a motivated and organized individual to join their team as a Congressional Field Representative based in Charleston, SC. As a Field Representative, you will be responsible for representing the Member in the district, building relationships with local stakeholders, and providing exceptional constituent services.\n\nCharleston, SC is a vibrant and historic city known for its beaches, cuisine, and culture. As a Congressional Field Representative based in Charleston, you will have the opportunity to work in a dynamic district and experience all that the city has to offer. From its rich history and architecture to its bustling downtown and scenic waterfront, Charleston is a great place to live, work, and play.",
    "responsibilities": [
      "Act as a liaison between our Member of Congress and constituents, local officials, community leaders, and organizations in the district.",
      "Attend meetings, events, and other gatherings on behalf of our Member of Congress to maintain and build relationships with stakeholders.",
      "Conduct research and analysis on policy issues affecting the district and provide updates to our Member of Congress.",
      "Collaborate with other staff members to ensure effective communication and implementation of our Member of Congress's priorities and initiatives."
    ],
    "qualifications": [
      "Bachelor's degree in political science, public administration, or a related field.",
      "Strong communication, interpersonal, and organizational skills.",
      "Knowledge of local and federal government, policies, and procedures.",
      "Ability to work independently, manage multiple projects, and meet deadlines.",
      "Experience in constituent services, advocacy, or related fields is preferred."
    ],
    "how_to_apply": "To apply please email noah.longest@teamsc01.com with your Resume & Cover Letter with the title 'Field Representative application'.",
    "salary_info": null,
    "contact": {
      "email": "noah.longest@teamsc01.com",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-005-26",
    "position_title": "Legislative Correspondent",
    "office": "Office of Congresswoman Emilia Sykes",
    "location": "Washington, DC",
    "posting_date": "2025-01-26",
    "description": "The Washington, DC office of Congresswoman Emilia Sykes is seeking a Legislative Correspondent to process and respond to constituent correspondence, including answering constituent mail and e-mail. Other responsibilities will include assisting the communications team with preparing digital content and written materials, tracking legislation, briefing the Congresswoman, responding to constituent requests for information, and other projects as assigned.\n\nIdeal candidates will be detail-oriented, strong writers and creative thinkers who work well in a collaborative environment. Hill or political experience is preferred.",
    "responsibilities": [
      "Process and respond to constituent correspondence, including answering constituent mail and e-mail.",
      "Assisting the communications team with preparing digital content and written materials.",
      "Tracking legislation.",
      "Briefing the Congresswoman.",
      "Responding to constituent requests for information.",
      "Other projects as assigned."
    ],
    "qualifications": [
      "Detail-oriented",
      "Strong writers",
      "Creative thinkers who work well in a collaborative environment",
      "Hill or political experience is preferred"
    ],
    "how_to_apply": "Qualified candidates may send their resume to JoinTeamSykes@mail.house.gov by January 16, with the subject line NAME - Legislative Correspondent. Please no drop-ins or calls.",
    "salary_info": null,
    "contact": {
      "email": "JoinTeamSykes@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The office of Congresswoman Emilia Sykes is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Women, minority and LGBTQ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-004-26",
    "position_title": "CONSTITUENT ADVOCATE",
    "office": "Office of Congresswoman Julie Fedorchak - North Dakota",
    "location": "Fargo or Bismarck, ND",
    "posting_date": "2025-01-26",
    "description": "The Office of Congresswoman Julie Fedorchak is seeking a compassionate, detail-oriented Constituent Advocate to help North Dakotans navigate federal agencies and receive timely assistance from their government. This is a frontline role based in the state, focused on providing exceptional constituent service and support through professional, prompt, and persistent casework.\n\nThe ideal candidate is a clear communicator, a meticulous record-keeper, and a dedicated problem-solver who shares our office values of Respect, Responsiveness, Resourcefulness, Resilience, and Results. You'll work closely with constituents, federal agencies, and teammates to ensure every case is handled with care-and that every North Dakotan feels heard, helped, and valued.\n\nWORK ENVIRONMENT:\nThis position is based in the Fargo or Bismarck office.\nStandard hours, with some flexibility for urgent case needs.\nReports to the Director of Constituent Advocacy or State Director.",
    "responsibilities": [
      "Constituent Casework",
      "Assist North Dakotans experiencing problems with federal agencies such as Social Security, VA, IRS, USCIS, and others.",
      "Open and manage case files in office database; track every action and communication.",
      "Submit timely, well-documented inquiries to agency liaisons on behalf of constituents.",
      "Draft and send professional case updates, letters, and closure correspondence.",
      "Agency Liaison",
      "Serve as a point of contact between constituents and relevant federal agencies.",
      "Learn and follow each agency's protocol for congressional inquiries.",
      "Follow up persistently on open cases and escalate when needed.",
      "Build strong, professional relationships with agency contacts to improve responsiveness and outcomes.",
      "Constituent Communication",
      "Provide a response to every new constituent request within 24 work hours.",
      "Submit all complete inquiries within 48 work hours of receiving the privacy release and supporting documents.",
      "Keep constituents updated at key milestones and every 30 days thereafter.",
      "Ensure all interactions are professional, empathetic, and solution-oriented.",
      "Office Coordination",
      "Collaborate with teammates to ensure high-quality service during vacations, transitions, or spikes in case volume.",
      "Refer non-federal matters appropriately and document them accordingly.",
      "Ensure your work is accessible and transparent to the team-no sticky notes, no silos."
    ],
    "qualifications": [
      "Strong writing, communication, and organizational skills.",
      "Ability to maintain professional detachment while showing empathy and care.",
      "Attention to detail and a methodical approach to documentation and follow-through.",
      "Sound judgment and discretion, especially with sensitive personal information.",
      "Comfort working independently in a fast-paced, high-trust environment.",
      "Familiarity with casework tracking systems is a plus.",
      "Knowledge of federal agencies, North Dakota communities, and constituent service is helpful-but not required. We will train the right person."
    ],
    "how_to_apply": "Please send resumes to State Director, John Odermann - john.odermann@mail.house.gov",
    "salary_info": null,
    "contact": {
      "name": "John Odermann",
      "title": "State Director",
      "email": "john.odermann@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-002-26",
    "position_title": "Communications Director",
    "office": "Congresswoman Val Hoyle (D-OR-04)",
    "location": "Washington, D.C.",
    "posting_date": "2025-01-26",
    "description": "Congresswoman Val Hoyle (D-OR-04) seeks a self-starting, highly experienced, and creative Communications Director to join her Washington, D.C. office and lead a fastpaced communications team.\n\nThe ideal candidate will have familiarity with national press, the House franking process, and will work closely with the Deputy Chief of Staff/District Director, Legislative Director, and report to the Chief of Staff to set the Congresswomen's messaging priorities. This position will be the direct supervisor of the Press Secretary and any Press Interns. This is not an entry-level position.\n\nWorking Conditions\nWork is performed in an office environment. A hybrid work arrangement involving telecommuting may also be approved, consistent with the needs of the office.\nNoise levels in the office are usually moderate.\nAbility to work in a small workstation without expectation of privacy.",
    "responsibilities": [
      "Develops and implements strategic communications plans for the office, including working closely with the legislative team to develop media strategies to roll out legislation, send letters, and make other major announcements",
      "Successfully and consistently pitches the Congresswoman to both local and national TV, radio, and print media",
      "Helps plan and staffs DC- and district-based events such as press conferences, teletownhalls, and roundtables, etc.",
      "Prepares for, brief, and staffs the Congresswoman for media interviews, press conferences, roundtables, and other engagements;",
      "Drafts talking points, speeches, press releases, op-eds and other materials, as necessary, and in the Congresswoman's voice;",
      "Speaks on background with reporters and act as a media liaison for the Congresswoman;",
      "Helps manage social media presence, this includes drafting social media copy, clipping interviews, and creating graphics to circulate across platforms;",
      "Maintains and updates office website to ensure that it features timely content;",
      "Serves as the formal spokesperson and media liaison for the Member;",
      "Develops and implements media, communications, and public relations strategy for the Member;",
      "Oversees digital media, website and other communications consultant;",
      "Remains abreast of current legislative and non-legislative issues about which the Member may be questioned;",
      "Evaluates current events and media reports in the district and the nation for their impact on the Member;",
      "Provides ideas and advice on the effect in the media of the Member's actions and legislative activities;",
      "Creates official digital ads and other graphics;",
      "Writes speeches for the Member;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Member, staff, media, and constituents;",
      "Works well under pressure and handles stress;",
      "Supervises Press Secretary and any assigned Press Interns;",
      "Accepts performance-based criticism and direction;",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned. Rep. Val Hoyle's Office, Oregon District"
    ],
    "qualifications": [
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Deep understanding of print, broadcast, and online media;",
      "Understanding of House franking process and regulations;",
      "Experience with digital communications, including paid ads and analytics reports;",
      "Background in graphic design, including graphics, videos, CANVA or Adobe Suite preferred;",
      "Experience developing communication strategy for a Member of Congress, an elected official, a federal agency, or a private or non-profit organization;",
      "Expertise in advising others on a communication strategy and ability to work well on a team;",
      "Able to make split-second decisions and develop communications under tight deadlines;",
      "Strategic thinker, politically savvy and comfortable navigating difficult situations with press and staff; and",
      "Time management skills, ability to work under pressure, and comfortable balancing multiple responsibilities at once.",
      "At least three-years of political and/or communications experience with strong academic credentials. Alternatively, four-years of related experience or training in communications or equivalent similar experience.",
      "Experience working in Congress is preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter. Resume and a cover letter should be sent to resumes.hoyle@mail.house.gov with the subject line containing Communications Director",
    "salary_info": null,
    "contact": {
      "email": "resumes.hoyle@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, marital status, parental status, military status, or any other factor or basis prohibited by applicable federal law."
  },
  {
    "id": "MEM-001-26",
    "position_title": "PRESS SECRETARY",
    "office": "Moderate House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2025-01-26",
    "description": "Moderate House Democrat seeks a Press Secretary for their Washington, D.C. office. This is a writing-intensive position responsible for drafting remarks, speeches, talking points, and press releases, as well as pitching and responding to media inquiries.\n\nThe Press Secretary will help execute the communications functions of the office, including:\n\nThis position reports to the Communications Director and the Chief of Staff.",
    "responsibilities": [
      "Drafting and editing a high volume of written materials, including remarks, speeches, press releases, statements, and talking points for the Member;",
      "Assisting with interview preparation and rapid-response messaging;",
      "Pitching stories and responding to media inquiries from national, state, and local press;",
      "Maintaining and strengthening relationships with reporters and media outlets;",
      "Monitoring press coverage and compiling daily news clips;",
      "Managing and updating the office's social media platforms and website content;",
      "Coordinating closely with the Communications Director, legislative staff, and district office to ensure consistent messaging."
    ],
    "qualifications": [
      "Exceptional writing and editing skills with strong attention to detail;",
      "2-3 years of relevant experience in a congressional office, on a political campaign, or in another fast-paced communications environment;",
      "Sound judgment and the ability to work under tight deadlines;",
      "Strong organizational skills and the ability to manage competing priorities;",
      "Capacity to communicate with a variety of personalities in a tactful, courteous, and professional manner;",
      "Willingness to accept direction and guidance on performance and process improvements from the Communications Director, Chief of Staff, and Member;",
      "The ability to anticipate challenges and proactively offer solutions;",
      "The ability to thrive in a fast-paced environment;",
      "The ability to work flexible hours including nights and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with \"Press Secretary\" as the subject line to jobs@mail.house.gov.",
    "salary_info": null,
    "contact": {
      "email": "jobs@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  }
]