[
  {
    "id": "MEM-277-25",
    "position_title": "DISTRICT DIRECTOR",
    "office": "OFFICE of CONGRESSWOMAN LAURA GILLEN",
    "location": "District Office",
    "posting_date": "2025-08-18",
    "description": "The District Director oversees all district office operations. This position develops and implements policy objectives, strategies and operating plans for the Congresswoman's district office and directs all activities and staff of the district office.",
    "responsibilities": [
      "Manages district office staff.",
      "Represents the Congresswoman and/or assigns appropriate staff to do so in the district office as needed.",
      "Plans, assigns and evaluates work of employees in district office.",
      "Interviews, selects and trains employees of district office and ensures that district office staff complies with office policies, practices, and procedures.",
      "Conducts district office staff meetings.",
      "Speaks to local groups when the Congresswoman is unavailable.",
      "Maintains close communication with the Washington, D.C. office.",
      "Travels throughout the district at regular intervals to keep abreast of local concerns.",
      "Meets with elected officials and representatives of local groups on behalf of the Congresswoman.",
      "Schedules meetings with federal and district government agencies as necessary.",
      "Responds to constituent telephone calls and mail.",
      "Meets attendance requirements as established by the office.",
      "Maintains a good working relationship with the Congresswoman, staff, and constituents.",
      "Works well under pressure and handles stress.",
      "Accepts performance-based criticism and direction.",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "A minimum of a bachelor's degree and five-ten years of related experience in management and/or legislation or equivalent similar experience is required.",
      "Ability to perform essential job functions above.",
      "Ability to work cooperatively and courteously with others.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Thorough knowledge of local, state and federal agencies and departments.",
      "An understanding of the district and federal political process.",
      "Provides necessary organization, supervisory leadership and motivation to manage district office.",
      "Excellent oral and written communication skills.",
      "Work is mainly performed in an office environment. Noise levels are usually moderate.",
      "Ability to work in a small workstation without an expectation of privacy."
    ],
    "how_to_apply": "Please email your resume to Sarah Carlson at sarah.carlson@mail.house.gov",
    "salary_info": null,
    "contact": {
      "name": "Sarah Carlson",
      "email": "sarah.carlson@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-276-25",
    "position_title": "Field Representative",
    "office": "Congresswoman Debbie Wasserman Schultz",
    "location": "Sunrise, FL",
    "posting_date": "2025-08-18",
    "description": "Congresswoman Debbie Wasserman Schultz is looking for a self-motivated full-time Field Representative for her Sunrise, FL office. Overall primary responsibilities include serving as a liaison with federal, state, and/or local agencies and constituent groups, answering casework correspondence, communicating and meeting with constituents, and executing district outreach on behalf of the Member.",
    "responsibilities": [
      "Meeting with local groups and constituents on behalf of the Congresswoman.",
      "Proactively seeking opportunities to develop community outreach relationships on behalf of the Congresswoman.",
      "Working closely with the District Director and Outreach Director to implement planned outreach events and to suggest new innovative ideas.",
      "Representing or speaking on behalf of the Congresswoman at events and local meetings.",
      "Staying abreast of local news and issues affecting South Florida, particularly Broward County.",
      "Monitoring and updating the Congresswoman and senior staff on district and local issues.",
      "Responding to casework inquiries from constituents in a timely manner while monitoring casework for problems requiring legislative action or proper escalations.",
      "Working a flexible schedule including long hours, nights and weekends.",
      "Performing other duties as assigned, including driving the Member while in South Florida as needed."
    ],
    "qualifications": [
      "The successful applicant must have a positive attitude and the genuine desire to serve constituents contacting Congresswoman Wasserman Schultz for assistance.",
      "Applicants must possess strong communication, organizational, and writing skills as well as a strong interest in community outreach.",
      "Knowledge of the communities of the 25th Congressional district is preferred.",
      "Additional language proficiency, including in Spanish, is a plus.",
      "Experience, connections or exposure to working with organizations focused on African American, faith based, and Caribbean Communities is a plus for the role."
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume and a list of at least three references as one PDF. They should be submitted through the online portal: https://resumebank.domewatch.us/start/?code=WPgUOjYoXQf&title=Field%20Representative.\nIf interested, please send the required information by Friday, September 12, 2025, at 5:00PM.",
    "salary_info": "Salary Range: $45,000 - $60,000 (title and compensation commensurate with experience)",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-275-25",
    "position_title": "Staff Assistant",
    "office": "House Judiciary Committee Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2025-08-18",
    "description": "House Judiciary Committee Democratic Staff seeks a Staff Assistant to support all aspects of the Committee's work. This position is full-time and based in Washington, D.C.\n\nThe Staff Assistant will report directly to the Chief Clerk and Staff Director and plays a critical role in the operations of the full Committee and its subcommittees.",
    "responsibilities": [
      "coordinating logistics for events, and meetings",
      "preparing for and clerking hearings and markups",
      "answering phone calls, mail, and other inquiries",
      "processing and logging incoming and outgoing correspondence",
      "proofreading and formatting memos, letters, and other written materials",
      "supporting the Committee's internship program",
      "other duties as assigned"
    ],
    "qualifications": [
      "superior organizational and time-management skills",
      "excellent attention to detail",
      "the ability to multitask effectively in a fast-paced environment",
      "be comfortable working in a collaborative team environment",
      "Excellent written and verbal communication skills are essential"
    ],
    "how_to_apply": "The application deadline is August 22, 2025. To apply, please send an email to Job.JDEM@mail.house.gov with the subject line \"Staff Assistant - [YOUR NAME]\" and attach the following application materials as one combined PDF: a cover letter, resume, and writing sample (not to exceed two pages).\n\nNo unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": {
      "email": "Job.JDEM@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The Judiciary Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-274-25",
    "position_title": "Staff Assistant",
    "office": "Office of Congresswoman Lateefah Simon (D-CA-12)",
    "location": "Washington, D.C.",
    "posting_date": "2025-08-18",
    "description": "The Office of Congresswoman Lateefah Simon (D-CA-12) has an immediate need to hire a Staff Assistant for the Washington, D.C. office in a full-time capacity.\nWe are building a high-performing congressional office that delivers exceptional service to constituents, operates with efficiency and professionalism, and works every day toward justice and equity. We are seeking an extremely motivated individual who thrives in a fast-paced environment, values teamwork, and takes pride in serving the public. This is an opportunity to join a mission-driven team committed to making government work for the people it represents.\nThe Staff Assistant is responsible for managing the front desk during office hours and provides the first impression of the Member office to constituents, guests, and other VIPs. This position is also responsible for handling incoming calls, Capitol and other tour requests, flag requests, administrative office needs, and assists the D.C. office staff with other work as assigned. The experiences gained in the Staff Assistant role provide a solid foundation to advance into positions of increasing responsibility.",
    "responsibilities": [
      "Greets constituents, visitors, and other VIPs to provide a welcoming environment and positive first impression of the office.",
      "Handles incoming calls and captures constituent requests to ensure consideration by Member office.",
      "Works closely with the Director of Operations and Scheduling to ensure constituent appointments are on time.",
      "Monitors and organizes requests for assistance to ensure that they are directed to the appropriate staff member in a timely manner.",
      "Signs for deliveries and forwards all materials delivered to ensure timely and appropriate handling.",
      "Performs general administrative duties as assigned to assist the office staff and Member with work.",
      "Assists with constituent flag requests, tours of the Capitol, and arranging visits to other national landmarks as part of the office's constituent relations.",
      "Assists the Legislative Correspondent and other legislative staff to process constituent mail.",
      "Purchases supplies for the office to maintain office equipment.",
      "Completes special projects as assigned by senior staff."
    ],
    "qualifications": [
      "Adaptability: Adapts quickly to change or unexpected obstacles; easily considers new approaches.",
      "Attention to Detail: Performs work thoroughly and accurately, acts conscientiously and with attention to detail.",
      "Constituent Service Driven: Anticipates and meets the needs of constituents. Delivers high-quality and services.",
      "Interpersonal Skills: Develops and maintains effective relationships with others from diverse backgrounds and in different situations. Demonstrates understanding, courtesy, tact, empathy, and politeness.",
      "Strong verbal and written communication skills, with the ability to draft professional correspondence and relay information accurately.",
      "Exceptional organizational skills and attention to detail, able to manage multiple priorities in a fast-paced environment.",
      "Proficiency with Microsoft Office Suite, Google Workspace, and standard office technology; comfort learning new software quickly.",
      "Ability to answer and screen phone calls, greet visitors, and manage the front desk with professionalism and discretion.",
      "Strong interpersonal skills with the ability to work well in a team and interact respectfully with constituents, colleagues, and stakeholders.",
      "Sound judgment and the ability to maintain confidentiality in all matters."
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume, cover letter, and three references in a single document to CA12ls.jobs@mail.house.gov with the subject line \"Staff Assistant.\" Applications will be considered on a rolling basis, with the position closing September 1, 2025.",
    "salary_info": "Starting Salary: $55,000 annually",
    "contact": "CA12ls.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-273-25",
    "position_title": "Legislative Correspondent",
    "office": "Representative Juan Vargas (CA-52)",
    "location": "DC",
    "posting_date": "2025-08-18",
    "description": "The office of Representative Juan Vargas (CA-52), a member of the Financial Services Committee and Ranking Member of the Task Force on Monetary Policy, Treasury Market Resilience, and Economic Prosperity, is seeking candidates to apply for an open Legislative Correspondent position. This position will report to the Chief of Staff and Deputy Chief of Staff / Legislative Director.\n\nThe position will be based in DC and occasionally travel to San Diego, as needed. Qualified candidates will be independent self-starters with a demonstrated ability to generate new ideas and work well as part of a team. They will also have strong writing, research, analytical, and organizational skills. This position will be responsible for:",
    "responsibilities": [
      "Leading the office's efforts to respond to constituent outreach, including by designing, developing, and executing processes for collecting, reviewing, organizing, and responding to correspondence from constituents in both English and Spanish;",
      "Identifying ways that the office can better respond to constituent outreach and concerns, including by making proposals to the Legislative Director and Chief of Staff regarding how to improve correspondence processes and approaches;",
      "Overseeing the process of logging outreach from constituents-including outreach by phone, email, website, or physical mail-into our constituent management system and managing the process of organizing constituent outreach into categories (or 'batches') of correspondence based on the topic of the correspondence;",
      "Making recommendations to the Legislative Director about when to create new batches and letters, and drafting new letters in response to constituent outreach on new topics;",
      "Training interns on how to answer phones, log correspondence, and batch messages, and overseeing and reviewing work done by interns to batch and categorize constituent messages;",
      "Proofreading batches of correspondence before regularly sending out responses;",
      "Monitoring existing letters and making recommendations about when to update letters in response to new developments;",
      "Working with the Legislative Director to assign letter drafting responsibilities to interns, fellows, and legislative staff, and to ensure that staff have completed their reviews in a timely fashion;",
      "Reviewing initial letter drafts written by interns for accuracy, style, and consistency with the members' views;",
      "Sending weekly updates to the Legislative Director that include, among other things, draft outlines for letters, recommendations for new letters, and updates on where existing letters are in the review process;",
      "Managing the office's constituent mail database (Indigov) and outreach lists, including by ensuring that information is tagged correctly and that we are adding user tags for constituents from various groups;",
      "Overseeing the sending of physical responses to constituent messages received through the mail;",
      "Responding to constituent requests for flags and tours of federal buildings (including the FBI, White House, Library of Congress, and the Capitol);",
      "Staffing the front desk when needed;",
      "Responding to thank you letters from capitol tour groups and constituents and managing the sending of Congressional Awards and Letters of Commendation;",
      "Devising a strategy for responding to niche individual mail and constituent requests, and identifying opportunities for the congressman to personally contact constituents; and",
      "Managing the D.C. office intern program, including by hiring interns, managing the intern budget, overseeing the work of the interns, and serving as the point of contact for past interns."
    ],
    "qualifications": [
      "Independent self-starters with a demonstrated ability to generate new ideas and work well as part of a team.",
      "Strong writing, research, analytical, and organizational skills.",
      "Congressional experience (preferred).",
      "Spanish proficiency (preferred).",
      "Southern California ties (preferred)."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and writing sample to: cajobs52@gmail.com with \"Legislative Correspondent - [NAME]\" in the subject line. Applications are due by August 24, 2025.",
    "salary_info": "The salary range for this position is between $55,000-$60,000, based on experience.",
    "contact": "cajobs52@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all backgrounds to apply."
  },
  {
    "id": "MEM-270-25",
    "position_title": "District Staff Assistant/Press Assistant",
    "office": "Office of Congresswoman Janelle Bynum",
    "location": "Oregon City, Oregon",
    "posting_date": "2025-08-18",
    "description": "The Office of Congresswoman Janelle Bynum is seeking a District Staff Assistant/Press Assistant. This position offers a unique opportunity to serve in a dual role furthering the district office's administrative and communication activities.\n\nPOSITION OVERVIEW:\nThe Staff Assistant/Press Assistant will maintain the district office to ensure a welcoming environment for constituents and visitors - and work with the office's communications team to manage media contacts, create content, and organize district events.",
    "responsibilities": [
      "Greet and screen visitors at the district office based in Oregon City, Oregon;",
      "Handle incoming calls with poise, professionalism, and promptness to capture input from constituents on policy matters for consideration and response;",
      "Draft memos, speeches, video scripts, newsletters, surveys, and social media content;",
      "Staff the Congresswoman for interviews at district events;",
      "Assist with planning and executing district events, such as town halls and roundtable meetings;",
      "Develop and implement media and communication strategies for the Member;",
      "Drive the Member to events and staff events as needed;",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Bachelor's degree or related job experience;",
      "A demonstrated interest in public service;",
      "Familiarity with the Oregon Congressional District 5 and knowledge of current issues and events in which the Member is involved;",
      "Strong writing, editing, and proofreading skills;",
      "Strong oral communication skills;",
      "Understanding of print and broadcast media;",
      "Ability to work well under pressure and courteously with others."
    ],
    "how_to_apply": "Please send your resume and cover letter to BynumJobs@mail.house.gov by Monday, August 18, 2025.",
    "salary_info": null,
    "contact": "BynumJobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-269-25",
    "position_title": "Deputy Communications Director/Digital Director",
    "office": "Office of Congressman Moskowitz",
    "location": "Washington, D.C.",
    "posting_date": "2025-08-18",
    "description": "As a member of our communications team and in collaboration with the Congressman, Deputy Comms Director/Digital Director will write and produce engaging digital content, monitor online narratives and trends, and assist with traditional press inquiries and tasks. The individual will also manage the Congressman's social media platforms with oversight from the Communications Director. This is a mid-level communications role within the office.",
    "responsibilities": [
      {
        "category": "Digital Strategy",
        "tasks": [
          "Develop and implement digital strategies to amplify the Representative's message and engage constituents, including through emerging trends online.",
          "Manage social media accounts (Facebook, Instagram, X, YouTube, Bluesky, and Threads) through content creation and community engagement.",
          "Create compelling digital content such as graphics, videos, and infographics to communicate key messages."
        ]
      },
      {
        "category": "Content Creation",
        "tasks": [
          "Collaborate with team members to develop multimedia content that effectively communicates legislative priorities and initiatives.",
          "Ensure all content is accurate, consistent with the Representative's voice, and aligns with brand guidelines.",
          "Required to have extensive knowledge and experience to create memes and create AI videos from start to finish. Experience with video production, video editing, and emerging AI tools, including through platforms like Canva, ChatGPT, and the Adobe Suite."
        ]
      },
      {
        "category": "Public Relations",
        "tasks": [
          "Draft press releases, media advisories, op-eds, franked communications, and other materials as needed.",
          "Coordinate interviews, press conferences, and media appearances for the Representative in both the traditional and new media spaces.",
          "Monitor media coverage--including press and digital clips with support from a press intern--and prepare regular reports for the team.",
          "Be comfortable making fun of our republican colleagues such as, James Comer (this tells me you read the whole post)."
        ]
      }
    ],
    "qualifications": [
      "Experience working in a fast-paced government office or on political campaigns.",
      "Knowledge of data analytics and metrics to track the effectiveness of digital campaigns.",
      "Experience managing crisis communications and responding to media inquiries under tight deadlines.",
      "Demonstrated ability to think creatively and strategically to generate innovative ideas for media outreach and digital engagement.",
      "Strong interpersonal skills and the ability to collaborate effectively with team members and external stakeholders.",
      "Flexibility to work evenings and weekends as needed, especially during high-profile events or legislative sessions."
    ],
    "how_to_apply": "Please submit resume, three references, a digital portfolio, and a cover page as one PDF document to Moskowitz.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "Moskowitz.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal-opportunity employer. Candidates with diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-268-25",
    "position_title": "Field Representative & Caseworker",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Long Beach, CA",
    "posting_date": "2025-08-18",
    "description": "Congresswoman Nanette Barragan (CA-44) is seeking a Field Representative & Caseworker for her District Office in Long Beach, CA.\n\nCandidate should possess excellent verbal and written communication skills, have the proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests, be highly organized, and have the ability to manage multiple tasks and competing deadlines simultaneously.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "answer and log incoming phone calls, casework intake and work on casework through completion",
      "identify event and correspondence opportunities in assigned geographic and issue areas",
      "staff the Congresswoman and serve as staff representative for the Congresswoman at community meetings and events",
      "lead or assist with planning, organizing, and executing district outreach efforts in assigned geographic and issue areas",
      "identify issues related to federal programs for possible legislation and/or letters",
      "manage correspondence and acknowledgements from the office",
      "meet with constituent and community leaders and develop relationships and networks in assigned geographic and issue areas",
      "work with community groups and organizations, local elected officials, and others in the Congressional District to identify potential opportunities for federal funding",
      "serve as a liaison with federal, state, and local agencies, and committees"
    ],
    "qualifications": [
      "excellent verbal and written communication skills",
      "proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests",
      "highly organized",
      "ability to manage multiple tasks and competing deadlines simultaneously",
      "Knowledge of communities within California's 44th District preferred.",
      "A car and good driving record required (mileage reimbursement available)",
      "Diverse candidates encouraged to apply.",
      "Candidates must also be able to work a flexible schedule, including some nights and weekends as required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with 'CA44 Field Rep' in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "$60-$72,000 based on experience",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-267-25",
    "position_title": "District Staff Assistant",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Long Beach, CA",
    "posting_date": "2025-08-18",
    "description": "Congresswoman Nanette Barragan (CA-44) is seeking a District Staff Assistant for her District Office in Long Beach, CA.\n\nThe District Staff Assistant greets visitors, answers the telephone, helps to supervise the district internship program, and responds to constituent requests for general information and other inquiries. This position maintains the front office and assists district office staff with various administrative duties while maintaining an external agenda that interacts frequently with constituents. The position will also support the Office's community outreach and events with the Congresswoman when she is in the district.",
    "responsibilities": [
      "Greets visitors, answers the telephone, helps to supervise the district internship program, and responds to constituent requests for general information and other inquiries.",
      "Maintains the front office and assists district office staff with various administrative duties while maintaining an external agenda that interacts frequently with constituents.",
      "Support the Office's community outreach and events with the Congresswoman when she is in the district."
    ],
    "qualifications": [
      "Possess excellent verbal and written communication skills, strong interpersonal skills, have the proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests, highly organized, the ability to manage multiple tasks and competing deadlines simultaneously, and able to work in a fast-paced environment.",
      "Knowledge of communities within California's 44th District preferred.",
      "A car and good driving record required (mileage reimbursement available)",
      "Diverse candidates encouraged to apply.",
      "Candidates must also be able to work a flexible schedule, including some nights and weekends as required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with 'CA44 Staff Assistant' in the subject line to CA44Resumes@mail.house.gov",
    "salary_info": "Pay: $50-53,000 based on experience",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-265-25",
    "position_title": "Legislative Director",
    "office": "Rep. Frederica Wilson (D-FLA.)",
    "location": "Washington, D.C.",
    "posting_date": "2025-08-18",
    "description": "The Washington, D.C. Office of Rep. Frederica Wilson (D-FLA.), Member of the Committee on Education and the Workforce and Transportation & Infrastructure Committees, is hiring a Legislative Director. The Legislative Director works with the Member and other senior staff to lead the development and implementation of her policy, legislative, and appropriations strategy, managing a legislative team of 4-5 staff and fellows while also covering a small individual portfolio of legislative issues.",
    "responsibilities": [
      "Developing and advancing the Member's policy priorities through the legislative and appropriations processes.",
      "Managing the operations of the legislative team and serving as a member of the office's senior leadership team.",
      "Developing memos, remarks, committee materials, and other briefing materials for the Member/office.",
      "Supporting the press team on policy-related communications.",
      "Working with the district team to support their work and address constituents' policy concerns.",
      "Monitoring activity on the House Floor, the House Rules Committee and working with the legislative team to develop vote recommendations.",
      "Building and maintaining positive and effective relationships with district, D.C., and national stakeholders and advocacy organizations.",
      "Overseeing the office's constituent correspondence program; and",
      "Other duties and special projects as assigned."
    ],
    "qualifications": [
      "This is not an entry-level role.",
      "Candidates should have deep expertise in policy, legislative drafting and procedure, and congressional appropriations experience is a plus.",
      "Miami/Florida ties are also a plus.",
      "Candidates with previous Education Committee or Senate HELP experience are encouraged to apply.",
      "Essential skills include an expert-level working knowledge of Congress; strong oral and written communication skills, including rigorous editing and fact-checking; excellent attention to detail; the ability to execute on multiple deadlines and tasks in a fast-paced environment; strong interpersonal and relationship-building skills; the ability to make quick decisions when advising a principal; a proven track record navigating complex constituent and political situations; and the responsiveness and professional demeanor to represent the office well to a wide range of communities."
    ],
    "how_to_apply": "To apply, please email the Chief of Staff, Leon Buck at Leon.Buck@mail.house.gov, with \"Legislative Director\" in the subject line and the following application materials attached as one combined PDF. Applications will be considered on a rolling basis:\n- Resume\n- Cover letter\n- 2-3 professional references\n- A writing sample would be appreciated.",
    "salary_info": null,
    "contact": {
      "name": "Leon Buck",
      "title": "Chief of Staff",
      "email": "Leon.Buck@mail.house.gov",
      "subject": "Legislative Director"
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status."
  },
  {
    "id": "MEM-263-25",
    "position_title": "Counsel or Professional Staff Member",
    "office": "Committee on Oversight and Government Reform, Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2025-08-18",
    "description": "The Committee on Oversight and Government Reform, Democratic staff seeks a counsel or professional staff member to assist with the Committee's oversight and investigations work.\n\nThis position's primary focus would include national security, homeland security, law enforcement, immigration, and the military; reporting to the Full Committee, as well as the Subcommittee on Military and Foreign Affairs, and the Subcommittee on Federal Law Enforcement. Substantive work on policy, oversight, and investigations related to DHS and DOD is preferred.",
    "responsibilities": [
      "Preparing for and staffing hearings and briefings",
      "Drafting statements, memos, letters and other materials",
      "Assisting with the Committee's investigative and oversight work, including preparing for and conducting transcribed interviews and depositions",
      "Serving as a resource for Democratic Members and staff on matters within the Committee's jurisdiction"
    ],
    "qualifications": [
      "Exceptional writing and research skills, sound political judgment, the capacity to articulate technical and policy issues clearly and concisely, and the ability to work closely and collaboratively with other congressional offices and stakeholders are essential.",
      "This is not an entry-level position.",
      "Previous Capitol Hill, Administration or legal experience, and experience with investigations or oversight, is preferred.",
      "Candidates with a TS or TS/SCI Security Clearance are preferred."
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with \"Counsel/Professional Staff Member\" in the subject line. Please attach your resume and cover letter as one PDF with the file name using the following format: \"LastName.FirstName\". No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": "The starting range for this position is $75,000 - $110,000, with the negotiated salary highly commensurate with the level of educational and professional experience.",
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "The Oversight Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-262-25",
    "position_title": "Scheduler",
    "office": "The Office of Congresswoman Linda Sanchez",
    "location": "Washington, DC",
    "posting_date": "2025-08-18",
    "description": "The Office of Congresswoman Linda Sanchez is seeking a Scheduler based in the Washington, DC office. Candidates must have exceptional organizational and communications skills, be very detail oriented, and enjoy working in a fast-paced team environment. The ideal candidate will have proven knowledge of the congressional work setting, ability to balance competing demands, and possess sound political judgement. The position requires a willingness to work non-traditional hours when required. Hybrid work options are available during non-session weeks.",
    "responsibilities": [
      "Maintaining and managing the Member's daily and long-term DC and national schedule",
      "Responding to all incoming meeting and scheduling requests",
      "Coordinating travel and booking flight, train, and lodging reservations for the Congresswoman",
      "Communicating key information and scheduling changes to the Member, staff, and effected stakeholders in a timely and efficient manner",
      "Coordinating with other Member offices, Committee staff, leadership offices, the White House, and Executive Departments and federal agencies on scheduling requests and events",
      "Coordinating with the District Director and district staff on scheduling in-district events when appropriate",
      "Compiling the Congresswoman's daily briefing materials and coordinating with legislative and press staff on materials needed for meetings and events",
      "Assisting the Chief of Staff with office operations",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Exceptional organizational and communications skills",
      "Very detail oriented",
      "Enjoy working in a fast-paced team environment",
      "Proven knowledge of the congressional work setting",
      "Ability to balance competing demands",
      "Possess sound political judgement",
      "Willingness to work non-traditional hours when required",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred",
      "Southern California ties are a plus"
    ],
    "how_to_apply": "To apply for this position, email a PDF copy of your resume and three professional references to CA38jobs@mail.house.gov with \"DC Scheduler Position\" in the subject line.",
    "salary_info": "Salary will be commensurate with experience. (The range for this job is $60,000 - $74,000.)",
    "contact": {
      "email": "CA38jobs@mail.house.gov"
    },
    "equal_opportunity": "This office is an equal opportunity employer. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-257-25",
    "position_title": "Staff Assistant/Driver",
    "office": "Office of Congressman Marc Veasey (TX-33)",
    "location": "Washington, DC",
    "posting_date": "2025-08-18",
    "description": "The office of Congressman Marc Veasey (TX-33) is seeking a Staff Assistant/Driver for his Washington, DC Office.\n\nThe ideal candidate has strong driving skills, excellent professional judgement and discretion, exceptional customer or constituent service skills, close attention to detail and time management, excellent writing and communication skills, an aptitude for database work, the ability to prioritize and follow through on multiple competing priorities in a fast-paced environment, and a strong commitment to public service. A valid U.S. driver's license, clean driving record, and access to a vehicle are required for the position. The applicant should be aware that this position will sometimes require work outside of normal hours of operation.\n\nTexas ties are a plus but not necessary.",
    "responsibilities": [
      "Driving the Member;",
      "Work closely with the Member's scheduling team to ensure appointments are on time;",
      "Managing the front office - including greeting and welcoming visitors;",
      "Answering DC phones and logging constituent comments/feedback;",
      "Coordinating tour and flag requests;",
      "Completing office operation and administrative duties;",
      "Assisting with management of DC internship program;",
      "Managing office mail program, including overseeing IQ correspondence system and ensuring constituents receive timely replies to mail;",
      "Assisting the DC staff with other work as assigned."
    ],
    "qualifications": [
      "Active driver's license, a clean driving record, and personal vehicle",
      "Effective communication skills for verbal and written correspondence",
      "Strong organizational skills, attention to detail, time management, and ability to manage multiple priorities",
      "Professional demeanor and positive attitude"
    ],
    "how_to_apply": "All applicants should send an email, cover letter, and writing sample to TX33Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": {
      "email": "TX33Jobs@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-254-25",
    "position_title": "Staff Assistant & District Field Representative",
    "office": "Congressman Frank Pallone, Jr.",
    "location": "New Jersey",
    "posting_date": "2025-08-18",
    "description": "The district office of Congressman Frank Pallone, Jr. seeks a hardworking, organized individual to serve as a Staff Assistant & District Field Representative. This position primarily entails constituent casework and community outreach. Other responsibilities include meeting with local community officials, representing the Congressman at community and governmental events, special projects, as well as general office work.\n\nCandidates should possess excellent verbal and written communication skills and must enjoy working with the public. Prior experience in government, the non-profit sector, community and grassroots organizing is preferred. This position is based in New Jersey.",
    "responsibilities": [
      "Constituent casework and community outreach.",
      "Meeting with local community officials.",
      "Representing the Congressman at community and governmental events.",
      "Special projects.",
      "General office work."
    ],
    "qualifications": [
      "Excellent verbal and written communication skills.",
      "Must enjoy working with the public.",
      "Prior experience in government, the non-profit sector, community and grassroots organizing is preferred.",
      "Applicants must have a valid driver license."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, writing sample, and references by email to NJ06.Jobs@mail.house.gov",
    "salary_info": null,
    "contact": {
      "email": "NJ06.Jobs@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-249-25",
    "position_title": "Constituent Service Representative/Caseworker",
    "office": "Office of U.S. Congressman Ed Case",
    "location": "Honolulu, HI",
    "posting_date": "2025-08-18",
    "description": "U.S. Congressman Ed Case (Hawai'i - 01) is seeking a Constituent Services Representative / Caseworker for his district office located in downtown Honolulu.\n\nThis position also acts as a liaison to federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues. The position requires initiative, strong interpersonal skills, the ability to multitask, work independently and effectively under pressure, make decisions, and solve problems, orientation to detail, excellent verbal communication and writing skills, and unpredictable hours as necessary.\n\nPreference given to Hawai'i background/community involvement and prior related work experience, and applicants are asked to detail these attributes.",
    "responsibilities": [
      "Acts as a liaison to federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues."
    ],
    "qualifications": [
      "Initiative",
      "Strong interpersonal skills",
      "The ability to multitask, work independently and effectively under pressure, make decisions, and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work unpredictable hours as necessary",
      "Preference given to Hawai'i background/community involvement and prior related work experience"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with \"Constituent Service Representative\" in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": {
      "email": "HI01resumes@gmail.com",
      "phone": null,
      "fax": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-248-25",
    "position_title": "Congressional District Director",
    "office": "Office of U.S. Congressman Ed Case",
    "location": "Honolulu, HI",
    "posting_date": "2025-08-18",
    "description": "U.S. Congressman Ed Case (Hawaii- 01) is seeking a District Director for his Honolulu district office.\n\nThis is a senior leadership position in the office.",
    "responsibilities": [
      "Overseeing the Representative's constituent casework activities with federal, state and local agencies;",
      "Aligning the office's strategies and plans with the Representative's broader goals;",
      "Collaborating with Washington-based staff to ensure smooth communication and coordination between the Honolulu and D.C. offices;",
      "Facilitating he Representative's engagement in the district;",
      "Managing and leading the Honolulu office staff, which includes planning, assigning and directing work to ensure high performance and efficiency."
    ],
    "qualifications": [
      "Familiarity with Hawaii's 1st Congressional District",
      "Initiative",
      "Strong interpersonal skills",
      "The ability to multitask, work independently and effectively under pressure",
      "A proven ability to manage staff, make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "The ability to manage long and unpredictable hours",
      "Very strong preference given to (1) prior experience especially in comparable duties and (2) Hawaii background/community involvement, and applicants are asked to detail these attributes."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two references and two short writing samples to HI01resumes@gmail.com with 'Honolulu District Director Vacancy' in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-247-25",
    "position_title": "Staff Assistant",
    "office": "Office of U.S. Congressman Ed Case",
    "location": "Honolulu, HI",
    "posting_date": "2025-08-18",
    "description": "U.S. Congressman Ed Case (Hawai'i - 01) is seeking a Staff Assistant for his district office located in downtown Honolulu.\n\nThe position is responsible for a wide variety of administrative duties and acts as a liaison to federal, district and local government agencies and community organizations on behalf of the Congressman on requests by constituents seeking assistance with individual/group issues. The position requires initiative, strong interpersonal skills, the ability to multitask, work independently and effectively under pressure, make decisions, and solve problems, orientation to detail, excellent verbal communication and writing skills, and unpredictable hours as necessary. Duties include but are not limited to greeting visitors and answering constituent calls and requests for general information, tours and other inquiries.\n\nPreference given to Hawai'i background/community involvement and prior related work experience, and applicants are asked to detail these attributes.",
    "responsibilities": [
      "Responsible for a wide variety of administrative duties.",
      "Acts as a liaison to federal, district and local government agencies and community organizations on behalf of the Congressman on requests by constituents seeking assistance with individual/group issues.",
      "Greeting visitors and answering constituent calls and requests for general information, tours and other inquiries."
    ],
    "qualifications": [
      "Initiative",
      "Strong interpersonal skills",
      "The ability to multitask, work independently and effectively under pressure, make decisions, and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work unpredictable hours as necessary",
      "Preference given to Hawai'i background/community involvement and prior related work experience"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with \"Staff Assistant\" in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": {
      "email": "HI01resumes@gmail.com",
      "phone": null,
      "address": null,
      "instructions": "Use subject line \"Staff Assistant\""
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-246-25",
    "position_title": "Scheduler",
    "office": "Office of Congressman Pat Ryan",
    "location": "Washington, DC and Hudson Valley, NY",
    "posting_date": "2025-08-18",
    "description": "The role will work closely with the Chief of Staff to maintain the short- and long-term schedules for the Member in DC and the Hudson Valley. Primary scheduling responsibilities include exercising sharp judgment in granting scheduling requests, responding to all meeting requests promptly and politely, and keeping events and meetings within designated timeframes.\n\nOverall goals include ensuring that the Member's messaging and mission are reflected in his schedule and itinerary. This position requires flexible hours, adaptability, ability to skillfully and effectively communicate, and superior organizational skills.\n\nThis is not an entry-level position. This position is part of the senior staff team and reports to the Chief of Staff.",
    "responsibilities": [
      "Resourcing the Member with proper briefing materials, ensuring that the Member is properly staffed for meetings and events,",
      "Serving as a liaison for the Member with the staff, public, Committees, and other Members of Congress",
      "Assisting with event planning, coordinating and booking travel,",
      "Leading scheduling meetings and updating staff on the Member's schedule,",
      "Additional duties as assigned by the Member or Chief of Staff"
    ],
    "qualifications": [
      "Ideal candidates will have previous experience working in operational roles on Capitol Hill or on political campaigns.",
      "Preference given to candidates with Hudson Valley or New York ties."
    ],
    "how_to_apply": "To apply, please send your resume, cover letter, and references in a single PDF to ny18resumes@mail.house.gov with the job title in the subject line and your full name (e.g.: \"Scheduling Role - First Last). Applicants will be evaluated on a rolling basis.",
    "salary_info": "The pay range for the position is $60,000 - $75,000 a year.",
    "contact": "ny18resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-245-25",
    "position_title": "Speechwriter",
    "office": "The House Appropriations Committee Minority",
    "location": null,
    "posting_date": "2025-08-18",
    "description": "The House Appropriations Committee Minority seeks an experienced Speechwriter.\n\nCompetitive candidates will possess the ability to write clearly, persuasively, and concisely. Candidates should have the flexibility to work under tight deadlines and write about a wide range of topics. In this position, creativity and collaboration are as vital as attention to detail and capturing Ranking Member Rosa DeLauro's voice.\n\nThe ideal candidate has extensive communications experience, with a preference for candidates with knowledge of the Appropriations process. Responsibilities include, but are not limited to:\n\nBeyond these duties, there is room for candidates to explore other interests including the creation of graphics, videos, and other digital material.",
    "responsibilities": [
      "Managing the production of all oral statements and op-eds for the Ranking Member and assisting other Members of the Committee.",
      "Collaborating with the Communications Director, committee staff, and the Ranking Member's personal office to produce robust speeches with approved messaging, as well as well-sourced facts and figures, and moving stories.",
      "Writing statements, speeches, op-eds, talking points, messaging guidance, fact sheets, newsletters, and social media copy.",
      "Executing other press responsibilities including compiling the morning clips, sending out press releases in a timely manner, managing the press list, updating the website, and other duties as assigned."
    ],
    "qualifications": [
      "Possess the ability to write clearly, persuasively, and concisely.",
      "Flexibility to work under tight deadlines and write about a wide range of topics.",
      "Creativity and collaboration are as vital as attention to detail and capturing Ranking Member Rosa DeLauro's voice.",
      "Extensive communications experience, with a preference for candidates with knowledge of the Appropriations process."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three professional references, and two relevant writing samples to AppropsDemJobs@mail.house.gov with the following subject line: [Full Name] - Speechwriter",
    "salary_info": null,
    "contact": {
      "email": "AppropsDemJobs@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-244-25",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Rosa L. DeLauro (CT-03)",
    "location": "Washington, DC",
    "posting_date": "2025-08-18",
    "description": "Congresswoman Rosa L. DeLauro (CT-03) is hiring a full-time Staff Assistant in her Washington, DC office to start in the beginning of September 2025. This role provides a unique entry level opportunity to work closely with a prominent Member of Congress. The staff assistant reports to the scheduler and chief of staff.",
    "responsibilities": [
      "driving the Member",
      "helping execute her daily schedule",
      "providing logistical support for events and meetings",
      "managing the front office and the internship program",
      "coordinating tours and constituent requests",
      "processing incoming phone calls, mail, and other inquiries",
      "providing operational, administrative, and technology support for the office and staff",
      "performing other duties as assigned"
    ],
    "qualifications": [
      "Applicants should be detail-oriented, proactive, calm under pressure, able to exercise discretion, eager to work in a fast-paced office, and willing to work flexible-and sometimes long-hours when the Member is in DC.",
      "Strong communication, logistical, interpersonal, and organizational skills are essential.",
      "Applicants must have a valid driver's license, a clean driving record, and should be comfortable driving in DC.",
      "Access to a personal car is preferred, although not required.",
      "Connecticut ties are a plus."
    ],
    "how_to_apply": "please send a cover letter, resume, writing sample (maximum of 1-2 pages), and two reference contacts (name, title, email, phone, and relationship) in a single pdf file to Daniel.Robillard@mail.house.gov with the subject line \"Staff Assistant: Your name (First/Last)\" No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "Daniel.Robillard@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and encourages all qualified candidates to apply."
  },
  {
    "id": null,
    "position_title": "Press Secretary",
    "office": "CA44",
    "location": "Los Angeles Metro|Southern California",
    "posting_date": "2025-08-18",
    "description": null,
    "responsibilities": [
      "Work with the Communications Director to build and maintain the Congresswoman's brand.",
      "Develop and manage digital content across platforms (Facebook, Instagram, X, Bluesky, and YouTube). Support the office's social media strategy by drafting social media posts and producing video and graphic materials.",
      "Update and manage the official website.",
      "Monitor national and local media coverage, as well as social media trends.",
      "Clip and caption TV appearances, floor speeches, long and short form videos, and more.",
      "Draft and edit press releases, advisories, franked communications, and other communications materials as assigned",
      "Help plan and execute press events, interviews, and digital outreach.",
      "Maintain press contact lists and support external communications efforts."
    ],
    "qualifications": [
      "Strong writing, editing, and strategic messaging skills",
      "Skilled in Canva, Adobe Suite, or similar platforms",
      "Media relations success and ability to assist with communications in a fast-paced environment",
      "Los Angeles Metro|Southern California ties are a plus",
      "Fluency in Spanish is a plus",
      "Must be a collaborative, high-energy team player committed to advancing the office's mission and responsive to emerging priorities."
    ],
    "how_to_apply": "Send (1) Cover Letter, (2) Resume, (3) 2 writing samples of 500 words or less, (4) digital/photographic portfolio, and (5) and three references - including name, title, organization, contact details, and your relationship. Please send all materials to CA44Resumes@mail.house.gov with \"CA44 Press Secretary\" in the Subject Line.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  }
]