[
  {
    "id": "MEM-141-25",
    "position_title": "Clackamas Field Rep",
    "office": "Congresswoman Janelle Bynum’s Office",
    "location": "Clackamas County field office",
    "posting_date": "2025-04-28",
    "description": "The office of Congresswoman Janelle Bynum is seeking a field representative for the office’s Clackamas County field office. This position offers a unique opportunity to play a key role in the Congresswoman’s efforts and act as a grassroots representative for the office.\n\nPOSITION OVERVIEW:\nThe field representative will work closely with the district staff and act as a liaison with federal, district, and local agencies for the Member and constituents.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals, and coordinate closely with the District Director and D.C. staff to ensure district priorities are reflected in legislative priorities;",
      "Inform the District Director and the Member on up-and-coming issues in the district;",
      "Serve as a representative for the Member at events in the district as determined by the District Director;",
      "Build and maintain relationships with constituents and key community leaders;",
      "Inform the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Bachelor’s degree or related job experience;",
      "A demonstrated interest in public service;",
      "Familiarity with the Member’s district and/or state."
    ],
    "how_to_apply": "Please send your resume and cover letter to BynumJobs@mail.house.gov by May 9, 2025.",
    "salary_info": null,
    "contact": "BynumJobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-140-25",
    "position_title": "Senior Legislative Assistant",
    "office": "Rep. Tony Gonzales (TX-23)",
    "location": null,
    "posting_date": "2025-04-28",
    "description": null,
    "responsibilities": [
      "to develop legislative initiatives relevant to the Member's position on the House Appropriations Committee and the Committee on Homeland Security",
      "to monitor legislative developments within Committees and on the House floor",
      "to meet with constituents and advocacy groups on behalf of the Member"
    ],
    "qualifications": [
      "at least 2 years of legislative experience in a full-time, legislative position",
      "prior Capitol Hill experience is strongly preferred",
      "excellent oral and written communication skills",
      "thorough knowledge of the legislative process",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member",
      "ability to work cooperatively and courteously with others",
      "ability to work well under pressure",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-139-25",
    "position_title": "Press Assistant/Press Secretary",
    "office": "Rep. Tony Gonzales (TX-23)",
    "location": "Washington, D.C.",
    "posting_date": "2025-04-28",
    "description": "The Office of Congressman Tony Gonzales seeks a Press Secretary or Press Assistant in his Washington, D.C. office (title and pay commensurate with experience). Applicants must have exceptional writing skills, attention to detail, and an ability to manage competing demands and deadlines.",
    "responsibilities": [
      "Managing the Congressman’s digital media",
      "Coordinating the creation of print and digital advertisements",
      "Creating and posting social media posts",
      "Producing graphics and editing photos and videos",
      "Drafting press releases and weekly newsletters",
      "Compiling daily press clips",
      "Managing the Member’s website"
    ],
    "qualifications": [
      "Candidates with Texas ties are preferred.",
      "This is not an entry-level position; at least 1-2 years of full-time, post-graduation professional experience in press and digital communications or a related field is required (internships do not count toward this requirement)."
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-138-25",
    "position_title": "FINANCIAL DISCLOSURE COUNSEL",
    "office": "U.S. HOUSE OF REPRESENTATIVES COMMITTEE ON ETHICS",
    "location": "Washington, DC",
    "posting_date": "2025-04-28",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office. The Committee's financial disclosure counsel is responsible for reviewing and certifying a large volume of Financial Disclosure Reports, providing legal advice on financial disclosure related matters, providing education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product. This is a nonpartisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Reviewing and certifying a large volume of Financial Disclosure Reports",
      "Providing legal advice on financial disclosure related matters",
      "Providing education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "$136,780 and $145,604 per annum",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-137-25",
    "position_title": "Caseworker",
    "office": "Congresswoman Sarah Elfreth (MD-03)",
    "location": "Columbia, Maryland",
    "posting_date": "2025-04-28",
    "description": "Congresswoman Sarah Elfreth (MD-03) seeks a self-motivated and organized\nindividual to join her team as a Caseworker based in her District Office in Columbia, Maryland. This position serves as a liaison between federal, state, and local agencies on behalf of the Member and her constituents. The Caseworker will handle a portfolio of issue areas through casework correspondence and verbal communication with constituents.",
    "responsibilities": [
      "Serve as the representative for the Member in their assigned portfolio, including responding to casework requests, meeting/corresponding with constituents and serving as a liaison to federal agencies.",
      "Inform the Member and District Director of trends and policy updates in his or her assigned issue areas.",
      "Handle and prioritize casework assignments while assisting with general intake, constituent service requests, and communication in an office environment.",
      "Assess casework inquiries for problems requiring legislative action and provide recommendations to the District Director, Chief of Staff and the Member.",
      "Screen and refer cases, when appropriate, to other federal, state and local elected officials.",
      "Prepare periodic memos/reports for senior leadership and the Member on pending cases and district activities in his or her assigned issue areas.",
      "Monitor active cases and act as a liaison on behalf of constituents to ensure inquiries are handled in a responsive manner.",
      "Maintain up-to-date files on all cases, constituent correspondence and issues of importance to the Office.",
      "Direct and guide constituents to private and public resources at the federal, state and local level.",
      "Maintain a good working relationship with the Member, staff, and constituents.",
      "Demonstrate an ability to accept performance-based feedback and direction.",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Demonstrate strong interpersonal skills, including the ability to empathize and active listening.",
      "Ability to exercise discretion and independent judgment to handle and respond appropriately to casework inquiries.",
      "Strong oral and written communication skills.",
      "General knowledge of casework process.",
      "General knowledge and ability to identify federal, state and local issues.",
      "Professional and compassionate telephone manner.",
      "Strong organizational and follow-up skills.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others.",
      "Thoroughness and careful attention to detail.",
      "Proficient in word processing, general computer programming and office equipment: scanner, copier, printer, desktop computer."
    ],
    "how_to_apply": "All interested candidates should email a resume and cover letter directly to MD03Resumes@mail.house.gov with the subject line “Caseworker – [Applicant’s First Name and Last Name].",
    "salary_info": null,
    "contact": "MD03Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-135-25",
    "position_title": "DC-Based Scheduler and Office Manager",
    "office": "Office of Representative Sharice Davids (KS-03)",
    "location": "DC",
    "posting_date": "2025-04-28",
    "description": "The Office of Representative Sharice Davids (KS-03) is seeking a DC- based\nScheduler/Office Manager to coordinate the Representative’s schedule and manage\noverall operations in the DC office.\n\nCandidates must have exceptional organizational skills, attention to detail, and an ability\nto manage competing demands and deadlines. Candidates must handle conflicting\nrequests, anticipate the needs of the Member, and exercise sound and efficient judgment\nwhen scheduling meetings, events, and travel. Candidate must have strong\ncommunication skills. Capitol Hill or other relevant administrative, operations, or\nscheduling experience is strongly preferred. Kansas ties are a plus.",
    "responsibilities": [
      "Maintaining and managing the Member’s daily and long-term DC and district schedule, including coordinating with District staff.",
      "Responding to all incoming meeting and scheduling requests.",
      "Coordinating closely with appropriate legislative or communications staff to ensure efficient delivery of the Member’s briefing materials.",
      "Coordinating travel and booking flight, train, and lodging reservations for the Member and staff as needed",
      "Communicating key information and scheduling changes to the Member, staff, and effected stakeholders in a timely and efficient manner",
      "Coordinating with Caucus, Leadership, and Committee staff to efficiently coordinate the Member's schedule while the House is in session",
      "Provide operational support to the office, including time-off requests, office supply needs, tech management, and other duties, to ensure staff is supported.",
      "Work closely with Chief of Staff and Financial Admin to ensure compliance with annual budget.",
      "The position requires flexible, non-traditional working hours and availability by phone as needed."
    ],
    "qualifications": [
      "Bachelor’s Degree preferred.",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred.",
      "Kansas ties are a plus."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and three references to ks03.jobs@mail.house.gov with the subject line “Full Name – DC Office Scheduler\".\nApplications will be processed on a rolling basis.",
    "salary_info": null,
    "contact": "ks03.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color, and other members of underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-134-25",
    "position_title": "Staff Assistant",
    "office": "House Committee on Energy and Commerce Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2025-04-28",
    "description": "The House Committee on Energy and Commerce Democratic Staff (minority) seeks an enthusiastic, motivated, and highly organized Staff Assistant for fast-paced committee office.",
    "responsibilities": [
      "Tasks associated with a front office such as receptionist duties",
      "Answering phones",
      "Greeting visitors",
      "Ensuring that office and meeting rooms are kept in order",
      "Supporting staff in preparations for committee events such as hearings, markups, meetings, and events",
      "Training and supervising interns",
      "Handling and sorting incoming mail",
      "Maintaining both digital and paper records and files",
      "Maintaining office supplies and mastering basic equipment operations",
      "Assisting other staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Exceptional time management skills",
      "Ability to work collaboratively",
      "Hill experience preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, references, and a short writing sample to ecdjobs@mail.house.gov with the subject line “Staff Assistant Application 2025.” No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Our office deeply values the diversity of our employees and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-133-25",
    "position_title": "DC Staff Assistant",
    "office": "Congresswoman Rashida Tlaib, representing Michigan's 12th Congressional District",
    "location": "DC",
    "posting_date": "2025-04-28",
    "description": "The Staff Assistant will help to support all team members. Their primary role is to provide strong administrative support to team members for meetings, ensuring that constituent services are addressed by appropriate staff, and creating a welcoming environment for residents and advocates visiting our DC office.",
    "responsibilities": [
      "Create a welcoming and organized front office;",
      "Lead administrative support for calls, voicemails, and email messages;",
      "Develop a system for resident follow ups and requests as needed;",
      "Management of all front of office duties including but not limited to signing for deliveries, and forwarding mail or other materials to the appropriate staff;",
      "Work closely with the Scheduler to ensure that the Member's appointments are on time and that the team is aware of the visitors' arrival; assisting with staffing of meetings as required or needed;",
      "Follow up and complete constituent requests for flags, White House and U.S. Capitol tours and other requests for tours;",
      "Manage the organization and updating of the office cheat sheet that has all important contacts for staff and constituent services;",
      "Support constituent service team as needed in intake process;",
      "Lead the work on letter responses to constituent mail not related to legislation, including thank you letters;",
      "Manages follow-ups or call list for the member as needed or requested;",
      "Organizes general email box for the office;",
      "Support Operations Manager with office supply management and office inventory tracking;",
      "Tracks commendation and greeting requests received from stakeholders and constituents;",
      "Processes and tracks ledger for in-kind gifts;",
      "Manages inventory and supplies needed for the office, staff and for the member;",
      "Supports management of internship programs and assists with assignments of responsibilities and tasks as needed;",
      "Support with all other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please email Rashida.Jobs@mail.house.gov (SUBJECT LINE: Staff Assistant, YOUR NAME) with a cover letter, resume and 2-3 references (no office walk-ins).",
    "salary_info": "The starting salary for this position is $55,000 with some flexibility based on experience.",
    "contact": "Rashida.Jobs@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQIA+, and other members of other marginalized communities are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status. This position reports to the Operations Manager, Chief of Staff and Member."
  },
  {
    "id": "MEM-131-25",
    "position_title": "Scheduler/Director of Operations",
    "office": "The Office of Congressman Jimmy Panetta (CA-19)",
    "location": "Washington",
    "posting_date": "2025-04-28",
    "description": "The Office of Congressman Jimmy Panetta (CA-19) seeks candidates for an open Scheduler/Director of Operations position. Prior experience with scheduling for a Member of Congress or scheduling for a political campaign is preferred, but scheduling for a similar organization will be considered.\n\nIdeal candidates possess attention to detail, ability to handle a fast-paced environment, and strong communication and organizational skills. Responsibilities include maintaining Member's daily and long-term schedule in Washington, working with stakeholders to balance the Member's time, evaluating incoming meeting requests and invitations, coordinating domestic and international travel arrangements, and performing other administrative and operational duties.",
    "responsibilities": [
      "Maintaining Member's daily and long-term schedule in Washington",
      "Working with stakeholders to balance the Member's time",
      "Evaluating incoming meeting requests and invitations",
      "Coordinating domestic and international travel arrangements",
      "Performing other administrative and operational duties"
    ],
    "qualifications": [
      "Attention to detail",
      "Ability to handle a fast-paced environment",
      "Strong communication and organizational skills",
      "Prior experience with scheduling for a Member of Congress or scheduling for a political campaign is preferred, but scheduling for a similar organization will be considered."
    ],
    "how_to_apply": "Please send a resume, cover letter, and references in a single PDF document with “Scheduler/Director of Operations” as the subject line to ca19.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ca19.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer."
  },
  {
    "id": "MEM-130-25",
    "position_title": "Inspector General",
    "office": "Office of the Inspector General",
    "location": null,
    "posting_date": "2025-04-28",
    "description": "The Inspector General is accountable for the evaluation of internal controls and organizational structures, as well as determining the extent and quality of conformance with policies and procedures within the House. In collaboration with the Deputy Inspector General, provides executive management to the Office of Inspector General and its major areas of responsibility including the performance of Information Systems Audits, Management Advisory Services, Performance Audits, Financial Audits, Investigations, and internal OIG administration.",
    "responsibilities": [
      "Directs the mission and functions of the Office of Inspector General, including the supervision of approximately twenty-five (25) employees in executing the duties of the Office, which include, but are not limited to:",
      "Providing audit, investigative, and advisory services to the House and other legislative branch entities in a manner consistent with government-wide standards including periodic audits of the financial and administrative functions of the House and other legislative branch entities.",
      "Informing House Leadership and appropriate House Committees based as outline in House Rules concerning the results of audits, investigations, and advisory services.",
      "Coordinating, compiling, and presenting an annual work plan for the Office of the Inspector General to the Committee on House Administration for approval."
    ],
    "qualifications": [],
    "how_to_apply": "1) ALL applicants must submit a resume and cover letter on or before the closing date that presents their knowledge, experience, and education and meet the position's requirements.\n2) Submit your resume and cover letter via email to House.Apply@mail.house.gov ONLY.\nReference our vacancy announcement ID, \" IG-25-04 IS-HGOV”, in the Subject Line of your email.",
    "salary_info": "$212,000 - $217,000",
    "contact": "House.Apply@mail.house.gov",
    "equal_opportunity": "The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant. Moving and related relocation expenses are not available. Employment with the U.S. House of Representatives is at-will. All qualified candidates are encouraged to apply"
  },
  {
    "id": "MEM-129-25",
    "position_title": "LEGISLATIVE DIRECTOR",
    "office": "The Washington, D.C. Office of Rep. Lauren Underwood (D-IL), Ranking Member of the Homeland Security Appropriations Subcommittee and Co-Chair of the Black Maternal Health Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2025-04-28",
    "description": "The Legislative Director works with the Member and other senior staff to lead development and implementation of her policy, legislative, and appropriations strategy, managing a legislative team of 6-8 staff, fellows, and interns while also covering a small individual portfolio of legislative issues.",
    "responsibilities": [
      "developing and advancing the Member's policy priorities through the legislative and appropriations processes;",
      "overseeing operations of the legislative team;",
      "developing high-quality memos, remarks, committee materials, and other briefing materials for the Member/office;",
      "supporting the press team on policy-related communications;",
      "working with the district team to support their work and address constituents' policy concerns;",
      "monitoring activity on the House Floor and the Member's committee(s) and working with the legislative team to develop vote recommendations;",
      "building and maintaining positive and effective relationships with district, D.C., and national stakeholders and advocacy organizations;",
      "proactively tracking relevant state and local policy changes and working with local officials;",
      "overseeing the office's constituent correspondence program; and",
      "other duties and special projects as assigned."
    ],
    "qualifications": [
      "Candidates should have deep expertise in policy, legislative drafting and procedure, and congressional appropriations, as well as at least one year of professional experience managing direct reports.",
      "Essential skills include an expert-level working knowledge of Congress; strong oral and written communication skills, including rigorous editing and fact-checking; excellent attention to detail; the ability to execute on multiple deadlines and tasks in a fast-paced environment; strong interpersonal and relationship-building skills; the ability to make quick decisions when advising a principal; a proven track record navigating complex constituent and political situations; and the responsiveness and professional demeanor to represent the office well to a wide range of communities.",
      "Candidates with a background in health policy are encouraged to apply.",
      "Please note that candidates must be available for occasional weekend and evening work to support the Member when the congressional schedule requires."
    ],
    "how_to_apply": "To apply, please email Underwood.DCJobs@mail.house.gov with “Legislative Director” in the subject line and the following application materials attached as one combined PDF:\n(1) Resume\n(2) Cover letter\n(3) 2-3 professional references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference. We will not reach out to these references without your permission.",
    "salary_info": "The annual salary range for this position is $100,000 - $110,000, dependent on experience and qualifications. The position offers health coverage; comp time; telework opportunities during congressional recesses; retirement benefits with an employer match; paid sick, bereavement, and vacation leave; transit or parking benefits; 16 weeks of paid parental leave; 12 weeks of paid FMLA leave; access to life insurance coverage; professional development opportunities; and access to the Student Loan Repayment Program.",
    "contact": "Underwood.DCJobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-121-25",
    "position_title": "Communications Director",
    "office": "Problem Solvers Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2025-04-28",
    "description": "The bipartisan Problem Solvers Caucus is seeking an experienced Communications Director to join its office in Washington, D.C. The Communications Director will be responsible for developing and executing the Problem Solvers Caucus' communications strategy.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Writing press releases",
      "Pitching stories and responding to reporter inquiries",
      "Creating and posting social media content",
      "Booking interviews with national and local press outlets",
      "Writing internal and external newsletters",
      "Compiling press clips",
      "Managing the caucus' website",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Prior experience working on Capitol Hill",
      "Excellent written and oral communications skills",
      "Proficient in photo and video editing and graphic design",
      "Detail-oriented",
      "Organized",
      "Highly motivated to serve on a small, collaborative team",
      "Comfortable working for both Democratic and Republican Members"
    ],
    "how_to_apply": "To apply, please email a resume, cover letter, and two writing samples in a single PDF to problemsolverscaucus@gmail.com with the subject line “Communications Director.”",
    "salary_info": null,
    "contact": "problemsolverscaucus@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-127-25",
    "position_title": "Press Secretary/ Digital Director",
    "office": "Pennsylvania Republican",
    "location": "D.C.",
    "posting_date": "2025-04-28",
    "description": "Pennsylvania Republican is looking for a Press Secretary/Digital Director to join a fastpaced, media-heavy communications team in the D.C. office.\n\nThis position reports directly to the Communications Director and is ideal for a highly motivated individual who excels in a high-energy, deadline-driven environment. The right candidate will have strong writing and editing skills, experience in digital content creation, website editing, and the ability to quickly adapt to the fast-moving political landscape.",
    "responsibilities": [
      "Assist the Communications Director in drafting and editing press releases, statements, floor speeches, and op-eds",
      "Draft the Member's weekly newsletters",
      "Manage the Member's social media pages--draft posts, create graphics, and keep engagement growing",
      "Clip media interviews and monitor mentions",
      "Update and maintain content on the Member's official website",
      "Assist Communications Director with media prep for interviews and other public appearances",
      "Keep the Member informed of breaking news and media coverage",
      "Assist in executing the Franking plan"
    ],
    "qualifications": [
      "Prior experience on Capitol Hill is preferred but not required."
    ],
    "how_to_apply": "To apply, please send a resume to PaPressSecJob@gmail.com.",
    "salary_info": null,
    "contact": "PaPressSecJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-126-25",
    "position_title": "Legislative Director",
    "office": "The Office of Congressman Alma S. Adams, Ph.D.",
    "location": "DC",
    "posting_date": "2025-04-28",
    "description": "The LD will drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio, and manage their own legislative portfolio with the Agriculture Committee.\n\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects. This is not an entry level position; extensive Hill experience and knowledge of the legislative process are required. The successful applicant will have crisp and thorough written and oral communications skills, an entrepreneurial and self-starting attitude, strong attention to detail, creativity, and be a team player. Supervisory experience and expertise on agricultural policy is strongly preferred.",
    "responsibilities": [
      "Drive the proactive legislative agenda for the office.",
      "Develop and implement the strategy to push policy priorities and legislative goals.",
      "Supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio.",
      "Manage their own legislative portfolio with the Agriculture Committee.",
      "Work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations.",
      "Help ensure coordination between DC and district offices on important legislative updates and district-based events and projects."
    ],
    "qualifications": [
      "Extensive Hill experience and knowledge of the legislative process are required.",
      "Crisp and thorough written and oral communications skills.",
      "An entrepreneurial and self-starting attitude.",
      "Strong attention to detail.",
      "Creativity.",
      "Team player.",
      "Supervisory experience and expertise on agricultural policy is strongly preferred."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to nc12.resume@mail.house.gov. Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with North Carolina ties. Due to the volume of applications, we receive, we will only contact you if we decide to move forward with your application. Please no calls, direct emails, or walk-ins.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-125-25",
    "position_title": "Press Assistant/Deputy Press Secretary",
    "office": "Congresswoman Andrea Salinas (D-OR)",
    "location": "district office",
    "posting_date": "2025-04-28",
    "description": "Congresswoman Andrea Salinas (D-OR) is seeking a Press Assistant/Deputy Press Secretary in her district office to join an aggressive, fast-paced communications team. The ideal candidate will have excellent writing, editing, and photography skills. Additionally, they will assist the Communications Director in drafting releases, talking points, speeches, and quotes for in-district press events, maintaining press lists, distributing daily press clips, and staffing the Member at district-based press events. Strong proofreading and copyediting skills are a must. This role primarily assists the Communications Director with drafting outgoing communications. Candidates seeking to join a highly active press team across national, local, and digital media with opportunities for growth are encouraged to apply.\nThis is a full-time position based in district that often requires availability on nights and weekends to support the Member’s communications plan and District Office operations. The position requires attention to detail and strong written and oral communication skills along with the ability to work collaboratively in a fast-paced, team environment. Spanish fluency is a plus but not required.",
    "responsibilities": [
      "Assist the Communications Director with drafting press releases, quotes, statements, speeches and talking points.",
      "Compile and distribute daily press clips.",
      "Help identify and cultivate relationships with local reporters and content creators in the district.",
      "Staff and manage reporter interactions with the Member at OR-based press events;",
      "Work with the District Office and Digital Manager to publicize constituent services and events.",
      "Manage live-streaming and photography at OR-based press conferences and events.",
      "Support the District Office with events.",
      "Work well under pressure and with quick turnarounds"
    ],
    "qualifications": [],
    "how_to_apply": "Please email a resume, cover letter, and two writing samples in a single PDF to OR06resumes@mail.house.gov with “First Name Last Name—Press Assistant/Deputy PressSecretary” in the Subject Line. Applicants may also provide one example of their digital designwork and/or photography (this is optional but not required). Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": "The salary range for this position is $55,000-$60,000, depending on experience, with full benefits including up to $833/month in student loan repayments; health, dental, andvision insurance; and both defined-benefit and defined-contribution retirement plans.",
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-123-25",
    "position_title": "CASEWORKER AND FIELD REPRESENTATIVE",
    "office": "Congressman Dan Goldman",
    "location": "Brooklyn District Office (Sunset Park, Brooklyn NY)",
    "posting_date": "2025-04-28",
    "description": "The Caseworker / Field Representative manages incoming casework requests with care, promptness and high-touch constituent service; and monitors and updates the Deputy Chief of Staff on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents in a timely and professional manner.",
    "responsibilities": [
      "Acts as the representative for the Congressman within the area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Manages casework assigned to them.",
      "Assesses casework for problems requiring legislative action and makes recommendations to the Deputy Chief and Director of Constituent Services",
      "Screens and refers cases, when appropriate, to city and state offices.",
      "Logs all incoming and outgoing mail and incoming telephone calls relating to casework.",
      "Prepares periodic reports for the Director of Constituent Services on pending cases and for the Deputy Chief on district activities in their assigned issue areas.",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner.",
      "Maintains up-to-date files on all cases and categories of information of importance to the office.",
      "Serves as a liaison to community boards, precinct councils, and other community groups.",
      "Meets attendance requirements as established by the office.",
      "Maintains a good working relationship with the Congressman, staff, and constituents.",
      "Works well under pressure and handles stress.",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "A minimum 1 year in a government office in a similar role.",
      "Bilingual (Spanish language) skills strongly preferred.",
      "Thoroughness and careful attention to detail.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Strong oral and written communication skills.",
      "Knowledge of all issues and events in the district in which the Congressman is involved; Professional telephone manner.",
      "Ability to perform the essential job functions above.",
      "Ability to work cooperatively and courteously with others.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Work with compassion, empathy and patience for constituents.",
      "Knowledge of office policies, practices, and procedures.",
      "Knowledge of office computer applications; and",
      "Proficiency in word processing."
    ],
    "how_to_apply": "Submit your resume and cover letter to jobs.goldman@mail.house.gov. Subject line should note: Your Name - Caseworker / Field Rep",
    "salary_info": "$60,000 per year",
    "contact": "jobs.goldman@mail.house.gov",
    "equal_opportunity": "The office of Congressman Dan Goldman is committed to diversity among its staff and recognizes that the success of its operations requires the highest commitment to obtaining and retaining a diverse staff. We are an equal opportunity employer and prohibit discrimination in employment, promotion, compensation, terms, conditions, or privileges of employment on the basis of gender, physical and or mental disability, race, age, national origin, color, sexual orientation, gender identity or expression, family status, religion, veteran's status, or any other basis prohibited by applicable law."
  },
  {
    "id": "MEM-122-25",
    "position_title": "Creative Director",
    "office": "Representative Maxwell Frost (D-FL)",
    "location": null,
    "posting_date": "2025-04-28",
    "description": "The office of Representative Maxwell Frost (D-FL) is seeking a dynamic and creative individual to join our communications team as a Creative Director. This is a fast-paced, progressive environment with a forward-thinking principal who is not afraid to try new things. This office prides itself on fostering a collaborative work environment where creativity, teamwork, and an outside-the-box approach are highly valued. A passion for digital strategy, visual storytelling, and innovative political communication is a must. This is not an entry-level position.\n\nThe Creative Director will work closely with and report to the Communications Director to help shape and execute the visual and digital strategy for the Representative’s publicfacing and internal initiatives, and offer strategic digital insight and assistance related to the Member’s leadership role as part of the Democratic Policy and Communications Committee. This role will manage the day-to-day operations of the office’s design work and digital content, including but not limited to graphic design, social media assets, digital video, website visuals, and email campaigns.",
    "responsibilities": [
      "Digital Strategy & Creative Leadership -- Lead the development and execution of innovative digital strategies to elevate the Representative’s presence on social media, websites, email campaigns, and other digital platforms. Ensure that all creative work is aligned with the office’s values and goals.",
      "Graphic Design & Visual Communication -- Design high-quality graphics for digital and print materials, including social media assets, infographics, posters, digital ads, and more, all in line with the Member’s existing branding and style guide. Expertise in the Adobe Creative Suite is required.",
      "Content Creation & Coordination -- Collaborate with the Communications Director, Legislative and District teams, and Member to create compelling multimedia content. This includes coordinating the production of graphics, videos, and other creative content for various platforms – from ideation to creation.",
      "Media Buys & Metrics & Evaluation -- Make strategic suggestions for paid communications campaigns on various digital platforms and assist in tracking the effectiveness of creative strategies, using data and feedback to iterate and improve future content. Monitor the performance of digital content across platforms, adjusting strategies as needed.",
      "Artist & Influencer Relations -- Collaborate with the Communications Director help maintain and establish relationships with artists and digital thought leaders and content creators through strategic partnership opportunities aimed at advancing the Member’s policy and legislative initiatives. Our office is uniquely plugged into local and national music and creative arts issues so a passion for this is a plus."
    ],
    "qualifications": [
      "At least 2-3 years of experience in creative or digital strategy, with a focus on graphic design and content creation.",
      "Prior experience working in political campaigns, progressive causes, or government oDices is preferred.",
      "Advanced proﬁciency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, After EDects, Premiere Pro) and other design tools.",
      "Strong understanding of digital platforms and the role of design in social media, online engagement, and web communication.",
      "Experience with digital video production and editing.",
      "Ability to juggle multiple projects and work under tight deadlines in a fast-paced, team-oriented environment.",
      "Strong attention to detail and a keen eye for visual storytelling and design.",
      "Florida and Orlando ties are a plus."
    ],
    "how_to_apply": "Visit repfrost.us/CreativeDirector",
    "salary_info": "Salary range is $70,000 -$90,000, commensurate with experience.\nHealth, dental, and vision beneﬁts.\nGenerous paid leave, including vacation, sick days, and parental leave.\nGenerous student loan repayment program.\nRetirement plan options.\nOpportunities for professional development and training.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-119-25",
    "position_title": "Press/Digital Assistant",
    "office": "Congresswoman Luz Rivas (CA-29)",
    "location": "Los Angeles",
    "posting_date": "2025-04-28",
    "description": "Congresswoman Luz Rivas (CA-29) is seeking a motivated, creative, and collaborative Press/Digital Assistant based in Los Angeles in a full-time capacity.\n\nThis position is responsible for working with the Communications Director and District Director to identify press and digital opportunities in the District; develop branded content for social media, including graphics, videos, and photos of the Member. Additionally, this position will staff and advance press and community events in the District with the Member; compile and distribute daily press clips; track media coverage; develop promotional materials of the Member's events; and build relationships with local reporters and outlets. Additionally, this position will assist the Communications Director in drafting quotes and press releases; developing newsletters; and drafting constituent outreach materials such as resource packets, and other duties as assigned.",
    "responsibilities": [
      "Identify press and digital opportunities in the District",
      "Develop branded content for social media, including graphics, videos, and photos of the Member",
      "Staff and advance press and community events in the District with the Member",
      "Compile and distribute daily press clips",
      "Track media coverage",
      "Develop promotional materials of the Member's events",
      "Build relationships with local reporters and outlets",
      "Assist the Communications Director in drafting quotes and press releases",
      "Develop newsletters",
      "Draft constituent outreach materials such as resource packets",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Excellent writing and verbal skills",
      "Editing and digital experience, including experience in graphic design and video editing",
      "Sound editorial judgement",
      "A baseline understanding of the key stakeholders in the District",
      "Ability to work well and respectfully with others in a fast-paced environment",
      "Friendly and professional demeanor",
      "Ability to exercise political savvy and discretion",
      "Ties to California's 29th Congressional District are a plus",
      "Prior experience working with media and press and creating digital content",
      "Flexibility to work long hours, including nights and weekends"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a cover letter, resume, one writing sample and one creative sample in a single PDF document to CA29jobs@gmail.com with the following subject line: “District Press/DigitalAssistant [candidate’s full name]”.",
    "salary_info": null,
    "contact": "CA29jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-117-25",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2025-04-28",
    "description": "Duties include assisting the technology needs of Committee staff; editing and maintaining the Committee's website; answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee's website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance are strongly encouraged to apply"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov",
    "salary_info": "$52,003 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-115-25",
    "position_title": "EXPERIENCED OFFICE ADMINISTRATOR",
    "office": "U.S. HOUSE OF REPRESENTATIVES COMMITTEE ON ETHICS",
    "location": "Washington, DC",
    "posting_date": "2025-04-28",
    "description": "The Committee on Ethics seeks an experienced Office Administrator to serve as the Director of Administration for the Committee. The Director of Administration will oversee the Committee's administrative, financial, and human resource functions. The Director will manage the nonpartisan administrative staff who are responsible for ensuring a high level of customer service to the House community as well as the efficient operation of the Committee's work.\n\nThis is a non-partisan position which requires the ability to maintain strict confidentiality, to serve all Members of Congress equally, and to refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess a minimum of 5 years of experience with government administrative, financial, or human resource processes",
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment",
      "Experience in one or more of the following areas is also desirable: CAO finance and human resource processes, office administration, and familiarity with Congress",
      "Previous management experience and proficiency with PeopleSoft and Finmart preferred"
    ],
    "how_to_apply": "Please email resume, cover letter, and a list of references to ethicsjobs@mail.house.gov. Please include the phrase “Director of Administration” in the subject line.",
    "salary_info": "$132,638 to $140,667",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-113-25",
    "position_title": "Export Controls Professional",
    "office": "U.S. House Committee on Foreign Affairs Majority",
    "location": null,
    "posting_date": "2025-04-28",
    "description": "The U.S. House Committee on Foreign Affairs Majority seeks experienced Export\nControls Professional with a background in legislative authorization processes. Primary\nduties of the role will include day to day oversight of the Commerce Department’s Bureau\nof Industry and Security and International Trade Administration. In addition, employee will\nsupport overseeing and authorizing the State Department’s Bureau of South and Central\nAsia and Public Diplomacy and Public Affairs (R) family. Candidates should have previous\nforeign policy experience in the Legislative and/ or Executive branches.",
    "responsibilities": [
      "Day to day oversight of the Commerce Department’s Bureau of Industry and Security and International Trade Administration.",
      "Support overseeing and authorizing the State Department’s Bureau of South and Central Asia and Public Diplomacy and Public Affairs (R) family."
    ],
    "qualifications": [
      "Previous foreign policy experience in the Legislative and/ or Executive branches."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and brief writing sample to\nHFACGOP.Resumes@mail.house.gov, with the following subjective line: “HFAC SCA\nVacancy”",
    "salary_info": null,
    "contact": "HFACGOP.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-523-24",
    "position_title": "Digital Assistant",
    "office": "House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "location": "Washington D.C.",
    "posting_date": "2025-04-28",
    "description": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02) seek a creative and detail-oriented Digital Assistant to support digital communications and public engagement efforts. This position will be split between the committee office and personal office and will be based out of Washington D.C.\n\nThis position involves creating and scheduling content for social media platforms, maintaining the committee’s website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\n\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor’s degree in communications, political science, or a related field is preferred.",
    "responsibilities": [
      "Creating and scheduling content for social media platforms",
      "Maintaining the committee’s website",
      "Producing multimedia materials (graphics, videos, and infographics)",
      "Monitoring digital analytics to optimize outreach"
    ],
    "qualifications": [
      "1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred)",
      "Proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva)",
      "Strong writing and editing skills",
      "Passion for progressive policymaking",
      "Highly organized and comfortable working under tight deadlines",
      "Familiar with social media analytics and website content management systems",
      "A bachelor’s degree in communications, political science, or a related field is preferred"
    ],
    "how_to_apply": "To apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: \"[Name] – Digital Assistant Application.\" Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary is commensurate with experience, and the position includes a competitive benefits package.",
    "contact": "budget-democrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply."
  }
]