[
  {
    "id": "MEM-300-25",
    "position_title": "Staff Assistant",
    "office": "Office of Congressman Mike Flood",
    "location": "Washington, DC",
    "posting_date": "2025-09-15",
    "description": "The primary responsibility of the Staff Assistant is to serve as support staff for the operations team to maintain the regular daily functions and operations of the Washington, DC office. This could include answering telephones, greeting visitors to the office, assisting with appointments and scheduling, answering constituent requests for general information, giving tours of the capitol, monitoring deliveries, maintaining the front office, and assisting with other various administrative duties. Typical responsibilities may include, but are not limited to:",
    "responsibilities": [
      "Answering and screening telephone calls for the Member and other staff members.",
      "Greeting and screening visitors.",
      "Assisting individuals who have appointments with the Member or other staff members.",
      "Maintaining handout literature regarding the state and Congress.",
      "Signing for deliveries and forwarding deliveries to appropriate staff members.",
      "Maintaining the office answering machine and tracking voicemails.",
      "Ensuring that requests for assistance are directed to appropriate staff members.",
      "Maintaining the reception room.",
      "Maintaining the office guest book.",
      "Maintaining quick reference sheets of prominent VIPs and a list of frequently requested contacts.",
      "Recording visitors' opinions, names, addresses, and other relevant information.",
      "Helping to log mail.",
      "Performing general typing and administrative assignments."
    ],
    "qualifications": [
      "Position is based in the Washington, DC official office. Regular, predictable and punctual attendance required for the performance of duties.",
      "Work requires physical presence at the office during business hours and when working outside business hours, as needed.",
      "Ability to communicate effectively with the Member and office staff, Members and representatives from other offices, constituents, outside organizations, and others.",
      "Work is public-facing and requires frequent interaction with members of the Senate and congressional community and the public, including constituents, in a prompt, courteous and tactful manner.",
      "Work is performed in a front office work station or other commonly traveled areas of the office, meaning that there should be little expectation of privacy.",
      "Work occasionally requires extended and unscheduled hours.",
      "Must be able to prioritize and perform duties under pressure in a fast-paced environment.",
      "Regularly use typical office equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc.",
      "Nebraska ties are preferred but not required for application."
    ],
    "how_to_apply": "Interested applicants may submit their resume and cover letter to FloodHiring@mail.house.gov",
    "salary_info": null,
    "contact": "FloodHiring@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-299-25",
    "position_title": "Front Office Assistant",
    "office": "House Office of the Legislative Counsel",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "The House Office of the Legislative Counsel provides legislative drafting services to the committees and Members of the United States House of Representatives on a nonpartisan, impartial, and confidential basis. Our goal is to work with committees and Members to understand their policy preferences in order to implement those preferences through clear, concise, and legally effective legislative language.\n\nPosition Description:\nThe Front Office Assistant plays a pivotal role in providing essential administrative and clerical support services to the staff within the House Office of the Legislative Counsel (HOLC). The Front Office Assistant will work a flexible hybrid work schedule- required to be on-site 3 days a week and remote the remainder of the week.\n\nSeen as the initial point of contact for the HOLC office, the Front Office Assistant provides assistance to clients (Members of Congress and their staff) and welcomes office visitors in a courteous, polite, and professional manner. The Front Office Assistant will handle requests and information adhering to HOLC's strict attorney/client confidentiality protocols and disseminate information to the appropriate individual(s).\n\nWhen working on special projects, the Front Office Assistant may be tasked with providing general assistance and recommendations on specific work activities.\n\nThis position reports to the HOLC office leadership and does not have any supervisory responsibilities.",
    "responsibilities": [
      "Develops and maintains general working knowledge and understanding of the House Office of the Legislative Counsel practices and the legislative process at-large.",
      "Greets office visitors, answers incoming calls, address general/routine inquiries, forwards messages as appropriate, and ensures that adequate phone coverage is maintained during official business hours.",
      "Carefully assess and distribute client requests to attorneys and paralegals either by phone or email.",
      "Maintains HOLC general inbox and ensures prompt and accurate HOLC correspondence with internal and external individual(s).",
      "Maintain daily, weekly and monthly staff calendar. Keep accurate and up to date leave records of staff and leadership.",
      "Coordinate miscellaneous general office services, including ordering office furnishings, materials, and supplies. Maintain office legal library."
    ],
    "qualifications": [
      "2 years of relevant work experience. Or an equivalent combination of education and work experience.",
      "Must be United States citizen.",
      "Professional background cannot contain partisan political work.",
      "Ability to maintain decorum in high stress situations. Exhibit a high standard of customer service.",
      "Ability to provide administrative support, including assessing and disseminating requests, scheduling meetings, and managing records.",
      "Ability to work on multiple tasks/assignments simultaneously with a strong attention to detail.",
      "Knowledge of, and ability to, use various automated office systems and software programs, including record management systems, Microsoft Office, and Adobe Acrobat.",
      "Ability to analyze problems and recommend appropriate solutions/changes.",
      "Ability to establish effective working relationships with HOLC staff, office leadership, and clients.",
      "Ability to work autonomously and within a team.",
      "Ability to handle sensitive and confidential matters with tact and maintain impartiality in judgment and in action."
    ],
    "how_to_apply": "Qualified candidates please submit your cover letter and resume by September 19, 2025 via this link.",
    "salary_info": "$60,000.00",
    "contact": null,
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age.\n\nEmployment is contingent upon satisfactorily completing a criminal history records check (or other applicable security clearance).\n\nSubchapter I of chapter 131 of title 5, United States Code, requires certain House employees to file Financial Disclosure Statements. For information, please visit http://clerk.house.gov/public_disc/index.aspx"
  },
  {
    "id": "MEM-298-25",
    "position_title": "Military Legislative Assistant (MLA)",
    "office": "Congresswoman Jen Kiggans (VA-02)",
    "location": "Washington, DC",
    "posting_date": "2025-09-15",
    "description": "Congresswoman Jen Kiggans (VA-02) seeks a Military Legislative Assistant (MLA) for her Washington, DC office. The MLA will be responsible for the Congresswoman's work on the House Armed Services Committee, as well as a small portfolio of other policy issues. As the office's primary expert on defense related matters, the MLA will work closely with the Legislative Director and Chief of Staff to develop and execute a coordinated legislative strategy to advance the Congresswoman's goals.",
    "responsibilities": [
      "Preparing and staffing the Congresswoman for committee hearings",
      "Drafting and advancing legislation",
      "Reviewing and analyzing legislation to make cosponsor and vote recommendations",
      "Writing memos and staffing the Congresswoman for defense-related meetings",
      "Maintaining strong relationships with stakeholders and constituent groups in our defense-heavy district",
      "Occasional trips to the district will be required"
    ],
    "qualifications": [
      "Two years of legislative experience at minimum, including experience with the defense portfolio",
      "Ability to foster a tight-knit community environment and encourage cross-talent collaboration between our legislative and district teams",
      "Detail-oriented",
      "Team player with the ability to effectively manage multiple projects in a fast-paced political environment",
      "Virginia ties and prior military service are preferred but not required"
    ],
    "how_to_apply": "Interested applicants should email their resume to kiggans.info@mail.house.gov. Applicants may be asked to provide writing samples and references.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": {
      "email": "kiggans.info@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-297-25",
    "position_title": "Communications Director",
    "office": "Senior Republican Member, House Financial Services Committee",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "A senior Republican Member serving on the House Financial Services Committee seeks a Communications Director to lead a proactive, fast-paced, media-centric operation in the Washington, D.C. office. This is not an entry-level role. The Communications Director will work closely with the Member, Chief of Staff, Legislative Team, and District leadership to drive a disciplined message across national, D.C., and district media.",
    "responsibilities": [
      "Build and execute a comprehensive communications strategy aligned to the Member's financial services, small business, and district portfolio (natural gas, coal, manufacturing, banking, capital markets, housing, fintech/crypto, insurance, monetary policy, access to capital) and broader conference priorities.",
      "Serve as primary press contact and on-record spokesperson; cultivate relationships with national, regional, and trade outlets (e.g., TV, print, radio, digital, podcasts).",
      "Aggressively pitch and book media; prepare and staff the Member for interviews and other media facing events.",
      "Draft and edit press releases, speeches, op-eds, talking points, e-newsletters, and messaging.",
      "Own official digital channels: content planning, copy, graphics/video guidance, posting, engagement, and analytics.",
      "Manage an active social media with a presence on X, Facebook, Instagram, and Truth.",
      "Coordinate closely with the legislative/oversight teams to translate hearings, markups, investigations, and floor activity into clear, timely communications.",
      "Oversee message discipline and rapid response; develop crisis-communications plans and approvals workflows.",
      "Maintain an editorial calendar; manage vendor relationships (design, video, monitoring tools) and track performance metrics."
    ],
    "qualifications": [
      "Pre-existing relationships with National bookers and producers is required.",
      "Prior Hill communications experience required; experience as a Press Secretary or Communications Director strongly preferred.",
      "Demonstrated on-record experience and sound news judgment under tight deadlines.",
      "Exceptional writing and editing skills; ability to translate complex financial policy into clear, accessible messaging.",
      "Fluency with digital platforms, media monitoring, and analytics tools.",
      "Familiarity with financial services policy is a strong plus but not required."
    ],
    "how_to_apply": "Please email a resume and a relevant writing sample to Matthew.Perricone@mail.house.gov, Courtney.Trigg@mail.house.gov, and Jackson.Notes@mail.house.gov.",
    "salary_info": null,
    "contact": {
      "email": [
        "Matthew.Perricone@mail.house.gov",
        "Courtney.Trigg@mail.house.gov",
        "Jackson.Notes@mail.house.gov"
      ],
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-296-25",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans' Affairs, Majority Staff",
    "office": "House Committee on Veterans' Affairs, Majority Staff",
    "location": "Washington, DC",
    "posting_date": "2025-09-15",
    "description": "REPORTS TO: Majority Staff Director, Subcommittee on Disability Assistance and Memorial Affairs\n\nCORE RESPONSIBILITIES:\n* Provide administrative and research support to Subcommittee staff and assists with duties as assigned.\n\nBENEFITS: Employees may be eligible for the following benefits:\n* Sick and Annual Leave\n* Student Loan Repayment Program\n* Federal Employees Health Benefits Program\n* Thrift Savings Plan\n* Federal Employees' Group Life Insurance Program\n* Federal Long-Term Care (LTC) Insurance\n* Flexible Spending Accounts (FSAFEDS)\n* Dental & Vision Insurance Program (FEDVIP)\n* Metro or Parking Benefits\n* Many other supportive services and benefits offered by the U.S. House of Representatives.\n\nOther Information: Employment with the U.S. House of Representatives is at-will. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant.\n\nThis is a full-time, on-site position in Washington, DC.",
    "responsibilities": [
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee's jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notifications.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in staff-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee's oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and staff.",
      "Assist with developing policy recommendations and serve as a resource for Members both on and off Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Staff Director or Deputy Staff Director, and Subcommittee Staff Director, and assisting other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Strong Microsoft Office proficiency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage fluctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "how_to_apply": "Qualified candidates please send their cover letter, resume, and two (2) references to the following e-mail address: VAR.Resumes@mail.house.gov with \"DAMA Republican Research Assistant\" in the subject line. In your cover letter, please include one policy within the jurisdiction of the Subcommittee on Disability Assistance and Memorial Affairs that you believe needs review and your policy recommendation. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": {
      "email": "VAR.Resumes@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age."
  },
  {
    "id": "MEM-294-25",
    "position_title": "Executive Assistant and Scheduler",
    "office": "Congresswoman Maggie Goodlander (NH-02)",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "Congresswoman Maggie Goodlander (NH-02) seeks a qualified individual to serve as Executive Assistant and Scheduler. The position is based in the Washington, D.C. office.",
    "responsibilities": [
      "managing and maintaining the Congresswoman's daily and long-term calendar",
      "organizing and tracking invitations",
      "coordinating travel",
      "compiling briefing materials",
      "driving the Member on occasion",
      "duties related to office management",
      "serving as a liaison for the Member with constituents, congressional offices, and other stakeholders"
    ],
    "qualifications": [
      "Candidates must be highly organized, detail-oriented, energetic, and capable of thriving in a fast-paced and rapidly changing workplace.",
      "Previous scheduling experience and/or Hill experience is strongly preferred but not strictly required.",
      "New Hampshire ties are a plus."
    ],
    "how_to_apply": "Interested candidates should submit their applications materials by September 19 using this form: https://forms.gle/ApsnAzm5Qh7VTD5e8",
    "salary_info": "Salary is commensurate with experience.",
    "contact": null,
    "equal_opportunity": "Congresswoman Goodlander's office provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age,"
  },
  {
    "id": "MEM-293-25",
    "position_title": "Digital Director/Press Secretary",
    "office": "Congresswoman Shontel Brown (OH-11)",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "Congresswoman Shontel Brown (OH-11) seeks a Digital Director/Press Secretary in the Washington, D.C. office to lead and grow a dynamic digital and communications strategy.\n\nThe Digital Director/Press Secretary will be responsible for shaping how the Congresswoman's work and priorities reach constituents and national audiences. This includes developing and executing a strategic digital growth plan, managing and expanding all social media channels, producing innovative graphic and video content, executing strategic digital advertising campaigns, and using analytics to guide engagement. The role also includes maintaining a cohesive brand identity, updating the office's website, managing e-newsletters, drafting press releases and talking points, handling media inquiries, and producing communications materials for district events. The Digital Director/Press Secretary may supervise a Press Intern or Press Assistant and serves as the lead communications staffer for the DC office.\n\nThe ideal candidate will bring demonstrated success in digital strategy, with strong writing skills, creative visual storytelling, and the ability to turn complex policy issues into compelling and shareable content. Candidates should be comfortable setting digital priorities, driving audience growth, and identifying emerging trends to keep the Congresswoman's platforms innovative and effective. A collaborative approach, strong project management skills, and a commitment to authenticity are essential.",
    "responsibilities": [
      "Developing and executing a strategic digital growth plan",
      "Managing and expanding all social media channels",
      "Producing innovative graphic and video content",
      "Executing strategic digital advertising campaigns",
      "Using analytics to guide engagement",
      "Maintaining a cohesive brand identity",
      "Updating the office's website",
      "Managing e-newsletters",
      "Drafting press releases and talking points",
      "Handling media inquiries",
      "Producing communications materials for district events",
      "May supervise a Press Intern or Press Assistant",
      "Serves as the lead communications staffer for the DC office"
    ],
    "qualifications": [
      "Demonstrated success in digital strategy",
      "Strong writing skills",
      "Creative visual storytelling",
      "The ability to turn complex policy issues into compelling and shareable content",
      "Comfortable setting digital priorities, driving audience growth, and identifying emerging trends to keep the Congresswoman's platforms innovative and effective",
      "A collaborative approach",
      "Strong project management skills",
      "A commitment to authenticity",
      "Ohio ties are a plus",
      "Prior digital and/or press experience is required",
      "This is not an entry level position"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume, three digital media samples, and two (2) writing samples to Ohio11Resumes@mail.house.gov. No walk-ins or staff directed submissions please. The position will remain open until filled.",
    "salary_info": "The salary range for this position is $65,000 - $75,000 per year, commensurate with experience. In addition, the Office offers a competitive package of benefits.",
    "contact": "Ohio11Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-291-25",
    "position_title": "Communications Director",
    "office": "Congressman Jason Crow (CO-06)",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "Congressman Jason Crow (CO-06) is seeking an experienced and creative Communications Director for his Washington, D.C. office. This position will oversee a robust communications staff and lead strategy for a fast-paced, high-profile communications operation in Colorado and nationally.\n\nCandidates must be willing to travel domestically and internationally, work long hours (including nights and weekends), and be part of an office on the front lines of resisting harmful Trump administration policies. Candidates must be strategic thinkers with strong political acumen, excellent writers, self-starters, organized and detail-oriented professionals, and ready to manage a high-performing, fast-paced communications team. A sense of humor is essential.\n\nThe ideal candidate will have experience working on Capitol Hill, in political communications or campaigns, and a familiarity with Colorado politics. This position is a senior member of the Congressman's team and is not an entry level position. A minimum of 3 to 5 years of relevant Capitol Hill, administration, or campaign experience is necessary.",
    "responsibilities": [
      "Lead and mentor a three-person full-time communications team plus interns;",
      "Develop and execute an aggressive communications plan and strategy, including focusing on both day-to-day wins and accomplishing longer-term strategic objectives to grow the Congressman's influence and reach;",
      "Build and strength relationships with key reporters and media in Colorado, Washington, D.C. and New York City;",
      "Draft written materials, often on tight deadlines, including news releases, statements, on-the-record quotes, public remarks, op-eds, and talking points;",
      "Pitch national, state, and local press, including print, radio, and broadcast, as well as new media like podcasts and live streams;",
      "Create videos, graphics, and other digital content, often on tight deadlines, that is compelling, engaging, on-brand, and error-free;",
      "Prepare the Congressman for interviews, speeches, press conferences, public events, town halls, and other external-facing events;",
      "Work with the Legislative and District teams to strategize, design, and put together effective roll outs for legislation, letters, and district events;",
      "Manage a six-figure annual franked communications budget, including the creation of digital ads, graphics, newsletters, and telephone town halls."
    ],
    "qualifications": [
      "Willing to travel domestically and internationally, work long hours (including nights and weekends), and be part of an office on the front lines of resisting harmful Trump administration policies.",
      "Strategic thinkers with strong political acumen, excellent writers, self-starters, organized and detail-oriented professionals, and ready to manage a high-performing, fast-paced communications team.",
      "A sense of humor is essential.",
      "Experience working on Capitol Hill, in political communications or campaigns, and a familiarity with Colorado politics.",
      "A minimum of 3 to 5 years of relevant Capitol Hill, administration, or campaign experience is necessary."
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume, cover letter, and a writing sample (not to exceed three pages) as a single PDF to co06.resumes@mail.house.gov with the subject title \"[LAST NAME] - Communications Director.\" Applications will be considered on a rolling basis. No walk-ins or phone calls, please.",
    "salary_info": "The salary range for this position is $95,000 - $105,000 per year, commensurate with experience. In addition, the Congressman's office offers a competitive package of benefits, including health insurance, transit benefits/parking, 401(k) retirement match, student loan repayment/tuition assistance, paid family leave, and more.",
    "contact": {
      "email": "co06.resumes@mail.house.gov",
      "phone": null
    },
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-290-25",
    "position_title": "Communications Director",
    "office": "Congressman Derrick Van Orden (WI-03)",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "U.S. Navy SEAL veteran Congressman Derrick Van Orden (WI-03) is seeking a Communications Director to lead a proactive, fast-paced, media-centered communications operation for his Washington, D.C. office. The Communications Director is a one-man comms shop, but works closely with the Member, Chief of Staff, and District Director. This is not an entry-level position.",
    "responsibilities": [
      "Develop and execute a comprehensive media and communications strategy.",
      "Manage and implement an aggressive Franking program.",
      "Serve as the Member's primary press contact and spokesperson by responding to press inquiries and fostering relationships with local, D.C., and national press.",
      "Pitch and book media appearances at all outreach levels (TV, print, radio, digital).",
      "Write talking points, press releases, newsletters, and run the Member's official social media platforms.",
      "Collaborate with the legislative team and District Director for D.C.- and District-based messaging."
    ],
    "qualifications": [
      "Prior Hill communications experience is required; experience as a Press Secretary or Communications Director is strongly preferred.",
      "Ability to manage multiple priorities with tight deadlines in a fast-paced environment.",
      "A proactive and strategic mindset with a strong work ethic and team-oriented attitude.",
      "Excellent written and verbal communication skills.",
      "Familiarity with Wisconsin/the Midwest, veterans, agricultural, and military issues are a plus but not required."
    ],
    "how_to_apply": "Qualified applicants should send their resume and two writing samples to Ashley.Haines@mail.house.gov.",
    "salary_info": null,
    "contact": "Ashley.Haines@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-289-25",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Rep. Madeleine Dean (PA-04)",
    "location": "Washington, DC",
    "posting_date": "2025-09-15",
    "description": "Rep. Madeleine Dean (PA-04) seeks a Legislative Assistant with strong oral and written communication skills to join her DC office. The Legislative Assistant will assist with the Congresswoman's work on the Appropriations Committee and lead a diverse portfolio of issues including the Congresswoman's work as a member of the Subcommittee on Labor, Health and Human Services, Education and Related Agencies. Additional issues would likely include Agriculture, Energy & Water, Interior, and Environment. This person will also be responsible for overseeing other issue areas as assigned and will work in coordination with the Member's Legislative Director and Chief of Staff to advance the Congresswoman's legislative goals.",
    "responsibilities": [
      "Preparing and staffing the Congresswoman for committee hearings and markups including proposing strategic approaches, drafting remarks and questions, understanding issues sufficiently to respond to questions;",
      "Advancing current and new legislative initiatives including idea generation, building support, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets;",
      "Developing expertise in new issue areas as they arise;",
      "Representing the Congresswoman's priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal stakeholders including advocacy organizations; academics; fellow Congressional and Committee offices;",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "A strong policy background within the portfolio;",
      "A team player and a self-starter;",
      "Strong written and verbal communication skills;",
      "Previous Capitol Hill experience or policy experience",
      "Strong understanding of the legislative process and coalition building;",
      "Ability to maintain strategic relationships with constituent organizations;",
      "Comfortable managing multiple priorities in a fast-paced environment.",
      "Appropriations experience",
      "Health Policy experience",
      "3+ years of work experience",
      "A demonstrated interest in public service"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, cover letter, writing sample, and references to PA04applications@gmail.com with the subject line \"Legislative Assistant - [applicant's last name]\" The application deadline is 2025-09-12. The office will contact the best qualified candidates to begin our interview process on a rolling basis. Please, no phone calls or drop ins.",
    "salary_info": null,
    "contact": {
      "email": "PA04applications@gmail.com",
      "phone": null,
      "address": null,
      "instructions": "Please, no phone calls or drop ins."
    },
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-288-25",
    "position_title": "Veterans Liaison & Constituent Services Representative",
    "office": "Office of Congressman Pete Aguilar (CA-33)",
    "location": "San Bernardino, CA",
    "posting_date": "2025-09-15",
    "description": "The Office of Congressman Pete Aguilar (CA-33) is seeking a Veterans Liaison & Constituent Services Representative based in San Bernardino, CA.\n\nThis position is responsible for overseeing all veteran-related issues and initiatives on behalf of the Congressman, including managing VA and DOD casework and outreach; managing the Service Academy nomination process; overseeing the Congressman's Veterans Advisory Board; liaising with Veteran Service Organizations (VSOs); representing and staffing the Congressman at community meetings and events; serving as the Congressman's primary representative in assigned cities; serving as the Congressman's Law Enforcement Coordinator and overseeing district office security.",
    "responsibilities": [
      "Overseeing all veteran-related issues and initiatives on behalf of the Congressman, including managing VA and DOD casework and outreach",
      "Managing the Service Academy nomination process",
      "Overseeing the Congressman's Veterans Advisory Board",
      "Liaising with Veteran Service Organizations (VSOs)",
      "Representing and staffing the Congressman at community meetings and events",
      "Serving as the Congressman's primary representative in assigned cities",
      "Serving as the Congressman's Law Enforcement Coordinator and overseeing district office security"
    ],
    "qualifications": [
      "Prior experience working with veterans",
      "Possess excellent organizational, writing and oral communication skills",
      "A high level of attention to detail",
      "The ability to manage multiple tasks, work effectively in a team environment and be a self-starter",
      "Must be able to work a flexible schedule, including occasional nights, weekends and some holidays"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter and resume to aguilar.resumes@mail.house.gov with 'Veterans Liaison & Constituent Services Representative Application' in the subject line.",
    "salary_info": "The salary range for this full-time position is $60,000 - $70,000 per year. Employment benefits include medical, dental, vision, and life insurance, Flexible Spending Accounts (FSA), Health Savings Accounts (HSA), student loan repayment, retirement plans, and other benefits in addition to paid time off, sick leave, and federal holidays.",
    "contact": {
      "email": "aguilar.resumes@mail.house.gov",
      "phone": null
    },
    "equal_opportunity": "The Office of Congressman Pete Aguilar is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require a reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-287-25",
    "position_title": "Press Assistant/Press Secretary",
    "office": "Rep. Tony Gonzales (TX-23)",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "The Office of Congressman Tony Gonzales seeks a Press Secretary or Press Assistant in his Washington, D.C. office (title and pay commensurate with experience). Applicants must have exceptional writing skills, attention to detail, and an ability to manage competing demands and deadlines.",
    "responsibilities": [
      "Coordinating the creation of print and digital advertisements;",
      "Creating and posting social media posts;",
      "Producing graphics and editing photos and videos;",
      "Drafting press releases and weekly newsletters;",
      "Compiling daily press clips;",
      "Assisting with the drafting of columns and other written materials as assigned;",
      "Managing the Member's website."
    ],
    "qualifications": [
      "Candidates with Texas ties are preferred.",
      "This is not an entry-level position; at least 1-2 years of full-time professional experience in press and digital communications or a related field is required."
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-283-25",
    "position_title": "Communications Director",
    "office": "Congresswoman Emilia Sykes",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "Congresswoman Emilia Sykes seeks a Communications Director to serve in their Washington, D.C. office. Candidates must be proactive, possess superior written and oral communication skills, and be able to execute a robust communications strategy.\n\nThis is not an entry-level position. Only candidates with prior political or legislative communications experience will be considered.",
    "responsibilities": [
      "Creating and executing a robust communications plan;",
      "Establishing and maintaining relationships with Ohio, national, and D.C.-based media;",
      "Advancing press events and staffing the Member as needed, including occasional night and weekend commitments;",
      "Drafting and distributing press releases, statements, and media advisories;",
      "Creating, editing, and strategically placing op-eds;",
      "Overseeing the development of social media content creation, including rapid response;",
      "Managing a franked communications plan including text messages, e-newsletters, digital ads, radio ads, 499s, mailers, etc;",
      "Pitching to reporters and producers, responding to press inquiries, and serving as the main point-of-contact for media;",
      "Updating the website as needed;",
      "Managing the Press Secretary; and",
      "Performing other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, three references, and two writing samples in one pdf to JoinTeamSykes@mail.house.gov with the following subject line: Full Name - Communications Director.",
    "salary_info": null,
    "contact": {
      "email": "JoinTeamSykes@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-284-25",
    "position_title": "Assistant General Counsel",
    "office": "The Office of General Counsel ('OGC')",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "The Office of General Counsel ('OGC'), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation, is accepting applications for the position of Assistant General Counsel.",
    "responsibilities": [
      "drafting district court pleadings and appellate briefs",
      "appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest",
      "analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions",
      "advising and counseling House Members, committees, officers, and employees on a wide range of legal issues",
      "gathering facts necessary to permit OGC to provide sound legal advice",
      "interacting with House leadership, committees, and other House offices",
      "interacting with opposing counsel (both government and private)",
      "representing witnesses in connection with investigative proceedings",
      "performing legal research on issues of constitutional, statutory, and common law",
      "working closely with other OGC attorneys and support staff in performing these functions."
    ],
    "qualifications": [
      "Minimum Requirements:",
      "excellent academic credentials",
      "at least three years' experience as a practicing attorney, including any judicial clerkships",
      "excellent writing, analytical, and people skills",
      "excellent judgment",
      "ability to work with, and to provide high quality legal advice and representation to, House Members, committees, officers, and employees, without regard to political affiliation",
      "appreciation of-or at least the desire to learn about and understand-the role and functioning of the Legislative Branch.",
      "Preferred Qualifications:",
      "judicial clerkship or other government experience",
      "experience drafting dispositive motions in federal district courts and/or briefs in federal courts of appeals",
      "understanding of structure and operations of the Federal Government, particularly the House of Representatives and the Department of Justice."
    ],
    "how_to_apply": "Please email your application consisting of: cover letter, resume, law school transcript, list of references, and writing sample to OGC.Employment@mail.house.gov. Application deadline, Thursday, September 18, 2025. Applications will be considered on a rolling basis between now and the deadline. Please include in the email subject line 'Assistant General Counsel Vacancy.'",
    "salary_info": "$170,000-$185,000",
    "contact": {
      "email": "OGC.Employment@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-281-25",
    "position_title": "Digital Director",
    "office": "Rep. Mike Thompson (CA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2025-09-15",
    "description": "Rep. Mike Thompson (CA-04), senior member of the House Ways and Means Committee and Chair of the House Gun Violence Prevention Task Force, seeks a Digital Director to join his fast-paced communication team.\n\nThe Digital Director is an integral part of the communications team and will work to manage the Member's digital profile via social media, the official website, photography/videography, graphic creation, and content editing, among other responsibilities. Candidates should be familiar with graphic design and photo/video editing tools, including Canva and Adobe Premiere. This position is not entry level and will be based in Washington, D.C. 1-2 years of relevant digital experience is required. California ties and/or Spanish fluency is a plus but not required. This is a full-time position with evening and weekend work as needed. This is an in-person position.",
    "responsibilities": [
      "Coordinate with the Communications Director to develop and implement the Member's communications and media strategy",
      "Create videos, graphics, and other digital content that is compelling, engaging, on-brand, and error-free",
      "Draft content in the voice of the Congressman each day in addition to quickly responding to breaking news and Capitol Hill and district developments",
      "Taking photos and videos of the Congressman at events and in meetings",
      "Creating content for rollouts and rapid response opportunities, including clipping, captioning, and posting committee remarks, floor speeches, and interviews",
      "Assist with drafting and circulating the Congressman's newsletter, media advisories, press releases, statements, talking points, and speeches",
      "Manage and post on all social media accounts for the Member (Facebook, X, Instagram, YouTube, Blue Sky, etc.)",
      "Track analytics across all relevant platforms and suggest improvements or ideas to enhance Member's brand",
      "Edit and maintain the Member's website to include relevant updates, press releases, news, photos, and more",
      "Design public-facing printed materials (mailers, pamphlets, brochures)",
      "Develops communications to assist with outreach to district stakeholders and Member offices",
      "Monitors national and local media coverage to stay abreast of current events",
      "Support press event logistics for the Member in Washington, D.C. and in the district",
      "Create and maintain press lists",
      "Proofreads and fact-checks written materials to ensure complete accuracy",
      "Compiles the Member's daily news clips to distribute to office staff",
      "Generates and shares ideas for press, mass mailing, and newsletters to assist with the development of traditional and digital media strategies",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner",
      "Other duties as assigned by the Communications Director, Chief of staff, Deputy Chief of Staff and Member",
      "Reports to Chief of Staff, Deputy Chief of Staff, and Communications Director"
    ],
    "qualifications": [
      "Bachelor's degree in communications, journalism, public relations, graphic design, or related field",
      "Exceptional writing, editing, and organizational skills",
      "Experience with social media platforms and tools (e.g., Twitter/X, Facebook, Instagram, Canva, Adobe Creative Suite, or similar tools)",
      "Ability to create engaging graphics, visuals, and videos",
      "Strong interest in digital media and trends",
      "Detail-oriented, with the ability to juggle multiple tasks and meet tight deadlines"
    ],
    "how_to_apply": "Prospective candidates should e-mail a cover letter, resume, one graphic digital work sample, and one video work sample to CA04Jobs@mail.house.gov with the subject line \"LASTNAME_Digital.\"",
    "salary_info": "$60,000, commensurate with experience, and includes health insurance, student loan repayment, and other competitive benefits.",
    "contact": "CA04Jobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental"
  },
  {
    "id": "MEM-277-25",
    "position_title": "DISTRICT DIRECTOR",
    "office": "OFFICE of CONGRESSWOMAN LAURA GILLEN",
    "location": "District Office",
    "posting_date": "2025-09-15",
    "description": "The District Director oversees all district office operations. This position develops and implements policy objectives, strategies and operating plans for the Congresswoman's district office and directs all activities and staff of the district office.",
    "responsibilities": [
      "Manages district office staff.",
      "Represents the Congresswoman and/or assigns appropriate staff to do so in the district office as needed.",
      "Plans, assigns and evaluates work of employees in district office.",
      "Interviews, selects and trains employees of district office and ensures that district office staff complies with office policies, practices, and procedures.",
      "Conducts district office staff meetings.",
      "Speaks to local groups when the Congresswoman is unavailable.",
      "Maintains close communication with the Washington, D.C. office.",
      "Travels throughout the district at regular intervals to keep abreast of local concerns.",
      "Meets with elected officials and representatives of local groups on behalf of the Congresswoman.",
      "Schedules meetings with federal and district government agencies as necessary.",
      "Responds to constituent telephone calls and mail.",
      "Meets attendance requirements as established by the office.",
      "Maintains a good working relationship with the Congresswoman, staff, and constituents.",
      "Works well under pressure and handles stress.",
      "Accepts performance-based criticism and direction.",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "A minimum of a bachelor's degree and five-ten years of related experience in management and/or legislation or equivalent similar experience is required.",
      "Ability to perform essential job functions above.",
      "Ability to work cooperatively and courteously with others.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Thorough knowledge of local, state and federal agencies and departments.",
      "An understanding of the district and federal political process.",
      "Provides necessary organization, supervisory leadership and motivation to manage district office.",
      "Excellent oral and written communication skills.",
      "Work is mainly performed in an office environment. Noise levels are usually moderate;",
      "Ability to work in a small workstation without an expectation of privacy."
    ],
    "how_to_apply": "Please email your resume to Sarah Carlson at sarah.carlson@mail.house.gov",
    "salary_info": null,
    "contact": {
      "name": "Sarah Carlson",
      "email": "sarah.carlson@mail.house.gov"
    },
    "equal_opportunity": null
  }
]