[
  {
    "id": "MEM-370-25",
    "position_title": "Digital Assistant",
    "office": "The Democratic Staff of the Ways and Means Committee",
    "location": null,
    "posting_date": "2025-12-08",
    "description": "The Democratic Staff of the Ways and Means Committee seek a creative and detailoriented Digital Assistant to join a fast-paced, committed team. This position requires strong writing skills, familiarity with creative tools, and the desire to develop social media content to connect the Committee's jurisdiction to almost any conversation. The ideal candidate is early in their career and eager to grow in social media content development while delving into the world of policy and politics.",
    "responsibilities": [
      "Create and publish regular social media posts that lift up and align with the Committee's priorities",
      "Produce graphics and assets for organic and paid social media",
      "Assist the team with video creation",
      "Assist the team with managing press lists, clips, and website"
    ],
    "qualifications": [
      "Strong copywriting and editing skills",
      "Strong graphic design skills with proficiency in Adobe Creative Suite and/or Canva",
      "Ability to take direction and adapt quickly",
      "Interest in emerging platforms and trends",
      "Creative under short deadlines",
      {
        "Exceptionally Qualified Candidates will have:": [
          "Experience creating content for multiple social media platforms",
          "Familiarity with brand development and visual identity systems",
          "Demonstrated understanding of or familiarity with Ways and Means' jurisdiction"
        ]
      }
    ],
    "how_to_apply": "Please send a cover letter, resume, and at least 2-3 sample posts and graphics, additional video samples welcome but not required, to dylan.peachey@mail.house.gov with the subject line \"Digital Assistant: Last name\". Applications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "dylan.peachey@mail.house.gov",
    "equal_opportunity": "We are an equal opportunity employer and do not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability. Diverse applicants encouraged to apply."
  },
  {
    "id": "MEM-369-25",
    "position_title": "Director of Digital & New Media",
    "office": "Congressman Jason Crow (D-CO-06)",
    "location": "Washington, DC",
    "posting_date": "2025-12-08",
    "description": "Congressman Jason Crow (D-CO-06) seeks an innovative and forward-thinking Director of Digital & New Media to serve in his Washington, DC office. The position will lead the Congressman's digital, video, and new media strategy to help build and expand opportunities for the Congressman to engage online.\n\nCandidates must be willing to travel, work long hours (including nights and weekends), and be part of an office on the front lines of resisting harmful Trump Administration policies.\n\nCandidates should be well-versed in photography and videography and should have a background in advanced photo and video editing programs. Because this position will also manage digital platforms and relationships, candidates should be comfortable writing social copy and working with external messaging partners and online content creators.\n\nThe ideal candidate will have a background in political communications or campaigns, but any creative and self-starting person should apply. This is not an entry level position. The Director of Digital & New Media will work regularly with the Congressman, report to the Communications Director, and collaborate hand-in-hand with the rest of a four-person communications team.",
    "responsibilities": [
      "Envisioning, drafting, and posting engaging digital content across relevant platforms, including but not limited to Meta (Facebook/Instagram), X, BlueSky, TikTok, and YouTube",
      "Creating high-quality videos from start to finish, including idea generation, script drafts, film design, film edits, and final posts",
      "Assisting with rapid response needs as they relate to digital platforms, including clipping/captioning content, boosting posts, and coordinating with external partners on them",
      "Booking the Congressman on new media platforms-including podcasts, Substacks, and digital content creator livestreams-and coordinating/staffing appearances for them",
      "Managing relationships with external digital partners and building new partnerships to advance the Congressman's brand",
      "Maintaining and updating the Congressman's website",
      "Designing digestible graphics and one-pagers for internal and external partners",
      "Collaborating with policy staff and the rest of the press team to translate the Congressman's priorities into a digital format",
      "Supporting other day-to-day needs of the Communications team"
    ],
    "qualifications": [
      "Willing to travel, work long hours (including nights and weekends), and be part of an office on the front lines of resisting harmful Trump Administration policies.",
      "Well-versed in photography and videography and should have a background in advanced photo and video editing programs.",
      "Comfortable writing social copy and working with external messaging partners and online content creators.",
      "A background in political communications or campaigns is ideal.",
      "Creative and self-starting.",
      "This is not an entry level position."
    ],
    "how_to_apply": "Interested applicants are encouraged to submit a resume, cover letter, and digital portfolio as a single PDF to co06.resumes@mail.house.gov with the subject line \"[LAST NAME] - Director of Digital & New Media.\" Applications will be considered on a rolling basis. No walk-ins or phone calls, please.",
    "salary_info": "The salary range for this position is $80,000-$85,000 per year, commensurate with experience. In addition, the Congressman's office offers a competitive package of benefits, including health insurance, transit benefits/parking, 401(k) retirement match, student loan repayment/tuition assistance, paid family leave, and more.",
    "contact": {
      "email": "co06.resumes@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-368-25",
    "position_title": "Digital Director/Press Secretary",
    "office": "Congressman Jim Baird",
    "location": "Washington, D.C.",
    "posting_date": "2025-12-08",
    "description": "Congressman Jim Baird has an immediate need to hire an experienced Digital Director/Press Secretary for the Washington, D.C. office in a full-time capacity. Interested candidates are encouraged to submit a resume and cover letter. Interviews will be conducted on a rolling basis.\n\nJob Expectations:\nThe Digital Director/Press Secretary develops media advisories, press releases, talking points, digital content, and other materials for the Member with a heavy focus on social media and publishing quality content online that highlights the Congressman's legislative work, constituent meetings, and other comparable information. This position also assists the Communications Director with development and implementation of the Member's communications and media strategy.",
    "responsibilities": [
      "Works with key staff to develop and implement a comprehensive communications and media strategy that promotes the Member's policies and priorities",
      "Manages all social media channels and web content to ensure all platforms are adequately maintained and up to date",
      "Works with the Communications team to identify new ways to engage with press and digital audiences",
      "Oversees the communications schedule to manage the Member's digital media accounts and work with local and national reporters",
      "Assists the Communications Director to draft news releases, advisories, talking points, op-eds, and other materials",
      "Stays informed on the current issues impacting the Member and their district and anticipates any inquiries from the press",
      "Monitors news to determine how the Member and their agenda is portrayed by the media",
      "Prepares the Member for all interviews (including TV, radio, and print) and other public appearances to maintain a positive public perception",
      "Builds relationships with local and national reporters to book the member for media spots",
      "Works with the Communications Director to write press releases, op-eds, speeches, newsletters, and talking points",
      "Assists with developing materials to communicate with the media, including press releases, talking points, emails, advisories, pitches, media kits, and reports",
      "Manages the staffing of virtual, D.C., and district-based events such as press conferences and roundtables to ensure adequate staffing",
      "Oversees the creation of the Member's newsletters and questionnaires to ensure materials are distributed as planned",
      "Compiles daily press clips to distribute to office staff",
      "Pitches and fields a high volume of press requests to engage the press in the Member's activities"
    ],
    "qualifications": [
      "Attention to detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Digital Media Expertise: Understands and applies audio, graphics, text, and/or other digital media technology principles, methods, tools, and techniques.",
      "Media Relations: Works with various media outlets to effectively provide information on the Member's objectives and activities.",
      "Verbal Communication: Makes clear and convincing oral presentations that are appropriate to listeners and situations. Listens effectively, attends to nonverbal cues, and responds appropriately.",
      "Written Communication: Writes in a clear, concise, organized, and convincing manner for the intended audience.",
      "Bachelor's degree",
      "Experience on the Hill and/or working in fast-paced media environments is preferred",
      "On-the record experience is preferred"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume to Baird.staff.resumes@gmail.com",
    "salary_info": null,
    "contact": "Baird.staff.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-367-25",
    "position_title": "Legislative Director",
    "office": "Rep. Jim Baird",
    "location": "Washington, D.C.",
    "posting_date": "2025-12-08",
    "description": "Rep. Jim Baird is looking for an experienced Legislative Director. The ideal candidate will be a self-starter with a law degree and 1 to 2 years of relevant professional experience developing and advancing policy on Capitol Hill, in the Administration, or the private sector. Superior written and oral communications skills, legislative drafting experience, a passion for interfacing with and developing junior staffers, and the ability to work as part of a team are critical. 1-2 years of management experience preferred. Salary will be competitive and commensurate with experience.",
    "responsibilities": [
      "Partners with the Member and senior staff to develop the Member's legislative strategy",
      "Ensures that all legislative staff are positioned to support and implement the Member's legislative strategy",
      "Works with Committee staff to advance legislation sponsored by the Member",
      "Builds coalitions with Member offices and key stakeholders to advance the Member's policy priorities through the legislative process",
      "Drafts legislative memos, talking points, opening statements for committee hearings, and floor speeches for the Member",
      "Meets with VIPs, and executives from private, government, and non-profit sectors to discuss the Member's legislative priorities and initiatives",
      "Maintains knowledge of legislation affecting the District and legislation in which the Member is a principal sponsor or cosponsor to provide updates to the Member and Chief of Staff",
      "Coordinates with staff to ensure all legislative mail is addressed",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner",
      "Trains and supervises legislative staff to ensure that staff comply with office policies, practices, and procedures",
      "Schedules and directs legislative staff meetings to ensure all tasks are handled and assigned",
      "Collaborates with the Chief of Staff to evaluate and manage legislative staff work"
    ],
    "qualifications": [
      "A self-starter with a law degree and 1 to 2 years of relevant professional experience developing and advancing policy on Capitol Hill, in the Administration, or the private sector.",
      "Superior written and oral communications skills, legislative drafting experience, a passion for interfacing with and developing junior staffers, and the ability to work as part of a team are critical.",
      "1-2 years of management experience preferred.",
      "Coalition Building: Develops networks and builds alliances; collaborates across groups or organizations to gain cooperation, build strategic relationships, and achieve common goals.",
      "House Knowledge: Knows the mission and functions of the House of Representatives, and how to operate effectively.",
      "Legislative Knowledge: Applies understanding of laws, legal codes, precedents, legislative practices and documents, Government regulations, Executive orders, Government organization and functions, and the democratic political process.",
      "Managing Others: Plans, distributes, and monitors work assignments of others; evaluates work performance and provides ongoing feedback to others on their performance and opportunities to learn through formal and informal methods.",
      "Written Communication: Writes in a clear, concise, organized, and convincing manner for the intended audience."
    ],
    "how_to_apply": "Interested individuals should send a resume and cover letter to Baird.staff.resumes@gmail.com with the subject line \"<Applicant First and Last Name> Legislative Director\"",
    "salary_info": "Salary will be competitive and commensurate with experience.",
    "contact": "Baird.staff.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-365-25",
    "position_title": "Senior Military Legislative Assistant",
    "office": "Congressman Donald Norcross (NJ-1)",
    "location": "Washington, DC",
    "posting_date": "2025-12-08",
    "description": "Congressman Donald Norcross (NJ-1), Ranking Member of the Subcommittee on Tactical Air and Land Forces of the House Armed Services Committee, is accepting applications for a senior Military Legislative Assistant position on his legislative team. Congressman Norcross also serves on House Armed Services Subcommittees on Seapower and Projection Forces and Strategic Forces and is a member of NATO Parliamentary Assembly, all of which are a part of the MLA legislative portfolio.",
    "responsibilities": [
      "Managing related authorization and appropriations requests.",
      "Staffing committee hearings, briefings, markups, and floor action.",
      "Developing and advancing legislative and program priorities.",
      "Making cosponsor and vote recommendations.",
      "Writing policy and program memos and talking points.",
      "Working directly with defense, foreign affairs, and veterans agencies, interest groups, industries, and constituents."
    ],
    "qualifications": [
      "Competitive applicants should have an extensive knowledge of defense, foreign affairs, and veterans budgets, policies, and programs.",
      "This is not an entry-level position, and closer consideration will go to applicants with prior Hill and/or military experience."
    ],
    "how_to_apply": "Interested candidates should submit a resume and two writing samples (one narrative style and one bulleted issue brief, each 1 page max) with the subject line 'MLA - [Last Name]' to cd1jobs@mail.house.gov by December 15th 2025. Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": {
      "email": "cd1jobs@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-363-25",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Jennifer McClellan (D-VA-04)",
    "location": "Washington, DC",
    "posting_date": "2025-12-08",
    "description": "Congresswoman Jennifer McClellan (D-VA-04) seeks a proactive, dependable, and detailoriented staff assistant for the Washington, DC office.\n\nThis position plays an invaluable role in office operations and reports directly to the Chief of Staff.",
    "responsibilities": [
      "serving as the primary point of contact in the front office",
      "managing the office's DC internship program",
      "coordinating tour and flag requests",
      "answering phones",
      "assisting the Chief of Staff and Director of Operations with office operations",
      "driving the Member",
      "other duties as assigned"
    ],
    "qualifications": [
      "A strong communicator, a collaborative team player, and someone who thrives in a fast-paced environment with professionalism, flexibility, and good humor.",
      "Virginia ties and previous Capitol Hill experience are a plus but not required.",
      "Requires availability outside of typical office hours, including some early mornings and late evenings.",
      "A clean driving record is required.",
      "Candidates do not need to have their own vehicle."
    ],
    "how_to_apply": "Interested candidates should email their cover letter, resume, writing sample, and references to VA04.Jobs@mail.house.gov with the subject line \"[FIRST INITIAL, LAST NAME] Staff Assistant.\" No phone calls or walk-ins please.",
    "salary_info": "The salary range for this full-time position is $50,000 - 55,000, commensurate with experience. The office offers a competitive package of benefits, including health insurance, retirement plans with an employer match, generous PTO, paid FMLA, student loan repayment assistance, transit or parking benefits, and flexible work-from-home options.",
    "contact": {
      "email": "VA04.Jobs@mail.house.gov",
      "instructions": "Use subject line \"[FIRST INITIAL, LAST NAME] Staff Assistant\""
    },
    "equal_opportunity": "Congresswoman McClellan's office is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, national origin, age, disability, or veteran status. We strongly encourage applicants from diverse backgrounds-including women, people of color, LGBTQ+ individuals, and members of other underrepresented communities-to apply."
  },
  {
    "id": "MEM-362-25",
    "position_title": "Legislative Assistant",
    "office": "The Office of Congressman Jamie Raskin (MD-08)",
    "location": "Washington D.C.",
    "posting_date": "2025-12-08",
    "description": "The Office of Congressman Jamie Raskin (MD-08) seeks a Legislative Assistant to advance the Congressman's priorities related to foreign policy, human rights, campaign finance, democracy reform, voting rights and elections, and other policy areas to be assigned. This is a full-time, in-person position in the Washington D.C. office.\n\nThis position will report directly to the Legislative Director and work in close collaboration with the Congressman, Chief of Staff, the District Office team, and the communications team. This position may include evening and weekend work as the Congressional schedule requires.",
    "responsibilities": [
      "Identifying and proactively pursuing legislation and other policy initiatives related to the priorities of the Congressman and Maryland's Eighth District.",
      "Working closely with the Legislative Director and Chief of Staff to formulate and execute a coordinated legislative strategy for the Congressman for their assigned issue areas, and working with external stakeholders, Legislative Counsel, and other Congressional offices to draft and advance legislation, speeches, policy letters and other policy initiatives.",
      "Providing the Congressman with timely legislative updates, generating ideas, and working with the communications team on press releases, op-eds, and speeches.",
      "Staffing the Congressman for meetings with constituents and advocacy groups.",
      "Meeting with constituents and advocacy groups on the Congressman's behalf.",
      "Drafting and reviewing constituent correspondence."
    ],
    "qualifications": [
      "At least three years of relevant professional experience and subject matter knowledge in the policy areas described above. This is not an entry-level position.",
      "Willingness to cover a diverse issue portfolio and be responsive to constituents' varied concerns and perspectives.",
      "Exceptional writing skills, attention to detail, and creativity.",
      "Strong verbal communications skills.",
      "Serious work ethic, keen organization, effective time management, a professional and discreet approach, and the ability to work in a fast-paced, dynamic and collaborative environment and quickly respond to requests from the Congressman, colleagues, and constituents.",
      "Residence in, or ties to, Maryland's Eighth District and facility with other languages are both plus factors, though not requirements."
    ],
    "how_to_apply": "The deadline for applications is Friday, December 12 at 5pm. Applications will be reviewed on a rolling basis.\n\nTo apply, please 1) fill out this basic form (copy and paste the URL into your browser):https://forms.office.com/g/uvBhtdLwgs AND 2) send an email to MD08.Resumes@mail.house.gov with \"Legislative Assistant: [YOUR NAME]\" in the subject line and the following application materials attached as one combined PDF:\n- Cover letter (not to exceed one page)\n- Resume\n- Two writing samples (not to exceed two pages each)",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-361-25",
    "position_title": "PRESS ASSISTANT",
    "office": "OFFICE of CONGRESSMAN AUCHINCLOSS",
    "location": "Washington, D.C.",
    "posting_date": "2025-12-08",
    "description": "Congressman Jake Auchincloss (D-MA) is seeking a Press Assistant in the Washington, D.C. office to join an aggressive, fast-paced communications team. The Press Assistant will have excellent writing, editing, and digital skills. Strong proofreading and copyediting skills are a must. This role will be heavily focused on digital communications, working with the Communications Director to produce social media content and develop a creative digital strategy.\n\nThis role primarily assists the Communications Director with drafting constituent-facing outgoing communications and developing a social media plan. Candidates seeking to join a highly active press team across national, local, and digital media are encouraged to apply.\n\nVideography and video editing skills are a plus. This role requires some work outside of business hours.",
    "responsibilities": [
      "Drafts, edits or compiles the Congressman's remarks, newsletters, press releases, and other public-facing written materials;",
      "Designs and executes a robust social media plan that builds engagement and audience growth;",
      "Posts daily social media content in accordance with the social media plan under quick deadlines and suggests new ideas;",
      "Runs the office's 499 program;",
      "Monitors social media and relevant news to produce rapid response tweets;",
      "Clips the Congressman's TV appearances and public facing events for social media;",
      "Provides creative, proactive ideas on social media, press pitches and events;",
      "Assists the Communications Director with drafting press releases, quotes, statements, floor speeches and talking points;",
      "Works closely with the Communications Director to produce franked mail, texts, digital ads, telephone surveys, and telephone town halls;",
      "Conducts research on podcasts and other upcoming press hits;"
    ],
    "qualifications": [
      "Excellent writing, editing, and digital skills.",
      "Strong proofreading and copyediting skills are a must.",
      "Videography and video editing skills are a plus.",
      "Possesses strong instincts for digital trends and digital media opportunities;",
      "Works well under pressure and with quick turnarounds;"
    ],
    "how_to_apply": "Please email a resume, cover letter, writing sample and two digital work samples in a single PDF to AuchinclossJobs@mail.house.gov with \"First Name Last Name-Press Assistant\" in the Subject Line. Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": "The salary for this position is $55,000.",
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law.\n\nAll applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-355-25",
    "position_title": "Field Representative",
    "office": "Congresswoman Lizzie Fletcher (TX-7)",
    "location": "Houston, TX",
    "posting_date": "2025-12-08",
    "description": "Congresswoman Lizzie Fletcher (TX-7) seeks a positive, well-organized, and outgoing Field Representative in her Houston, TX office. Primary duties include attending local events as the Congresswoman's representative; building and maintaining relationships with constituents, community leaders and organizations, and local government offices; assisting with the outreach programs; planning events; and staffing the Congresswoman.\n\nStrong candidates will demonstrate excellent written and oral communication skills and attention to detail, strong organizational skills, ability to manage multiple projects at once, and function well in a team-oriented environment. Candidates should be able to communicate clearly in a fast-paced environment with good humor, and to work effectively with different teams in the office as well as organizations and government offices in the community.\n\nThis position requires flexible working hours, including on weekends, and availability by phone and email during evenings and weekends. Previous government experience is highly desirable.",
    "responsibilities": [
      "Attending local events as the Congresswoman's representative",
      "Building and maintaining relationships with constituents, community leaders and organizations, and local government offices",
      "Assisting with the outreach programs",
      "Planning events",
      "Staffing the Congresswoman"
    ],
    "qualifications": [
      "Excellent written and oral communication skills and attention to detail",
      "Strong organizational skills",
      "Ability to manage multiple projects at once",
      "Function well in a team-oriented environment",
      "Ability to communicate clearly in a fast-paced environment with good humor",
      "Ability to work effectively with different teams in the office as well as organizations and government offices in the community",
      "Requires flexible working hours, including on weekends, and availability by phone and email during evenings and weekends",
      "Previous government experience is highly desirable"
    ],
    "how_to_apply": "Interested candidates should email their resume, writing sample, and references to TX07.hiring@mail.house.gov with the subject line \"Field Representative.\" No phone calls or walk-ins please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "TX07.hiring@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-354-25",
    "position_title": "Trade Counsel",
    "office": "Committee on Ways and Means, Democratic Staff, U.S. House of Representatives",
    "location": "Washington, DC",
    "posting_date": "2025-12-08",
    "description": "The Committee on Ways and Means, U.S. House of Representatives, seeks applications to fill a Trade Counsel position on the Democratic Staff.",
    "responsibilities": [
      "arranging and staffing hearings",
      "legislative drafting",
      "providing expert legal and policy analysis",
      "negotiating and corresponding with Executive agencies",
      "conducting oversight and investigative activities"
    ],
    "qualifications": [
      "Candidates for the position must be graduates of an accredited law school and members in good standing of a state or the District of Columbia Bar.",
      "Candidates must be a U.S. citizen and should have at least five years of trade litigation or trade policy experience.",
      "Exceptional legal research and writing skills are required.",
      "Candidates must be able to obtain and maintain a U.S. security clearance.",
      "Previous Federal Executive Branch experience is preferred with a specific background in customs law, trade remedies, services trade, government procurement, intellectual property rights, artificial intelligence, competition law, labor law, technical barriers to trade, environmental law, or human rights.",
      "Applicants must be able to travel internationally.",
      "Candidates with an ability to converse in French or Spanish is desirable."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and references to WMDemTradeSubmissions@mail.house.gov. Position closes December 11, 2025\n\nDue to an anticipated high volume of applications, we are unable to contact each applicant individually regarding the status of their application.",
    "salary_info": null,
    "contact": {
      "email": "WMDemTradeSubmissions@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-351-25",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Dexter - District OR-03",
    "location": "Washington, D.C.",
    "posting_date": "2025-12-08",
    "description": "Congresswoman Maxine Dexter is seeking a highly organized and detail-oriented individual to serve as a Scheduler for her Washington, D.C. office. This position is essential in managing the Congresswoman's daily schedule, travel arrangements, and other related activities. The Scheduler will act as a liaison between the Congresswoman, staff, the public, and other Members of Congress. A valid driver's license and owning a car is preferred. Full-time benefited position with a starting salary range of $65-75K. Additional benefit of student loan repayment.",
    "responsibilities": [
      "Prepare the Congresswoman's daily schedule.",
      "Organize monthly projected schedules and brief the Congresswoman on all scheduling activities.",
      "Coordinate staff meetings, briefings, and events involving the Congresswoman.",
      "Schedule press, interview, radio, and television engagements in coordination with the Communications Director.",
      "Manage reservations for air travel, ground transportation, and lodging.",
      "Submit vouchers for travel and expense reimbursement.",
      "Ensure the Congresswoman receives briefing materials for each event by coordinating with participants and staff.",
      "Maintain files related to travel, correspondence, and event materials.",
      "Assist with preparing documentation for the Congresswoman's annual financial disclosure report.",
      "Act as a liaison between the Congresswoman, constituents, and government offices.",
      "Maintain positive working relationships with staff and other stakeholders.",
      "Work a flexible schedule including long hours, nights, and weekends, and perform other duties as assigned."
    ],
    "qualifications": [
      "At least one year of experience working in a congressional office is preferred.",
      "Strong telephone, oral, and written communication skills.",
      "Ability to prioritize and manage appointments with discretion and independent judgment.",
      "Excellent organizational skills with keen attention to detail.",
      "Ability to work cooperatively and maintain professional relationships with diverse personalities.",
      "Knowledge of office administration, policies, and procedures.",
      "Ability to work under pressure and handle stress in a fast-paced environment.",
      "Must be adaptable to a flexible work schedule."
    ],
    "how_to_apply": "Please send a resume and cover letter to Grace.Banfield@mail.house.gov and Kari.Williamson@mail.house.gov.",
    "salary_info": "Full-time benefited position with a starting salary range of $65-75K. Additional benefit of student loan repayment.",
    "contact": "Grace.Banfield@mail.house.gov and Kari.Williamson@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-350-25",
    "position_title": "District Representative",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Las Vegas, NV",
    "posting_date": "2025-12-08",
    "description": "The office of Congresswoman Susie Lee (NV-03) is hiring a District Representative based out of her district office in Las Vegas. The ideal candidate is enthusiastic, team-oriented, self-motivated, good-humored, and resourceful. Qualified applicants will have strong oral and written communication skills, astute attention to detail, work efficiently under pressure, and be creative, proactive, and strategic. This position requires flexibility to work some nights and weekends, especially when the Congresswoman is in southern Nevada.\n\nThe District Representative will report to the District Director.",
    "responsibilities": [
      "Organizing and hosting events",
      "Tracking and attending community events",
      "Supporting and staffing the Congresswoman",
      "Preparing briefing memos",
      "Staying informed with assigned issue areas in the community",
      "Conducting casework and other constituent services",
      "Acting as a liaison for the Congresswoman in the community",
      "Assist with various tasks to support the Congresswoman while in district, including driving the Congresswoman"
    ],
    "qualifications": [
      "Experience working with elected officials and community groups",
      "Ability to exercise discretion and independent judgment",
      "Ability to work cooperatively and courteously with others in a fast-paced office",
      "Basic knowledge of government affairs and constituent services",
      "Knowledge of Nevada's Third Congressional District is desired",
      "Must possess a valid drivers' license, strong driving skills, and own a registered vehicle"
    ],
    "how_to_apply": "Qualified candidates should submit in PDF format a cover letter, resume, three references (including name, title and organization, phone number, email, and relationship to the candidate) and one writing sample to nv03resumes@gmail.com with the following subject line: \"Full Name - District Representative.\"",
    "salary_info": "Compensation will be commensurate with experience.",
    "contact": {
      "email": "nv03resumes@gmail.com",
      "submission_instructions": "Submit with the following subject line: \"Full Name - District Representative.\""
    },
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-349-25",
    "position_title": "Press Secretary|Digital Director",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2025-12-08",
    "description": "Congresswoman Nanette Barragan (CA-44) is seeking a Press Secretary|Digital Director to join our communications team. The Press Secretary|Digital Director will work under the office's Communications Director to carry out the Congresswoman's communications and outreach strategy. Ideal candidates are motivated self-starters, detail-oriented, highly organized, possess problem solving skills, thrive in a very fast-paced environment - and be willing to work extended hours and oftentimes under tight time constraints. Interested applicants are encouraged to apply by 15 December 2025.",
    "responsibilities": [
      "Work with the Communications Director to build and maintain the Congresswoman's brand.",
      "Develop and manage digital content across platforms (Facebook, Instagram, X, Bluesky, and YouTube). Support the office's social media strategy by drafting social media posts and producing video and graphic materials.",
      "Update and manage the official website.",
      "Monitor national and local media coverage, as well as social media trends.",
      "Clip and caption TV appearances, floor speeches, long and short form videos, and more.",
      "Draft and edit press releases, advisories, franked communications, and other communications materials as assigned",
      "Help plan and execute press events, interviews, and digital outreach.",
      "Maintain press contact lists and support external communications efforts."
    ],
    "qualifications": [
      "Strong writing, editing, and strategic messaging skills",
      "Skilled in Canva, Adobe Suite, or similar platforms",
      "Media relations success and ability to assist with communications in a fastpaced environment",
      "Los Angeles Metro|Southern California ties are a plus",
      "Fluency in Spanish is a plus",
      "Must be a collaborative, highenergy team player committed to advancing the office's mission and responsive to emerging priorities."
    ],
    "how_to_apply": "Send (1) Cover Letter, (2) Resume, (3) 2 writing samples of 500 words or less, (4) digital/photographic portfolio, and (5) and three references (including name, title, organization, contact details, and your relationship. Pleasesend all materials to CA44Resumes@mail.house.gov With \"CA44 Press Secretary\" in the Subject Line.",
    "salary_info": "$60-70,000 based on experience",
    "contact": {
      "email": "CA44Resumes@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-344-25",
    "position_title": "District Caseworker",
    "office": "Congresswoman Val Hoyle (D-OR-04)",
    "location": "District Office, OR",
    "posting_date": "2025-12-08",
    "description": "Congresswoman Val Hoyle (D-OR-04) seeks a self-starting District Caseworker to join her office to work with a dedicated and hardworking district team. In this role, the District Caseworker acts as a liaison to federal agencies for constituents on behalf of the Member. They provide casework assistance through correspondence and verbal communications to constituents and federal agencies. They also often work with state and local agencies.\n\nThey work closely with other district caseworkers and field staff, and reports to the District Director and the Chief of Staff.",
    "responsibilities": [
      "Acts as a liaison to federal agencies for constituents on behalf of the Member.",
      "Provide casework assistance through correspondence and verbal communications to constituents and federal agencies.",
      "Work with state and local agencies.",
      "Work closely with other district caseworkers and field staff.",
      "Reports to the District Director and the Chief of Staff."
    ],
    "qualifications": [
      "Excellent written and oral skills.",
      "Can exercise discretion and independent judgment in carrying out the duties of the position.",
      "Working knowledge of local, state, and federal agencies and departments.",
      "Aware of and can communicate about issues and events in the district of importance to the Member.",
      "Can communicate with a variety of personalities in a tactful, pleasant and professional manner.",
      "A professional telephone manner.",
      "Courteous to others.",
      "Thorough and pays careful attention to detail.",
      "Can fulfillment of all casework responsibilities.",
      "A preference for Spanish speakers is preferred but not required for this position."
    ],
    "how_to_apply": "Please have candidates send a cover letter and resume to resumes.hoyle@mail.house.gov. Applications will be reviewed on an ongoing/rolling basis",
    "salary_info": null,
    "contact": "resumes.hoyle@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-336-25",
    "position_title": "Scheduler",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2025-12-08",
    "description": "Congresswoman Nanette Barragan (CA-44) seeks an experienced Scheduler for her Washington, DC office.\n\nCandidates must be highly organized, detail-oriented, energetic, and capable of thriving in a fast-paced and rapidly changing workplace.\n\nThis position requires availability outside of regular business hours including some weekend availability as needed.",
    "responsibilities": [
      "maintaining the Member's daily and long-term schedules for both DC and the District;",
      "organizing and evaluating all incoming meeting requests and invitations.",
      "keeping the Member on schedule throughout the day.",
      "working with legislative and communications staff to ensure the Member is prepared for events/meetings.",
      "coordinating travel arrangements.",
      "processing and managing expenses and reimbursements for the Member.",
      "supporting planning and scheduling for the Congressional Hispanic Caucus related to the Chairwoman.",
      "Facilitate weekly scheduling meetings with the Member and Chief of Staff to evaluate meeting requests.",
      "Coordinating with the Member and Chief of Staff regarding political scheduling requests;",
      "Communicating with constituents by phone and email to address requests;",
      "Drive the Member as needed;",
      "And additional administrative responsibilities as necessary."
    ],
    "qualifications": [
      "Previous experience in scheduling/operations and/or Hill experience is preferred.",
      "Southern California | Los Angeles Metro area ties, access to a car, and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with \"SCHEDULER\" in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "The salary range for this position is $60,000 - $80,000, depending on experience and qualifications. Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-335-25",
    "position_title": "Constituent Services Representative",
    "office": "The Office of Congresswoman April McClain Delaney (D-MD-06)",
    "location": "Frederick, MD",
    "posting_date": "2025-12-08",
    "description": "The Office of Congresswoman April McClain Delaney (D-MD-06) seeks a Constituent Services Representative to be based out of her District Office in Frederick, MD. The position reports directly to the District Director and is responsible for assisting in all aspects of the District Team's day-to-day responsibilities. This role will require travel throughout Maryland's Sixth District.\n\nA Constituent Services Representative acts as a liaison to federal, state, and city agencies for the Member's constituents. This position will handle a portfolio of issue areas on behalf of the Member and work closely with the District Director and staff to provide outstanding service to the Member's constituents. A Constituent Services Representative is also responsible for answering casework correspondence and verbal communications with constituents. Additionally, a Constituent Services Representative works with the Director of Constituent Services and the Director of Outreach to ensure effective communication with agencies and constituents.",
    "responsibilities": [
      "Serves as a liaison with federal governments to address individual constituent concerns",
      "Monitors casework trends to provide updates to the District Director and Director of Constituent Services",
      "Prepares incoming and outgoing constituent casework to manage casework in assigned areas of expertise",
      "Maintains accurate and complete files on all assigned casework to keep track of all casework progress",
      "Screens and monitors cases to determine if referring the case to other government entities is appropriate",
      "Answers casework correspondence, meets with constituents, and serves as a liaison with federal, state, and local authorities to act as the representative for the Member within their areas of responsibility",
      "Attends community meetings to support public events and provides updates to District Director and Director of Outreach",
      "Writes responses to constituent letters relating to casework to answer questions or inform them of case progress",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities",
      "Availability to work long hours, including nights and weekends, if needed",
      "Ability to work cooperatively and courteously with others",
      "Strong oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "Knowledge of all issues in the District in which the Member is involved",
      "Maryland ties are a plus",
      "The ability to speak Spanish is a plus",
      "1-3 years of experience working for a candidate or elected official (Federal, State, or Municipal)"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to md06.jobs@gmail.com with the subject line \"Constituent Services Representative.\" No calls or walk-ins please. Applications will be considered on a rolling basis.",
    "salary_info": "The salary range for this position is $55,000 - $65,000 annually. Additionally, the office provides a robust benefits package.",
    "contact": "md06.jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; the office does not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law"
  },
  {
    "id": "MEM-333-25",
    "position_title": "LEGISLATIVE CORRESPONDENT",
    "office": "Moderate House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2025-12-08",
    "description": "Moderate House Democrat seeks a Legislative Correspondent for their Washington, D.C. office.\n\nThis position reports up to the Legislative Director and Chief of Staff.",
    "responsibilities": [
      "Managing a robust constituent mail program through Indigov and ensuring timely, accurate responses;",
      "Helping manage a legislative portfolio, including tracking legislation in assigned issue areas and assisting with legislative research and briefing materials;",
      "Researching legislative issues and drafting correspondence to explain the Member's position on a wide range of public policy matters;",
      "Collaborating with legislative staff to develop and maintain an up-to-date library of constituent correspondence;",
      "Drafting, editing, and personalizing letters to address constituent inquiries."
    ],
    "qualifications": [
      "A Bachelor's degree or related job experience;",
      "1-3 years of relevant job experience;",
      "Exceptional written and verbal communication skills;",
      "Excellent attention to detail and time-management abilities;",
      "A strong commitment to providing outstanding constituent service;",
      "The ability to thrive in a fast-paced, team-oriented environment;",
      "Sound judgment and a positive, professional attitude;",
      "A demonstrated interest in public service and legislative work;",
      "Prior Capitol Hill experience preferred."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, a cover letter, and a writing sample with \"Legislative Correspondent\" as the subject line to jobs@mail.house.gov.",
    "salary_info": null,
    "contact": {
      "email": "jobs@mail.house.gov",
      "subject": "Legislative Correspondent"
    },
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request accommodation at any time during those processes."
  }
]