[
  {
    "id": "MEM-048-25",
    "position_title": "Digital Director",
    "office": "House Committee on Oversight and Government Reform",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "The Democratic Staff of the House Committee on Oversight and Government Reform has an immediate need to hire a creative, proactive, and full-time Digital Director in Washington, D.C. Interested applicants are encouraged to submit a resume, cover letter describing their fit for the role, a writing sample, and three digital work products to oversightjobs@mail.house.gov with “Digital Director” in the subject line by Friday, February 21, 2025, at midnight. Applications will be reviewed on a rolling basis. No calls or walk-ins please.\n\nThe individual selected will have strong writing skills and the ability to translate complex issues and topics for audiences across platforms and medias. This position is based in Washington, D.C. and will work closely with the Communications Director and Press Secretary. Responsibilities include developing and honing a proactive digital strategy, overseeing the Committee’s branding, crafting engaging content (including graphics, videos, and copy) for all social media channels, creating social media toolkits for Committee Members and the caucus as needed, tracking social media analytics, streaming live events, capturing and editing photos, managing the committee’s website and social media pages, and working with the Communications team to identify new ways to engage with press and digital audiences. The position may require work outside standard office hours.\n\nThis is not an entry level position. Qualified candidates will have at least 2 years of digital experience, excellent writing skills, a keen attention to details, proficiency in graphic design, an ability to leverage social media and news trends to take advantage of opportunities for social engagement, and a passion for thinking creatively about how to translate complex ideas into compelling visuals.\n\nApplicants should also have experience with Adobe programs (Photoshop, Canva, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects) and a working knowledge of HTML. Ability to work well with others, manage competing priorities, and turn around high-quality products under tight deadlines are a must.",
    "responsibilities": [
      "Developing and honing a proactive digital strategy",
      "Overseeing the Committee’s branding",
      "Crafting engaging content (including graphics, videos, and copy) for all social media channels",
      "Creating social media toolkits for Committee Members and the caucus as needed",
      "Tracking social media analytics",
      "Streaming live events",
      "Capturing and editing photos",
      "Managing the committee’s website and social media pages",
      "Working with the Communications team to identify new ways to engage with press and digital audiences"
    ],
    "qualifications": [
      "At least 2 years of digital experience",
      "Excellent writing skills",
      "A keen attention to details",
      "Proficiency in graphic design",
      "An ability to leverage social media and news trends to take advantage of opportunities for social engagement",
      "A passion for thinking creatively about how to translate complex ideas into compelling visuals",
      "Experience with Adobe programs (Photoshop, Canva, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects)",
      "A working knowledge of HTML",
      "Ability to work well with others, manage competing priorities, and turn around high-quality products under tight deadlines"
    ],
    "how_to_apply": "Interested applicants are encouraged to submit a resume, cover letter describing their fit for the role, a writing sample, and three digital work products to oversightjobs@mail.house.gov with “Digital Director” in the subject line by Friday, February 21, 2025, at midnight.",
    "salary_info": "The starting salary for this position is $70,000 but is commensurate with experience.",
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin. Candidates with diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-047-25",
    "position_title": "Caseworker",
    "office": "Office of Congressman Brad Sherman (CA-32)",
    "location": "Sherman Oaks",
    "posting_date": "2025-02-10",
    "description": "Caseworker responsibilities include: Interact with constituents via phone, email and in-office meetings; Assist senior staff with administrative responsibilities; Input, file and review constituent inquiries; Contact federal agencies on behalf of constituents.\n\nApplicant should be organized, professional, highly motivated and must possess strong writing, typing and interpersonal skills. Must be able to work in a fast-paced environment and meet deadlines. Proficiency with Microsoft Office and database software preferred.\n\nPosition is entry-level, but past experience in a social work or government field is preferred.\n\nCandidate should have graduated from an accredited four-year college or university with a bachelor's degree.",
    "responsibilities": [
      "Interact with constituents via phone, email and in-office meetings",
      "Assist senior staff with administrative responsibilities",
      "Input, file and review constituent inquiries",
      "Contact federal agencies on behalf of constituents"
    ],
    "qualifications": [
      "Organized, professional, highly motivated",
      "Strong writing, typing and interpersonal skills",
      "Able to work in a fast-paced environment and meet deadlines",
      "Proficiency with Microsoft Office and database software preferred",
      "Past experience in a social work or government field is preferred",
      "Graduated from an accredited four-year college or university with a bachelor's degree"
    ],
    "how_to_apply": "Please submit cover letter and resume attn: Scott Abrams to scott.abrams@mail.house.gov . No calls please",
    "salary_info": "Salary starts at $45,000 annually, with additional considerations made for relevant experience. We offer a generous student loan reimbursement package.",
    "contact": "scott.abrams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-046-25",
    "position_title": "Counsel (JD required) or Professional Sta Member",
    "office": "House Committee on Homeland Security Republican Sta",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The House Committee on Homeland Security Republican Sta] is hiring for a Counsel (JD required) or Professional Sta5 Member supporting the Director of Investigations and the Subcommittee on Oversight, Investigations, and Accountability.\n\nThe ideal candidate will have at least two years of experience with a background or strong interest in congressional oversight and investigations. Experience in homeland security issues is a plus.",
    "responsibilities": [
      "Sta]ing Subcommittee and some Full Committee congressional hearings",
      "Drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations",
      "Conducting depositions/ transcribed interviews",
      "Reviewing document productions, legislation, research",
      "Managing external sources of information",
      "Interacting with various congressional committee and personal o]ices."
    ],
    "qualifications": [
      "Candidates must possess a strong work ethic, superior attention to detail, be selfmotivated, work well under pressure, and possess excellent written and oral communication skills.",
      "The ability to work both independently and as part of a team are critical.",
      "Prior Hill experience preferred."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to Resumes.CHS@mail.house.gov with the subject line “OIA Counsel <Applicant First and Last Name> - OIA Counsel” or “OIA PSM - <Applicant First and Last Name>.”",
    "salary_info": null,
    "contact": "Resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-045-25",
    "position_title": "Correspondence Fellow",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "Washington D.C.",
    "posting_date": "2025-02-10",
    "description": "The O]ice of Congressman Glenn Ivey (MD-04) seeks an excellent writer to join our team as a part-time, temporary Correspondence Fellow. This is a 180-day, twenty hours per week position in the Washington D.C. o]ice.\n\nThis position is responsible for assisting the Legislative Assistant and legislative team with the o]ice’s busy constituent mail program, primarily by drafting accurate, lively, and timely responses to constituent mail.",
    "responsibilities": [
      "drafting replies to constituent letters, including any necessary research",
      "proofreading mail",
      "providing administrative assistance as required",
      "other duties as assigned"
    ],
    "qualifications": [
      "motivated team player with exceptional writing skills",
      "scrupulous attention to detail",
      "strong organizational abilities",
      "e]ective time management",
      "professional demeanor",
      "Strong applicants would include college and graduate students, and early career candidates with a passion for writing and who are interested in learning how Members of Congress communicate with their constituents."
    ],
    "how_to_apply": "To apply, please send an email to md04resumes@gmail.com with “Correspondence Fellow: Your Last Name” in the subject line and the following application materials attached as one combined PDF:\n\n- Cover letter (not to exceed one page) – please customize your letter to this position\n- Resume\n- Two writing samples (not to exceed one page each)\n- Two references (not to exceed one page) – for each reference, please include name, current title/o]ice, phone number, email, and a one-sentence description of your relationship to the reference.",
    "salary_info": null,
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. Ties to Maryland and/or Maryland’s Fourth District are a plus. The U.S. House of Representatives is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-043-25",
    "position_title": "Associate General Counsel/Assistant General Counsel",
    "office": "Office of General Counsel",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The Office of General Counsel (“OGC”), which provides legal advice and representation to\nMembers, committees, officers, and employees of the House on matters related to their\nofficial duties without regard to political affiliation, is accepting applications for the\nposition of Associate General Counsel/Assistant General Counsel.",
    "responsibilities": [
      "Drafting district court pleadings and appellate briefs",
      "Appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest",
      "Analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions",
      "Advising and counseling House Members, committees, officers, and employees on a wide range of legal issues",
      "Gathering facts necessary to permit OGC to provide sound legal advice",
      "Interacting with House leadership, committees, and other House offices",
      "Interacting with opposing counsel (both government and private)",
      "Representing witnesses in connection with investigative proceedings",
      "Performing legal research on issues of constitutional, statutory, and common law",
      "Working closely with other OGC attorneys and support staff in performing these functions"
    ],
    "qualifications": [
      "Excellent academic credentials",
      "At least three years’ experience as a practicing attorney, including any judicial clerkships",
      "Excellent writing, analytical, and people skills",
      "Excellent judgment",
      "Ability to work with, and to provide high quality legal advice and representation to, House Members, committees, officers, and employees, without regard to political affiliation",
      "Appreciation of—or at least the desire to learn about and understand—the role and functioning of the Legislative Branch"
    ],
    "how_to_apply": "Please email your application consisting of: cover letter, resume, law school transcript, list\nof references, and writing sample to OGC.Employment@mail.house.gov. Application\ndeadline, Wednesday, February 26, 2025.\n\nApplications will be considered on a rolling basis between now and the deadline. Please\ninclude in the email subject line “Associate General Counsel/Assistant General Counsel\nVacancy.”",
    "salary_info": "$176,000-$204,500",
    "contact": "OGC.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-042-25",
    "position_title": "Scheduler",
    "office": "Office of Congressman Gabe Vasquez (NM-02)",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "The O]ice of Congressman Gabe Vasquez (NM-02) seeks an experienced, highly organized, and detail-oriented Scheduler to be based in his Washington, DC o]ice. This is not an entry-level position. Candidates must have exceptional organizational skills, meticulous attention to detail, expertise prioritizing and managing multiple tasks under tight deadlines, and the ability to work under pressure in a fast-paced environment for a battleground Member.\n\nThe Scheduler serves as a key player of the team by managing the Member’s time. This role reports to and works closely with the Chief of Sta] but is expected to be a leader and team player in coordinating closely with the full team regarding the Member’s schedule.",
    "responsibilities": [
      "Evaluating, organizing, and responding to all incoming meeting and event requests in coordination with the Chief of Sta] in a timely manner.",
      "Maintains the Member’s daily and long-term schedule, coordinates travel, and acts as a liaison for the Member with other congressional o]ices, constituents, and stakeholders.",
      "Briefs the Member weekly on upcoming events, meetings, and other scheduling matters in Washington, DC and New Mexico.",
      "Collaborates with the Member and Senior Sta] to determine and ﬁnalize the Member’s daily and long-term schedules, and collect brieﬁng materials (e.g., memos, talking points, and speeches).",
      "Manages Member and o]ice operations in Washington, D.C. including coordination of Member movements, meetings, and o]-campus events.",
      "Works closely with ﬁnancial administrator for travel and o]icial expenses.",
      "Reports directly to the Chief of Sta] and Member."
    ],
    "qualifications": [
      "The ideal candidate will have congressional work experience and prior scheduling experience.",
      "New Mexico ties and Spanish-language proﬁciency are a plus."
    ],
    "how_to_apply": "To apply, please send a cover letter and resume as a single document to NM02applications@mail.house.gov with “Scheduler: [Your Name]” as the subject line.",
    "salary_info": null,
    "contact": "NM02applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; the office does not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-040-25",
    "position_title": "Legislative Director",
    "office": "Congressman Rob Wittman",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Overview: Congressman Rob Wittman is seeking a highly motivated and experienced Legislative Director to lead his legislative agenda and coordinate policy initiatives in his Washington, D.C. o]ice. The Legislative Director would handle the Congressman’s Natural Resources Committee assignment, as well as Energy, Environment and Chesapeake Bay, Tax, Telecom/Broadband, Transportation & Infrastructure, Appropriations and the Budget, Immigration, Labor/Workforce/Federal Employees. In addition, the Legislative Director will have a close working relationship with the Chief of Sta] in building and maintaining relationships with other lawmakers, committee sta], and advocacy groups.\n\nThe Legislative Director should be knowledgeable about issues relating to Virginia and VA01, and work closely with the District Director and district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative e]orts. Most importantly, the Legislative Director should have a genuine commitment to public service and advocating for the best interests of Virginia’s First District.",
    "responsibilities": [
      "Develop and implement a comprehensive legislative strategy aligned with the Congressman’s priorities and constituents' needs.",
      "Manage and mentor a legislative team, provide guidance, and foster collaboration among sta] members.",
      "Build and maintain relationships with other lawmakers, committee sta], advocacy groups, and stakeholders to advance the Congressman’s legislative goals.",
      "Engage with district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative e]orts.",
      "Understand the political landscape and anticipate the implications of legislative actions as it relates to VA-01.",
      "Draft legislation, amendments, and policy papers, ensuring clarity and adherence to congressional procedures.",
      "Maintains up-to-date tracking reports on all legislative items including Sponsored and Cosponsored legislation and letters, provisions in larger bills, and district wins.",
      "Review responses to all constituent mail, and review content produced by the communications team.",
      "Represent the Congressman in meetings with constituents, interest groups, and other legislative o]ices.",
      "Monitor legislative developments and provide timely updates to the Congressman and his sta]."
    ],
    "qualifications": [
      "Minimum of 5 years of experience in legislative a]airs, public policy, or a related ﬁeld, preferably in a congressional o]ice.",
      "Strong understanding of the legislative process and federal government operations.",
      "Excellent writing, research, and communication skills.",
      "Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.",
      "Commitment to public service and the values of Congressman Wittman.",
      "Virginia ties Preferred"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and references to Carolyn.King@mail.house.gov with the subject line “Legislative Director Application.”",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-038-25",
    "position_title": "Communications Director",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks an experienced and creative Communications Director to join her Washington, D.C. office. The ideal candidate should have experience working on Capitol Hill, possess strong written and oral communication skills, have demonstrated political instincts with a thorough knowledge fostering and maintaining relationships with press. They should be a team player who is self-motivated, detailed oriented, comfortable managing multiple projects under strict deadlines and able to explore innovative approaches to traditional communications.\n\nThis position will act as chief spokesperson for the Member, develop and execute strategic communications plans, and work closely with the Communications Team. This is not an entry level position. Candidates must have previous communications and press related experience. Connecticut ties are a preferred but not required. This is a senior level position and only applicants who meet all qualifications will be considered.",
    "responsibilities": [
      "Lead strategy development and implementation of the Member’s communications objectives in consultation with senior sta];",
      "Oversee day-to-day press activities, including responding to media inquiries, booking interviews, and pitching to media outlets;",
      "Produce press releases, speeches, op-eds, talking points, and statements;",
      "Develop and execute press conferences and public events centered around core messaging areas;",
      "Advance and sta] the Member at media events and other commitments, including nights and weekends;",
      "Develop social media content creation, including rapid response;",
      "Produce franked communications, including 499s and mailers;",
      "Stay up to date on current events and legislation relevant to the Member and the priorities of the district; and",
      "Assist the Member and senior sta] in other projects and duties as assigned."
    ],
    "qualifications": [
      "Capitol Hill or political experience or a demonstrated knowledge of Congress and the legislative process;",
      "3-4 years of experience, with on the record experience as a press secretary or other communications role;",
      "Superior writing, editing, and oral communications skills;",
      "Creative thinker with innovative approaches and an understanding of traditional communications and digital media;",
      "Ability to work collaboratively and courteously with others;",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response;",
      "Careful attention to detail;",
      "Availability to work non-traditional hours; and",
      "Experience working with stakeholders on messaging opportunities and priorities."
    ],
    "how_to_apply": "Interested parties should e-mail a concise cover letter including salary requirements, a resume, and two writing samples to CT05jobs@mail.house.gov with the following subject line: Full Name – Communications Director. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Women, minorities and candidates with Connecticut ties are strongly encouraged to apply."
  },
  {
    "id": "MEM-036-25",
    "position_title": "Legislative Director Job Listing",
    "office": "Midwest Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "A conservative Midwest Member of Congress has an immediate need to hire an experienced full-time Legislative Director in the Washington, D.C. office. Interested candidates are encouraged to email their resume, cover letter, and references to ConservativeRep@mail.house.gov. Please use ‘Legislative Director’ as the subject line, and in the body of the email, please indicate where you found this job description.",
    "responsibilities": [
      "This Legislative Director plays an essential leadership role in the office. This position works closely with the Chief of Staff in assisting with the formulation of the Member’s policy and legislative strategy and moving the Member’s legislation.",
      "The Legislative Director will also work with the Communications Director to ensure that the Member’s legislative strategy is incorporated into the office’s communications plan.",
      "Additionally, the Legislative Director may also manage and oversee the performance of the legislative team."
    ],
    "qualifications": [
      "Prior Legislative Director Experience",
      "Proficient at moving legislation",
      "Capitol Hill experience",
      "Great writer",
      "Management Experience",
      "Proficient at Microsoft suite",
      "Detail oriented",
      "Multitasker"
    ],
    "how_to_apply": "Interested candidates are encouraged to email their resume, cover letter, and references to ConservativeRep@mail.house.gov. Please use ‘Legislative Director’ as the subject line, and in the body of the email, please indicate where you found this job description.",
    "salary_info": null,
    "contact": "ConservativeRep@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-035-25",
    "position_title": "Professional Sta5 Member",
    "office": "House Committee on Veterans' A]airs (Majority), Subcommittee on Health",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "The Majority sta] of the House Committee on Veterans' A]airs is seeking a Professional\nSta] Member for the Subcommittee on Health. This position will support the\nSubcommittee Sta] Director in conducting oversight of and drafting legislation related to\nthe Department of Veterans A]airs' (VA) including its Veterans Health Administration (VHA),\nthe largest integrated health care system in the United States, providing care at 1,380\nhealth care facilities. The role involves research, drafting legislation, leading oversight\nincluding trips to VA facilities, leading engagements with outside stakeholders, and other\nduties as assigned. Candidates with healthcare experience or prior medical experience are\nstrongly preferred. Veterans are strongly encouraged to apply. This is a full-time, on-site\nposition in Washington, DC. Some domestic travel is required.",
    "responsibilities": [
      "Leading oversight including organizing and participating in meetings, drafting memos,\nreading documents, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities.",
      "Leading legislation drafting e]orts.",
      "Representing the Committee including meeting with other congressional sta], veteran\nservice organizations, and external healthcare stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta] Director, Committee Sta]\nDirector, or Committee Deputy Sta] Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Post-graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Problem solving skills",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Qualiﬁed candidates should send their resume to VAR.Resumes@mail.house.gov with\n“Health PSM” in the subject line. Please include a short description of why you are\ninterested in the position in the body of the email. Writing and editing tests, and references\nmay be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of\nRepresentatives is an equal opportunity employer. All applicants will be considered\nwithout regard to race, color, national origin, religion, sex (including marital or parental\nstatus), disability, or age. Transportation and all related travel expenses associated with the\ninterview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-029-25",
    "position_title": "Speechwriter",
    "office": "Office of Democratic Leader Hakeem Jeffries",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The O]ice of Democratic Leader Hakeem Je]ries seeks an exceptional writer and\nresearcher to support all aspects of a fast-paced communications operation. Job\nresponsibilities include drafting written remarks, talking points, press statements and\nmore. Candidates should have experience writing ﬂawless public-facing remarks and\nstatements for a principal. This o]ice is an equal opportunity employer committed to a\ndiverse and inclusive workforce and does not discriminate on the basis of race, sex, color,\nage, religion, national origin, sexual orientation, gender identity or disability. Women and\nminority applicants are encouraged to apply.",
    "responsibilities": [
      "drafting written remarks",
      "talking points",
      "press statements"
    ],
    "qualifications": [
      "experience writing ﬂawless public-facing remarks and statements for a principal"
    ],
    "how_to_apply": "To apply, please send PDFs of resume, cover letter, three writing samples (including at least\none set of remarks written for a principal), and three professional references\nto resumes.je]ries@mail.house.gov with your name and “Speechwriter” in the subject\nline. Absolutely no phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "resumes.je]ries@mail.house.gov",
    "equal_opportunity": "This o]ice is an equal opportunity employer committed to a\ndiverse and inclusive workforce and does not discriminate on the basis of race, sex, color,\nage, religion, national origin, sexual orientation, gender identity or disability. Women and\nminority applicants are encouraged to apply."
  },
  {
    "id": "MEM-028-25",
    "position_title": "Content Partnership Manager",
    "office": "The House Democratic Policy and Communications Committee",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The House Democratic Policy and Communications Committee seeks a Content\nPartnership Manager. This role is at the intersection of digital media and political\ncommunications, with a focus on supporting Democratic Members of Congress and\namplifying their voices by building and managing relationships with digital creators,\nstreamers, and podcasters and ensuring e]ective engagement with national and local\naudiences across various platforms.",
    "responsibilities": [
      "Identify, cultivate, and manage relationships with creators, streamers, and\npodcasters. Use these relationships to act as a liaison between content creators\nand Members of Congress to facilitate meaningful interactions on political and nonpolitical topics.",
      "Secure opportunities for Members of Congress to appear on local and national\ndigital platforms and ensure e]ective messaging and maximum audience\nengagement. This will include coordinating logistics for creator-driven content and\nevents around key legislative proceedings and moments such as joint congressional\naddresses.",
      "Support Members and sta] with best practices on engaging with digital media on\ntheir own, with a particular focus on strategies to connect Members of Congress\nwith local and regional creators, streamers, and podcasters to amplify legislative\npriorities and personal stories.",
      "Develop and manage a robust data analytics program to track Members of\nCongress’ engagement with digital creators, streamers, and podcasters and use the\nﬁndings to direct their work to bolster Caucus-wide digital partnerships."
    ],
    "qualifications": [
      "A minimum of 3-5 years of experience in digital communications, political\ncommunications, public relations, or a related ﬁeld",
      "A proven track record of managing partnerships or relationships with digital creators\nor inﬂuencers.",
      "Strong understanding of social media platforms, trends, and digital audience\nengagement.",
      "Excellent written and verbal communication skills.",
      "Ability to manage multiple projects in a fast-paced environment and meet tight\ndeadlines."
    ],
    "how_to_apply": "To apply, please send PDFs of resume, cover letter, and three professional references\nto resumes.je]ries@mail.house.gov with your name and “Content Partnership Manager” in\nthe subject line. Absolutely no phone calls or drop-ins.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "resumes.je]ries@mail.house.gov",
    "equal_opportunity": "This o]ice is an equal opportunity employer committed to a diverse and inclusive\nworkforce and does not discriminate on the basis of race, sex, color, age, religion, national\norigin, sexual orientation, gender identity or disability. Women and minority applicants are\nencouraged to apply."
  },
  {
    "id": "MEM-034-25",
    "position_title": "Contracts Investigator",
    "office": "House Committee on Veterans' A5airs (Majority)",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "The House Committee on Veterans' A]airs Majority sta] seeks a subject matter expert on government procurement, contracting, and acquisition.",
    "responsibilities": [
      "Under the supervision of the General Counsel for the Committee, the individual will conduct oversight and develop policies relating to Department of Veterans A]airs (VA) procurement, contracting, and acquisition.",
      "The responsibilities encompass the entire VA, which includes the Veterans Beneﬁts Administration, Veterans Health Administration, National Cemetery Administration, and VA Central O]ice organizations. This also covers a wide range of activities such as small-dollar procurement, contracting by negotiation, major acquisition, Federal Supply Schedules, category management, construction, leasing, information technology, health care, research and development, and small business.",
      "Collect technical information and translate it into brieﬁngs, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Meet with congressional sta], veteran service organizations, industry organizations, and internal and external stakeholders.",
      "Perform other duties as assigned by the General Counsel, Committee Deputy Sta] Director, and Committee Sta] Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Work experience in procurement operations, preferably as a contract specialist or contracting o]icer in a federal agency",
      "Command of the Federal Acquisition Regulation and familiarity with major procurement laws",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume to VAR.Resumes@mail.house.gov with “Contracts Investigator “in the subject line. Writing samples and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Veterans are strongly encouraged to apply. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-033-25",
    "position_title": "Scheduler",
    "office": "Office of Congresswoman Alma S. Adams (NC12)",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "The Office of Congresswoman Alma S. Adams (NC12) seeks an experienced, highly organized, and detail-oriented Scheduler for her Washington, DC office. This is not an entry-level position. The ideal candidate will possess exceptional time management skills, the ability to prioritize and manage competing demands, and the capacity to perform well under pressure in a fast-paced environment. The Scheduler is responsible for managing the Congresswoman’s complex schedule, organizing official travel, and acting as a liaison with various stakeholders, including constituents, fellow Members of Congress, distinguished guests, and leaders from public, private, and nonprofit sectors.\n\nThe Scheduler will work closely with the Member, Chief of Staff, and Deputy Chief of Staff/District Director to ensure the smooth coordination of the Member's day-to-day activities and long-term commitments.",
    "responsibilities": [
      "Scheduling & Coordination:",
      "Manage and maintain the Congresswoman’s daily and long-term schedule, ensuring all appointments, meetings, events, and travel are accounted for.",
      "Receive, prioritize, and organize incoming scheduling requests from internal and external stakeholders.",
      "Communicate with external organizations, constituents, and other congressional offices to coordinate scheduling requests, events, and meetings.",
      "Maintain flexibility to accommodate changes to the schedule throughout the day and ensure the Congresswoman is briefed on updates in real time.",
      "Ensure that all meetings, events, and activities are properly logged and tracked.",
      "Travel & Logistics:",
      "Coordinate all travel arrangements for the Congresswoman, including transportation, lodging, and related logistics.",
      "Work with the Chief of Staff and Deputy Chief of Staff to coordinate travel schedules and ensure seamless transitions between office duties and travel commitments.",
      "Manage travel-related expenses, including collecting receipts and submitting for reconciliation with the financial administrator.",
      "Briefing & Preparation:",
      "Work with the Member and relevant staff to prepare daily briefing materials, including key meeting objectives, background information, and travel logistics.",
      "Provide daily and weekly briefings to the Congresswoman on upcoming events, meetings, and other scheduling matters.",
      "Liaison & Communication:",
      "Serve as the primary point of contact for coordinating scheduling with key stakeholders, including Members of Congress, Congressional staff, government officials, donors, advocates, and other influential partners.",
      "Ensure timely and professional communication with constituents, including responding to scheduling inquiries and arranging meetings or office visits as appropriate.",
      "Collaborate with other congressional offices, leadership staff, and external organizations to ensure seamless scheduling and minimize conflicts.",
      "Administrative Support:",
      "Track and manage the Congresswoman’s messages, telephone calls, and emails as requested, ensuring timely follow-up, follow-through and prioritization.",
      "Assist with administrative tasks as needed, including drafting correspondence, managing schedules, and other office support functions."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a cover letter, a resume, and three references to NC12.resume@mail.house.gov with “[NAME] –Scheduler” in the subject line.",
    "salary_info": "Salary: commensurate with experience.\nBenefits: Eligible for transit benefits, student loan repayment assistance, and other standard congressional office benefits. Additional benefits to be discussed during the interview process.",
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-032-25",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Janelle Bynum (OR-5)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Janelle Bynum (OR-5) seeks a Legislative Assistant to join her Washington, D.C. office. The position will primarily be responsible for managing an active policy portfolio based on both the office’s needs and the selected candidate’s interests.\n\nThe Congresswoman’s priorities include advocating for family-first policies, lowering the cost of living, promoting economic growth, and making government work better for all Americans. This position will not handle the House Financial Services Committee portfolio.",
    "responsibilities": [
      "Develop legislative initiatives and collaborate closely with the legislative and communications teams to advance the Congresswoman’s priorities.",
      "Monitor legislative developments in Congress and the Administration and provide vote recommendations.",
      "Meet with constituents and advocacy groups, draft briefing materials, and prepare talking points.",
      "Staff the Congresswoman at relevant meetings and events.",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "This is not an entry-level position and previous relevant policy and/or Capitol Hill experience is required.",
      "Oregon-ties are a plus.",
      "Preference will be given to candidates who understand the appropriations process, have a customer service-first attitude, and can anticipate the evolving needs of a battleground member.",
      "Successful candidates are those who have a constant appetite to learn about legislative processes, possess entrepreneurial skills, and demonstrate the ability to adapt to the fast-paced environment of a new member office."
    ],
    "how_to_apply": "To apply, please send in a single PDF: cover letter, resume, and contact information for three professional references to BynumOregonJobs@gmail.com with the subject line “Legislative Assistant – [Your Name].” The office will contact the most qualified candidates to begin the interview process on a rolling basis.",
    "salary_info": null,
    "contact": "BynumOregonJobs@gmail.com",
    "equal_opportunity": "Our office is committed to diversity and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, disability, age, or national origin. We encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-030-25",
    "position_title": "Legislative Assistant / senior LA / policy advisor",
    "office": "Representative Jill Tokuda (D-HI-02)",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "Representative Jill Tokuda (D-HI-02) seeks an experienced candidate for a Legislative Assistant / senior LA / policy advisor to lead her work on the House Agriculture Committee. This portfolio will consist of other topics that may include energy, the environment, financial services, and other economic issues.\n\nThis is not an entry-level position and will report to the legislative director.",
    "responsibilities": [
      "Staffing the Representative",
      "Monitoring committee and Floor activities",
      "Developing and advancing legislative initiatives",
      "Reviewing constituent correspondence",
      "Coordinating with the communications team and District Office",
      "Representing the member and the office at events and meetings"
    ],
    "qualifications": [
      "At least two years of substantive policy experience and work on the Hill.",
      "Strong communication skills",
      "Relevant policy experience",
      "A positive and can-do attitude",
      "A willingness to work in a fast-paced, collaborative environment"
    ],
    "how_to_apply": "Please send a cover letter, resume, two writing samples, and a list of three references in a single PDF to hawaii02jobs@gmail.com with “Agriculture Legislative Staffer – [Last Name, First Name]” in the subject line.",
    "salary_info": "Salary and title will be commensurate with experience and qualifications.",
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-026-25",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Congressman Greg Steube",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "Congressman Greg Steube is seeking an experienced, highly motivated Communications Director to spearhead the office's strategic communications efforts. This individual will manage all aspects of media relations, content creation, and digital strategy. The ideal candidate will be an exceptional writer, a strong strategic thinker, and a skilled manager who thrives in a fast-paced environment.",
    "responsibilities": [
      "Pitch and book local and national media regularly to ensure strong and consistent coverage.",
      "Develop and maintain strong relationships with local and national press to amplify the Congressman's message.",
      "Create daily social media content (including graphic design) and write compelling statements, press releases, media advisories, op-eds, radio ad scripts, and the weekly newsletter.",
      "Draft talking points, speeches, and key messaging for public appearances and interviews.",
      "Oversee and manage a large communications budget, covering areas such as mass mailers, digital ads, radio ads, text messages, surveys, and email campaigns.",
      "Produce, edit, and clip video content for use on social media and other platforms."
    ],
    "qualifications": [
      "Proven experience in strategic communications, public relations, and/or media relations ideally in a political, public affairs, or government context.",
      "Strong writing, editing, and verbal communication skills, with the ability to craft concise, persuasive messaging under tight deadlines.",
      "Solid understanding of social media platforms, digital advertising, and video content creation.",
      "Strong organizational, time-management, and project management skills with the ability to juggle multiple priorities simultaneously.",
      "Experience managing budgets and working with vendors, including for advertising and media buys.",
      "A self-starter who can work independently and as part of a dynamic team."
    ],
    "how_to_apply": "Interested applicants should send resume and cover letter to:",
    "salary_info": null,
    "contact": "Floridarepublicanjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-025-25",
    "position_title": "PRESS SECRETARY",
    "office": "The Office of Rep. French Hill (AR02)",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The Office of Rep. French Hill (AR02) seeks to fill the position of Press\nSecretary. Candidates should have at least three years of prior relevant experience in\ncommunications and / or press roles.\n\nThe Press Secretary is responsible for driving an established press strategy that combines\nboth local and national press goals. Responsibilities include overseeing the preparation of\nall communications materials and preparation of all digital, audio and print content,\nincluding graphics. Responsibilities also include managing media relations and developing\ncontacts with members of the media and community leaders. Where necessary, the Press\nSecretary acts as the formal spokesperson and media liaison for the Congressman.\n\nExcellent verbal and written communications skills are required, as are proficiency and\nflexibility with communications technologies. This role requires the production of\nnumerous types of communications products including press releases, op-eds, talking\npoints, newsletters, speeches, and social media posts. Having an established network of\nmedia contacts is a plus as is prior management experience.\n\nDesired attributes include the ability to thrive in a fast-paced environment and an\nopenness to learning new technologies and communications tools. The Press Secretary is\na member of the Senior Staff team.",
    "responsibilities": [
      "Overseeing the preparation of all communications materials and preparation of all digital, audio and print content, including graphics.",
      "Managing media relations and developing contacts with members of the media and community leaders.",
      "Acting as the formal spokesperson and media liaison for the Congressman."
    ],
    "qualifications": [
      "At least three years of prior relevant experience in communications and / or press roles.",
      "Excellent verbal and written communications skills are required, as are proficiency and flexibility with communications technologies.",
      "This role requires the production of numerous types of communications products including press releases, op-eds, talking points, newsletters, speeches, and social media posts.",
      "Having an established network of media contacts is a plus as is prior management experience.",
      "The ability to thrive in a fast-paced environment and an openness to learning new technologies and communications tools."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to ar02.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ar02.applications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-25",
    "position_title": "FIELD REPRESENTATIVE",
    "office": "Senior Democratic Member of Congress",
    "location": "Santa Rosa, California, to cover the town of Sonoma",
    "posting_date": "2025-02-10",
    "description": "Senior Democratic Member of Congress seeks Field Representative for office in Santa\nRosa, California, to cover the town of Sonoma. The Field Representative serves as the\nMember's community representative for issues and programs within their assigned areas,\nincluding monitoring and updating the Member and their colleagues on important local\nissues, emerging trends, and critical developments. They also represent the Member at\ncommunity events and meetings, schedule the Member while in the district, prepare and\nattend meetings and events with the Member, answer casework correspondence and\nverbal communications with constituents, act as liaison with federal, district, and local\nagencies for the Member and constituents, and other duties important to serving the\npeople of the congressional district.",
    "responsibilities": [
      "Coordinates with the Member and colleagues to ensure outreach efforts align with the Member’s strategic vision, goals, and priorities",
      "Collaborates with district and D.C. colleague to ensure district priorities are aligned and inform the Member’s legislative strategy",
      "Serves as a liaison with federal government entities for individual constituent concerns, including the handling of constituent casework",
      "Collaborates with colleagues to schedule the Member while in their assigned areas in the district",
      "Assesses casework trends and identifies issues requiring legislative action and/or additional Congressional oversight",
      "Informs the Member and colleagues on any important developments and current events impacting the district",
      "Builds and maintains positive relationships with constituents, key community leaders, and other stakeholders",
      "Tracks news stories and social media posts for the Member and colleagues, including the communications team",
      "Acts as a liaison to local, state, and federal officials and stakeholders to form effective relationships for the Member",
      "Attends events to serve as a representative for the Member, as determined by their supervisor",
      "Handles various community issues in accordance with office policies and procedures.",
      "Support Office in executing public meetings and annual Congressional activities such as the Congressional Art Competition, Congressional App Competition, and other similar events.",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner",
      "Understands differing perspectives and opinions to navigate conflicts and develop solutions effectively"
    ],
    "qualifications": [
      "Candidates must be a self-starter, hard-working, highly dependable, adaptable, and organized as well as possess strong oral and written communication skills and the ability to work quickly under pressure.",
      "Good judgment, strong customer service and interpersonal skills, ability to develop and collaborate with coalitions, works well in a team environment, a passion for public service, and availability to work evenings and weekends are required.",
      "Driver’s license and access to vehicle is required.",
      "Bachelor's degree or equivalent combination of education and experience preferred.",
      "Prior experience developing a community relations strategy for a Member of Congress, elected official, or Federal agency is preferred.",
      "Familiarity with Member's district, especially Rohnert Park, Cotati, and Penngrove, is preferred.",
      "Ability to communicate in multiple languages, especially Spanish, is highly desirable."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples and three references to ca04districtstaff@gmail.com with the Subject Line: Field Representative Vacancy.",
    "salary_info": "$59,540 - $68,093",
    "contact": "ca04districtstaff@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-022-25",
    "position_title": "DISTRICT CASEWORKER (Social Security and Medicare)",
    "office": "Congresswoman Madeleine Dean (PA-04)",
    "location": "Glenside, PA",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Madeleine Dean (PA-04) seeks a motivated and organized individual to join her team as a Congressional Caseworker based in Glenside, PA. This position serves as a liaison to federal, district, and local agencies on behalf of the Member and her constituents. The Caseworker will handle a portfolio of issue areas while serving as the lead on all Social Security and Medicare concerns through casework correspondence and verbal communication with constituents.",
    "responsibilities": [
      "Acts as the representative for the Member in the realm of Social Security and Medicare including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with other federal, district, and local agencies.",
      "Informs the Member and District Director of all happenings in his or her assigned issue areas.",
      "Handles and prioritizes casework assignments while assisting with general intake, constituent services requests, and communication in an office environment.",
      "Assesses casework inquiries for problems requiring legislative action and makes recommendations to the District Director and Chief of Staff.",
      "Screens and refers cases, when appropriate, to other district offices.",
      "Logs all incoming and outgoing mail and telephone calls relating to casework in Customer Relationship Management (CRM) system.",
      "Prepares periodic reports for the Casework Manager on pending cases and district activities in his or her assigned issue areas.",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner.",
      "Maintains up-to-date files on all cases and issues of importance to the office.",
      "Maintains a good working relationship with the Member, staff, and constituents.",
      "Accepts performance-based criticism and directions.",
      "Works well under pressure and handles stress.",
      "Performs other duties as assigned.",
      "Works Monday – Friday 8:30am – 4:30pm, with occasional nights and weekends for town hall meetings and other special events."
    ],
    "qualifications": [
      "Strong oral and written communication skills.",
      "Knowledge of legislative process and of House organization and procedures.",
      "Knowledge of local, state, and federal agencies and departments—especially regarding Social Security and Medicare programming.",
      "Professional telephone manner.",
      "Strong organization and follow-up skills.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others.",
      "Thoroughness and careful attention to detail.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Knowledge of office policies, practices, and procedures.",
      "Knowledge of office computer applications.",
      "Proficiency in word processing as well as with office equipment: scanner, copier, printer, desktop computer."
    ],
    "how_to_apply": "All interested candidates should email a resume and cover letter directly to mdeanhiring@gmail.com with the subject line “Caseworker – [Applicant’s Last Name]",
    "salary_info": null,
    "contact": "mdeanhiring@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-021-25",
    "position_title": "Communications Director, House Committee on Veterans’ A]airs Democratic Sta]",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The Democratic Sta] of the House Committee on Veterans’ A]airs seeks a\nCommunications Director to implement the Ranking Member’s Committee\ncommunications strategy.",
    "responsibilities": [
      "Serve as primary communications advisor for the Ranking Member and Democratic Committee Sta]",
      "Manage the execution of the communications strategy",
      "Oversee day-to-day press activities, including responding to media inquiries, booking interviews, and pitching news stories to media outlets",
      "Work with policy leads to develop core messaging and talking points",
      "Produce press releases, speeches, op-eds, and materials that are at or near ﬁnished product",
      "Supervise other press sta]",
      "Assist with the development of talking points, remarks, statements, press releases, advisories, and caucus messaging guides",
      "Assist with the coordination, preparation, and execution of media interviews, speaking engagements, and press conferences",
      "Monitor and track media appearances, manage media relationships, and work with policy subject matter experts to identify opportunities for media engagement",
      "Assist with rapid response e]orts",
      "Coordinate with Committee Member o]ices on any press related needs",
      "Sta] Ranking Member at press events"
    ],
    "qualifications": [
      "Superior writing, editing, and oral communications skills",
      "Creative thinker with innovative approaches and an understanding of digital media",
      "Ability to work cooperatively and courteously with others",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response",
      "Thoroughness and careful attention to detail.",
      "Availability to work non-traditional hours"
    ],
    "how_to_apply": "All candidates are required to complete an online application at https://democratsveterans.house.gov/opportunities to be considered for this position. There you can upload your resume, cover letter, and two professional writing samples.",
    "salary_info": "Salary range $90K-$110K, commensurate with experience.",
    "contact": null,
    "equal_opportunity": "To build a diverse and more inclusive work environment, veterans, minorities, women, people with disabilities, and LGBTQ+ candidates are encouraged to apply."
  },
  {
    "id": "MEM-019-25",
    "position_title": "Press Assistant",
    "office": "The Energy and Commerce Committee Democratic Sta",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The Energy and Commerce Committee Democratic Sta] seeks a motivated and\nhardworking communications professional to join fast-paced communications team as a\nPress Assistant.",
    "responsibilities": [
      "Drafting press releases, social media posts, talking points, and the committee\nnewsletter",
      "Designing graphics for both social media and web content",
      "Producing and editing videos and photos",
      "Monitoring social media",
      "Maintaining and updating press lists",
      "Compiling daily press clips"
    ],
    "qualifications": [
      "Excellent written and oral communication skills, a proven\nability to perform under pressure while juggling multiple tasks and sound political\njudgment",
      "Prior Hill or campaign communications experience, as well as professional social media\nand digital experience (including graphic design and photo and video editing), is preferred."
    ],
    "how_to_apply": "Qualiﬁed candidates should submit a cover letter, resume, one writing sample, and two\ndigital samples to ecdjobs@mail.house.gov. Please no walk ins or phone calls.",
    "salary_info": "$65,000",
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Our o]ice deeply values the diversity of our employees and encourages candidates from\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-016-25",
    "position_title": "Senior Legislative Assistant",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "The Office of Congresswoman Pramila Jayapal (WA-07) is seeking an experienced Senior Legislative Assistant to handle a comprehensive portfolio that could include the following issues: education, childcare, tax, financial services, housing, healthcare, labor, transportation, commerce and small business. The issue set will depend on the candidate's experience and interests. We encourage individuals with legislative, research and writing experience to apply and we will discuss the issue set more in depth through the interview process.\n\nThis position requires the ability to advance Congresswoman Jayapal's legislative priorities in their issue portfolio. The ideal candidate will come with previous legislative experience, including the knowledge and abilities to drive issues with traditional legislative tools (i.e. committee work, bill introductions) as well as organizing tools (i.e. events with partners, in district town halls).",
    "responsibilities": [
      "Driving current and new legislative initiatives including idea generation, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets;",
      "Preparing and staffing the Congresswoman for relevant committee hearing and markups; drafting hearing remarks and questions;",
      "Representing the Congresswoman's priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal",
      "stakeholders including advocacy organizations; academics; fellow",
      "Congressional and Committee offices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "4 -6 years of relevant experience including policy development and analysis; issue advocacy; and strategic planning;",
      "Passionate about public service and committed to progressive values;",
      "Excellent writing and time management skills;",
      "Ability to digest new content with a political and ideological lens that is appropriate for the office;",
      "Poised, level-headed, flexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Candidates should submit their resume, cover letter, two writing samples, and references in PDF format to jobs.pramila@mail.house.gov with “Legislative Assistant: [Applicant’s First and Last Name]” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus. Prior Hill experience is strongly preferred."
  },
  {
    "id": "MEM-015-25",
    "position_title": "Senior Legislative Assistant",
    "office": "Congresswoman Summer L. Lee (D-Pittsburgh)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Summer L. Lee (D-Pittsburgh) has an immediate need to hire an experienced legislative staffer to serve as the office’s Senior Legislative Assistant. This full-time, exempt position is based in the Washington, D.C. office. The Senior LA will be responsible for staffing the Education and Workforce Committee as well as handling a diverse portfolio of issue including science, space, and technology; financial services; small business; banking; insurance; taxes; telecommunications; international affairs; defense; veterans; and economic development. Additional issue areas may be assigned as needed. This is not an entry-level position. The ideal candidate will have prior legislative experience and a demonstrated ability to translate policy ideas into successful legislative outcomes. District or state ties are a plus.\n\nThe Legislative Assistant serves as the Member's primary expert on an assigned set of public policy issues and works closely with the Legislative Director and Chief of Staff to develop and execute a coordinated legislative strategy for the Member. This position also prepares the Member for Committee hearings and markups and attends meetings with constituents, visitors, and other key stakeholders. This is not an entry-level position. The ideal candidate will have prior legislative experience and a demonstrated ability to translate policy ideas into successful legislative outcomes.",
    "responsibilities": [
      "Collaborate with the Legislative Director and Chief of Staff to formulate and advance legislative initiatives for assigned issue areas",
      "Plans, coordinates, and schedules to introduce legislation in the House (or offering it on an appropriate vehicle if it is in an amendment)",
      "Developing and analyzing legislation and policy",
      "Drafting remarks, talking points, and memos",
      "Prepares briefing materials for Member in advance of committee hearings, markups, and meetings",
      "Building and maintaining strong relationships with constituent and stakeholder groups",
      "Drafting letters to stakeholders, the Administration, and other Members",
      "Staffing the Congresswoman in meetings, events, hearings, and markups",
      "Managing multiple projects in a fast-paced environment.",
      "Considers and addresses differing perspectives and opinions to navigate conflicts and develop solutions effectively",
      "Tracks legislation and other developments in assigned issue areas to brief the Member for floor work, committee work, and work in the district",
      "Provides information to generate ideas and make decisions pertaining to press, mass mailings, and newsletters",
      "Provides district office staff with targeted information to assist preparation for community events and town hall meetings",
      "Provides input to assist the Communications Director with draft speeches, press releases, op-eds, and Congressional Record statements for the Member",
      "Assists LC in the answering of constituent letters in assigned issue areas and assists constituents with federal matters",
      "Acts as a liaison with committee and Federal departments/agencies to communicate and coordinate information regarding specific legislative matters when assigned"
    ],
    "qualifications": [
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Legislative Knowledge: Applies understanding of laws, legal codes, precedents, legislative practices and documents, Government regulations, Executive orders, Government organization and functions, and the democratic political process.",
      "Coalition Build"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume, and two writing samples in a single pdf by 1/26/25 to PA12Jobs@mail.house.gov. Please include “Ed & Labor Senior LA– [your name]” in the subject line. The office will contact the best qualified candidates to begin our interview process on a rolling basis.",
    "salary_info": "$68,000 - $78,000, commensurate with experience",
    "contact": "PA12Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-013-25",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Sarah McBride (DE-AL)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Sarah McBride (DE-AL) is seeking a Legislative Assistant for her Washington, D.C. office. This position will focus on a diverse legislative portfolio, including the Congresswoman's work on the Science, Space, and Technology Committee.\n\nThe ideal candidate will be a self-starter with strong writing, research, and communication skills, capable of producing high-quality work in a fast-paced environment. This is not an entry-level position. Previous legislative experience in a congressional office is required. A positive attitude, attention to detail, the ability to thrive in a collaborative team environment, and a good sense of humor are essential.",
    "responsibilities": [
      "Collaborate with the Congresswoman, Legislative Director, additional staff, other hill offices, and stakeholders to develop and advance legislative initiatives within the assigned diverse legislative portfolio.",
      "Staff the Congresswoman for her work on the Science, Space, and Technology Committee, including writing remarks, managing relationships, and advancing legislation.",
      "Research and track legislation, coordinate bill co-sponsorships, and monitor relevant committee and floor activities.",
      "Draft policy memos and briefing materials for the Congresswoman and senior staff.",
      "Brief the Congresswoman on legislative matters and assist in preparing her for hearings, markups, and meetings.",
      "Represent the Congresswoman in meetings with constituents, advocacy organizations, and industry stakeholders.",
      "Support state office staff by providing relevant legislative updates and assisting with local initiatives.",
      "Perform additional responsibilities as assigned."
    ],
    "qualifications": [
      "Legislative experience in a congressional office.",
      "Strong written and verbal communication skills.",
      "Ability to exercise sound judgment, make decisions under pressure, and navigate challenging situations.",
      "Excellent organizational and time management skills to manage multiple projects simultaneously."
    ],
    "how_to_apply": "Applicants should email their resume and a cover letter to DEResumes@sarahmcbride.com with \"Legislative Assistant\" in the subject line.",
    "salary_info": null,
    "contact": "DEResumes@sarahmcbride.com",
    "equal_opportunity": "The office of Congresswoman Sarah McBride is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-012-25",
    "position_title": "Operations Assistant/Legislative Correspondent",
    "office": "Congresswoman Shontel M. Brown (OH-11)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Shontel M. Brown (OH-11) is seeking a full-time Operations Assistant/Legislative Correspondent in her Washington, D.C. o]ice. The position reports to the Administrative Director and Legislative Director. Responsibilities include logging phone calls, greeting visitors, managing front o]ice operations, handling tour and ﬂag requests, assisting with drafting constituent correspondence and managing the mail program, overseeing the intern program, providing administrative support to the team, and additional duties as assigned. A successful candidate will have excellent writing and proofreading ability, outstanding organizational and time management capacity, strong attention to detail, and the ability to work independently. Ohio ties are a plus.",
    "responsibilities": [
      "logging phone calls",
      "greeting visitors",
      "managing front o]ice operations",
      "handling tour and ﬂag requests",
      "assisting with drafting constituent correspondence and managing the mail program",
      "overseeing the intern program",
      "providing administrative support to the team",
      "additional duties as assigned"
    ],
    "qualifications": [
      "excellent writing and proofreading ability",
      "outstanding organizational and time management capacity",
      "strong attention to detail",
      "the ability to work independently",
      "Ohio ties are a plus"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume, and writing sample to Ohio11resumes@mail.house.gov with the subject \"Operations Assistant/Legislative Correspondent: Last Name, First Name\".",
    "salary_info": null,
    "contact": "Ohio11resumes@mail.house.gov",
    "equal_opportunity": "Our o]ice is an equal opportunity employer and does not discriminate on the basis of race, sex, color, religion, national origin, age, gender identity, sexual orientation, marital or parental status, or disability. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-011-25",
    "position_title": "Outreach Coordinator",
    "office": "Congressman Greg Stanton",
    "location": "Mesa District Office, 4th Congressional District",
    "posting_date": "2025-02-10",
    "description": "Congressman Greg Stanton seeks a motivated Outreach Coordinator (full-time) in his Mesa District O]ice to implement a strong constituency-based outreach program in the 4th Congressional District. This position will help build and maintain relationships with key stakeholders and work to address local issues on the federal level.\n\nAn ideal candidate will have:",
    "responsibilities": [
      "Act as the representative for the Congressman within their area of responsibility including answering correspondence, occasionally speaking at events, meeting with constituents, and communicating with local stakeholders",
      "Inform the District Director of all happenings in their assigned issue areas by screening district media sources and interacting with constituents",
      "Coordinate and organize meetings and events with local stakeholders in their assigned issue areas for the Congressman",
      "Serve as a liaison to local, state, and federal o]icials and other people or groups to form e]ective relationships for the Congressman",
      "Work with other district and DC sta] to identify and promote the Congressman’s legislative agenda",
      "Track legislation, Dear Colleague Letters, and other developments in their assigned issue areas and use this information to keep constituencies apprised and connected to the Congressman’s work."
    ],
    "qualifications": [
      "Strong written and oral communications skills and the ability to work e]ectively in a fast-paced environment",
      "Experience developing and maintaining relationships with constituents and community leaders",
      "Ability to think strategically and creatively",
      "Strong decision-making skills",
      "Knowledge of issues and events in the district in which the Congressman has been involved as well as a good understanding of federal-level policy work",
      "Understanding of the federal legislative process as well as federal agencies and departments",
      "Previous experience working for an elected o]icial or as an issue/community organizer",
      "Ability to work cooperatively and courteously with others",
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Willingness to work evenings, weekends and irregular hours",
      "Ability to speak, read, and write in other languages is a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to AZ04resumes@gmail.com with the subject line “Outreach Coordinator.”",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "AZ04resumes@gmail.com",
    "equal_opportunity": "Congressman Stanton’s o]ice is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-010-25",
    "position_title": "Senior Outreach Coordinator",
    "office": "Congressman Greg Stanton",
    "location": "Mesa, Arizona",
    "posting_date": "2025-02-10",
    "description": "Congressman Greg Stanton seeks a highly motivated, detail-oriented Senior Outreach Coordinator (full-time) in his District O]ice in Mesa, Arizona, to plan, manage, and execute the outreach e]orts of the o]ice.",
    "responsibilities": [
      "Work with the Chief of Sta], District Director and Communications Director to plan, coordinate, and execute the o]ice’s outreach e]orts",
      "Develop, plan and execute meetings and events with local stakeholders for the Congressman",
      "Act as a representative for the Congressman, including answering correspondence, occasionally speaking at events, meeting with constituents, and routinely communicating with local stakeholders",
      "Serve as a liaison to local, state, and federal o]icials and other people or groups to form e]ective relationships for the Congressman"
    ],
    "qualifications": [
      "Strong written and oral communications skills and the ability to work e]ectively in a fast-paced environment",
      "Expertise in developing and maintaining relationships with constituents and community leaders",
      "Ability to think strategically and creatively",
      "Strong decision-making skills",
      "Knowledge of issues and events in the district in which the Congressman has been involved as well as a good understanding of federal-level policy work",
      "Understanding of the federal legislative process as well as federal agencies and departments",
      "Previous experience working for an elected o]icial or as an issue/community organizer",
      "Ability to work cooperatively and courteously with others",
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Flexibility to work evenings, weekends and irregular hours",
      "Ability to speak, read, and write in other languages is a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to AZ04resumes@gmail.com with the subject line “Senior Outreach Coordinator.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "AZ04resumes@gmail.com",
    "equal_opportunity": "Congressman Stanton’s o]ice is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-009-25",
    "position_title": "Digital Media Manager – Congressman Rob Wittman (VA-01)",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2025-02-10",
    "description": "The O]ice of Congressman Rob Wittman (VA-01) is seeking a digital media manager. This\nposition is responsible for developing a proactive constituent communications strategy\nand plan. They will work with the communications director to ﬁnd new ways to grow the congressman’s following, increase\nhis name ID in the district, and maintain synergy across communications materials.\n\nThis is not an entry-level position. A strong candidate will have 1-2 years of experience and\nwill be a creative, proactive communicator familiar with social media, the legislative\nprocess, website maintenance, as well as photography, graphic design, and video editing.\nExcellent writing and organization skills are required. An ability to multitask and work under\ntight deadlines is necessary. Candidates must have previous congressional or political\ncommunications experience; ties to Virginia are helpful but not required.",
    "responsibilities": [
      "Drafting press releases and talking points",
      "Writing email newsletters for targeted constituent coalitions",
      "Promoting the congressman’s district events and engagements",
      "Maintaining the communications content calendar",
      "Overseeing website management and updates",
      "Branding through graphic design and video/audio editing",
      "Managing social media accounts and analyzing their performance metrics",
      "Maintaining the Member’s photo and video database"
    ],
    "qualifications": [
      "1-2 years of experience",
      "Creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing",
      "Excellent writing and organization skills are required",
      "An ability to multitask and work under tight deadlines is necessary",
      "Previous congressional or political communications experience",
      "Ties to Virginia are helpful but not required"
    ],
    "how_to_apply": "Interested applicants should email a resume and two writing samples to Julianne.Heberlein@mail.house.gov with “Digital Media Manager” in the subject line.",
    "salary_info": null,
    "contact": "Julianne.Heberlein@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-008-25",
    "position_title": "District Special Assistant",
    "office": "Congressman Mike Flood (NE-01)",
    "location": "Norfolk, NE",
    "posting_date": "2025-02-10",
    "description": "The primary responsibility of the District Special Assistant is to transport the Member and other sta] members to meetings and appointments as necessary, deliver and pickup materials for the o]ice, sta] the Member at various meetings, and serve as a personal aide to the Member when he is in the district. When the Member is in DC, the Special Assistant will assist the district sta] with ﬁeld rep duties and casework.\n\n",
    "responsibilities": [
      "Transportation of the Member for their o]icial duties.",
      "Deliver and pickup materials for the o]ice, including letters, packages, and documents from other government agencies.",
      "Working with the Scheduler to be aware of the Member’s schedule.",
      "Running errands and assisting the District Director with supplies and other misc. administrative matters.",
      "Assisting in sorting and delivering mail.",
      "Sta]ing the Member at various meetings and events.",
      "Serving as a personal aide to the Member, tending to various needs as they arise while he is in the district.",
      "Assisting the Field Reps with events, meetings, and correspondence as necessary.",
      "Assisting with casework as necessary."
    ],
    "qualifications": [
      "Located in Norfolk, NE or willingness to relocate.",
      "Regular, predictable and punctual attendance at assigned locations required for performance of duties.",
      "Ability to communicate e]ectively with the Member and o]ice sta], Members and representatives from other o]ices, outside organizations, and others.",
      "Ability to work most weekends as the Member’s schedule dictates, with less work expected on weekdays when the Member is in DC.",
      "Ability to handle di]icult and sometimes tense interactions with members of the public, including constituents, with tact while also prioritizing the well-being of the Member.",
      "Work is public-facing and requires frequent interaction with members of the public, including constituents, in a courteous and tactful manner. Work requires extended and unscheduled hours as dictated by the Member’s schedule and o]ice needs.",
      "Work requires regularly driving the Member with the individual’s personal vehicle.",
      "Must possess a valid driver’s license and have a good driving record. A personal vehicle used to drive the Member is not necessarily required.",
      "Regularly lifts and moves luggage, books, ﬁles, documents, and other o]ice materials.",
      "Must be able to prioritize and perform duties under pressure in a fast-paced environment.",
      "Regularly use typical o]ice equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc."
    ],
    "how_to_apply": "Interested applicants should send their resume, cover letter, and references to FloodHiring@mail.house.gov",
    "salary_info": null,
    "contact": "FloodHiring@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-530-24",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial A]airs, House Committee on Veterans’ A]airs, Majority Sta]",
    "office": "Subcommittee on Disability Assistance and Memorial A]airs, House Committee on Veterans’ A]airs, Majority Sta]",
    "location": "Washington, DC",
    "posting_date": "2025-02-10",
    "description": "Provide administrative and research support to Subcommittee sta] and assists with duties as assigned.\n\nMaintain Subcommittee archives of activities, including Member and stakeholder engagements.\nTravel and conduct oversight visits at agency locations.\nDraft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.\nSubcommittee casework as assigned.\nAnswer telephone and respond to caller inquiries.\n\nKeep abreast of emails, including Member inquiries and agency notiﬁcations.\nOrganize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.\nParticipate in sta]-level discussions on legislation being considered; draft policy memoranda as assigned.\nAssist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.\nAssist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.\nAttend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.\nAssist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.\nReview the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and sta].\nAssist with developing policy recommendations and serve as a resource for Members both on and o] Committee.\nResponsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Sta] Director or Deputy Sta] Director, and Subcommittee Sta] Director, and assisting other Committee sta], as needed.\nThis is a full-time, on-site position in Washington, DC.",
    "responsibilities": [
      "Provide administrative and research support to Subcommittee sta] and assists with duties as assigned.",
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notiﬁcations.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in sta]-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and sta].",
      "Assist with developing policy recommendations and serve as a resource for Members both on and o] Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Sta] Director or Deputy Sta] Director, and Subcommittee Sta] Director, and assisting other Committee sta], as needed.",
      "This is a full-time, on-site position in Washington, DC."
    ],
    "qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Strong Microsoft O]ice proﬁciency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage ﬂuctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "how_to_apply": "Qualiﬁed candidates please send their cover letter, resume, and one (1) writing sample to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-523-24",
    "position_title": "Digital Assistant",
    "office": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "location": "Washington D.C.",
    "posting_date": "2025-02-10",
    "description": "This position involves creating and scheduling content for social media platforms, maintaining the committee’s website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\n\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor’s degree in communications, political science, or a related field is preferred.\n\nSalary is commensurate with experience, and the position includes a competitive benefits package.\n\nThis office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion,\nnational origin or citizenship status, sex, gender identity or expression, pregnancy, sexual\norientation, age, disability, or military status. Candidates with diverse backgrounds,\nwomen, people of color, and LGBTQIA+ candidates are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred)",
      "Proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva)",
      "Strong writing and editing skills",
      "Familiar with social media analytics and website content management systems",
      "Bachelor’s degree in communications, political science, or a related field is preferred"
    ],
    "how_to_apply": "To apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: \"[Name] – Digital Assistant Application.\" Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary is commensurate with experience, and the position includes a competitive benefits package.",
    "contact": "budget-democrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion,\nnational origin or citizenship status, sex, gender identity or expression, pregnancy, sexual\norientation, age, disability, or military status. Candidates with diverse backgrounds,\nwomen, people of color, and LGBTQIA+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-522-24",
    "position_title": "Press Secretary",
    "office": "Office of Congressman Pat Ryan (NY-18)",
    "location": "Washington DC",
    "posting_date": "2025-02-10",
    "description": "The Office of Congressman Pat Ryan (NY-18) seeks a Press Secretary based in the Washington DC office. Applicants should be prepared to join a highly-collaborative, highachieving team and possess an eagerness to grow and learn within the office. Ties to New York’s 18th District are a plus.\n\nThe ideal candidate should demonstrate excellent writing and editing skills in addition to a strong work ethic, good sense of humor, and keen attention to detail. The position will require working non-traditional hours.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Drafting talking points and op-eds",
      "Staffing the Congressman for interviews and media events",
      "Planning press conferences and in-district events",
      "Responding to press inquiries",
      "Maintaining relationships and booking interviews with local press outlets",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Excellent writing and editing skills",
      "Strong work ethic",
      "Good sense of humor",
      "Keen attention to detail"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, two writing samples, and three references in a single PDF to ny18resumes@mail.house.gov with the job title and your full name in the subject line (e.g.: “Press Secretary - Bryson Daily). No phone calls, faxes or drop-ins, please. Applications will be considered on a rolling basis.",
    "salary_info": "The salary range for this position is $60,000 - $80,000, commensurate with experience.",
    "contact": "ny18resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-517-24",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Susie Lee (D-NV)",
    "location": "DC",
    "posting_date": "2025-02-10",
    "description": "Congresswoman Susie Lee (D-NV) seeks a highly organized, good-humored, hard-working DC Scheduler to develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC. The DC Scheduler will report to the Chief of Staff and work closely with the Member, DC staff, and District staff, including a District-based scheduler responsible for in-district scheduling. This is not an entry-level role; prior scheduling experience is preferred, and salary will be commensurate with experience.\n\nResponsibilities also include tracking, evaluating, and responding to all invitations and scheduling requests, coordinating travel for the Member, compiling the Congresswoman’s nightly briefing materials, and managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties. Responsibilities will also include providing staffing support, including driving the Congresswoman as needed. Strong candidates will be creative problem solvers, have excellent attention to detail, communicate succinctly and effectively, and thrive in a fastpaced work environment. The position requires the ability to multi-task, work well under pressure, and the flexibility to be responsive to urgent scheduling needs on nights and weekends.",
    "responsibilities": [
      "Develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC.",
      "Track, evaluate, and respond to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Compiling the Congresswoman’s nightly briefing materials",
      "Managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties",
      "Providing staffing support, including driving the Congresswoman as needed."
    ],
    "qualifications": [
      "Prior scheduling experience is preferred",
      "Creative problem solvers",
      "Excellent attention to detail",
      "Communicate succinctly and effectively",
      "Thrive in a fast-paced work environment",
      "Ability to multi-task",
      "Work well under pressure",
      "Flexibility to be responsive to urgent scheduling needs on nights and weekends"
    ],
    "how_to_apply": "Candidates should submit in PDF format a resume, cover letter, and three references (including name, title and organization, phone number, email, and relationship to the candidate) to nv03resumes@gmail.com with the following subject line: “Full Name – DC Scheduler.”",
    "salary_info": "salary will be commensurate with experience.",
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-476-24",
    "position_title": "Legislative Assistant (LA)",
    "office": "Congressman Dan Crenshaw (R-TX-02)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-10",
    "description": "Congressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative Assistant (LA), based in our Washington, D.C. o]ice. This position reports to the Legislative Director. The LA will handle an economic facing portfolio, including Budget and Appropriations, Financial Services, and Tax, with other issues to follow.\nIdeal candidates will have strong written and oral communications skills and be detailoriented, organized, and creative. They must be able to quickly learn the member’s voice and think in a proactive, communications-focused manner.",
    "responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and sta]ing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas Working with external stakeholders, Congressional Research Service (CRS), Legislative Counsel, and committee sta] to draft legislation based on the Member’s priorities"
    ],
    "qualifications": [
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
      "Hill experience is required."
    ],
    "how_to_apply": "Qualiﬁed applicants should submit a resume and writing sample (no more than 3 pages) as one combined PDF to Kenneth.Depew@mail.house.gov. Include “Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on a rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "Kenneth.Depew@mail.house.gov",
    "equal_opportunity": null
  }
]