[
  {
    "id": "MEM-169-25",
    "position_title": "Senior Legislative Assistant or Legislative Assistant",
    "office": "The office of Representative Juan Vargas (CA-52)",
    "location": "DC",
    "posting_date": "2025-06-02",
    "description": "The office of Representative Juan Vargas (CA-52), a member of the Financial Services Committee and Ranking Member of the Task Force on Monetary Policy, Treasury Market Resilience, and Economic Prosperity, is seeking candidates to apply for an open Senior Legislative Assistant or Legislative Assistant position to handle a portfolio of domestic policy issues including, environment, energy, transportation, agriculture, SNAP, commerce, science, seniors, and social security, among others. This position will report to the Chief of Staff and Deputy Chief of Staff / Legislative Director.\n\nThe position will be based in DC and occasionally travel to San Diego, as needed.",
    "responsibilities": [
      "advancing the Member's priorities in the assigned issue areas;",
      "monitoring pending legislation and current events in assigned issue areas;",
      "drafting amendments, bills, oversight letters, talking points, and speeches within assigned issue areas;",
      "reviewing requests for the Member to cosign letters, cosponsor legislation, or attend events;",
      "recommending and executing legislative strategies within assigned issue areas and identifying leadership opportunities for the Member;",
      "meeting with constituents and outside groups on behalf of the Member;",
      "preparing briefing materials and talking points for the Member;",
      "staffing the member at events and meetings on topics within the assigned issue areas;",
      "reviewing materials prepared by the communications team on topics within assigned issue areas, including constituent letters, social media posts, and press releases;",
      "working with the intern coordinator to develop assignments for interns and fellows within assigned issue areas;",
      "assisting with administrative responsibilities as needed, including staffing the front office and responding to constituent outreach;",
      "supporting the appropriations process, including by drafting letters, reviewing proposals, and inputting requests",
      "helping to manage the policy team, including by mentoring and supporting junior staff;",
      "supporting the Deputy Chief of Staff / Legislative Director with preparing vote recommendations;",
      "developing strategies for achieving the congressman's priorities through policy;",
      "filling in as needed as a member of the management team"
    ],
    "qualifications": [
      "Qualified candidates will be independent self-starters with a demonstrated ability to generate new ideas and work well as part of a team.",
      "Strong writing, research, analytical, and organizational skills.",
      "A strong candidate for the 'Legislative Assistant' role will have at least two years of policy experience.",
      "Competitive candidates for a 'Senior Legislative Assistant' position should have significant policy experience in a relevant issue area--ideally environmental policy--and more than five years of congressional experience.",
      "Applicants with congressional experience, Southern California ties, or Spanish proficiency are especially encouraged to apply."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and writing sample to: cajobs52@gmail.com with 'Senior Legislative Assistant or Legislative Assistant - [NAME]' in the subject line. Applications will be considered on a rolling basis. The last day to submit an application is June 15, 2024.",
    "salary_info": "The salary range for this position is between $55,000-$80,000, based on experience.",
    "contact": "cajobs52@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all backgrounds to apply."
  },
  {
    "id": "MEM-168-25",
    "position_title": "District Director",
    "office": "Office of U.S. Congressman Greg Stanton",
    "location": "Based in the Phoenix Metropolitan Area. Candidates with knowledge of the East Valley are strongly preferred.",
    "posting_date": "2025-06-02",
    "description": "Job Title: District Director\nReports to: Chief of Staff\nLocation: Based in the Phoenix Metropolitan Area. Candidates with knowledge of the East Valley are strongly preferred.\n\nThe District Director serves as the Congressman's most senior staff member in Arizona and leads all district operations, staff management, and external engagement. This role requires close coordination with the Washington, D.C. office to ensure all district activities align with the Congressman's legislative and constituent priorities.\n\nThe District Director also serves as the Congressman's surrogate in the community and plays a key role in delivering results for constituents, fostering a strong office culture, and maintaining trusted partnerships with stakeholders across the district. The ideal candidate models professionalism, inclusion, and accountability; sets high expectations for ethical conduct and performance; and is committed to mentoring and supporting staff development.\n\nWorking Conditions:\n- Primarily based in the district office, with frequent travel throughout the district.\n- This is a senior-level, public-facing role that occasionally requires work outside of standard business hours, including evenings and weekends, to support events and district priorities.\n- Occasional travel to Washington, D.C. may be required.",
    "responsibilities": [
      "District Leadership & Staff Management",
      "Directly supervise district office staff, including delegation of responsibilities, performance evaluation, conflict resolution, and professional development.",
      "Lead weekly staff meetings and ensure district operations follow House policies and office procedures.",
      "Oversee recruitment, onboarding, and training for new district office hires.",
      "Constituent Services & Community Outreach",
      "Supervise the constituent services program and ensure timely, high-quality response to casework and community concerns.",
      "Build and maintain relationships with constituents, local officials, nonprofit organizations, business leaders, and advocacy groups.",
      "Serve as the primary district liaison with federal, state, and local agencies. Ensure that constituent casework is handled with impartiality, professionalism, and a service-oriented mindset regardless of political affiliation.",
      "Strategic Coordination & Scheduling",
      "Collaborate with the DC office to shape and implement an annual strategic plan for district activities and priorities.",
      "Manage the Congressman's in-district schedule in coordination with fellow senior staff to maximize visibility and impact.",
      "Ensure in-district appearances support legislative messaging, communications strategy, and stakeholder engagement.",
      "Representation & External Communications",
      "Represent the Congressman at pre-approved meetings and events when he is unavailable.",
      "Deliver remarks on the Congressman's behalf and ensure accurate and consistent messaging aligned with office priorities.",
      "Monitor district developments and flag key issues to senior staff for follow-up.",
      "District Travel & Relationship Management",
      "Travel throughout the district regularly to maintain visibility, attend events, and meet with constituents and community leaders.",
      "Actively maintain a pulse on district concerns and elevate trends or urgent issues to fellow senior staff and the Congressman for response."
    ],
    "qualifications": [
      "Minimum 5 years of professional experience, including team leadership and staff management",
      "Demonstrated ability to manage complex workflows, multitask under pressure, and drive team performance",
      "Strong political judgment, discretion, and professionalism",
      "Proven ability to exercise sound judgment in high-pressure or politically sensitive situations",
      "Outstanding verbal and written communication skills, including public speaking",
      "Valid driver's license and access to reliable transportation for in-district travel",
      "Demonstrated commitment to public service and a passion for helping others",
      "Preferred Qualifications:",
      "Congressional, political, nonprofit, or public service experience",
      "Familiarity with the East Valley and Arizona's Fourth Congressional District",
      "Experience using or demonstrated comfort with constituent management systems (e.g., IQ), scheduling tools, and office productivity software",
      "A bachelor's degree, advanced degree, or equivalent public service experience"
    ],
    "how_to_apply": "Deadline: Friday, June 13 at Noon (Arizona Time)\n\nTo apply, please submit the following materials as a single PDF document (not to exceed 12 pages) to AZ04Resumes@gmail.com with \"District Director\" in the subject line:\n- Cover Letter (one page, with your full name at the top)\n- Resume (one page, including your phone number and email address)\n- Three Writing Samples (not to exceed ten total pages; should reflect a range of formats and styles)\n\nApplications are due by Friday, June 13 at 12:00 PM Arizona Time. Late submissions, incomplete applications, or materials that do not follow these instructions will not be considered.\n\nNo calls or drop-ins, please-but you may call to confirm receipt of your application.\n\nApplicants selected for interviews will be required to complete an in-person writing exercise and may be asked to provide professional references.",
    "salary_info": "Salary & Retirement\n- Salary range: $85,000-$95,000, commensurate with experience\n- Matched retirement contributions through the Federal Employees Retirement System (FERS)\n- Eligibility for federal student loan repayment assistance\n\nHealth & Insurance\n- Employer-paid health, vision, and dental insurance available through the D.C. Health Exchange\n- Employer-paid life insurance\n\nLeave & Time Off\n- Generous paid leave and sick leave\n- Office is closed for all federal holidays\n\nAdditional Benefits\n- Free on-site parking",
    "contact": "AZ04Resumes@gmail.com",
    "equal_opportunity": "The Office of Congressman Greg Stanton is an equal opportunity employer. We are committed to building a diverse and inclusive team and encourage individuals from all backgrounds to apply."
  },
  {
    "id": "MEM-167-25",
    "position_title": "Director of Operations",
    "office": "The Congressional Black Caucus (CBC)",
    "location": "Washington, D.C.",
    "posting_date": "2025-06-02",
    "description": "The Congressional Black Caucus (CBC) seeks an experienced, strategic, and highly organized Director of Operations to lead core administrative functions and deepen engagement across Member offices and external stakeholders. This role serves as a chief integrator of operations and member services--managing internal systems, supporting CBC leadership, and advancing the Caucus' institutional effectiveness and mission.\n\nThe Director of Operations, under the direction of the Executive Director, will be responsible for overseeing day-to-day administration, technology systems, and office logistics, while simultaneously leading member services strategy to strengthen communication, coordination, and shared policy goals across CBC offices. The ideal candidate is a dynamic team leader with a strong understanding of congressional operations, excellent judgment, and a deep commitment to Black communities.",
    "responsibilities": [
      {
        "heading": "Strategic Operations & Administration",
        "points": [
          "Coordinate all core operational functions of the CBC, including finance, human resources, information technology and office logistics.",
          "Collaborate with the CBC staff to develop and manage long-term and daily schedules, briefing books, and institutional materials.",
          "Deploy and manage communications, project management, cybersecurity, and information-sharing technologies to safeguard and streamline operations.",
          "Maintain administrative policies, procedures, and records, and oversee compliance with House standards and protocols.",
          "Maintain staff contact information and distribution lists."
        ]
      },
      {
        "heading": "Member Services & Engagement",
        "points": [
          "Serve as the primary liaison to CBC Member offices, building proactive relationships and identifying opportunities for collaboration, engagement, and strategic alignment.",
          "Conduct regular outreach to Member offices to share event participation opportunities, coordinate messaging, and support shared policy initiatives.",
          "Draft and distribute newsletters to internal and external audiences highlighting Member engagement, upcoming events, and legislative priorities.",
          "Develop in coordination with other teammates, briefing materials, resources, and toolkits for use by CBC Member offices and staff.",
          "Builds and maintains databases of internal and external stakeholders"
        ]
      },
      {
        "heading": "Program & Event Management",
        "points": [
          "Oversee logistics for weekly Caucus meetings, briefings, retreats, and special convenings.",
          "Coordinate scheduling of House and Capitol rooms for CBC-hosted events, stakeholder meetings, and external collaborations."
        ]
      },
      {
        "heading": "Personnel & Administrative Oversight",
        "points": [
          "Support staff onboarding, orientation, and exit procedures; maintain personnel records and staff contact systems.",
          "Supervise interns and manage internal workflows and team coordination."
        ]
      }
    ],
    "qualifications": [
      "Deep understanding of CBC policy priorities and experience working with the African American community.",
      "Strong grasp of congressional operations, House and Senate procedures, and legislative processes.",
      "Significant experience in operations, member services, congressional administration, or a related field.",
      "Exceptional writing, communication, and interpersonal skills; highly organized with keen attention to detail.",
      "Experience with office management protocols.",
      "Demonstrated ability to manage multiple priorities in a fast-paced, politically sensitive environment.",
      "Discretion, professionalism, and sound political judgment are essential."
    ],
    "how_to_apply": "To apply, please send a cover letter and resume to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-166-25",
    "position_title": "Communications Manager/Digital Director",
    "office": "The office of Congresswoman Maggie Goodlander",
    "location": "Concord, N.H., or Washington, D.C.",
    "posting_date": "2025-06-02",
    "description": "The office of Congresswoman Maggie Goodlander is seeking a creative, experienced, and motivated Communications Manager/Digital Director to play a key role in shaping the congresswoman's presence and message across platforms. This is not an entry-level position. The ideal applicant will have experience managing a digital presence across platforms and a strong understanding of best practices for online growth.\n\nThis position reports to the Director of Communications and will be based in the congresswoman's office in Concord, N.H., or Washington, D.C. This role will require availability on some nights and weekends to support the Member's communications plan and events. Previous Hill experience is recommended. Ties to New Hampshire are encouraged but not required.",
    "responsibilities": [
      "Working closely with the Communications Director and the member to build and execute an ambitious strategic and proactive communications and digital plan to reach more constituents and increase engagement.",
      "Developing digital content for the congresswoman from start to finish, including social media posts, videos and graphics, newsletters, emails, and website content.",
      "Tracking the congresswoman's digital growth and metrics, and suggesting adjustments to the communications plan based on data and performance.",
      "Serving as photographer and videographer at meetings and events.",
      "Managing live-streaming and video-recording as necessary.",
      "Managing the photo archive for the office.",
      "Developing and updating website content."
    ],
    "qualifications": [
      "This is not an entry-level position.",
      "Experience managing a digital presence across platforms and a strong understanding of best practices for online growth.",
      "Previous Hill experience is recommended.",
      "Ties to New Hampshire are encouraged but not required.",
      "Attention to detail",
      "A can-do attitude",
      "Experience in photography, graphic design, and video editing",
      "The ability to handle multiple projects at a time in a fast-paced team environment."
    ],
    "how_to_apply": "Please submit a resume, cover letter, one writing sample, one digital media example, and a list with two references in one PDF document to nh02jobs603@gmail.com with \"Communications Manager / Digital Director Application - FIRST NAME LAST NAME\" in the subject line by Friday, June 13th. No calls or drop-ins.",
    "salary_info": "The salary range for this position is $55,000-$85,000, depending on experience.",
    "contact": "nh02jobs603@gmail.com",
    "equal_opportunity": "The office is an equal-opportunity employer."
  },
  {
    "id": "MEM-165-25",
    "position_title": "Legislative Correspondent",
    "office": "Congressman Rob Menendez (NJ-08)",
    "location": null,
    "posting_date": "2025-06-02",
    "description": "Congressman Rob Menendez (NJ-08) is seeking a hardworking and collaborative Legislative Correspondent to manage the office's active mail program. Additional issue areas may be assigned as needed. Responsibilities include but are not limited to batching incoming constituent outreach, drafting timely responses to constituent letters, proofreading letters, tracking trends in constituent correspondence, and other duties as assigned. This individual will also have the opportunity to assist on the health and education portfolios.\n\nIdeal candidates will have exceptional research and writing skills, strong attention to detail, display good judgement, be effective at time management, and be a motivated team player. This individual will often interact with constituents and must have a friendly and professional demeanor.",
    "responsibilities": [
      "batching incoming constituent outreach",
      "drafting timely responses to constituent letters",
      "proofreading letters",
      "tracking trends in constituent correspondence",
      "other duties as assigned",
      "assist on the health and education portfolios"
    ],
    "qualifications": [
      "exceptional research and writing skills",
      "strong attention to detail",
      "display good judgement",
      "be effective at time management",
      "be a motivated team player",
      "friendly and professional demeanor"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a cover letter, resume, and two writing samples in one PDF document to NJO8hiring@gmail.com with the following subject line: \"Full Name - Legislative Correspondent.\"",
    "salary_info": "This is a full-time position. This office offers benefits including competitive options for health, dental, vision, and life insurance; retirement match; student loan repayment; and transit/parking benefits. The base salary range for this position is $53,000-$56,000.",
    "contact": "NJO8hiring@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-164-25",
    "position_title": "Minority Professional Staff for the Subcommittees on Oversight and Investigations and Office of Insular Affairs",
    "office": "House Natural Resources Committee",
    "location": "Washington, D.C.",
    "posting_date": "2025-06-02",
    "description": "The Professional Staff member will play a central role in preparing for hearings in the subcommittee and full committee, and in conducting oversight and investigations on the issues and agencies in the full committee's jurisdiction. The Committee Democrats value experience conducting investigations, a legal/policy background, familiarity with the Department of the Interior, NOAA and the Forest Service, written and verbal Spanish fluency, and an understanding of the issues in the Committee's jurisdiction. The position requires strong organizational, time management, verbal and written communications skills, as well as the ability to work in a fast-paced environment.\n\nThe successful candidate demonstrates an awareness and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations. The candidate also understands how the work of the Committee intersects with racism, economic, and social inequality in the United States and has a passion for working to dismantle these systems.\n\nThe position is based in Washington, D.C. The Professional Staff person will be expected to work in office when Congress is in session.",
    "responsibilities": [
      "Drafting hearing memos, statements, and questions",
      "Evaluating hearing witnesses",
      "Briefing Members of Congress on the Committee and their staff",
      "Legal/policy and issue-based research",
      "Writing and implementing investigation plans",
      "Drafting correspondence and document requests",
      "Writing investigative reports",
      "Meeting with subject matter experts",
      "Possible light travel for field hearings or investigations.",
      "Briefing members of the media"
    ],
    "qualifications": [
      "Experience conducting investigations",
      "A legal/policy background",
      "Familiarity with the Department of the Interior, NOAA and the Forest Service",
      "Written and verbal Spanish fluency",
      "An understanding of the issues in the Committee's jurisdiction",
      "Strong organizational, time management, verbal and written communications skills",
      "Ability to work in a fast-paced environment",
      "Demonstrates an awareness and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations",
      "Understands how the work of the Committee intersects with racism, economic, and social inequality in the United States and has a passion for working to dismantle these systems"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and two writing samples via the application form by 5PM EST, June 3, 2025.",
    "salary_info": "Salary Range is $70,000- $100,000 per year",
    "contact": null,
    "equal_opportunity": "Women, LGBTQIA+, and racial/ethnic minority candidates are encouraged to apply. All applicants will be considered without regard to race, color, national origin, religion, sex, gender identity, disability, or age."
  },
  {
    "id": "MEM-163-25",
    "position_title": "Legislative Director",
    "office": "Congresswoman Jill Tokuda",
    "location": "Washington, DC",
    "posting_date": "2025-06-02",
    "description": "Congresswoman Jill Tokuda is seeking an experienced, organized and highly motivated Legislative Director to lead our office's legislative work and strategy. The Legislative Director provides strategic planning on legislative priorities in addition to managing their own active issue portfolio which will include the House Armed Services Committee and/or the Select Committee on China. The Legislative Director will also be responsible for managing and mentoring the legislative team, coordinating with the district and communications teams, fostering collaboration among staff members, and overseeing the constituent correspondence program.\n\nPreferred candidates will have Hill or policy experience, strong knowledge of the legislative process, and management experience. The successful candidate will be an excellent writer and communicator and able to juggle multiple priorities under extremely tight deadlines.",
    "responsibilities": [
      "Lead the office's legislative work and strategy.",
      "Provide strategic planning on legislative priorities.",
      "Manage an active issue portfolio which will include the House Armed Services Committee and/or the Select Committee on China.",
      "Manage and mentor the legislative team.",
      "Coordinate with the district and communications teams.",
      "Foster collaboration among staff members.",
      "Oversee the constituent correspondence program."
    ],
    "qualifications": [
      "Hill or policy experience.",
      "Strong knowledge of the legislative process.",
      "Management experience.",
      "Excellent writer and communicator.",
      "Able to juggle multiple priorities under extremely tight deadlines.",
      "Hawaii ties are highly desirable but not required."
    ],
    "how_to_apply": "Resumes will be reviewed on a rolling basis. To apply, please email Hawaii02jobs@gmail.com (SUBJECT: Legislative Director, YOUR NAME) with a cover letter, resume, and 2-3 references, all in one document.",
    "salary_info": "The starting salary for this position is $95,000 and will be commensurate with experience.",
    "contact": {
      "email": "Hawaii02jobs@gmail.com",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-161-25",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Office of Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2025-06-02",
    "description": "The Office of Congressman Rob Wittman (VA-01) is seeking a dynamic and experienced Communications Director to lead our communications efforts. The ideal candidate will be an exceptional writer and manager with a proven track record in media relations and strategic communication. Most importantly, the Communications Director should have a genuine commitment to public service and advocate for the best interests of Virginia's First District.",
    "responsibilities": [
      "Oversee a two-person communications team, providing leadership and guidance to ensure effective messaging and outreach.",
      "Collaborate closely with legislative staff to articulate the Member's policy priorities in a timely, efficient, and relevant manner.",
      "Draft press releases, Member statements, and other communications materials that effectively convey the Congressman's positions.",
      "Pitch op-eds to local and national media outlets, securing coverage that enhances the Congressman's profile.",
      "Proactively seek opportunities for the Member's appearances on local and national radio, television, and podcasts.",
      "Create timely and relevant talking points for the Member and staff to use in various communication settings.",
      "Manage the communications budget, ensuring resources are allocated effectively to support outreach efforts.",
      "Develop and oversee the overall communications and messaging strategy for Congressman Wittman."
    ],
    "qualifications": [
      "Previous experience in a communications role, preferably in a congressional office, political campaign, or related field.",
      "Strong understanding of policy issues and legislative processes.",
      "Exceptional writing, editing, and verbal communication skills.",
      "Proven ability to build relationships with media and stakeholders.",
      "Experience managing a team and coordinating multiple projects."
    ],
    "how_to_apply": "Interested applicants should email a resume and a brief cover letter to Nicolle.Miranda@mail.house.gov with \"Communications Director\" in the subject line.",
    "salary_info": null,
    "contact": "Nicolle.Miranda@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-160-25",
    "position_title": "Staff Assistant/Constituent Advocate",
    "office": "Office of the Congressman for New York's 22nd District",
    "location": "Utica, NY",
    "posting_date": "2025-06-02",
    "description": "based in the Utica Office, this in-person position reports to the District Director and will work in collaboration with the District Director, Utica Regional Representative, Senior Constituent Advocate, and others to help operate the Utica District Office and support the office's constituent services program, making sure the office is accessible and receptive to Central New Yorkers. This staffer will play a vital role in supporting the operations of the Utica office, ensuring constituents receive prompt, professional service and helping to advance the Congressman's priorities through serving as a first point of contact for visitors and callers and coordinating office functions and schedules.\n\nThis person will also help the Senior Constituent Advocate facilitate the Member's constituent casework activities with federal departments and agencies and ensure communication and information sharing between the district office and DC office.",
    "responsibilities": [
      "Serving as the first point of contact for visitors and callers, providing a welcoming and professional environment.",
      "Works closely with other members of the office to ensure the highest level of constituent services, and to ensure constituent service is at the forefront of every department's work",
      "Drafting letters, certificates, and awards.",
      "Manage constituent requests for flags and tours, in partnership with DC staff.",
      "Support the Syracuse District Office Manager in hiring and supervising district office interns.",
      "Assist the casework team with intake, case tracking, and federal agency liaison duties as needed.",
      "Maintain accurate and complete files on constituent casework and support outreach to community leaders and stakeholders.",
      "Represent the Congressman at events and meetings when the Regional Representative is unable to, as assigned by the District Director.",
      "Partnering with outreach staff to coordinate and support office-sponsored events, such as veterans fairs or community roundtables.",
      "Performing additional duties as assigned."
    ],
    "qualifications": [
      "Strong interpersonal and organizational skills",
      "Ability to handle sensitive information with discretion",
      "Excellent written and verbal communication skills",
      "Commitment to public service and constituent-focused work",
      "Previous experience in government, customer service, or constituent services is a plus",
      "Proficiency in Spanish (speaking, reading, writing) is a plus"
    ],
    "how_to_apply": "Please e-mail a resume and cover letter to newyork22jobs@gmail.com and include the job title \"Staff Assistant/Constituent Advocate\" in the subject line by COB on Wednesday, June 4. No walk ins or calls, please.",
    "salary_info": "minimum $45K; salary commensurate with experience",
    "contact": "newyork22jobs@gmail.com",
    "equal_opportunity": "The office is an equal employment opportunity employer and strongly encourages all interested candidates to apply, including women, people of color, veterans, and LGBTQIA individuals. Applicants with disabilities who require reasonable accommodation to participate effectively in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-159-25",
    "position_title": "Staff Assistant & Driver",
    "office": "Senior Florida Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2025-06-02",
    "description": "Senior Florida Democrat seeks a Staff Assistant & Driver in the Washington, D.C. office.\nResponsibilities include transporting the Member (including evenings), providing general assistance to the Member, managing the D.C. Intern Program, answering phones, processing mail and packages, welcoming office visitors, processing flag requests, general office administration, assisting with scheduling/operations, and working with staff on other duties as assigned.\nSuccessful candidates will have professional experience and familiarity working in a legislative environment, have proficiency in professional writing, customer service, time-management, and good organizational skills. A positive, solution-oriented personality who has an ability to multitask effectively in a fast-paced environment is ideal.\nSouth Florida/Florida ties are required and prior work in a Congressional or Senate office is a major plus.\nA safe car and a good driving record are required for this position.",
    "responsibilities": [
      "transporting the Member (including evenings)",
      "providing general assistance to the Member",
      "managing the D.C. Intern Program",
      "answering phones",
      "processing mail and packages",
      "welcoming office visitors",
      "processing flag requests",
      "general office administration",
      "assisting with scheduling/operations",
      "working with staff on other duties as assigned"
    ],
    "qualifications": [
      "professional experience and familiarity working in a legislative environment",
      "proficiency in professional writing, customer service, time-management, and good organizational skills",
      "A positive, solution-oriented personality who has an ability to multitask effectively in a fast-paced environment is ideal",
      "South Florida/Florida ties are required",
      "prior work in a Congressional or Senate office is a major plus",
      "A safe car and a good driving record are required for this position"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to FL25Resume@mail.house.gov with the subject line \"Staff Assistant - Last Name.\" Please save cover letter and resume in a single file (pdf preferred) and name the file \"Last name, First name.\"",
    "salary_info": null,
    "contact": "FL25Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-158-25",
    "position_title": "Legislative Assistant/Senior Legislative Assistant",
    "office": "Midwest Conservative Republican",
    "location": "Washington, DC",
    "posting_date": "2025-06-02",
    "description": "The Legislative Assistant/Senior Legislative Assistant is responsible for developing and advancing proactive policy proposals, monitoring legislative developments in assigned issue areas, drafting vote recommendations, agency correspondence, representing the member in meetings with constituents and key stakeholders, and other duties as assigned.\n\nThis person will be responsible for handling the Agriculture Committee portfolio, in addition to other policy areas as well.\n\nApplicants should have previous Capitol Hill, legislative, or policy experience, excellent research, writing, and verbal communication skills, strong attention to detail, and the ability to handle multiple responsibilities simultaneously in a fast-paced environment. Ties to the Midwest are preferred but not required.\n\nThis is not an entry level position.",
    "responsibilities": [
      "Developing and advancing proactive policy proposals",
      "Monitoring legislative developments in assigned issue areas",
      "Drafting vote recommendations",
      "Agency correspondence",
      "Representing the member in meetings with constituents and key stakeholders",
      "Handling the Agriculture Committee portfolio, in addition to other policy areas as well",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Previous Capitol Hill, legislative, or policy experience",
      "Excellent research, writing, and verbal communication skills",
      "Strong attention to detail",
      "The ability to handle multiple responsibilities simultaneously in a fast-paced environment",
      "Ties to the Midwest are preferred but not required"
    ],
    "how_to_apply": "Interested candidates should submit a resume to midwesternrepublicanoffice@gmail.com with \"Legislative Assistant\" in the subject line.",
    "salary_info": null,
    "contact": {
      "email": "midwesternrepublicanoffice@gmail.com",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-152-25",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Office of Congressman Gabe Vasquez",
    "location": "Washington, D.C.",
    "posting_date": "2025-06-02",
    "description": "The Office of Congressman Gabe Vasquez seeks a full-time Staff Assistant/Legislative Correspondent in the Washington, D.C. office.\n\nResponsibilities include answering phones, handling tour and flag requests, greeting constituents, driving the Member (including evenings), and other administrative tasks as needed. This position will also be responsible for managing the correspondence system, including sorting and drafting responses to constituent mail, and other duties as assigned.\n\nCandidates must have exceptional oral and written communication skills, meticulous attention to detail, expertise prioritizing and managing multiple tasks under tight deadlines, a commitment to public service, and the ability to work under pressure in a fast-paced environment for a battleground Member. Familiarity with IQ and prior Hill experience (including internships) is also helpful.\n\nPossession of a driver's license, a good driving record, and safe vehicle are required for this position. New Mexico ties and Spanish-language proficiency are also a plus.",
    "responsibilities": [
      "Answering phones",
      "Handling tour and flag requests",
      "Greeting constituents",
      "Driving the Member (including evenings)",
      "Other administrative tasks as needed",
      "Managing the correspondence system, including sorting and drafting responses to constituent mail",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Exceptional oral and written communication skills",
      "Meticulous attention to detail",
      "Expertise prioritizing and managing multiple tasks under tight deadlines",
      "A commitment to public service",
      "The ability to work under pressure in a fast-paced environment for a battleground Member",
      "Familiarity with IQ and prior Hill experience (including internships) is also helpful",
      "Possession of a driver's license, a good driving record, and safe vehicle are required",
      "New Mexico ties and Spanish-language proficiency are also a plus"
    ],
    "how_to_apply": "To apply, please send a cover letter and resume as a single document to NM02applications@mail.house.gov with \"SA/LC: [Your Name]\" as the subject line. Please no walk-ins or phone calls.",
    "salary_info": "The starting salary for this position is $52,000.",
    "contact": {
      "email": "NM02applications@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "This office is an equal opportunity employer; the office does not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-150-25",
    "position_title": "Legislative Assistant",
    "office": "Congressman Ryan Mackenzie (PA-07)",
    "location": "Washington, DC",
    "posting_date": "2025-06-02",
    "description": "The Office of Congressman Ryan Mackenzie (PA-07) is hiring a Legislative Assistant to manage the Congressman's Committee on Education and Workforce assignment and several other issues, including healthcare, tax, and small business.\n\nQualified applicants will have a strong work ethic, strong interpersonal and communication skills (both written and verbal), attention to detail, and the ability to handle competing priorities in a fast-paced environment effectively. Prior experience with Education or Labor policy is preferred but not required.",
    "responsibilities": [
      "Advancing the Member's priorities and monitoring key developments within assigned legislative areas",
      "Drafting vote recommendations and preparing materials for Committee activity",
      "Conducting meetings with constituent groups and key stakeholders"
    ],
    "qualifications": [
      "A strong work ethic",
      "Strong interpersonal and communication skills (both written and verbal)",
      "Attention to detail",
      "The ability to handle competing priorities in a fast-paced environment effectively",
      "Prior experience with Education or Labor policy is preferred but not required"
    ],
    "how_to_apply": "Interested applicant should submit their resumes to Julia.Hearthway@mail.house.gov.",
    "salary_info": null,
    "contact": "Julia.Hearthway@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-149-25",
    "position_title": "Legislative Staffer",
    "office": "Congressman Mark DeSaulnier (D-CA)",
    "location": "Washington, D.C.",
    "posting_date": "2025-06-02",
    "description": "Congressman Mark DeSaulnier (D-CA), member of the Transportation and Infrastructure Committee, seeks an experienced Legislative Staffer to handle a diverse legislative portfolio to include Transportation Committee work. Duties include identifying and advancing policy proposals, committee hearing and mark-up preparation and staffing, building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff, briefing the Congressman and drafting legislative memos, policy background, constituent correspondence, and other duties as assigned.\n\nIdeal candidate will be a strategic, detail-oriented thinker with experience formulating and advancing legislation. Qualified candidates will exercise discretion and independent judgement, have excellent organizational, research, writing, communication, and time management skills, and a willingness to work in a team environment. Knowledge of California is a plus. This is not an entry level position - prior legislative experience on Capitol Hill and working knowledge of House processes and procedures is preferred. Title to be based on candidate's experience.",
    "responsibilities": [
      "Identifying and advancing policy proposals",
      "Committee hearing and mark-up preparation and staffing",
      "Building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff",
      "Briefing the Congressman",
      "Drafting legislative memos, policy background, constituent correspondence",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Strategic, detail-oriented thinker with experience formulating and advancing legislation",
      "Exercise discretion and independent judgement",
      "Excellent organizational, research, writing, communication, and time management skills",
      "A willingness to work in a team environment",
      "Knowledge of California is a plus",
      "This is not an entry level position",
      "Prior legislative experience on Capitol Hill and working knowledge of House processes and procedures is preferred"
    ],
    "how_to_apply": "Qualified candidates should send resume, cover letter, and references to DeSaulnierResumes@gmail.com.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": {
      "email": "DeSaulnierResumes@gmail.com",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The office is an equal opportunity employer. All qualified candidates are encouraged to apply, including women, people of color, and other members of traditionally underrepresented communities."
  }
]