[
  {
    "id": "MEM-003-25",
    "position_title": "Caseworker",
    "office": "Republican Member of Congress from South Carolina",
    "location": "Charleston, SC",
    "posting_date": "2025-01-06",
    "description": "A Republican Member of Congress from South Carolina is seeking a motivated and organized individual to join their team as a Congressional Caseworker based in Charleston, SC. As a Caseworker, you will act as office liaison for other federal agencies on behalf of the Member in the district, develop familiarity with key individuals across all relevant agencies, and provide exceptional constituent services.",
    "responsibilities": [
      "Act as a liaison between our Member of Congress and constituents, when inquiring to various federal agencies.",
      "For non-federal issues, conduct research and make every effort to redirect constituents to appropriate solutions when possible.",
      "Conduct status checks on all cases and provide updates to constituents.",
      "Collaborate with other staff members to ensure effective communication and implementation of our Member of Congress's priorities and initiatives."
    ],
    "qualifications": [
      "Bachelor's degree in political science, public administration, or a related field is preferred but not required.",
      "Strong communication, interpersonal, and organizational skills.",
      "Knowledge of local and federal government, policies, and procedures is preferred but not required.",
      "Ability to work independently, manage multiple projects, and meet deadlines.",
      "Experience in constituent services, or related fields is preferred but not required."
    ],
    "how_to_apply": "Qualified candidates please send their resume to the following email address: noah.longest@mail.house.gov. Please include “Caseworker” (First Name) (Last Name) in the subject line.",
    "salary_info": "The job comes with a competitive benefits package that includes health, dental, and vision insurance; federal student loan repayment (terms apply); retirement plans; transit benefits; and paid time off.",
    "contact": "noah.longest@mail.house.gov",
    "equal_opportunity": "The U.S. House of Representatives is an equal opportunity employer. All qualified applicants are encouraged to apply. All travel-related expenses associated with the interview and hiring process must be paid by the applicant, to include any relocation expenses. Employment may be contingent upon the satisfactory completion of a criminal history records check. Employment with the U.S. House of Representatives is at-will. A qualified applicant must meet one of the following residency requirements within the continental United States for eligibility for a paid position with the U.S. House of Representatives:\n\nBe a U.S. citizen\nBe lawfully admitted for permanent residence and seeking citizenship as outlined in 8 U.S.C. § 1324b(a)(3)(B)\nBe (i) admitted as a refugee under 8 U.S.C. § 1157 or granted asylum under 8 U.S.C. § 1158 and (ii) have filed a declaration of intention to become a lawful permanent resident and then a citizen when eligible\nOwe allegiance to the U.S. (i.e., qualify as a non-citizen U.S. national under federal law)"
  },
  {
    "id": "MEM-002-25",
    "position_title": "Staff Assistant",
    "office": "Congressman Michael Rulli (OH-06)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "Congressman Michael Rulli (OH-06) has an immediate need to hire a Staff Assistant in his Washington, DC office. Interested applicants should submit an email including a resume and cover letter to OH06Jobs@mail.house.gov.",
    "responsibilities": [
      "to open the office at 9:00AM on normal office days;",
      "to answer phone calls;",
      "to greet visitors upon arrival to the office;",
      "to answer and correctly log constituent requests for general information, tours, and other inquiries;",
      "to monitor delivery and pickup of materials (i.e. office supplies, mail, etc.);",
      "to maintain front lobby area;",
      "to provide capitol tours to constituents and assist in setting up other various tours (i.e. White House, Washington Monument, etc.)",
      "to assist with various administrative and legislative duties as assigned.",
      "to coordinate flag requests.",
      "to manage the intern program.",
      "answers and screens telephone calls for the Member and other staff members and takes messages;",
      "greets and screens visitors;",
      "assists individuals who have appointments with the Member or other staff members. Works closely with the Member's Director of Operations to ensure that the Member's appointments are on time and that the corresponding staff member is aware of the visitors' arrival;",
      "responds to constituent requests for flags, tours and other information;",
      "maintains handout literature regarding the district and the House;",
      "signs for deliveries and forwards all materials delivered to the office to appropriate staff members in a timely manner;",
      "maintains the office voice mail and forwards messages to correct staff member;",
      "ensures that all constituent inquiries are directed to the appropriate staff member in a timely manner;",
      "logs visitor opinions, including full name, address, and all relevant information into IQ;",
      "logs mail into IQ;",
      "performs other administrative and legislative duties and/or assists staff members in projects as assigned."
    ],
    "qualifications": [
      "professional telephone manner;",
      "proficiency in word processing;",
      "excellent organizational and proofreading skills;",
      "ability to use photocopier, printer, and other basic office equipment;",
      "ability to work cooperatively and courteously with others;",
      "availability to work long hours, if required."
    ],
    "how_to_apply": "Interested applicants should submit an email including a resume and cover letter to OH06Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "OH06Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-001-25",
    "position_title": "Legislative Correspondent",
    "office": "Congressman Michael Rulli (OH-06)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "CORE RESPONSIBILITIES:\nto provide research for and respond to letters from constituents; and\nto provide administrative support to the Legislative Assistants.\n\nDUTIES:\nanswers assigned constituent correspondence, conducts any research necessary\nto formulate an adequate response to the letters;\nanswers phone calls;\ndevelops and maintains a collection of prepared text for use in responding to\nconstituent mail;\ndrafts form letters to respond to a large number of letters on the same issue;\nconsults with the Legislative Director and Legislative Assistants to keep the form\nletters up to date;\nsupervises the printing and proofreading of form letters;\ndrafts responses to constituent mail that cannot be answered with a form letter;\nprovides assistance as required, including meeting with constituents and interested\nparties, and attending committee hearings and markups;\nperforms other duties as assigned.",
    "responsibilities": [
      "to provide research for and respond to letters from constituents",
      "to provide administrative support to the Legislative Assistants"
    ],
    "qualifications": [
      "strong research, writing and communication skills",
      "knowledge of the legislative process",
      "strong organizational skills",
      "ability to exercise discretion and independent judgment in the formulation and\nrecommendation of policy positions for the Member",
      "ability to work cooperatively and courteously with others",
      "thoroughness and attention to detail",
      "proﬁciency in word processing and IQ",
      "availability to work long hours and at night if required"
    ],
    "how_to_apply": "Interested applicants should submit an\nemail including a resume and cover letter to OH06Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "OH06Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-532-24",
    "position_title": "Press/Digital Assistant",
    "office": "Congressman Jared Huffman (CA-02)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "Congressman Jared HuEman (CA-02) is seeking a Press/Digital Assistant to join his personal Washington, DC oEice. The ideal candidate will have strong writing, editing, and digital skills including video editing and graphic design.",
    "responsibilities": [
      "Assist with drafting press releases, talking points, scripts, op-eds/letters to the editor, newsletters, and other written materials as assigned",
      "Create daily social media content including graphics and videos",
      "Clip TV appearances and other video content for social media",
      "Work with the district oEice to publicize constituent services and events",
      "Develop and update website content",
      "Create and maintain press lists",
      "Other tasks as needed"
    ],
    "qualifications": [
      "Bachelor’s degree in communications, journalism, public relations, graphic design, or related ﬁeld",
      "Exceptional writing, editing, and organizational skills",
      "Experience with social media platforms and tools (e.g., Twitter/X, Facebook, Instagram, Canva, Adobe Creative Suite, or similar tools)",
      "Ability to create engaging graphics, visuals, and videos",
      "Strong interest in digital media and trends",
      "Detail-oriented, with the ability to juggle multiple tasks and meet tight deadlines"
    ],
    "how_to_apply": "Interested applicants should submit a resume, writing sample, and two digital work samples (i.e. graphics or videos) to CA02Jobs@gmail.com. Include “Press/Digital Assistant – (First Name) (Last Name)” in the subject line.",
    "salary_info": "$60,000, commensurate with experience.",
    "contact": "CA02Jobs@gmail.com",
    "equal_opportunity": "The OEice of U.S. Congressman Jared HuEman is an equal opportunity employer; the oEice does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability. Our oEice encourages candidates of diverse backgrounds to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-531-24",
    "position_title": "District StaE Assistant/Scheduler",
    "office": "Member of Congress",
    "location": "District",
    "posting_date": "2025-01-06",
    "description": "The District StaE Assistant/Scheduler is a dynamic and detail-oriented role that supports the Member and district operations through a variety of administrative and scheduling responsibilities. This role combines the responsibilities of managing district communications, constituent correspondence, administrative and scheduling activities to ensure smooth and eEicient oEice operations.",
    "responsibilities": [
      "District Operations:",
      "-Serve as a rover between ﬁeldwork and casework.",
      "-Support the Member when in the district and coordinate with the Director of Constituent Services, Communications, and Director of Field.",
      "Constituent Correspondence:",
      "-Monitor the district email inbox, answer oEice phone, and respond to constituent emails, voicemails, and web requests.",
      "-Generate weekly mail reports and sort mail for scheduling and casework.",
      "-Perform data entry of constituent information and maintain accurate records across oEice platforms.",
      "District Scheduling and Travel Management:",
      "-Manage the Member’s schedule, ensuring all calendar entries meet oEice standards.",
      "-Coordinate weekly scheduling meetings with the Member to review requests.",
      "-Book and manage all Member travel in the district.",
      "-Monitor the shared scheduling inbox and manage requests.",
      "Measurable Objectives:",
      "-Maintain incoming mail through oEice platforms.",
      "-Execute annual mailing items.",
      "-Ensure timely completion of all scheduling, travel, and reporting tasks."
    ],
    "qualifications": [
      "This position requires excellent organizational skills, proactive communication, and a commitment to supporting the Member’s district and scheduling needs."
    ],
    "how_to_apply": "Qualiﬁed candidates please send their resume to the following email address: noah.longest@mail.house.gov. Please include “StaE Assistant/Scheduler” (First Name) (Last Name) in the subject line.",
    "salary_info": null,
    "contact": "noah.longest@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-530-24",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial AEairs, House Committee on Veterans’ AEairs, Majority StaE",
    "office": "Subcommittee on Disability Assistance and Memorial AEairs, House Committee on Veterans’ AEairs",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "Provide administrative and research support to Subcommittee staE and assists with duties as assigned.",
    "responsibilities": [
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notiﬁcations.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in staE-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and staE.",
      "Assist with developing policy recommendations and serve as a resource for Members both on and oE Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee StaE Director or Deputy StaE Director, and Subcommittee StaE Director, and assisting other Committee staE, as needed.",
      "This is a full-time, on-site position in Washington, DC."
    ],
    "qualifications": [
      "Bachelor of Arts or Science."
    ],
    "how_to_apply": "Qualiﬁed candidates please send their cover letter, resume, and one (1) writing sample to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-529-24",
    "position_title": "Legislative Assistant or Senior Policy Advisor",
    "office": "Rep. Nanette Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "Rep. Nanette Barragan (CA-44) seeks a highly talented and motivated Legislative Assistant or Senior Policy Advisor in her Washington, DC oEice – position title dependent on experience. The primary responsibility for this position will be handling the Member’s work on telecommunications issues as a member of the Energy and Commerce Committee. Other priority issues in the legislative portfolio include; housing homelessness, labor, education, and other issues as assigned.\n\nThis is NOT an entry-level position. Candidates should have at least 2-3 years of Capitol Hill or relevant policy experience, be highly motivated, detail-oriented professionals with strong organizational and time-management skills, a positive attitude, and the ability to work under pressure and meet deadlines in a fast-paced work environment.\n\nCandidates with previous experience in telecommunications policy and working knowledge of the FCC and NTIA are preferred. Applicants should also have experience with coalition building and the ability to maintain strategic relationships with constituent organizations.\n\nPrevious experience working on housing and homelessness issues, Los Angeles Metro Area|Southern California ties, and Spanish language skills are a plus.",
    "responsibilities": [
      "Drafting legislation, policy letters, memos, and talking points",
      "Preparing for and staEing committee hearings",
      "Making vote recommendations",
      "Meeting and maintaining relationships with constituents and advocacy groups",
      "Working closely with the communications team and district staE",
      "Advancing a number of the Member’s legislative priorities",
      "Other tasks as required"
    ],
    "qualifications": [
      "At least 2-3 years of Capitol Hill or relevant policy experience",
      "Highly motivated",
      "Detail-oriented",
      "Strong organizational and time-management skills",
      "Positive attitude",
      "Ability to work under pressure and meet deadlines in a fast-paced work environment",
      "Previous experience in telecommunications policy and working knowledge of the FCC and NTIA are preferred",
      "Experience with coalition building and the ability to maintain strategic relationships with constituent organizations",
      "Previous experience working on housing and homelessness issues, Los Angeles Metro Area|Southern California ties, and Spanish language skills are a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, two references, and two writing samples with “Telecomm Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "$60-80,000 - commensurate with skills and experience",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The oEice is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-528-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Nanette Diaz Barragán (CA-44)",
    "location": null,
    "posting_date": "2025-01-06",
    "description": "Congresswoman Nanette Diaz Barragán (CA-44) seeks an experienced Communications\nDirector to lead a fast-paced and highly engaged press operation. Applicants must be\ncreative, dynamic, proactive, and energetic.\n\nThe Communications Director will serve as the spokesperson and primary\ncommunications advisor to the Member. They will be responsible for developing and\nexecuting an aggressive strategic communications plan, including social media, that\nencompasses local, national, and specialty media outlets. The Communications Director\nwill oversee day-to-day press operations, including coordinating and managing the press\nteam; responding to media inquiries; booking the Member for interviews; pitching news\nopportunities to media outlets; planning press conferences and in-district events;\nmanaging the Member’s social media accounts and oEicial website; editing/drafting\nspeeches, talking points, ﬂoor statements, press releases, op-eds, and e-newsletters; and\ncreating and distributing e-newsletters and franked mailings.\n\nThey are also responsible for working with the Member, Chief of StaE, Legislative Director,\nand District Director to develop and coordinate core messaging. The Communications\nDirector is responsible for maintaining the Congresswoman’s voice across all\ncommunications materials, with an emphasis on clarity, relatability, authenticity, and\nconnecting the Congresswoman’s values and advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related\nexperience either on or oE Capitol Hill. They must be highly organized, proﬁcient in multitasking, have strong political judgment and instincts, and possess superior writing, editing,\nand proofreading skills.\n\nLos Angeles Metro|Southern California ties are a plus.\nFluency in Spanish is a plus.\nExperience with video editing and graphic design are a plus.\nExperience with national media contacts both print and digital, as well as with radio/TV\nbookers and producers is a plus.\n\nAdditionally, the Communications Director must be willing to work extended hours and\noftentimes under time constraints, while maintaining a positive attitude.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Candidates should submit a resume, a cover letter including salary requirements, and two\nwriting samples with the subject line “Communications\nDirector” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The oEice is an equal opportunity employer and does not discriminate on the basis of race,\ncolor, religion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-527-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Val Hoyle (D-OR-04)",
    "location": "Washington, D.C.",
    "posting_date": "2025-01-06",
    "description": "Congresswoman Val Hoyle (D-OR-04) seeks a self-starting, highly experienced, and\ncreative Communications Director to join her Washington, D.C. oEice and lead a fastpaced communications team. The ideal candidate will have familiarity with national press,\nthe House franking process, and will work closely with the Deputy Chief of StaE/District\nDirector, Legislative Director, and report to the Chief of StaE to set the Congresswomen’s\nmessaging priorities. This position will be the direct supervisor of the Press Secretary and\nany Press Interns. This is not an entry-level position.",
    "responsibilities": [
      "Develops and implements strategic communications plans for the office, including\nworking closely with the legislative team to develop media strategies to roll out\nlegislation, send letters, and make other major announcements",
      "Successfully and consistently pitches the Congresswoman to both local and\nnational TV, radio, and print media",
      "Helps plan and staffs DC- and district-based events such as press conferences,\ntele-townhalls, and roundtables, etc.",
      "Prepares for, brief, and staffs the Congresswoman for media interviews, press\nconferences, roundtables, and other engagements.",
      "Drafts talking points, speeches, press releases, op-eds and other materials, as\nnecessary, and in the Congresswoman’s voice.",
      "Speaks on background with reporters and act as a media liaison for the\nCongresswoman.",
      "Helps manage social media presence, this includes drafting social media copy,\nclipping interviews, and creating graphics to circulate across platforms.",
      "Maintains and updates office website to ensure that it features timely content.",
      "Serves as the formal spokesperson and media liaison for the Member;",
      "Develops and implements media, communications, and public relations strategy\nfor the Member.",
      "Oversees digital media, website and other communications consultant.",
      "Remains abreast of current legislative and non-legislative issues about which the\nMember may be questioned.",
      "Evaluates current events and media reports in the district and the nation for their\nimpact on the Member.",
      "Provides ideas and advice on the effect in the media of the Member's actions and\nlegislative activities.",
      "Creates official digital ads and other graphics.",
      "Writes speeches for the Member.",
      "Meets attendance requirements as established by the office.",
      "Maintains a good working relationship with the Member, staff, media, and\nconstituents.",
      "Works well under pressure and handles stress.",
      "Supervises Press Secretary and any assigned Press Interns.",
      "Accepts performance-based criticism and direction.",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Exceptionally strong writing, editing, and proofreading skills.",
      "Deep understanding of print, broadcast, and online media.",
      "Understanding of House franking process and regulations.",
      "Experience with digital communications, including paid ads and analytics reports.",
      "Background in graphic design, including graphics, videos, CANVA or Adobe Suite\npreferred.",
      "Experience developing communication strategy for a Member of Congress, an\nelected oEicial, a federal agency, or a private or non-proﬁt organization.",
      "Expertise in advising others on a communication strategy and ability to work well on\na team.",
      "Able to make split-second decisions and develop communications under tight\ndeadlines.",
      "Strategic thinker, politically savvy and comfortable navigating diEicult situations\nwith press and staE; and",
      "Time management skills, ability to work under pressure, and comfortable balancing\nmultiple responsibilities at once."
    ],
    "how_to_apply": "Qualiﬁed candidates should submit a\nresume and cover letter.",
    "salary_info": null,
    "contact": "resumes.hoyle@mail.house.gov",
    "equal_opportunity": "This oEice is an equal opportunity employer; we do not discriminate on the basis of race,\ncolor, religion, national origin, sex, gender identity or expression, pregnancy, sexual\norientation, age, disability, marital status, parental status, military status, or any other\nfactor or basis prohibited by applicable federal law."
  },
  {
    "id": "MEM-524-24",
    "position_title": "District Representative for California’s 49th Congressional District",
    "office": "Member of Congress",
    "location": "Oceanside",
    "posting_date": "2025-01-06",
    "description": "The staE member in this position acts as a liaison to federal, district, and\nlocal agencies for the Member of Congress and constituents. The District Representative is\ncharged with helping constituents with casework and engaging the residents of the 49th\nCongressional District, including planning meetings and events with the Member of\nCongress. This position is based in Oceanside.",
    "responsibilities": [
      "The person in this role is speciﬁcally responsible for building and\nmaintaining relationships with a variety of communities throughout CA-49, especially in\nEncinitas, Solana Beach, and Del Mar.",
      "This role involves handling constituent casework\nwith various federal agencies, with a focus on the Department of Homeland Security and\nthe Department of State.",
      "Other responsibilities include planning and staEing in-district events, meetings, and site visits; working closely with the District OEice and Washington, DC oEice staE on local and assigned policy issues and areas; and establishing relationships with local groups, including attendance at key meetings and ensuring the oEice is tracking events and functions to facilitate the Member’s attendance."
    ],
    "qualifications": [
      "Successful applicants should have a thorough knowledge of California’s 49th district, familiarity with the communities of Encinitas, Solana Beach, and Del Mar, a service-oriented attitude, strong organizational skills, proﬁciency at prioritizing and managing multiple projects at one time, a capacity to work both independently and as part of a team, and strong written and oral communications skills.",
      "Preference may be given to residents of the 49th District."
    ],
    "how_to_apply": "Please send resume, cover letter, and three professional references to ca49.applications@mail.house.gov",
    "salary_info": "$50,000 to $60,000, commensurate with experience.",
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This oAice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-523-24",
    "position_title": "Digital Assistant",
    "office": "House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "location": "Washington D.C.",
    "posting_date": "2025-01-06",
    "description": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02) seek a creative and detail-oriented Digital Assistant to support digital communications and public engagement efforts. This position will be split between the committee office and personal office and will be based out of Washington D.C.\n\nThis position involves creating and scheduling content for social media platforms, maintaining the committee’s website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\n\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor’s degree in communications, political science, or a related field is preferred.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: \"[Name] – Digital Assistant Application.\" Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary is commensurate with experience, and the position includes a competitive benefits package.",
    "contact": "budget-democrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-522-24",
    "position_title": "Press Secretary",
    "office": "Office of Congressman Pat Ryan (NY-18)",
    "location": "Washington DC",
    "posting_date": "2025-01-06",
    "description": "The Office of Congressman Pat Ryan (NY-18) seeks a Press Secretary based in the Washington DC office. Applicants should be prepared to join a highly-collaborative, highachieving team and possess an eagerness to grow and learn within the office. Ties to New York’s 18th District are a plus.\n\nThe ideal candidate should demonstrate excellent writing and editing skills in addition to a strong work ethic, good sense of humor, and keen attention to detail. The position will require working non-traditional hours.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Drafting talking points and op-eds",
      "Staffing the Congressman for interviews and media events",
      "Planning press conferences and in-district events",
      "Responding to press inquiries",
      "Maintaining relationships and booking interviews with local press outlets",
      "Other tasks as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should submit a cover letter, resume, two writing samples, and three references in a single PDF to ny18resumes@mail.house.gov with the job title and your full name in the subject line (e.g.: “Press Secretary - Bryson Daily). No phone calls, faxes or drop-ins, please. Applications will be considered on a rolling basis.",
    "salary_info": "The salary range for this position is $60,000 - $80,000, commensurate with experience.",
    "contact": "ny18resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-521-24",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": "Washington D.C. or the Charlotte, N.C. District Office",
    "posting_date": "2025-01-06",
    "description": "The Communications Director is expected to work closely with the Chief of Staff, Deputy Chief of Staff / District Director, and the Legislative Director to develop and execute a comprehensive and aggressive strategic plan to inform constituents and the media about Congresswoman Adams and her work as a member of congress. This includes making media pitches, organizing press events, and reviewing, drafting, and finalizing statements, talking points/speeches, press releases, media advisories, and other messaging (e.g., newsletters and social media). Finally, the Communications Director will oversee all Franked communications, which includes mailers. Successful candidates will be exceptional writers and have strong experience working in fast-paced environments and implementing aggressive communications plans. North Carolina ties strongly preferred.",
    "responsibilities": [
      "Develop strategic communications plans for all district and DC events/speaking engagements/member appearances, etc. and work closely with the DC and District Offices to implement successful media strategies;",
      "Produce written and visual content for the office, including but not limited to press releases, statements, social media post and weekly newsletters;",
      "Manage, mentor, and grow the communications team, focusing on staff professional development, skill building, and efficient workflows;",
      "Build and sustain strong relationships with North Carolina and national print, online, radio, and broadcast media (reporters, producers, editors, columnists, etc.), and remain ready to identify creative ways to pitch the Member;",
      "Prepare, brief, and staff the Member for media interviews, press conferences, roundtables, and other engagements;",
      "Draft and edit office materials, talking points, speeches, press releases, op-eds, and other materials as necessary; and",
      "Speak on background or on the record with reporters when necessary and act as a media liaison for the Member."
    ],
    "qualifications": [
      "Bachelor's Degree in a relevant field or equivalent professional experience;",
      "Previous Capitol Hill, campaign or political experience strongly preferred;",
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Previous on the record experience;",
      "Ability to take photographs and write content for social media",
      "Experience managing others and promoting professional development;",
      "Deep understanding of print, broadcast, and online media and how to successfully create and leverage opportunities in each;",
      "Strategic thinker, politically savvy, and ability to manage competing priorities and develop solutions under tight deadlines;",
      "Ability to work well with others, willingness to take initiative, manage competing priorities, and turn around high-quality products under tight deadlines are a must; and",
      "Works a flexible schedule, including long hours on nights, weekends and holidays."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, a resume, three references, and three writing samples to NC12.resume@mail.house.gov with \"[NAME] -Communications Director\" in the subject line.",
    "salary_info": null,
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": "Rep. Alma S. Adams' office provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
  },
  {
    "id": "MEM-520-24",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman-elect Maxine Dexter",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "Congresswoman-elect Maxine Dexter is seeking a full-time Legislative Assistant in Washington, DC. This is not an entry-level position. The salary range is $62,000 - $75,000.",
    "responsibilities": [
      "Works with the Deputy Chief of Staff & Legislative Director and Chief of Staff to formulate and advance legislative initiatives for assigned issue areas.",
      "Represents the Congresswoman at meetings with constituents, district stakeholders, committee staff, and federal agencies and staffs the Congresswoman at engagements relevant to assigned issue areas.",
      "Tracks legislation and coordinates co-sponsorship of bills and co-signing of letters for the Congresswoman.",
      "Develops briefing materials, talking points, and policy memos for the Congresswoman.",
      "Briefs the Congresswoman on bills before the House, provides advice on Committee activity, and assists the district office staff with legislative matters that impact the local community.",
      "Provides input to the Communications Director to draft speeches, press releases, op-eds, and statements for the Congresswoman.",
      "Provides district office staff with targeted information for community events."
    ],
    "qualifications": [
      "Strong written and verbal communication skills.",
      "Thorough knowledge of the legislative process, procedures, and organization of the House.",
      "Self-starting personality.",
      "Passion for public service.",
      "Ability to work well under pressure.",
      "Willingness to accept performance-based criticism and direction.",
      "Ability to work cooperatively and courteously with others."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter to OR3resumes@gmail.com. Oregon ties are strongly preferred.",
    "salary_info": "$62,000 - $75,000",
    "contact": "OR3resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-519-24",
    "position_title": "Scheduling Director / Operations Manager",
    "office": "Congressman Jamie Raskin (MD-08)",
    "location": null,
    "posting_date": "2025-01-06",
    "description": "The Office of Congressman Jamie Raskin (MD-08) seeks a Scheduling Director / Operations Manager.\n\nThe Scheduling Director/Operations Manager will work closely with the Member, the Chief of Staff, and District Chief to coordinate the Member’s official schedule and provide administrative support to the Member and team to ensure efficient operations. Essential duties include but are not limited to: managing the Member’s daily and long-term schedule; organizing and tracking invitations, speaking engagements, meetings, and scheduling requests for the Member; corresponding with outside stakeholders on scheduling matters and keeping the Member on schedule throughout the day; coordinating logistics and strategic planning for events; coordinating official travel of the Member and staff; providing operational support such as overseeing leave requests and staff training; liaising with technology department and managing member’s technology and office technology; and other administrative duties as may be assigned.\n\nThe successful candidate ideally has experience working on the Hill and experience with scheduling and/or operations. Applicants should be motivated self-starters and highlycollaborative team players who demonstrate scrupulous attention to detail, keen organizational skills, effective time management, excellent oral and written communication skills, and has a professional demeanor. The role regularly interacts with constituents, relevant stakeholders, congressional offices, and federal agencies. The candidate should be responsive and friendly while demonstrating strategic planning and decision-making skills. A discreet approach to these responsibilities is essential. This position may include evening and weekend work as the Congressional and Member schedule requires.",
    "responsibilities": [
      "Managing the Member’s daily and long-term schedule",
      "Organizing and tracking invitations, speaking engagements, meetings, and scheduling requests for the Member",
      "Corresponding with outside stakeholders on scheduling matters and keeping the Member on schedule throughout the day",
      "Coordinating logistics and strategic planning for events",
      "Coordinating official travel of the Member and staff",
      "Providing operational support such as overseeing leave requests and staff training",
      "Liaising with technology department and managing member’s technology and office technology",
      "Other administrative duties as may be assigned."
    ],
    "qualifications": [
      "Experience working on the Hill and experience with scheduling and/or operations.",
      "Motivated self-starters and highly-collaborative team players",
      "Scrupulous attention to detail",
      "Keen organizational skills",
      "Effective time management",
      "Excellent oral and written communication skills",
      "Professional demeanor",
      "Strategic planning and decision-making skills",
      "Discreet approach to responsibilities"
    ],
    "how_to_apply": "To apply, please email: MD08.Resumes@mail.house.gov by January 9, 2025 with “Scheduling Director/Operations Manager: Last Name” in the subject line and the following applications materials attached as one pdf:\n1. Resume\n2. Cover letter\n3. Two writing samples\n4. Three references – including name, current title, phone number, and email address.",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation or any other characteristics protected by applicable laws, in any of its activities or operations."
  },
  {
    "id": "MEM-518-24",
    "position_title": "District Director",
    "office": "Congressman Greg Steube",
    "location": "Sarasota, Florida",
    "posting_date": "2025-01-06",
    "description": "The office of Congressman Greg Steube is seeking a District Director to oversee all in-district operations. This position is based in Sarasota, Florida, and offers a unique opportunity to play a key leadership role in the Congressman’s efforts to serve and represent constituents.\n\nPosition Overview:\nThe District Director will manage all operations of the district office and will be responsible for executing the Member’s priorities in the district. Working closely with the Member, Chief of Staff, Legislative Director, Communications Director, and Director of Operations, the District Director will contribute to the strategic development of initiatives and programs that align with the Member’s goals. This position will also serve as the public face of the office in the district, regularly attending events and representing the Congressman at meetings within the community.",
    "responsibilities": [
      "Oversee the Member’s constituent casework activities with federal departments and agencies",
      "Align district office strategies and plans with the Member’s broader goals and legislative priorities",
      "Collaborate with D.C. staff to ensure smooth communication and coordination between the district and D.C. offices",
      "Facilitate the Member’s visibility and engagement in the district through regular public appearances, meetings, and events",
      "Manage and lead district office staff, including planning, assigning, and directing work to ensure high performance and efficiency",
      "Build and maintain strong relationships with local community leaders, stakeholders, and constituents",
      "Monitor and assess district office operations to improve effectiveness and constituent satisfaction"
    ],
    "qualifications": [
      "Experience developing and implementing community relations strategies for an elected official, federal agency, or similar organization",
      "Proven ability to manage staff, make sound decisions, and prioritize competing demands in a fast-paced environment",
      "Politically astute with the ability to navigate complex political and community dynamics",
      "Familiarity with Florida’s 17th Congressional district, including its key issues and stakeholders"
    ],
    "how_to_apply": "Interested candidates should submit a resume to floridarepublicanjobs@gmail.com.",
    "salary_info": null,
    "contact": "floridarepublicanjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-517-24",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Susie Lee (D-NV)",
    "location": "DC",
    "posting_date": "2025-01-06",
    "description": "Congresswoman Susie Lee (D-NV) seeks a highly organized, good-humored, hard-working DC Scheduler to develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC. The DC Scheduler will report to the Chief of Staff and work closely with the Member, DC staff, and District staff, including a District-based scheduler responsible for in-district scheduling. This is not an entry-level role; prior scheduling experience is preferred, and salary will be commensurate with experience.\n\nResponsibilities also include tracking, evaluating, and responding to all invitations and scheduling requests, coordinating travel for the Member, compiling the Congresswoman’s nightly briefing materials, and managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties. Responsibilities will also include providing staffing support, including driving the Congresswoman as needed. Strong candidates will be creative problem solvers, have excellent attention to detail, communicate succinctly and effectively, and thrive in a fastpaced work environment. The position requires the ability to multi-task, work well under pressure, and the flexibility to be responsive to urgent scheduling needs on nights and weekends.",
    "responsibilities": [
      "Develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC.",
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Compiling the Congresswoman’s nightly briefing materials",
      "Managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties.",
      "Providing staffing support, including driving the Congresswoman as needed."
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should submit in PDF format a resume, cover letter, and three references (including name, title and organization, phone number, email, and relationship to the candidate) to nv03resumes@gmail.com with the following subject line: “Full Name – DC Scheduler.”",
    "salary_info": "salary will be commensurate with experience",
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-516-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Jennifer McClellan (VA-04)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "In close collaboration with the Member and Chief of Staff, the Communications Director will manage all aspects of the Congresswoman’s communications strategy, including her earned media, digital media, and franked communications. The Communications Director will report directly to the Chief of Staff.\n\nThe Communications Director will cultivate and manage relationships with both national and local press, field all press inquiries, and proactively pitch stories and book the Member for local and national TV; draft press releases, media advisories, and op-eds; collaborate with the Legislative and District teams to coordinate press rollouts for new legislative efforts and in-district events; manage a robust franked communications budget; oversee a rapid social media program; and oversee and manage a communications team.\n\nThis position is part of the Member’s senior staff – this is not an entry-level position. The ideal candidate should have several years of demonstrated communications experience, including on-the-record experience, strong relationships with bookers and producers, and a broad network of reporter relationships. The candidate should possess strong writing and interpersonal skills and good political instincts. Capitol Hill experience required. Virginia ties are a plus.",
    "responsibilities": [
      "Manage all aspects of the Congresswoman’s communications strategy, including her earned media, digital media, and franked communications.",
      "Cultivate and manage relationships with both national and local press.",
      "Field all press inquiries.",
      "Proactively pitch stories and book the Member for local and national TV.",
      "Draft press releases, media advisories, and op-eds.",
      "Collaborate with the Legislative and District teams to coordinate press rollouts for new legislative efforts and in-district events.",
      "Manage a robust franked communications budget.",
      "Oversee a rapid social media program.",
      "Oversee and manage a communications team."
    ],
    "qualifications": [
      "Several years of demonstrated communications experience, including on-the-record experience.",
      "Strong relationships with bookers and producers.",
      "Broad network of reporter relationships.",
      "Strong writing and interpersonal skills.",
      "Good political instincts.",
      "Capitol Hill experience required.",
      "Virginia ties are a plus."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, cover letter, and two writing samples to VA04.Jobs@mail.house.gov.",
    "salary_info": "$95,000-$105,000, commensurate with experience.",
    "contact": "VA04.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, religious affiliation, national origin, age, or military, marital, or parental status. The office prioritizes building a diverse team: women and candidates from BIPOC, LGBTQ+, and other underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-514-24",
    "position_title": "Legislative Counsel",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "The OEice of Congresswoman Pramila Jayapal (WA-07) is seeking a Legislative Counsel to lead the oEice’s Judiciary portfolio. The Congresswoman is a Member of the House Judiciary Committee and is currently the Ranking Member on the Subcommittee on Immigration Integrity, Security and Enforcement. This position will lead on all issues within the jurisdiction of the Judiciary Committee (except Immigration), which include but are not limited to antitrust, courts, criminal justice, elections, protection of civil rights and civil liberties, and intellectual property.",
    "responsibilities": [
      "Preparing and staEing the Congresswoman for committee hearings and markups including proposing strategic approaches, drafting remarks and questions, preparing amendments and talking points.",
      "Advancing current and new legislative initiatives including idea generation, building support, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets.",
      "Developing expertise in new issue areas as they arise.",
      "Representing the Congresswoman’s priorities with external stakeholders.",
      "Building and maintaining relationships with external and internal stakeholders including advocacy organizations; academics; fellow Congressional and Committee oEices; and carrying out additional duties as required."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values.",
      "Excellent writing and time management skills.",
      "Ability to digest new content with a political and ideological lens that is appropriate for the OEice.",
      "Previous Hill experience strongly preferred.",
      "Poised, level-headed, ﬂexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Candidates should submit their resume, cover letter, two writing samples, and references in PDF format to jobs.pramila@mail.house.gov with “Legislative Counsel”: [Applicant’s First and Last Name]” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The OEice of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus. Prior Hill experience is strongly preferred."
  },
  {
    "id": "MEM-510-24",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Congresswoman Angie Craig (MN-02)",
    "location": "Washington, DC",
    "posting_date": "2025-01-06",
    "description": "Congresswoman Angie Craig (MN-02) is in search of a highly-motivated Communications\nDirector in her Washington, DC oEice. This position reports to the Chief of StaE.\n\nThe Communications Director will manage all aspects of the Congresswoman’s\ncommunications portfolio – including her earned media strategy, digital media presence,\nand robust franked communications program – and will oversee a comms team that spans\nboth the DC and District oEices.\n\nThe ideal candidate should have several years of demonstrated communications\nexperience – including experience working with reporters. The candidate should be a\nstrategic thinker and dynamic writer with strong interpersonal skills, solid political\ninstincts, a good sense of humor, and a keen attention to detail.\n\nThis position is part of the Congresswoman’s senior staE – this is not an entry level\nposition.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and two writing samples to\nrepcraigresumebank@gmail.com with the subject line “Communications Director\n[applicant’s full name].”",
    "salary_info": "The position is full time with federal beneﬁts, including student loan repayment program (if\neligible), transit or parking beneﬁts, and an annual salary of between $85,000 and $95,000\ncommensurate with experience.",
    "contact": "repcraigresumebank@gmail.com",
    "equal_opportunity": "Our oEice is an equal opportunity employer and does not discriminate on the basis of race,\ncolor, religion, sex (including marital or parental status), national origin, age, disability,\ngender identity, or sexual orientation. Our oEice encourages candidates of diverse\nbackgrounds to apply."
  },
  {
    "id": "MEM-476-24",
    "position_title": "Legislative Assistant (LA)",
    "office": "Congressman Dan Crenshaw (R-TX-02)",
    "location": "Washington, D.C.",
    "posting_date": "2025-01-06",
    "description": "Congressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative Assistant (LA), based in our Washington, D.C. office. This position reports to the Legislative Director. The LA will handle an economic facing portfolio, including Budget and Appropriations, Financial Services, and Tax, with other issues to follow.\n\nIdeal candidates will have strong written and oral communications skills and be detailoriented, organized, and creative. They must be able to quickly learn the member's voice and think in a proactive, communications-focused manner.",
    "responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and staffing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas Working with external stakeholders, Congressional Research Service (CRS), Legislative Counsel, and committee staff to draft legislation based on the Member's priorities"
    ],
    "qualifications": [
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman's voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
      "Hill experience is required."
    ],
    "how_to_apply": "Qualified applicants should submit a resume and writing sample (no more than 3 pages) as one combined PDF to Kenneth.Depew@mail.house.gov. Include “Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on a rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "Kenneth.Depew@mail.house.gov",
    "equal_opportunity": null
  }
]