[
  {
    "id": "MEM-511-24",
    "position_title": "Research Assistant",
    "office": "House Committee on Veterans' A5airs (Majority), Subcommittee on Health",
    "location": "Washington, DC",
    "posting_date": "2024-12-09",
    "description": "The Majority sta5 of the House Committee on Veterans' A5airs is seeking a Research\nAssistant for the Subcommittee on Health. This position will support the Subcommittee\nSta5 Director and Professional Sta5 Members in conducting oversight of and drafting\nlegislation related to the Department of Veterans A5airs’ (VA) including its Veterans Health\nAdministration (VHA), the largest integrated health care system in the United States,\nproviding care at 1,380 health care facilities. The role involves administrative assistance,\nresearch, some policy work, and other duties as assigned. Prior congressional or federal\nagency experience is beneﬁcial. Subject matter expertise is not required. Veterans are\nstrongly encouraged to apply. This is a full-time, on-site position in Washington, DC. Some\ndomestic travel is required.",
    "responsibilities": [
      "Provide administrative assistance including answering the phone and responding to phone and email inquiries, reviewing incoming correspondence and documents, maintaining Subcommittee records, scheduling meetings, supporting hearings, and other administrative duties as assigned.",
      "Assisting with oversight including organizing and participating in meetings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities by searching for and compiling documents and information.",
      "Assisting with legislation in a limited capacity including reading and tracking pending and enacted legislation.",
      "Representing the Committee in a limited capacity including meeting with other congressional sta5, veteran service organizations, and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta5 Director, Committee Sta5 Director, or Committee Deputy Sta5 Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Problem solving skills",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Qualiﬁed candidates should send their resume to VAR.Resumes@mail.house.gov with “Health Research Assistant” in the subject line. Please include a short description of why you are interested in the position in the body of the email. Writing and editing tests, and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-503-24",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Congresswoman Emilia Sykes (OH-13)",
    "location": null,
    "posting_date": "2024-12-09",
    "description": "Congresswoman Emilia Sykes (OH-13) is seeking an experienced and enthusiastic Legislative Assistant to manage healthcare and other issues as assigned. Ideal candidates will have 2+ years of Hill experience, a good understanding of House procedures, an understanding of developing and tracking legislative initiatives, and political awareness. Experience with healthcare policy is required. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. Job responsibilities will include meeting with constituent groups and stakeholders, preparing and sta5ing the Congresswoman, drafting legislation, advancing the Congresswoman's legislative agenda, providing vote recommendations, drafting legislative memos and brieﬁng materials, and reviewing constituent correspondence, in addition to other duties as assigned.",
    "responsibilities": [
      "Meeting with constituent groups and stakeholders",
      "Preparing and sta5ing the Congresswoman",
      "Drafting legislation",
      "Advancing the Congresswoman’s legislative agenda",
      "Providing vote recommendations",
      "Drafting legislative memos and brieﬁng materials",
      "Reviewing constituent correspondence",
      "Other duties as assigned"
    ],
    "qualifications": [
      "2+ years of Hill experience",
      "Good understanding of House procedures",
      "Understanding of developing and tracking legislative initiatives",
      "Political awareness",
      "Experience with healthcare policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter"
    ],
    "how_to_apply": "Submit a resume and two writing samples to JoinTeamSykes@mail.house.gov with “Healthcare Legislative Assistant” in the Subject Line. Applications will be accepted until the end of business on Friday, December 13. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "This o5ice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-501-24",
    "position_title": "National Security Advisor",
    "office": "House GOP Member",
    "location": null,
    "posting_date": "2024-12-09",
    "description": "CORE RESPONSIBILITIES:\n1. to develop and plan legislative initiatives related to a national security, cyber\nsecurity, foreign a5airs, and armed services portfolio.\n2. to monitor legislative developments within Committees and on the House floor;\n3. to meet with constituents and advocacy groups on behalf of the Member.\n\nQUALIFICATIONS:\n1. at least 1 year of legislative experience in a full-time, paid position or legislative\nfellowship\n2. excellent oral and written communication skills;\n3. thorough knowledge of the legislative process;\n4. ability to exercise discretion and independent judgment in the formulation and\nrecommendation of policy positions for the Member;\n5. ability to work cooperatively and courteously with others;\n6. ability to work well under pressure;\n7. thoroughness and careful attention to detail",
    "responsibilities": [
      "to develop and plan legislative initiatives related to a national security, cyber security, foreign a5airs, and armed services portfolio.",
      "to monitor legislative developments within Committees and on the House floor;",
      "to meet with constituents and advocacy groups on behalf of the Member."
    ],
    "qualifications": [
      "at least 1 year of legislative experience in a full-time, paid position or legislative fellowship",
      "excellent oral and written communication skills;",
      "thorough knowledge of the legislative process;",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member;",
      "ability to work cooperatively and courteously with others;",
      "ability to work well under pressure;",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-497-24",
    "position_title": "Scheduler",
    "office": "Midwest Republican",
    "location": "Washington, D.C.",
    "posting_date": "2024-12-09",
    "description": "Midwest Republican seeks a Scheduler in the Washington, D.C. o5ice. Strong preference for applicants with prior or current Hill experience.",
    "responsibilities": [
      "Maintaining the Member’s day-to-day schedule, sharing appropriate event details, points of contact, and locations for meetings and events with the Member and sta5 as appropriate.",
      "Preparing daily itineraries for the Member along with all applicable brieﬁng materials for the day ahead.",
      "Working closely with the Member, Chief of Sta5, and Legislative Director to process all incoming meeting requests, invitations, committee hearings, and coordinating travel arrangements.",
      "Working closely with the Communications Director to schedule radio and television press, and interviews both in D.C. and in the district.",
      "Organizing expense reimbursements and working with the o5ice’s Financial Administrator to reconcile o5ice accounts.",
      "Working closely with the District Director to plan and facilitate travel to district visits.",
      "Maintains a good working relationship with constituents, committee sta5, other Congressional o5ices, and other government o5ices/agencies."
    ],
    "qualifications": [
      "Excellent organizational skills and attention to detail are required.",
      "Ideal candidates should have at least 1-2 years of relevant experience and the ability to multitask in a very fastpaced environment."
    ],
    "how_to_apply": "Interested applicants can send their resume and any references to GOPMidwestScheduler@gmail.com.",
    "salary_info": null,
    "contact": "GOPMidwestScheduler@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-484-24",
    "position_title": "Caseworker",
    "office": "Congressman Gabe Amo (RI-01)",
    "location": "Rhode Island",
    "posting_date": "2024-12-09",
    "description": "Congressman Gabe Amo (RI-01) seeks a Caseworker to join his district office in Rhode Island. Candidates must have exceptional written and verbal communication skills, be organized, and pay attention to detail. Candidates will be expected to be a liaison to other government entities on behalf of the Congressman to serve constituents. Candidates should have a strong ability to exercise discretion and judgment in resolving casework.\n\nThe Caseworker will report to the District Director, work with the staff in Washington D.C. as appropriate, and may have other duties as assigned.\n\nCandidates should have experience working in a fast-paced office and maintain a professional, flexible, and positive demeanor while managing competing tasks and projects. The Caseworker will be expected to maintain accurate and complete files on all assigned casework matters and be able to respond to constituent request for information. Casework or other relevant experience is strongly preferred. This is not an entry-level position. Rhode Island ties are a plus. Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, send in a single PDF with a resume, a cover letter, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01JobsAmo@gmail.com, with the following subject line: “Full Name – Caseworker”.",
    "salary_info": null,
    "contact": "RI01JobsAmo@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  }
]