[
  {
    "id": "MEM-040-25",
    "position_title": "Legislative Director",
    "office": "Congressman Rob Wittman",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congressman Rob Wittman is seeking a highly motivated and experienced Legislative Director to lead his legislative agenda and coordinate policy initiatives in his Washington, D.C. office. The Legislative Director would handle the Congressman’s Natural Resources Committee assignment, as well as Energy, Environment and Chesapeake Bay, Tax, Telecom/Broadband, Transportation & Infrastructure, Appropriations and the Budget, Immigration, Labor/Workforce/Federal Employees. In addition, the Legislative Director will have a close working relationship with the Chief of Staff in building and maintaining relationships with other lawmakers, committee staff, and advocacy groups.\n\nThe Legislative Director should be knowledgeable about issues relating to Virginia and VA01, and work closely with the District Director and district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative efforts. Most importantly, the Legislative Director should have a genuine commitment to public service and advocating for the best interests of Virginia’s First District.",
    "responsibilities": [
      "Develop and implement a comprehensive legislative strategy aligned with the Congressman’s priorities and constituents' needs.",
      "Manage and mentor a legislative team, provide guidance, and foster collaboration among staff members.",
      "Build and maintain relationships with other lawmakers, committee staff, advocacy groups, and stakeholders to advance the Congressman’s legislative goals.",
      "Engage with district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative efforts.",
      "Understand the political landscape and anticipate the implications of legislative actions as it relates to VA-01.",
      "Draft legislation, amendments, and policy papers, ensuring clarity and adherence to congressional procedures.",
      "Maintains up-to-date tracking reports on all legislative items including Sponsored and Cosponsored legislation and letters, provisions in larger bills, and district wins.",
      "Review responses to all constituent mail, and review content produced by the communications team.",
      "Represent the Congressman in meetings with constituents, interest groups, and other legislative offices.",
      "Monitor legislative developments and provide timely updates to the Congressman and his staff."
    ],
    "qualifications": [
      "Minimum of 5 years of experience in legislative affairs, public policy, or a related field, preferably in a congressional office.",
      "Strong understanding of the legislative process and federal government operations.",
      "Excellent writing, research, and communication skills.",
      "Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.",
      "Commitment to public service and the values of Congressman Wittman.",
      "Virginia ties Preferred"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and references to Carolyn.King@mail.house.gov with the subject line “Legislative Director Application.”",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-038-25",
    "position_title": "Communications Director",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks an experienced and creative Communications Director to join her Washington, D.C. office. The ideal candidate should have experience working on Capitol Hill, possess strong written and oral communication skills, have demonstrated political instincts with a thorough knowledge fostering and maintaining relationships with press. They should be a team player who is self-motivated, detailed oriented, comfortable managing multiple projects under strict deadlines and able to explore innovative approaches to traditional communications.\n\nThis position will act as chief spokesperson for the Member, develop and execute strategic communications plans, and work closely with the Communications Team. This is not an entry level position. Candidates must have previous communications and press related experience. Connecticut ties are a preferred but not required. This is a senior level position and only applicants who meet all qualifications will be considered.",
    "responsibilities": [
      "Lead strategy development and implementation of the Member’s communications objectives in consultation with senior staff;",
      "Oversee day-to-day press activities, including responding to media inquiries, booking interviews, and pitching to media outlets;",
      "Produce press releases, speeches, op-eds, talking points, and statements;",
      "Develop and execute press conferences and public events centered around core messaging areas;",
      "Advance and staff the Member at media events and other commitments, including nights and weekends;",
      "Develop social media content creation, including rapid response;",
      "Produce franked communications, including 499s and mailers;",
      "Stay up to date on current events and legislation relevant to the Member and the priorities of the district; and",
      "Assist the Member and senior staff in other projects and duties as assigned."
    ],
    "qualifications": [
      "Capitol Hill or political experience or a demonstrated knowledge of Congress and the legislative process;",
      "3-4 years of experience, with on the record experience as a press secretary or other communications role;",
      "Superior writing, editing, and oral communications skills;",
      "Creative thinker with innovative approaches and an understanding of traditional communications and digital media;",
      "Ability to work collaboratively and courteously with others;",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response;",
      "Careful attention to detail;",
      "Availability to work non-traditional hours; and",
      "Experience working with stakeholders on messaging opportunities and priorities."
    ],
    "how_to_apply": "Interested parties should e-mail a concise cover letter including salary requirements, a resume, and two writing samples to CT05jobs@mail.house.gov with the following subject line: Full Name – Communications Director. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Women, minorities and candidates with Connecticut ties are strongly encouraged to apply."
  },
  {
    "id": "MEM-037-25",
    "position_title": "LEGISLATIVE COUNSEL",
    "office": "Rep. Madeleine Dean (PA-04)",
    "location": "DC",
    "posting_date": "2025-02-03",
    "description": "Rep. Madeleine Dean (PA-04) seeks a Legislative Counsel with strong oral and written\ncommunication skills to join her DC o?ice. The candidate’s primary responsibility will be\noverseeing the Congresswoman’s work on the Appropriations Commerce, Justice, Science\nSubcommittee, which includes issues such as gun violence prevention, criminal justice\nreform, trade, AI/Tech, court reform, intellectual property, immigration, antitrust, and civil\nrights. This person will also be responsible for overseeing other issue areas as assigned\nand will work in coordination with the Member’s Legislative Director and Chief of Sta? to\nadvance the Congresswoman’s legislative goals.",
    "responsibilities": [
      "Preparing and sta?ing the Congresswoman for committee hearings and markups including proposing strategic approaches, drafting remarks and questions, understanding issues su?iciently to respond to questions;",
      "Advancing current and new legislative initiatives including idea generation, building support, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets;",
      "Developing expertise in new issue areas as they arise;",
      "Representing the Congresswoman’s priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal stakeholders including advocacy organizations; academics; fellow Congressional and Committee o?ices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "A strong policy background within the portfolio;",
      "A team player and a self-starter;",
      "Strong written and verbal communication skills;",
      "Previous Capitol Hill experience or experience working in the legal ﬁeld;",
      "Strong understanding of the legislative process and coalition building;",
      "Ability to maintain strategic relationships with constituent organizations;",
      "Comfortable managing multiple priorities in a fast-paced environment."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, writing sample, and references to PA04applications@gmail.com with the subject line “Legislative Counsel [applicant’s last name]” The application deadline is 2/5/25. The o?ice will contact the best qualiﬁed candidates to begin our interview process on a rolling basis. Please, no phone calls or drop ins.",
    "salary_info": null,
    "contact": "PA04applications@gmail.com",
    "equal_opportunity": "The o?ice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "preferences": [
      "Law Degree",
      "Appropriations experience",
      "A demonstrated interest in public service"
    ]
  },
  {
    "id": "MEM-036-25",
    "position_title": "Legislative Director Job Listing",
    "office": "A conservative Midwest Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "A conservative Midwest Member of Congress has an immediate need to hire an\nexperienced full-time Legislative Director in the Washington, D.C. office. Interested\ncandidates are encouraged to email their resume, cover letter, and references to\nConservativeRep@mail.house.gov. Please use ‘Legislative Director’ as the subject line, and\nin the body of the email, please indicate where you found this job description.",
    "responsibilities": [
      "This Legislative Director plays an essential leadership role in the office. This position works\nclosely with the Chief of Staff in assisting with the formulation of the Member’s policy and\nlegislative strategy and moving the Member’s legislation. The Legislative Director will also\nwork with the Communications Director to ensure that the Member’s legislative strategy is\nincorporated into the office’s communications plan. Additionally, the Legislative Director\nmay also manage and oversee the performance of the legislative team."
    ],
    "qualifications": [
      "Prior Legislative Director Experience",
      "Proficient at moving legislation",
      "Capitol Hill experience",
      "Great writer",
      "Management Experience",
      "Proficient at Microsoft suite",
      "Detail oriented",
      "Multitasker"
    ],
    "how_to_apply": "Interested candidates are encouraged to email their resume, cover letter, and references to ConservativeRep@mail.house.gov. Please use ‘Legislative Director’ as the subject line, and in the body of the email, please indicate where you found this job description.",
    "salary_info": null,
    "contact": "ConservativeRep@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-035-25",
    "position_title": "Professional StaO Member",
    "office": "House Committee on Veterans' A?airs (Majority)\nSubcommittee on Health",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "The Majority sta? of the House Committee on Veterans' A?airs is seeking a Professional\nSta? Member for the Subcommittee on Health. This position will support the\nSubcommittee Sta? Director in conducting oversight of and drafting legislation related to\nthe Department of Veterans A?airs’ (VA) including its Veterans Health Administration (VHA),\nthe largest integrated health care system in the United States, providing care at 1,380\nhealth care facilities. The role involves research, drafting legislation, leading oversight\nincluding trips to VA facilities, leading engagements with outside stakeholders, and other\nduties as assigned. Candidates with healthcare experience or prior medical experience are\nstrongly preferred. Veterans are strongly encouraged to apply. This is a full-time, on-site\nposition in Washington, DC. Some domestic travel is required.",
    "responsibilities": [
      "Leading oversight including organizing and participating in meetings, drafting memos,\nreading documents, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities.",
      "Leading legislation drafting e?orts.",
      "Representing the Committee including meeting with other congressional sta?, veteran\nservice organizations, and external healthcare stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta? Director, Committee Sta?\nDirector, or Committee Deputy Sta? Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Post-graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Problem solving skills",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Qualiﬁed candidates should send their resume to VAR.Resumes@mail.house.gov with\n“Health PSM” in the subject line. Please include a short description of why you are\ninterested in the position in the body of the email. Writing and editing tests, and references\nmay be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of\nRepresentatives is an equal opportunity employer. All applicants will be considered\nwithout regard to race, color, national origin, religion, sex (including marital or parental\nstatus), disability, or age. Transportation and all related travel expenses associated with the\ninterview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-029-25",
    "position_title": "Speechwriter",
    "office": "Office of Democratic Leader Hakeem Jeffries",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The O?ice of Democratic Leader Hakeem Je?ries seeks an exceptional writer and researcher to support all aspects of a fast-paced communications operation. Job responsibilities include drafting written remarks, talking points, press statements and more. Candidates should have experience writing ﬂawless public-facing remarks and statements for a principal. This o?ice is an equal opportunity employer committed to a diverse and inclusive workforce and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity or disability. Women and minority applicants are encouraged to apply.",
    "responsibilities": [
      "Drafting written remarks",
      "Talking points",
      "Press statements and more"
    ],
    "qualifications": [
      "Experience writing flawless public-facing remarks and statements for a principal"
    ],
    "how_to_apply": "To apply, please send PDFs of resume, cover letter, three writing samples (including at least one set of remarks written for a principal), and three professional references to resumes.je?ries@mail.house.gov with your name and “Speechwriter” in the subject line. Absolutely no phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "resumes.je?ries@mail.house.gov",
    "equal_opportunity": "This o?ice is an equal opportunity employer committed to a diverse and inclusive workforce and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity or disability. Women and minority applicants are encouraged to apply."
  },
  {
    "id": "MEM-028-25",
    "position_title": "Content Partnership Manager",
    "office": "The House Democratic Policy and Communications Committee",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The House Democratic Policy and Communications Committee seeks a Content Partnership Manager. This role is at the intersection of digital media and political communications, with a focus on supporting Democratic Members of Congress and amplifying their voices by building and managing relationships with digital creators, streamers, and podcasters and ensuring e@ective engagement with national and local audiences across various platforms.",
    "responsibilities": [
      "Identify, cultivate, and manage relationships with creators, streamers, and podcasters. Use these relationships to act as a liaison between content creators and Members of Congress to facilitate meaningful interactions on political and non-political topics.",
      "Secure opportunities for Members of Congress to appear on local and national digital platforms and ensure e@ective messaging and maximum audience engagement. This will include coordinating logistics for creator-driven content and events around key legislative proceedings and moments such as joint congressional addresses.",
      "Support Members and sta@ with best practices on engaging with digital media on their own, with a particular focus on strategies to connect Members of Congress with local and regional creators, streamers, and podcasters to amplify legislative priorities and personal stories.",
      "Develop and manage a robust data analytics program to track Members of Congress’ engagement with digital creators, streamers, and podcasters and use the ﬁndings to direct their work to bolster Caucus-wide digital partnerships."
    ],
    "qualifications": [
      "A minimum of 3-5 years of experience in digital communications, political communications, public relations, or a related ﬁeld",
      "A proven track record of managing partnerships or relationships with digital creators or inﬂuencers.",
      "Strong understanding of social media platforms, trends, and digital audience engagement.",
      "Excellent written and verbal communication skills.",
      "Ability to manage multiple projects in a fast-paced environment and meet tight deadlines."
    ],
    "how_to_apply": "To apply, please send PDFs of resume, cover letter, and three professional references to resumes.je@ries@mail.house.gov with your name and “Content Partnership Manager” in the subject line. Absolutely no phone calls or drop-ins.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "resumes.je@ries@mail.house.gov",
    "equal_opportunity": "This o@ice is an equal opportunity employer committed to a diverse and inclusive workforce and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity or disability. Women and minority applicants are encouraged to apply."
  },
  {
    "id": "MEM-034-25",
    "position_title": "Contracts Investigator",
    "office": "House Committee on Veterans’ AOairs (Majority)",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "The House Committee on Veterans’ A?airs Majority sta? seeks a subject matter expert on government procurement, contracting, and acquisition.",
    "responsibilities": [
      "Under the supervision of the General Counsel for the Committee, the individual will conduct oversight and develop policies relating to Department of Veterans A?airs (VA) procurement, contracting, and acquisition.",
      "The responsibilities encompass the entire VA, which includes the Veterans Beneﬁts Administration, Veterans Health Administration, National Cemetery Administration, and VA Central O?ice organizations. This also covers a wide range of activities such as small-dollar procurement, contracting by negotiation, major acquisition, Federal Supply Schedules, category management, construction, leasing, information technology, health care, research and development, and small business.",
      "Collect technical information and translate it into brieﬁngs, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Meet with congressional sta?, veteran service organizations, industry organizations, and internal and external stakeholders.",
      "Perform other duties as assigned by the General Counsel, Committee Deputy Sta? Director, and Committee Sta? Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Work experience in procurement operations, preferably as a contract specialist or contracting o?icer in a federal agency",
      "Command of the Federal Acquisition Regulation and familiarity with major procurement laws",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume to VAR.Resumes@mail.house.gov with “Contracts Investigator “in the subject line. Writing samples and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Veterans are strongly encouraged to apply."
  },
  {
    "id": "MEM-033-25",
    "position_title": "Scheduler",
    "office": "The Office of Congresswoman Alma S. Adams (NC12)",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "The Office of Congresswoman Alma S. Adams (NC12) seeks an experienced, highly organized, and detail-oriented Scheduler for her Washington, DC office. This is not an entry-level position. The ideal candidate will possess exceptional time management skills, the ability to prioritize and manage competing demands, and the capacity to perform well under pressure in a fast-paced environment. The Scheduler is responsible for managing the Congresswoman's complex schedule, organizing official travel, and acting as a liaison with various stakeholders, including constituents, fellow Members of Congress, distinguished guests, and leaders from public, private, and nonprofit sectors.\n\nThe Scheduler will work closely with the Member, Chief of Staff, and Deputy Chief of Staff/District Director to ensure the smooth coordination of the Member's day-to-day activities and long-term commitments.",
    "responsibilities": [
      "Scheduling & Coordination:",
      "Manage and maintain the Congresswoman’s daily and long-term schedule, ensuring all appointments, meetings, events, and travel are accounted for.",
      "Receive, prioritize, and organize incoming scheduling requests from internal and external stakeholders.",
      "Communicate with external organizations, constituents, and other congressional offices to coordinate scheduling requests, events, and meetings.",
      "Maintain flexibility to accommodate changes to the schedule throughout the day and ensure the Congresswoman is briefed on updates in real time.",
      "Ensure that all meetings, events, and activities are properly logged and tracked.",
      "Travel & Logistics:",
      "Coordinate all travel arrangements for the Congresswoman, including transportation, lodging, and related logistics.",
      "Work with the Chief of Staff and Deputy Chief of Staff to coordinate travel schedules and ensure seamless transitions between office duties and travel commitments.",
      "Manage travel-related expenses, including collecting receipts and submitting for reconciliation with the financial administrator.",
      "Briefing & Preparation:",
      "Work with the Member and relevant staff to prepare daily briefing materials, including key meeting objectives, background information, and travel logistics.",
      "Provide daily and weekly briefings to the Congresswoman on upcoming events, meetings, and other scheduling matters.",
      "Liaison & Communication:",
      "Serve as the primary point of contact for coordinating scheduling with key stakeholders, including Members of Congress, Congressional staff, government officials, donors, advocates, and other influential partners.",
      "Ensure timely and professional communication with constituents, including responding to scheduling inquiries and arranging meetings or office visits as appropriate.",
      "Collaborate with other congressional offices, leadership staff, and external organizations to ensure seamless scheduling and minimize conflicts.",
      "Administrative Support:",
      "Track and manage the Congresswoman’s messages, telephone calls, and emails as requested, ensuring timely follow-up, follow-through and prioritization.",
      "Assist with administrative tasks as needed, including drafting correspondence, managing schedules, and other office support functions."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a cover letter, a resume, and three references to NC12.resume@mail.house.gov with “[NAME] –Scheduler” in the subject line.",
    "salary_info": "Salary: commensurate with experience.\nBenefits: Eligible for transit benefits, student loan repayment assistance, and other standard congressional office benefits. Additional benefits to be discussed during the interview process.",
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-032-25",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Janelle Bynum (OR-5)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Janelle Bynum (OR-5) seeks a Legislative Assistant to join her\nWashington, D.C. office. The position will primarily be responsible for managing an active\npolicy portfolio based on both the office’s needs and the selected candidate’s interests.\n\nThe Congresswoman’s priorities include advocating for family-first policies, lowering the\ncost of living, promoting economic growth, and making government work better for all\nAmericans. This position will not handle the House Financial Services Committee portfolio.\n\nThis is not an entry-level position and previous relevant policy and/or Capitol Hill\nexperience is required. Oregon-ties are a plus.\n\nPreference will be given to candidates who understand the appropriations process, have a\ncustomer service-first attitude, and can anticipate the evolving needs of a battleground\nmember. Successful candidates are those who have a constant appetite to learn about\nlegislative processes, possess entrepreneurial skills, and demonstrate the ability to adapt\nto the fast-paced environment of a new member office.",
    "responsibilities": [
      "Develop legislative initiatives and collaborate closely with the legislative and communications teams to advance the Congresswoman’s priorities.",
      "Monitor legislative developments in Congress and the Administration and provide vote recommendations.",
      "Meet with constituents and advocacy groups, draft briefing materials, and prepare talking points.",
      "Staff the Congresswoman at relevant meetings and events.",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Previous relevant policy and/or Capitol Hill experience is required.",
      "Oregon-ties are a plus.",
      "Understanding of the appropriations process",
      "Customer service-first attitude",
      "Ability to anticipate the evolving needs of a battleground member.",
      "Constant appetite to learn about legislative processes",
      "Entrepreneurial skills",
      "Ability to adapt to the fast-paced environment of a new member office."
    ],
    "how_to_apply": "To apply, please send in a single PDF: cover letter, resume, and contact information for\nthree professional references to BynumOregonJobs@gmail.com with the subject line\n“Legislative Assistant – [Your Name].” The office will contact the most qualified candidates\nto begin the interview process on a rolling basis.",
    "salary_info": null,
    "contact": "BynumOregonJobs@gmail.com",
    "equal_opportunity": "Our office is committed to diversity and does not discriminate based on race, color,\nreligion, sex, sexual orientation, gender identity, disability, age, or national origin. We\nencourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-031-25",
    "position_title": "Clerk/Paralegal",
    "office": "House Office of the Legislative Counsel",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "A Clerk/Paralegal for the O?ice of the Legislative Counsel assists the attorneys and teams of the O?ice to meet the legislative drafting needs of the House of Representatives through a wide variety of activities. This position will report to the Executive Assistant and does not have any supervisory responsibilities.",
    "responsibilities": [
      "Assisting attorneys in the O?ice with the creation of legislative text, including by formatting text provided from a variety of sources, making edits from marked copy, and working collaboratively with attorneys in person and using Microsoft Teams.",
      "Carefully editing legislative text to minimize errors during the process of formatting, updating, or drafting the text and e?ectively communicating issues discovered.",
      "Drafting certain types of legislation, under the supervision of an attorney, while working directly with the o?ices of House Members.",
      "Administrative tasks, including maintaining equipment in the O?ice.",
      "Additional duties as assigned."
    ],
    "qualifications": [
      "Excellent written and oral communication skills.",
      "Attention to detail.",
      "Knowledge of, and experience with, various information and o?ice systems, including word processing and email (candidates experienced in working with XML encouraged).",
      "Ability to self-start, multi-task, and e?ectively prioritize under tight deadlines.",
      "Ability to work both independently and cooperatively.",
      "Willingness to learn, including a willingness to initiate learning and ask questions."
    ],
    "how_to_apply": "Qualified candidates please submit your cover letter and resume by February 10, 2024 via this link.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": "The House O?ice of the Legislative Counsel is dedicated to building an inclusive, diverse, and accessible workplace. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age.\nContinued employment is contingent upon satisfactorily completing a criminal history records check (or other applicable security clearance)."
  },
  {
    "id": "MEM-030-25",
    "position_title": "Legislative Assistant / senior LA / policy advisor",
    "office": "Representative Jill Tokuda (D-HI-02)",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "Representative Jill Tokuda (D-HI-02) seeks an experienced candidate for a Legislative Assistant / senior LA / policy advisor to lead her work on the House Agriculture Committee. This portfolio will consist of other topics that may include energy, the environment, financial services, and other economic issues.\n\nThis is not an entry-level position and will report to the legislative director.",
    "responsibilities": [
      "Staffing the Representative",
      "Monitoring committee and Floor activities",
      "Developing and advancing legislative initiatives",
      "Reviewing constituent correspondence",
      "Coordinating with the communications team and District Office",
      "Representing the member and the office at events and meetings"
    ],
    "qualifications": [
      "At least two years of substantive policy experience and work on the Hill.",
      "Strong communication skills",
      "Relevant policy experience",
      "A positive and can-do attitude",
      "A willingness to work in a fast-paced, collaborative environment."
    ],
    "how_to_apply": "Please send a cover letter, resume, two writing samples, and a list of three references in a single PDF to hawaii02jobs@gmail.com with “Agriculture Legislative Staffer – [Last Name, First Name]” in the subject line.",
    "salary_info": "Salary and title will be commensurate with experience and qualifications.",
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-027-25",
    "position_title": "Staff Assistant",
    "office": "Committee on Transportation and Infrastructure",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The Majority staff of the Committee on Transportation and Infrastructure seeks an\norganized and self-motivated candidate for the position of Staff Assistant.\n\nResponsibilities include answering phone calls, greeting office visitors, maintaining\nmeeting room schedules, general office administrative duties, and compiling materials for\nmembers and staff for use during committee activity. Staff assistants also assist in\nexecuting operational support necessary for committee events including roundtables,\nhearings, and markups.",
    "responsibilities": [
      "Answering phone calls",
      "Greeting office visitors",
      "Maintaining meeting room schedules",
      "General office administrative duties",
      "Compiling materials for members and staff for use during committee activity",
      "Assist in executing operational support necessary for committee events including roundtables, hearings, and markups"
    ],
    "qualifications": [
      "Well-organized, dependable, and hardworking with demonstrated experience in high-pressure work environments.",
      "Previous Capitol Hill internship experience is required."
    ],
    "how_to_apply": "Interested candidates should send a resume to tirepresumes@mail.house.gov using the\nposition and their name in the subject line.",
    "salary_info": null,
    "contact": "tirepresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-026-25",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Congressman Greg Steube",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "Congressman Greg Steube is seeking an experienced, highly motivated Communications Director to spearhead the office’s strategic communications efforts. This individual will manage all aspects of media relations, content creation, and digital strategy. The ideal candidate will be an exceptional writer, a strong strategic thinker, and a skilled manager who thrives in a fast-paced environment.",
    "responsibilities": [
      "Pitch and book local and national media regularly to ensure strong and consistent coverage.",
      "Develop and maintain strong relationships with local and national press to amplify the Congressman’s message.",
      "Create daily social media content (including graphic design) and write compelling statements, press releases, media advisories, op-eds, radio ad scripts, and the weekly newsletter.",
      "Draft talking points, speeches, and key messaging for public appearances and interviews.",
      "Oversee and manage a large communications budget, covering areas such as mass mailers, digital ads, radio ads, text messages, surveys, and email campaigns.",
      "Produce, edit, and clip video content for use on social media and other platforms."
    ],
    "qualifications": [
      "Proven experience in strategic communications, public relations, and/or media relations—ideally in a political, public affairs, or government context.",
      "Strong writing, editing, and verbal communication skills, with the ability to craft concise, persuasive messaging under tight deadlines.",
      "Solid understanding of social media platforms, digital advertising, and video content creation.",
      "Strong organizational, time-management, and project management skills with the ability to juggle multiple priorities simultaneously.",
      "Experience managing budgets and working with vendors, including for advertising and media buys.",
      "A self-starter who can work independently and as part of a dynamic team."
    ],
    "how_to_apply": "Interested applicants should send resume and cover letter to:",
    "salary_info": null,
    "contact": "Floridarepublicanjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-025-25",
    "position_title": "PRESS SECRETARY",
    "office": "The Office of Rep. French Hill (AR02)",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The Press Secretary is responsible for driving an established press strategy that combines both local and national press goals. Responsibilities include overseeing the preparation of all communications materials and preparation of all digital, audio and print content, including graphics. Responsibilities also include managing media relations and developing contacts with members of the media and community leaders. Where necessary, the Press Secretary acts as the formal spokesperson and media liaison for the Congressman.\n\nExcellent verbal and written communications skills are required, as are proficiency and flexibility with communications technologies. This role requires the production of numerous types of communications products including press releases, op-eds, talking points, newsletters, speeches, and social media posts. Having an established network of media contacts is a plus as is prior management experience.\n\nDesired attributes include the ability to thrive in a fast-paced environment and an openness to learning new technologies and communications tools. The Press Secretary is a member of the Senior Staff team.",
    "responsibilities": [
      "Overseeing the preparation of all communications materials and preparation of all digital, audio and print content, including graphics.",
      "Managing media relations and developing contacts with members of the media and community leaders.",
      "Acting as the formal spokesperson and media liaison for the Congressman."
    ],
    "qualifications": [
      "At least three years of prior relevant experience in communications and / or press roles.",
      "Excellent verbal and written communications skills.",
      "Proficiency and flexibility with communications technologies.",
      "Established network of media contacts is a plus.",
      "Prior management experience is a plus.",
      "Ability to thrive in a fast-paced environment.",
      "Openness to learning new technologies and communications tools."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to ar02.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ar02.applications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-25",
    "position_title": "FIELD REPRESENTATIVE",
    "office": "Senior Democratic Member of Congress",
    "location": "Santa Rosa, California",
    "posting_date": "2025-02-03",
    "description": "The Field Representative serves as the Member's community representative for issues and programs within their assigned areas, including monitoring and updating the Member and their colleagues on important local issues, emerging trends, and critical developments. They also represent the Member at community events and meetings, schedule the Member while in the district, prepare and attend meetings and events with the Member, answer casework correspondence and verbal communications with constituents, act as liaison with federal, district, and local agencies for the Member and constituents, and other duties important to serving the people of the congressional district.",
    "responsibilities": [
      "Coordinates with the Member and colleagues to ensure outreach efforts align with the Member’s strategic vision, goals, and priorities",
      "Collaborates with district and D.C. colleague to ensure district priorities are aligned and inform the Member’s legislative strategy",
      "Serves as a liaison with federal government entities for individual constituent concerns, including the handling of constituent casework",
      "Collaborates with colleagues to schedule the Member while in their assigned areas in the district",
      "Assesses casework trends and identifies issues requiring legislative action and/or additional Congressional oversight",
      "Informs the Member and colleagues on any important developments and current events impacting the district",
      "Builds and maintains positive relationships with constituents, key community leaders, and other stakeholders",
      "Tracks news stories and social media posts for the Member and colleagues, including the communications team",
      "Acts as a liaison to local, state, and federal officials and stakeholders to form effective relationships for the Member",
      "Attends events to serve as a representative for the Member, as determined by their supervisor",
      "Handles various community issues in accordance with office policies and procedures.",
      "Support Office in executing public meetings and annual Congressional activities such as the Congressional Art Competition, Congressional App Competition, and other similar events.",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner",
      "Understands differing perspectives and opinions to navigate conflicts and develop solutions effectively"
    ],
    "qualifications": [
      "Must be a self-starter, hard-working, highly dependable, adaptable, and organized as well as possess strong oral and written communication skills and the ability to work quickly under pressure.",
      "Good judgment, strong customer service and interpersonal skills, ability to develop and collaborate with coalitions, works well in a team environment, a passion for public service, and availability to work evenings and weekends are required.",
      "Driver’s license and access to vehicle is required.",
      "Bachelor's degree or equivalent combination of education and experience preferred.",
      "Prior experience developing a community relations strategy for a Member of Congress, elected official, or Federal agency is preferred.",
      "Familiarity with Member's district, especially Rohnert Park, Cotati, and Penngrove, is preferred.",
      "Ability to communicate in multiple languages, especially Spanish, is highly desirable."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples and three references to ca04districtstaff@gmail.com with the Subject Line: Field Representative Vacancy.",
    "salary_info": "$59,540 - $68,093",
    "contact": "ca04districtstaff@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-022-25",
    "position_title": "DISTRICT CASEWORKER (Social Security and Medicare)",
    "office": "Congresswoman Madeleine Dean (PA-04)",
    "location": "Glenside, PA",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Madeleine Dean (PA-04) seeks a motivated and organized individual to join her team as a Congressional Caseworker based in Glenside, PA. This position serves as a liaison to federal, district, and local agencies on behalf of the Member and her constituents. The Caseworker will handle a portfolio of issue areas while serving as the lead on all Social Security and Medicare concerns through casework correspondence and verbal communication with constituents.",
    "responsibilities": [
      "Acts as the representative for the Member in the realm of Social Security and Medicare including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with other federal, district, and local agencies.",
      "Informs the Member and District Director of all happenings in his or her assigned issue areas.",
      "Handles and prioritizes casework assignments while assisting with general intake, constituent services requests, and communication in an office environment.",
      "Assesses casework inquiries for problems requiring legislative action and makes recommendations to the District Director and Chief of Staff.",
      "Screens and refers cases, when appropriate, to other district offices.",
      "Logs all incoming and outgoing mail and telephone calls relating to casework in Customer Relationship Management (CRM) system.",
      "Prepares periodic reports for the Casework Manager on pending cases and district activities in his or her assigned issue areas.",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner.",
      "Maintains up-to-date files on all cases and issues of importance to the office.",
      "Maintains a good working relationship with the Member, staff, and constituents.",
      "Accepts performance-based criticism and directions.",
      "Works well under pressure and handles stress.",
      "Performs other duties as assigned.",
      "Works Monday – Friday 8:30am – 4:30pm, with occasional nights and weekends for town hall meetings and other special events."
    ],
    "qualifications": [
      "Strong oral and written communication skills.",
      "Knowledge of legislative process and of House organization and procedures.",
      "Knowledge of local, state, and federal agencies and departments—especially regarding Social Security and Medicare programming.",
      "Professional telephone manner.",
      "Strong organization and follow-up skills.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others.",
      "Thoroughness and careful attention to detail.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Knowledge of office policies, practices, and procedures.",
      "Knowledge of office computer applications.",
      "Proficiency in word processing as well as with office equipment: scanner, copier, printer, desktop computer."
    ],
    "how_to_apply": "All interested candidates should email a resume and cover letter directly to mdeanhiring@gmail.com with the subject line “Caseworker – [Applicant’s Last Name]",
    "salary_info": null,
    "contact": "mdeanhiring@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-021-25",
    "position_title": "Communications Director, House Committee on Veterans’ A?airs Democratic Sta?",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The Democratic Sta? of the House Committee on Veterans’ A?airs seeks a Communications Director to implement the Ranking Member’s Committee communications strategy.",
    "responsibilities": [
      "Serve as primary communications advisor for the Ranking Member and Democratic Committee Sta?",
      "Manage the execution of the communications strategy",
      "Oversee day-to-day press activities, including responding to media inquiries, booking interviews, and pitching news stories to media outlets",
      "Work with policy leads to develop core messaging and talking points",
      "Produce press releases, speeches, op-eds, and materials that are at or near ﬁnished product",
      "Supervise other press sta?",
      "Assist with the development of talking points, remarks, statements, press releases, advisories, and caucus messaging guides",
      "Assist with the coordination, preparation, and execution of media interviews, speaking engagements, and press conferences",
      "Monitor and track media appearances, manage media relationships, and work with policy subject matter experts to identify opportunities for media engagement",
      "Assist with rapid response e?orts",
      "Coordinate with Committee Member o?ices on any press related needs",
      "Sta? Ranking Member at press events"
    ],
    "qualifications": [
      "Superior writing, editing, and oral communications skills",
      "Creative thinker with innovative approaches and an understanding of digital media",
      "Ability to work cooperatively and courteously with others",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response",
      "Thoroughness and careful attention to detail.",
      "Availability to work non-traditional hours"
    ],
    "how_to_apply": "All candidates are required to complete an online application at https://democratsveterans.house.gov/opportunities to be considered for this position. There you can upload your resume, cover letter, and two professional writing samples.",
    "salary_info": "Salary range $90K-$110K, commensurate with experience.",
    "contact": null,
    "equal_opportunity": "To build a diverse and more inclusive work environment, veterans, minorities, women, people with disabilities, and LGBTQ+ candidates are encouraged to apply."
  },
  {
    "id": "MEM-019-25",
    "position_title": "Press Assistant",
    "office": "The Energy and Commerce Committee Democratic Staff",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The Energy and Commerce Committee Democratic Sta? seeks a motivated and\nhardworking communications professional to join fast-paced communications team as a\nPress Assistant.",
    "responsibilities": [
      "Drafting press releases, social media posts, talking points, and the committee newsletter",
      "Designing graphics for both social media and web content",
      "Producing and editing videos and photos",
      "Monitoring social media",
      "Maintaining and updating press lists",
      "Compiling daily press clips"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Proven ability to perform under pressure while juggling multiple tasks",
      "Sound political judgment",
      "Prior Hill or campaign communications experience, as well as professional social media and digital experience (including graphic design and photo and video editing), is preferred"
    ],
    "how_to_apply": "Qualiﬁed candidates should submit a cover letter, resume, one writing sample, and two\ndigital samples to ecdjobs@mail.house.gov. Please no walk ins or phone calls.",
    "salary_info": "$65,000",
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Our o?ice deeply values the diversity of our employees and encourages candidates from\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-016-25",
    "position_title": "Senior Legislative Assistant",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "The O?ice of Congresswoman Pramila Jayapal (WA-07) is seeking an experienced Senior\nLegislative Assistant to handle a comprehensive portfolio that could include the following\nissues: education, childcare, tax, ﬁnancial services, housing, healthcare, labor,\ntransportation, commerce and small business. The issue set will depend on the\ncandidate’s experience and interests. We encourage individuals with legislative, research\nand writing experience to apply and we will discuss the issue set more in depth through the\ninterview process.\n\nThis position requires the ability to advance Congresswoman Jayapal's legislative priorities\nin their issue portfolio. The ideal candidate will come with previous legislative experience,\nincluding the knowledge and abilities to drive issues with traditional legislative tools (i.e.\ncommittee work, bill introductions) as well as organizing tools (i.e. events with partners, in\ndistrict town halls).",
    "responsibilities": [
      "Driving current and new legislative initiatives including idea generation, legislative\ndrafting and producing accompanying materials, such as speeches, policy memos,\nand factsheets;",
      "Preparing and sta?ing the Congresswoman for relevant committee hearing and\nmarkups; drafting hearing remarks and questions;",
      "Representing the Congresswoman’s priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal\nstakeholders including advocacy organizations; academics; fellow\nCongressional and Committee o?ices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "4 -6 years of relevant experience including policy development and analysis; issue\nadvocacy; and strategic planning;",
      "Passionate about public service and committed to progressive values;",
      "Excellent writing and time management skills;",
      "Ability to digest new content with a political and ideological lens that is appropriate\nfor the o?ice;",
      "Poised, level-headed, ﬂexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Candidates should submit their resume, cover letter, two writing samples, and references\nin PDF format to jobs.pramila@mail.house.gov with “Legislative Assistant: [Applicant’s\nFirst and Last Name]” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The O?ice of Congresswoman Pramila Jayapal is an equal opportunity employer. Women,\npeople of color, LGBTQ+ individuals, new Americans, people with disabilities, and\nmembers of other underrepresented communities are strongly encouraged to apply. State\nand/or district ties are a plus. Prior Hill experience is strongly preferred."
  },
  {
    "id": "MEM-015-25",
    "position_title": "Senior Legislative Assistant",
    "office": "Congresswoman Summer L. Lee (D-Pittsburgh)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Summer L. Lee (D-Pittsburgh) has an immediate need to hire an experienced legislative staffer to serve as the office’s Senior Legislative Assistant. This full-time, exempt position is based in the Washington, D.C. office. The Senior LA will be responsible for staffing the Education and Workforce Committee as well as handling a diverse portfolio of issue including science, space, and technology; financial services; small business; banking; insurance; taxes; telecommunications; international affairs; defense; veterans; and economic development. Additional issue areas may be assigned as needed. This is not an entry-level position. The ideal candidate will have prior legislative experience and a demonstrated ability to translate policy ideas into successful legislative outcomes. District or state ties are a plus.\n\nThe Legislative Assistant serves as the Member's primary expert on an assigned set of public policy issues and works closely with the Legislative Director and Chief of Staff to develop and execute a coordinated legislative strategy for the Member. This position also prepares the Member for Committee hearings and markups and attends meetings with constituents, visitors, and other key stakeholders. This is not an entry-level position. The ideal candidate will have prior legislative experience and a demonstrated ability to translate policy ideas into successful legislative outcomes.",
    "responsibilities": [
      "Collaborate with the Legislative Director and Chief of Staff to formulate and advance legislative initiatives for assigned issue areas",
      "Plans, coordinates, and schedules to introduce legislation in the House (or offering it on an appropriate vehicle if it is in an amendment)",
      "Developing and analyzing legislation and policy",
      "Drafting remarks, talking points, and memos",
      "Prepares briefing materials for Member in advance of committee hearings, markups, and meetings",
      "Building and maintaining strong relationships with constituent and stakeholder groups",
      "Drafting letters to stakeholders, the Administration, and other Members",
      "Staffing the Congresswoman in meetings, events, hearings, and markups",
      "Managing multiple projects in a fast-paced environment.",
      "Considers and addresses differing perspectives and opinions to navigate conflicts and develop solutions effectively",
      "Tracks legislation and other developments in assigned issue areas to brief the Member for floor work, committee work, and work in the district",
      "Provides information to generate ideas and make decisions pertaining to press, mass mailings, and newsletters",
      "Provides district office staff with targeted information to assist preparation for community events and town hall meetings",
      "Provides input to assist the Communications Director with draft speeches, press releases, op-eds, and Congressional Record statements for the Member",
      "Assists LC in the answering of constituent letters in assigned issue areas and assists constituents with federal matters",
      "Acts as a liaison with committee and Federal departments/agencies to communicate and coordinate information regarding specific legislative matters when assigned"
    ],
    "qualifications": [
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Legislative Knowledge: Applies understanding of laws, legal codes, precedents, legislative practices and documents, Government regulations, Executive orders, Government organization and functions, and the democratic political process.",
      "Coalition Build"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume, and two writing samples in a single pdf by 1/26/25 to PA12Jobs@mail.house.gov. Please include “Ed & Labor Senior LA– [your name]” in the subject line. The office will contact the best qualified candidates to begin our interview process on a rolling basis.",
    "salary_info": "$68,000 - $78,000, commensurate with experience",
    "contact": "PA12Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-013-25",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Sarah McBride (DE-AL)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Sarah McBride (DE-AL) is seeking a Legislative Assistant for her\nWashington, D.C. office. This position will focus on a diverse legislative portfolio, including\nthe Congresswoman's work on the Science, Space, and Technology Committee.\n\nThe ideal candidate will be a self-starter with strong writing, research, and communication\nskills, capable of producing high-quality work in a fast-paced environment. This is not an\nentry-level position. Previous legislative experience in a congressional office is required. A\npositive attitude, attention to detail, the ability to thrive in a collaborative team\nenvironment, and a good sense of humor are essential.",
    "responsibilities": [
      "Collaborate with the Congresswoman, Legislative Director, additional staff, other\nhill offices, and stakeholders to develop and advance legislative initiatives within\nthe assigned diverse legislative portfolio.",
      "Staff the Congresswoman for her work on the Science, Space, and Technology\nCommittee, including writing remarks, managing relationships, and advancing\nlegislation.",
      "Research and track legislation, coordinate bill co-sponsorships, and monitor\nrelevant committee and floor activities.",
      "Draft policy memos and briefing materials for the Congresswoman and senior staff.",
      "Brief the Congresswoman on legislative matters and assist in preparing her for\nhearings, markups, and meetings.",
      "Represent the Congresswoman in meetings with constituents, advocacy\norganizations, and industry stakeholders.",
      "Support state office staff by providing relevant legislative updates and assisting with\nlocal initiatives.",
      "Perform additional responsibilities as assigned."
    ],
    "qualifications": [
      "Legislative experience in a congressional office.",
      "Strong written and verbal communication skills.",
      "Ability to exercise sound judgment, make decisions under pressure, and navigate\nchallenging situations.",
      "Excellent organizational and time management skills to manage multiple projects\nsimultaneously."
    ],
    "how_to_apply": "Applicants should email their resume and a cover letter to\nDEResumes@sarahmcbride.com with \"Legislative Assistant\" in the subject line.",
    "salary_info": null,
    "contact": "DEResumes@sarahmcbride.com",
    "equal_opportunity": "The office of Congresswoman Sarah McBride is an equal opportunity employer and does\nnot discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity\nand expression, national origin, disability, military status, age, marital status, or parental\nstatus."
  },
  {
    "id": "MEM-012-25",
    "position_title": "Operations Assistant/Legislative Correspondent",
    "office": "Congresswoman Shontel M. Brown (OH-11)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Shontel M. Brown (OH-11) is seeking a full-time Operations Assistant/Legislative Correspondent in her Washington, D.C. office. The position reports to the Administrative Director and Legislative Director. Responsibilities include logging phone calls, greeting visitors, managing front office operations, handling tour and flag requests, assisting with drafting constituent correspondence and managing the mail program, overseeing the intern program, providing administrative support to the team, and additional duties as assigned. A successful candidate will have excellent writing and proofreading ability, outstanding organizational and time management capacity, strong attention to detail, and the ability to work independently. Ohio ties are a plus.",
    "responsibilities": [
      "logging phone calls",
      "greeting visitors",
      "managing front office operations",
      "handling tour and flag requests",
      "assisting with drafting constituent correspondence and managing the mail program",
      "overseeing the intern program",
      "providing administrative support to the team",
      "additional duties as assigned"
    ],
    "qualifications": [
      "excellent writing and proofreading ability",
      "outstanding organizational and time management capacity",
      "strong attention to detail",
      "the ability to work independently",
      "Ohio ties are a plus"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume, and writing sample to Ohio11resumes@mail.house.gov with the subject \"Operations Assistant/Legislative Correspondent: Last Name, First Name\".",
    "salary_info": null,
    "contact": "Ohio11resumes@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, religion, national origin, age, gender identity, sexual orientation, marital or parental status, or disability. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-011-25",
    "position_title": "Outreach Coordinator",
    "office": "Congressman Greg Stanton",
    "location": "Mesa District Office",
    "posting_date": "2025-02-03",
    "description": "Congressman Greg Stanton seeks a motivated Outreach Coordinator (full-time) in his\nMesa District O?ice to implement a strong constituency-based outreach program in the\n4th Congressional District. This position will help build and maintain relationships with key\nstakeholders and work to address local issues on the federal level.",
    "responsibilities": [
      "Act as the representative for the Congressman within their area of responsibility including answering correspondence, occasionally speaking at events, meeting with constituents, and communicating with local stakeholders",
      "Inform the District Director of all happenings in their assigned issue areas by screening district media sources and interacting with constituents",
      "Coordinate and organize meetings and events with local stakeholders in their assigned issue areas for the Congressman",
      "Serve as a liaison to local, state, and federal o?icials and other people or groups to form e?ective relationships for the Congressman",
      "Work with other district and DC sta? to identify and promote the Congressman’s legislative agenda",
      "Track legislation, Dear Colleague Letters, and other developments in their assigned issue areas and use this information to keep constituencies apprised and connected to the Congressman’s work."
    ],
    "qualifications": [
      "Strong written and oral communications skills and the ability to work e?ectively in a fast-paced environment",
      "Experience developing and maintaining relationships with constituents and community leaders",
      "Ability to think strategically and creatively",
      "Strong decision-making skills",
      "Knowledge of issues and events in the district in which the Congressman has been involved as well as a good understanding of federal-level policy work",
      "Understanding of the federal legislative process as well as federal agencies and departments",
      "Previous experience working for an elected o?icial or as an issue/community organizer",
      "Ability to work cooperatively and courteously with others",
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Willingness to work evenings, weekends and irregular hours",
      "Ability to speak, read, and write in other languages is a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to AZ04resumes@gmail.com with the subject line “Outreach Coordinator.”",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "AZ04resumes@gmail.com",
    "equal_opportunity": "Congressman Stanton’s o?ice is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-010-25",
    "position_title": "Senior Outreach Coordinator",
    "office": "Congressman Greg Stanton",
    "location": "Mesa, Arizona",
    "posting_date": "2025-02-03",
    "description": "Congressman Greg Stanton seeks a highly motivated, detail-oriented Senior Outreach Coordinator (full-time) in his District Office in Mesa, Arizona, to plan, manage, and execute the outreach efforts of the office.\n\nAn ideal candidate will have:",
    "responsibilities": [
      "Work with the Chief of Staff, District Director and Communications Director to plan, coordinate, and execute the office’s outreach efforts",
      "Develop, plan and execute meetings and events with local stakeholders for the Congressman",
      "Act as a representative for the Congressman, including answering correspondence, occasionally speaking at events, meeting with constituents, and routinely communicating with local stakeholders",
      "Serve as a liaison to local, state, and federal officials and other people or groups to form effective relationships for the Congressman"
    ],
    "qualifications": [
      "Strong written and oral communications skills and the ability to work effectively in a fast-paced environment",
      "Expertise in developing and maintaining relationships with constituents and community leaders",
      "Ability to think strategically and creatively",
      "Strong decision-making skills",
      "Knowledge of issues and events in the district in which the Congressman has been involved as well as a good understanding of federal-level policy work",
      "Understanding of the federal legislative process as well as federal agencies and departments",
      "Previous experience working for an elected official or as an issue/community organizer",
      "Ability to work cooperatively and courteously with others",
      "Excellent organizational skills and careful attention to detail",
      "Valid driver’s license and access to a car",
      "Flexibility to work evenings, weekends and irregular hours",
      "Ability to speak, read, and write in other languages is a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to AZ04resumes@gmail.com with the subject line “Senior Outreach Coordinator.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "AZ04resumes@gmail.com",
    "equal_opportunity": "Congressman Stanton’s office is an equal opportunity employer and candidates from diverse and underrepresented backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-009-25",
    "position_title": "Digital Media Manager – Congressman Rob Wittman (VA-01)",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2025-02-03",
    "description": "The O?ice of Congressman Rob Wittman (VA-01) is seeking a digital media manager. This position is responsible for developing a proactive constituent communications strategy and plan. Primary responsibilities include: drafting press releases and talking points, writing email newsletters for targeted constituent coalitions, promoting the congressman’s district events and engagements, maintaining the communications content calendar, overseeing website management and updates, branding through graphic design and video/audio editing, managing social media accounts and analyzing their performance metrics, and maintaining the Member’s photo and video database. They will work with the communications director to ﬁnd new ways to grow the congressman’s following, increase his name ID in the district, and maintain synergy across communications materials.\n\nThis is not an entry-level position. A strong candidate will have 1-2 years of experience and will be a creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing. Excellent writing and organization skills are required. An ability to multitask and work under tight deadlines is necessary. Candidates must have previous congressional or political communications experience; ties to Virginia are helpful but not required.",
    "responsibilities": [
      "Drafting press releases and talking points",
      "Writing email newsletters for targeted constituent coalitions",
      "Promoting the congressman’s district events and engagements",
      "Maintaining the communications content calendar",
      "Overseeing website management and updates",
      "Branding through graphic design and video/audio editing",
      "Managing social media accounts and analyzing their performance metrics",
      "Maintaining the Member’s photo and video database"
    ],
    "qualifications": [
      "1-2 years of experience",
      "Creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing",
      "Excellent writing and organization skills are required",
      "Ability to multitask and work under tight deadlines is necessary",
      "Previous congressional or political communications experience",
      "Ties to Virginia are helpful but not required"
    ],
    "how_to_apply": "Interested applicants should email a resume and two writing samples to Julianne.Heberlein@mail.house.gov with “Digital Media Manager” in the subject line.",
    "salary_info": null,
    "contact": "Julianne.Heberlein@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-008-25",
    "position_title": "District Special Assistant – Congressman Mike Flood (NE-01)",
    "office": "Congressman Mike Flood (NE-01)",
    "location": "Norfolk, NE",
    "posting_date": "2025-02-03",
    "description": "The primary responsibility of the District Special Assistant is to transport the Member and other staff members to meetings and appointments as necessary, deliver and pickup materials for the office, staff the Member at various meetings, and serve as a personal aide to the Member when he is in the district. When the Member is in DC, the Special Assistant will assist the district staff with field rep duties and casework. Typical responsibilities may include, but are not limited to:",
    "responsibilities": [
      "Transportation of the Member for their official duties.",
      "Deliver and pickup materials for the office, including letters, packages, and documents from other government agencies.",
      "Working with the Scheduler to be aware of the Member’s schedule.",
      "Running errands and assisting the District Director with supplies and other misc. administrative matters.",
      "Assisting in sorting and delivering mail.",
      "Staffing the Member at various meetings and events.",
      "Serving as a personal aide to the Member, tending to various needs as they arise while he is in the district.",
      "Assisting the Field Reps with events, meetings, and correspondence as necessary.",
      "Assisting with casework as necessary."
    ],
    "qualifications": [
      "Located in Norfolk, NE or willingness to relocate.",
      "Regular, predictable and punctual attendance at assigned locations required for performance of duties.",
      "Ability to communicate effectively with the Member and office staff, Members and representatives from other offices, outside organizations, and others.",
      "Ability to work most weekends as the Member’s schedule dictates, with less work expected on weekdays when the Member is in DC.",
      "Ability to handle difficult and sometimes tense interactions with members of the public, including constituents, with tact while also prioritizing the well-being of the Member.",
      "Work is public-facing and requires frequent interaction with members of the public, including constituents, in a courteous and tactful manner. Work requires extended and unscheduled hours as dictated by the Member’s schedule and office needs.",
      "Work requires regularly driving the Member with the individual’s personal vehicle. Must possess a valid driver’s license and have a good driving record. A personal vehicle used to drive the Member is not necessarily required.",
      "Regularly lifts and moves luggage, books, files, documents, and other office materials.",
      "Must be able to prioritize and perform duties under pressure in a fast-paced environment.",
      "Regularly use typical office equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc."
    ],
    "how_to_apply": "Interested applicants should send their resume, cover letter, and references to FloodHiring@mail.house.gov",
    "salary_info": null,
    "contact": "FloodHiring@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-530-24",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Majority Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "Provide administrative and research support to Subcommittee staff and assists with duties as assigned.\n\n\nResponsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Staff Director or Deputy Staff Director, and Subcommittee Staff Director, and assisting other Committee staff, as needed.\n\nThis is a full-time, on-site position in Washington, DC.",
    "responsibilities": [
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notifications.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in staff-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and staff.",
      "Assist with developing policy recommendations and serve as a resource for Members both on and off Committee."
    ],
    "qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Strong Microsoft Office proficiency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage fluctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "how_to_apply": "Qualified candidates please send their cover letter, resume, and one (1) writing sample to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-523-24",
    "position_title": "Digital Assistant",
    "office": "House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "location": "Washington D.C.",
    "posting_date": "2025-02-03",
    "description": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02) seek a creative and detail-oriented Digital Assistant to support digital communications and public engagement efforts. This position will be split between the committee office and personal office and will be based out of Washington D.C.\n\nThis position involves creating and scheduling content for social media platforms, maintaining the committee's website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\n\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor's degree in communications, political science, or a related field is preferred.\n\nSalary is commensurate with experience, and the position includes a competitive benefits package.",
    "responsibilities": [],
    "qualifications": [
      "1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred)",
      "Proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva)",
      "Strong writing and editing skills",
      "Familiar with social media analytics and website content management systems",
      "Bachelor's degree in communications, political science, or a related field is preferred"
    ],
    "how_to_apply": "To apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: \"[Name] – Digital Assistant Application.\" Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary is commensurate with experience, and the position includes a competitive benefits package.",
    "contact": "budget-democrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-522-24",
    "position_title": "Press Secretary",
    "office": "Office of Congressman Pat Ryan (NY-18)",
    "location": "Washington DC",
    "posting_date": "2025-02-03",
    "description": "The Office of Congressman Pat Ryan (NY-18) seeks a Press Secretary based in the Washington DC office. Applicants should be prepared to join a highly-collaborative, highachieving team and possess an eagerness to grow and learn within the office. Ties to New York's 18th District are a plus.\n\nThe ideal candidate should demonstrate excellent writing and editing skills in addition to a strong work ethic, good sense of humor, and keen attention to detail. The position will require working non-traditional hours.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Drafting talking points and op-eds",
      "Staffing the Congressman for interviews and media events",
      "Planning press conferences and in-district events",
      "Responding to press inquiries",
      "Maintaining relationships and booking interviews with local press outlets",
      "Other tasks as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should submit a cover letter, resume, two writing samples, and three references in a single PDF to ny18resumes@mail.house.gov with the job title and your full name in the subject line (e.g.: “Press Secretary - Bryson Daily). No phone calls, faxes or drop-ins, please. Applications will be considered on a rolling basis.",
    "salary_info": "The salary range for this position is $60,000 - $80,000, commensurate with experience.",
    "contact": "ny18resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-517-24",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Susie Lee",
    "location": "DC",
    "posting_date": "2025-02-03",
    "description": "Congresswoman Susie Lee (D-NV) seeks a highly organized, good-humored, hard-working DC Scheduler to develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC. The DC Scheduler will report to the Chief of Staff and work closely with the Member, DC staff, and District staff, including a District-based scheduler responsible for in-district scheduling. This is not an entry-level role; prior scheduling experience is preferred, and salary will be commensurate with experience.\n\nResponsibilities also include tracking, evaluating, and responding to all invitations and scheduling requests, coordinating travel for the Member, compiling the Congresswoman’s nightly briefing materials, and managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties. Responsibilities will also include providing staffing support, including driving the Congresswoman as needed. Strong candidates will be creative problem solvers, have excellent attention to detail, communicate succinctly and effectively, and thrive in a fastpaced work environment. The position requires the ability to multi-task, work well under pressure, and the flexibility to be responsive to urgent scheduling needs on nights and weekends.",
    "responsibilities": [
      "Develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC",
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Compiling the Congresswoman’s nightly briefing materials",
      "Managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties",
      "Providing staffing support, including driving the Congresswoman as needed"
    ],
    "qualifications": [
      "Prior scheduling experience is preferred",
      "Creative problem solvers",
      "Excellent attention to detail",
      "Communicate succinctly and effectively",
      "Thrive in a fast-paced work environment",
      "Ability to multi-task",
      "Work well under pressure",
      "Flexibility to be responsive to urgent scheduling needs on nights and weekends"
    ],
    "how_to_apply": "Candidates should submit in PDF format a resume, cover letter, and three references (including name, title and organization, phone number, email, and relationship to the candidate) to nv03resumes@gmail.com with the following subject line: “Full Name – DC Scheduler.”",
    "salary_info": "salary will be commensurate with experience",
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-516-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Jennifer McClellan (VA-04)",
    "location": "Washington, DC",
    "posting_date": "2025-02-03",
    "description": "In close collaboration with the Member and Chief of Staff, the Communications Director will manage all aspects of the Congresswoman's communications strategy, including her earned media, digital media, and franked communications. The Communications Director will report directly to the Chief of Staff.\n\nThe Communications Director will cultivate and manage relationships with both national and local press, field all press inquiries, and proactively pitch stories and book the Member for local and national TV; draft press releases, media advisories, and op-eds; collaborate with the Legislative and District teams to coordinate press rollouts for new legislative efforts and in-district events; manage a robust franked communications budget; oversee a rapid social media program; and oversee and manage a communications team.\n\nThis position is part of the Member's senior staff – this is not an entry-level position. The ideal candidate should have several years of demonstrated communications experience, including on-the-record experience, strong relationships with bookers and producers, and a broad network of reporter relationships. The candidate should possess strong writing and interpersonal skills and good political instincts. Capitol Hill experience required. Virginia ties are a plus.",
    "responsibilities": [
      "Manage all aspects of the Congresswoman's communications strategy, including her earned media, digital media, and franked communications.",
      "Cultivate and manage relationships with both national and local press.",
      "Field all press inquiries.",
      "Proactively pitch stories and book the Member for local and national TV.",
      "Draft press releases, media advisories, and op-eds.",
      "Collaborate with the Legislative and District teams to coordinate press rollouts for new legislative efforts and in-district events.",
      "Manage a robust franked communications budget.",
      "Oversee a rapid social media program.",
      "Oversee and manage a communications team."
    ],
    "qualifications": [
      "Several years of demonstrated communications experience, including on-the-record experience.",
      "Strong relationships with bookers and producers.",
      "A broad network of reporter relationships.",
      "Strong writing and interpersonal skills.",
      "Good political instincts.",
      "Capitol Hill experience required.",
      "Virginia ties are a plus."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, cover letter, and two writing samples to VA04.Jobs@mail.house.gov.",
    "salary_info": "$95,000-$105,000, commensurate with experience",
    "contact": "VA04.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, religious affiliation, national origin, age, or military, marital, or parental status. The office prioritizes building a diverse team: women and candidates from BIPOC, LGBTQ+, and other underrepresented communities are encouraged to apply"
  },
  {
    "id": "MEM-476-24",
    "position_title": "Legislative Assistant (LA)",
    "office": "Congressman Dan Crenshaw (R-TX-02)",
    "location": "Washington, D.C.",
    "posting_date": "2025-02-03",
    "description": "Congressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative\nAssistant (LA), based in our Washington, D.C. office. This position reports to the Legislative\nDirector. The LA will handle an economic facing portfolio, including Budget and\nAppropriations, Financial Services, and Tax, with other issues to follow.",
    "responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and\nlegislative, communications, and district teams on legislative updates",
      "Preparing and staffing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas Working with external stakeholders, Congressional Research Service (CRS),\nLegislative Counsel, and committee staff to draft legislation based on the Member’s\npriorities"
    ],
    "qualifications": [
      "Ideal candidates will have strong written and oral communications skills and be detailoriented, organized, and creative.",
      "They must be able to quickly learn the member’s voice and think in a proactive, communications-focused manner.",
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
      "Hill experience is required."
    ],
    "how_to_apply": "Qualified applicants should submit a resume and writing sample (no more\nthan 3 pages) as one combined PDF to Kenneth.Depew@mail.house.gov. Include\n“Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on\na rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "Kenneth.Depew@mail.house.gov",
    "equal_opportunity": null
  }
]