[
  {
    "id": "MEM-271-25",
    "position_title": "Legislative Director",
    "office": "Congressman Jamie Raskin (MD-08)",
    "location": "Washington D.C.",
    "posting_date": "2025-08-11",
    "description": "Congressman Jamie Raskin (MD-08) seeks a Legislative Director to lead his personal office's legislative work and manage his legislative team. The Legislative Director will also manage the constituent correspondence program and the correspondence team.\n\nThe Legislative Director will cover an issue portfolio that will include several of the following policy areas: campaign finance, democracy reform, elections, federal workforce, foreign policy, health care, international human rights, and labor.\n\nThis is a challenging full-time, in-person position in the Washington D.C. office that will include evening and weekend work whenever the Congressional schedule requires.",
    "responsibilities": [
      "Working with the legislative team to formulate and execute a coordinated legislative strategy for the Congressman that reflects the priorities of Maryland's Eighth District.",
      "Advancing the Congressman's legislative priorities in their assigned issue portfolio.",
      "Monitoring action on the House Floor and providing the Congressman with background information and recommendations for all floor votes.",
      "Managing and overseeing the constituent correspondence program. Please note that reviewing, editing, and in some cases drafting constituent correspondence are essential responsibilities of this position.",
      "Managing and mentoring all members of the legislative and correspondence teams.",
      "Supporting and coordinating with the communications team on policy-related media and social media.",
      "Fostering collaboration and communication across teams, including by working closely with colleagues in the District Office and on the press and front office teams.",
      "Preparing and staffing the Congressman for meetings with constituents, advocacy groups, and others.",
      "Meeting with constituents and advocacy groups on the Congressman's behalf."
    ],
    "qualifications": [
      "At least four years of full-time work experience on Capitol Hill (required).",
      "Subject-matter knowledge and expertise in at least one of the policy areas listed above (campaign finance, democracy reform, elections, federal workforce, foreign policy, health care, international human rights, and labor).",
      "Commitment to creating a positive work environment and supporting team members in advancing their professional growth and goals.",
      "Excellent organizational skills, effective prioritization and time management, and a professional and discreet approach.",
      "Willingness to be responsive to constituents' varied concerns and perspectives.",
      "Exceptional writing skills, attention to detail, and creativity.",
      "Personnel management experience, experience with House floor procedure, and ties to Maryland's Eighth District are all highly valued and strongly preferred."
    ],
    "how_to_apply": "The application deadline is Friday, August 15, 2025 at 5pm. To apply, please 1) fill out this basic form: https://forms.office.com/g/1yNxZh0G4h and 2) send an email to MD08.Resumes@mail.house.gov with \"Legislative Director [YOUR NAME]\" in the subject line and the following application materials attached as one combined PDF:\n- Cover letter (not to exceed one page)\n- Resume\n- Two writing samples (not to exceed two pages each)",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-270-25",
    "position_title": "District Staff Assistant/Press Assistant",
    "office": "Office of Congresswoman Janelle Bynum",
    "location": "Oregon City, OR",
    "posting_date": "2025-08-11",
    "description": "The Office of Congresswoman Janelle Bynum is seeking a District Staff Assistant/Press Assistant. This position offers a unique opportunity to serve in a dual role furthering the district office's administrative and communication activities.\n\nPOSITION OVERVIEW:\nThe Staff Assistant/Press Assistant will maintain the district office to ensure a welcoming environment for constituents and visitors - and work with the office's communications team to manage media contacts, create content, and organize district events.",
    "responsibilities": [
      "Greet and screen visitors at the district office based in Oregon City, Oregon;",
      "Handle incoming calls with poise, professionalism, and promptness to capture input from constituents on policy matters for consideration and response;",
      "Draft memos, speeches, video scripts, newsletters, surveys, and social media content;",
      "Staff the Congresswoman for interviews at district events;",
      "Assist with planning and executing district events, such as town halls and roundtable meetings;",
      "Develop and implement media and communication strategies for the Member;",
      "Drive the Member to events and staff events as needed;",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Bachelor's degree or related job experience;",
      "A demonstrated interest in public service;",
      "Familiarity with the Oregon Congressional District 5 and knowledge of current issues and events in which the Member is involved;",
      "Strong writing, editing, and proofreading skills;",
      "Strong oral communication skills;",
      "Understanding of print and broadcast media;",
      "Ability to work well under pressure and courteously with others."
    ],
    "how_to_apply": "Please send your resume and cover letter to BynumJobs@mail.house.gov by Monday, August 18, 2025.",
    "salary_info": null,
    "contact": {
      "email": "BynumJobs@mail.house.gov"
    },
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-269-25",
    "position_title": "Deputy Communications Director/Digital Director",
    "office": "Office of Congressman Moskowitz",
    "location": "Washington, D.C.",
    "posting_date": "2025-08-11",
    "description": "Essential Job Function: As a member of our communications team and in collaboration with the Congressman, Deputy Comms Director/Digital Director will write and produce engaging digital content, monitor online narratives and trends, and assist with traditional press inquiries and tasks. The individual will also manage the Congressman's social media platforms with oversight from the Communications Director. This is a mid-level communications role within the office.\n\nDeputy Comms Director /Digital Director's role and responsibilities include, but are not limited to:",
    "responsibilities": [
      "Digital Strategy: Develop and implement digital strategies to amplify the Representative's message and engage constituents, including through emerging trends online.",
      "Digital Strategy: Manage social media accounts (Facebook, Instagram, X, YouTube, Bluesky, and Threads) through content creation and community engagement.",
      "Digital Strategy: Create compelling digital content such as graphics, videos, and infographics to communicate key messages.",
      "Content Creation: Collaborate with team members to develop multimedia content that effectively communicates legislative priorities and initiatives.",
      "Content Creation: Ensure all content is accurate, consistent with the Representative's voice, and aligns with brand guidelines.",
      "Content Creation: Required to have extensive knowledge and experience to create memes and create AI videos from start to finish. Experience with video production, video editing, and emerging AI tools, including through platforms like Canva, ChatGPT, and the Adobe Suite.",
      "Public Relations: Draft press releases, media advisories, op-eds, franked communications, and other materials as needed.",
      "Public Relations: Coordinate interviews, press conferences, and media appearances for the Representative in both the traditional and new media spaces.",
      "Public Relations: Monitor media coverage-including press and digital clips with support from a press intern-and prepare regular reports for the team.",
      "Public Relations: Be comfortable making fun of our republican colleagues such as, James Comer (this tells me you read the whole post)."
    ],
    "qualifications": [
      "Experience working in a fast-paced government office or on political campaigns.",
      "Knowledge of data analytics and metrics to track the effectiveness of digital campaigns.",
      "Experience managing crisis communications and responding to media inquiries under tight deadlines.",
      "Demonstrated ability to think creatively and strategically to generate innovative ideas for media outreach and digital engagement.",
      "Strong interpersonal skills and the ability to collaborate effectively with team members and external stakeholders.",
      "Flexibility to work evenings and weekends as needed, especially during high-profile events or legislative sessions."
    ],
    "how_to_apply": "Please submit resume, three references, a digital portfolio, and a cover page as one PDF document to Moskowitz.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "Moskowitz.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal-opportunity employer. Candidates with diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-268-25",
    "position_title": "Field Representative & Caseworker",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Long Beach, CA",
    "posting_date": "2025-08-11",
    "description": "Congresswoman Nanette Barragan (CA-44) is seeking a Field Representative & Caseworker for her District Office in Long Beach, CA.\n\nCandidate should possess excellent verbal and written communication skills, have the proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests, be highly organized, and have the ability to manage multiple tasks and competing deadlines simultaneously.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Answer and log incoming phone calls, casework intake and work on casework through completion;",
      "Identify event and correspondence opportunities in assigned geographic and issue areas;",
      "Staff the Congresswoman and serve as staff representative for the Congresswoman at community meetings and events;",
      "Lead or assist with planning, organizing, and executing district outreach efforts in assigned geographic and issue areas;",
      "Identify issues related to federal programs for possible legislation and/or letters;",
      "Manage correspondence and acknowledgements from the office;",
      "Meet with constituent and community leaders and develop relationships and networks in assigned geographic and issue areas;",
      "Work with community groups and organizations, local elected officials, and others in the Congressional District to identify potential opportunities for federal funding;",
      "Serve as a liaison with federal, state, and local agencies, and committees."
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests",
      "Highly organized",
      "Ability to manage multiple tasks and competing deadlines simultaneously",
      "Knowledge of communities within California's 44th District preferred",
      "A car and good driving record required (mileage reimbursement available)",
      "Must be able to work a flexible schedule, including some nights and weekends as required",
      "Diverse candidates encouraged to apply."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with 'CA44 Field Rep' in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "$60-$72,000 based on experience",
    "contact": {
      "email": "CA44Resumes@mail.house.gov",
      "subject": "CA44 Field Rep"
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-267-25",
    "position_title": "District Staff Assistant",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Long Beach, CA",
    "posting_date": "2025-08-11",
    "description": "Congresswoman Nanette Barragan (CA-44) is seeking a District Staff Assistant for her District Office in Long Beach, CA.\n\nThe District Staff Assistant greets visitors, answers the telephone, helps to supervise the district internship program, and responds to constituent requests for general information and other inquiries. This position maintains the front office and assists district office staff with various administrative duties while maintaining an external agenda that interacts frequently with constituents. The position will also support the Office's community outreach and events with the Congresswoman when she is in the district.",
    "responsibilities": [
      "Greets visitors, answers the telephone, helps to supervise the district internship program, and responds to constituent requests for general information and other inquiries.",
      "Maintains the front office and assists district office staff with various administrative duties while maintaining an external agenda that interacts frequently with constituents.",
      "Support the Office's community outreach and events with the Congresswoman when she is in the district."
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Strong interpersonal skills",
      "Proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests",
      "Highly organized",
      "The ability to manage multiple tasks and competing deadlines simultaneously",
      "Able to work in a fast-paced environment",
      "Knowledge of communities within California's 44th District preferred",
      "A car and good driving record required (mileage reimbursement available)",
      "Must be able to work a flexible schedule, including some nights and weekends as required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with \"CA44 Staff Assistant\" in the subject line to CA44Resumes@mail.house.gov",
    "salary_info": "$50-53,000 based on experience",
    "contact": {
      "email": "CA44Resumes@mail.house.gov",
      "subject": "CA44 Staff Assistant"
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-265-25",
    "position_title": "Legislative Director",
    "office": "Rep. Frederica Wilson (D-FLA.)",
    "location": "Washington, D.C.",
    "posting_date": "2025-08-11",
    "description": "The Washington, D.C. Office of Rep. Frederica Wilson (D-FLA.), Member of the Committee on Education and the Workforce and Transportation & Infrastructure Committees, is hiring a Legislative Director. The Legislative Director works with the Member and other senior staff to lead the development and implementation of her policy, legislative, and appropriations strategy, managing a legislative team of 4-5 staff and fellows while also covering a small individual portfolio of legislative issues.\n\nThis is not an entry-level role. Candidates should have deep expertise in policy, legislative drafting and procedure, and congressional appropriations experience is a plus. Miami/Florida ties are also a plus. Candidates with previous Education Committee or Senate HELP experience are encouraged to apply. Essential skills include an expert-level working knowledge of Congress; strong oral and written communication skills, including rigorous editing and fact-checking; excellent attention to detail; the ability to execute on multiple deadlines and tasks in a fast-paced environment; strong interpersonal and relationship-building skills; the ability to make quick decisions when advising a principal; a proven track record navigating complex constituent and political situations; and the responsiveness and professional demeanor to represent the office well to a wide range of communities.",
    "responsibilities": [
      "Developing and advancing the Member's policy priorities through the legislative and appropriations processes.",
      "Managing the operations of the legislative team and serving as a member of the office's senior leadership team.",
      "Developing memos, remarks, committee materials, and other briefing materials for the Member/office.",
      "Supporting the press team on policy-related communications.",
      "Working with the district team to support their work and address constituents' policy concerns.",
      "Monitoring activity on the House Floor, the House Rules Committee and working with the legislative team to develop vote recommendations.",
      "Building and maintaining positive and effective relationships with district, D.C., and national stakeholders and advocacy organizations.",
      "Overseeing the office's constituent correspondence program; and",
      "Other duties and special projects as assigned."
    ],
    "qualifications": [
      "Deep expertise in policy, legislative drafting and procedure",
      "Congressional appropriations experience is a plus",
      "Miami/Florida ties are a plus",
      "Previous Education Committee or Senate HELP experience are encouraged",
      "Expert-level working knowledge of Congress",
      "Strong oral and written communication skills, including rigorous editing and fact-checking",
      "Excellent attention to detail",
      "The ability to execute on multiple deadlines and tasks in a fast-paced environment",
      "Strong interpersonal and relationship-building skills",
      "The ability to make quick decisions when advising a principal",
      "A proven track record navigating complex constituent and political situations",
      "The responsiveness and professional demeanor to represent the office well to a wide range of communities"
    ],
    "how_to_apply": "To apply, please email the Chief of Staff, Leon Buck at Leon.Buck@mail.house.gov, \"Legislative Director\" in the subject line and the following application materials attached as one combined PDF, applications will be considered on a rolling basis:\n- Resume\n- Cover letter\n- 2-3 professional references,\n- and a writing sample would be appreciated.",
    "salary_info": null,
    "contact": {
      "name": "Leon Buck",
      "title": "Chief of Staff",
      "email": "Leon.Buck@mail.house.gov"
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status."
  },
  {
    "id": "MEM-263-25",
    "position_title": "Counsel/Professional Staff Member",
    "office": "Committee on Oversight and Government Reform, Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "The Committee on Oversight and Government Reform, Democratic staff seeks a counsel or professional staff member to assist with the Committee's oversight and investigations work.\n\nThis position's primary focus would include national security, homeland security, law enforcement, immigration, and the military; reporting to the Full Committee, as well as the Subcommittee on Military and Foreign Affairs, and the Subcommittee on Federal Law Enforcement. Substantive work on policy, oversight, and investigations related to DHS and DOD is preferred.",
    "responsibilities": [
      "Preparing for and staffing hearings and briefings;",
      "Drafting statements, memos, letters and other materials;",
      "Assisting with the Committee's investigative and oversight work, including preparing for and conducting transcribed interviews and depositions;",
      "Serving as a resource for Democratic Members and staff on matters within the Committee's jurisdiction."
    ],
    "qualifications": [
      "Exceptional writing and research skills, sound political judgment, the capacity to articulate technical and policy issues clearly and concisely, and the ability to work closely and collaboratively with other congressional offices and stakeholders are essential.",
      "This is not an entry-level position.",
      "Previous Capitol Hill, Administration or legal experience, and experience with investigations or oversight, is preferred.",
      "Candidates with a TS or TS/SCI Security Clearance are preferred."
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with \"Counsel/Professional Staff Member\" in the subject line. Please attach your resume and cover letter as one PDF with the file name using the following format: \"LastName.FirstName\". No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": "The starting range for this position is $75,000 - $110,000, with the negotiated salary highly commensurate with the level of educational and professional experience.",
    "contact": {
      "email": "oversightjobs@mail.house.gov",
      "phone": null,
      "address": null
    },
    "equal_opportunity": "The Oversight Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-262-25",
    "position_title": "Scheduler",
    "office": "Office of Congresswoman Linda Sanchez",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "The Office of Congresswoman Linda Sanchez is seeking a Scheduler based in the Washington, DC office. Candidates must have exceptional organizational and communications skills, be very detail oriented, and enjoy working in a fast-paced team environment. The ideal candidate will have proven knowledge of the congressional work setting, ability to balance competing demands, and possess sound political judgement. The position requires a willingness to work non-traditional hours when required. Hybrid work options are available during non-session weeks. Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred. Southern California ties are a plus.",
    "responsibilities": [
      "Maintaining and managing the Member's daily and long-term DC and national schedule",
      "Responding to all incoming meeting and scheduling requests",
      "Coordinating travel and booking flight, train, and lodging reservations for the Congresswoman",
      "Communicating key information and scheduling changes to the Member, staff, and effected stakeholders in a timely and efficient manner",
      "Coordinating with other Member offices, Committee staff, leadership offices, the White House, and Executive Departments and federal agencies on scheduling requests and events",
      "Coordinating with the District Director and district staff on scheduling in-district events when appropriate",
      "Compiling the Congresswoman's daily briefing materials and coordinating with legislative and press staff on materials needed for meetings and events",
      "Assisting the Chief of Staff with office operations",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Exceptional organizational and communications skills",
      "Very detail oriented",
      "Enjoy working in a fast-paced team environment",
      "Proven knowledge of the congressional work setting",
      "Ability to balance competing demands",
      "Possess sound political judgement",
      "Willingness to work non-traditional hours when required",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred",
      "Southern California ties are a plus"
    ],
    "how_to_apply": "To apply for this position, email a PDF copy of your resume and three professional references to CA38jobs@mail.house.gov with \"DC Scheduler Position\" in the subject line.",
    "salary_info": "Salary will be commensurate with experience. (The range for this job is $60,000 - $74,000.)",
    "contact": "CA38jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-257-25",
    "position_title": "Staff Assistant/Driver",
    "office": "Congressman Marc Veasey (TX-33)",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "The office of Congressman Marc Veasey (TX-33) is seeking a Staff Assistant/Driver for his Washington, DC Office.\n\nThe ideal candidate has strong driving skills, excellent professional judgement and discretion, exceptional customer or constituent service skills, close attention to detail and time management, excellent writing and communication skills, an aptitude for database work, the ability to prioritize and follow through on multiple competing priorities in a fast-paced environment, and a strong commitment to public service. A valid U.S. driver's license, clean driving record, and access to a vehicle are required for the position. The applicant should be aware that this position will sometimes require work outside of normal hours of operation.",
    "responsibilities": [
      "Driving the Member;",
      "Work closely with the Member's scheduling team to ensure appointments are on time;",
      "Managing the front office -- including greeting and welcoming visitors;",
      "Answering DC phones and logging constituent comments/feedback;",
      "Coordinating tour and flag requests;",
      "Completing office operation and administrative duties;",
      "Assisting with management of DC internship program;",
      "Managing office mail program, including overseeing IQ correspondence system and ensuring constituents receive timely replies to mail;",
      "Assisting the DC staff with other work as assigned."
    ],
    "qualifications": [
      "Active driver's license, a clean driving record, and personal vehicle",
      "Effective communication skills for verbal and written correspondence",
      "Strong organizational skills, attention to detail, time management, and ability to manage multiple priorities",
      "Professional demeanor and positive attitude",
      "Texas ties are a plus but not necessary."
    ],
    "how_to_apply": "All applicants should send an email, cover letter, and writing sample to TX33Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "TX33Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": null,
    "position_title": "Digital Manager",
    "office": "The Office of the Democratic Leader",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "The Office of the Democratic Leader is seeking a dynamic and highly skilled Digital Manager to join our communications team. The Digital Manager will be primarily responsible for transforming the Leader's on-camera content into compelling, high-impact video, audio and visual content for online platforms. The ideal candidate has experience in video editing and social media management, understands the digital media landscape and thrives in a fast-paced environment.",
    "responsibilities": [
      "Lead real-time video clipping and captioning operation for the Office of the Democratic Leader, bringing a keen eye to cutting press conferences, media interviews, floor speeches, direct-to-camera content and more for distribution to stakeholders and online audiences.",
      "Manage from start to finish the process for getting the Leader's video content distributed on platforms including Instagram, X (Twitter), YouTube, Facebook, TikTok and others, tailoring each piece for optimal engagement.",
      "Lead collaborative content brainstorming and planning process on a daily, weekly and monthly basis, in addition to spotting real-time opportunities for rapid response and identifying relevant trends.",
      "Amplify content by identifying and engaging with aligned content creators, influencers and key voices.",
      "Monitor the work of House Democrats--including committee hearings, floor activity, press conferences, media interviews and events--to identify and elevate powerful moments.",
      "Collaborate closely with policy, press and digital colleagues to ensure content is aligned with the Leader's voice, goals and message strategy.",
      "Track and report engagement metrics across platforms, using data to inform ongoing content planning."
    ],
    "qualifications": {
      "required": [
        "Minimum 3 years of relevant experience in video, audio and visual content creation for political, media or advocacy organizations.",
        "Expertise in editing software such as Adobe Premiere Pro, After Effects, Veed, Photoshop and Illustrator (or equivalent tools).",
        "Deep understanding of social media platforms, audience behaviors and platform-specific best practices.",
        "Strong political acumen and familiarity with Democratic priorities and the legislative process.",
        "Proven ability to move quickly, manage multiple projects under tight deadlines and respond in real-time to breaking news and political developments.",
        "Excellent judgment, storytelling instincts and a collaborative approach."
      ],
      "preferred": [
        "Experience working in a congressional, campaign or political office.",
        "Familiarity with analytics tools to evaluate content performance.",
        "Comfortable working both independently and as part of a close-knit, high-performing team."
      ]
    },
    "how_to_apply": "https://house.csod.com/ux/ats/careersite/19/home/requisition/3895?c=house",
    "salary_info": "Competitive and commensurate with experience.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-254-25",
    "position_title": "Staff Assistant & District Field Representative",
    "office": "Congressman Frank Pallone, Jr.",
    "location": "New Jersey",
    "posting_date": "2025-08-11",
    "description": "The district office of Congressman Frank Pallone, Jr. seeks a hardworking, organized individual to serve as a Staff Assistant & District Field Representative. This position primarily entails constituent casework and community outreach. Other responsibilities include meeting with local community officials, representing the Congressman at community and governmental events, special projects, as well as general office work.\n\nCandidates should possess excellent verbal and written communication skills, and must enjoy working with the public. Prior experience in government, the non-profit sector, community and grassroots organizing is preferred. This position is based in New Jersey. Applicants must have a valid driver license.",
    "responsibilities": [
      "Constituent casework and community outreach.",
      "Meeting with local community officials.",
      "Representing the Congressman at community and governmental events.",
      "Special projects.",
      "General office work."
    ],
    "qualifications": [
      "Excellent verbal and written communication skills.",
      "Must enjoy working with the public.",
      "Prior experience in government, the non-profit sector, community and grassroots organizing is preferred.",
      "Applicants must have a valid driver license."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, writing sample, and references by email to NJ06.Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "NJ06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-249-25",
    "position_title": "Constituent Service Representative/Caseworker",
    "office": "Office of U.S. Congressman Ed Case",
    "location": "Honolulu, HI",
    "posting_date": "2025-08-11",
    "description": "U.S. Congressman Ed Case (Hawai'i - 01) is seeking a Constituent Services Representative / Caseworker for his district office located in downtown Honolulu.\n\nThis position also acts as a liaison to federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues.\n\nPreference given to Hawai'i background/community involvement and prior related work experience, and applicants are asked to detail these attributes.",
    "responsibilities": [
      "Acts as a liaison to federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues."
    ],
    "qualifications": [
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work unpredictable hours as necessary",
      "Hawai'i background/community involvement and prior related work experience preferred"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with \"Constituent Service Representative\" in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": {
      "email": "HI01resumes@gmail.com",
      "phone": null,
      "address": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-248-25",
    "position_title": "Congressional District Director",
    "office": "Office of U.S. Congressman Ed Case",
    "location": "Honolulu, HI",
    "posting_date": "2025-08-11",
    "description": "U.S. Congressman Ed Case (Hawaii- 01) is seeking a District Director for his Honolulu district office.\n\nThis is a senior leadership position in the office. Duties include overseeing the Representative's constituent casework activities with federal, state and local agencies; aligning the office's strategies and plans with the Representative's broader goals; collaborating with Washington-based staff to ensure smooth communication and coordination between the Honolulu and D.C. offices; facilitating he Representative's engagement in the district; and managing and leading the Honolulu office staff, which includes planning, assigning and directing work to ensure high performance and efficiency\n\nThe position requires familiarity with Hawaii's 1st Congressional District, initiative, strong interpersonal skills, the ability to multitask, work independently and effectively under pressure, a proven ability to manage staff, make decisions and solve problems, orientation to detail, excellent verbal communication and writing skills, and the ability to manage long and unpredictable hours.\n\nVery strong preference given to (1) prior experience especially in comparable duties and (2) Hawaii background/community involvement, and applicants are asked to detail these attributes.",
    "responsibilities": [
      "overseeing the Representative's constituent casework activities with federal, state and local agencies",
      "aligning the office's strategies and plans with the Representative's broader goals",
      "collaborating with Washington-based staff to ensure smooth communication and coordination between the Honolulu and D.C. offices",
      "facilitating he Representative's engagement in the district",
      "managing and leading the Honolulu office staff, which includes planning, assigning and directing work to ensure high performance and efficiency"
    ],
    "qualifications": [
      "familiarity with Hawaii's 1st Congressional District",
      "initiative",
      "strong interpersonal skills",
      "the ability to multitask, work independently and effectively under pressure",
      "a proven ability to manage staff, make decisions and solve problems",
      "orientation to detail",
      "excellent verbal communication and writing skills",
      "the ability to manage long and unpredictable hours",
      "Very strong preference given to (1) prior experience especially in comparable duties and (2) Hawaii background/community involvement, and applicants are asked to detail these attributes."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two references and two short writing samples to HI01resumes@gmail.com with \"Honolulu District Director Vacancy\" in the subject line.\nPlease, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": {
      "email": "HI01resumes@gmail.com",
      "phone": null,
      "fax": null
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-247-25",
    "position_title": "Staff Assistant",
    "office": "Office of U.S. Congressman Ed Case",
    "location": "Honolulu, HI",
    "posting_date": "2025-08-11",
    "description": "U.S. Congressman Ed Case (Hawai'i - 01) is seeking a Staff Assistant for his district office located in downtown Honolulu.\n\nThe position is responsible for a wide variety of administrative duties and acts as a liaison to federal, district and local government agencies and community organizations on behalf of the Congressman on requests by constituents seeking assistance with individual/group issues. The position requires initiative, strong interpersonal skills, the ability to multitask, work independently and effectively under pressure, make decisions, and solve problems, orientation to detail, excellent verbal communication and writing skills, and unpredictable hours as necessary. Duties include but are not limited to greeting visitors and answering constituent calls and requests for general information, tours and other inquiries.\n\nPreference given to Hawai'i background/community involvement and prior related work experience, and applicants are asked to detail these attributes.",
    "responsibilities": [
      "Responsible for a wide variety of administrative duties.",
      "Acts as a liaison to federal, district and local government agencies and community organizations on behalf of the Congressman on requests by constituents seeking assistance with individual/group issues.",
      "Greeting visitors and answering constituent calls and requests for general information, tours and other inquiries."
    ],
    "qualifications": [
      "Initiative",
      "Strong interpersonal skills",
      "The ability to multitask",
      "Work independently and effectively under pressure",
      "Make decisions, and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Unpredictable hours as necessary",
      "Preference given to Hawai'i background/community involvement and prior related work experience"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with \"Staff Assistant\" in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-246-25",
    "position_title": "Scheduler",
    "office": "Office of Congressman Pat Ryan",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "The role will work closely with the Chief of Staff to maintain the short- and long-term schedules for the Member in DC and the Hudson Valley. Primary scheduling responsibilities include exercising sharp judgment in granting scheduling requests, responding to all meeting requests promptly and politely, and keeping events and meetings within designated timeframes.\n\nOverall goals include ensuring that the Member's messaging and mission are reflected in his schedule and itinerary. This position requires flexible hours, adaptability, ability to skillfully and effectively communicate, and superior organizational skills.\n\nThis position is part of the senior staff team and reports to the Chief of Staff.",
    "responsibilities": [
      "Resourcing the Member with proper briefing materials, ensuring that the Member is properly staffed for meetings and events,",
      "Serving as a liaison for the Member with the staff, public, Committees, and other Members of Congress",
      "Assisting with event planning, coordinating and booking travel,",
      "Leading scheduling meetings and updating staff on the Member's schedule,",
      "Additional duties as assigned by the Member or Chief of Staff"
    ],
    "qualifications": [
      "This is not an entry-level position.",
      "Ideal candidates will have previous experience working in operational roles on Capitol Hill or on political campaigns.",
      "Preference given to candidates with Hudson Valley or New York ties."
    ],
    "how_to_apply": "To apply, please send your resume, cover letter, and references in a single PDF to ny18resumes@mail.house.gov with the job title in the subject line and your full name (e.g.: 'Scheduling Role - First Last). Applicants will be evaluated on a rolling basis.",
    "salary_info": "$60,000 - $75,000 a year",
    "contact": {
      "email": "ny18resumes@mail.house.gov",
      "phone": null
    },
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-245-25",
    "position_title": "Speechwriter",
    "office": "House Appropriations Committee Minority",
    "location": null,
    "posting_date": "2025-08-11",
    "description": "The House Appropriations Committee Minority seeks an experienced Speechwriter.\n\nCompetitive candidates will possess the ability to write clearly, persuasively, and concisely. Candidates should have the flexibility to work under tight deadlines and write about a wide range of topics. In this position, creativity and collaboration are as vital as attention to detail and capturing Ranking Member Rosa DeLauro's voice.\n\nThe ideal candidate has extensive communications experience, with a preference for candidates with knowledge of the Appropriations process.\n\nBeyond these duties, there is room for candidates to explore other interests including the creation of graphics, videos, and other digital material.",
    "responsibilities": [
      "Managing the production of all oral statements and op-eds for the Ranking Member and assisting other Members of the Committee.",
      "Collaborating with the Communications Director, committee staff, and the Ranking Member's personal office to produce robust speeches with approved messaging, as well as well-sourced facts and figures, and moving stories.",
      "Writing statements, speeches, op-eds, talking points, messaging guidance, fact sheets, newsletters, and social media copy.",
      "Executing other press responsibilities including compiling the morning clips, sending out press releases in a timely manner, managing the press list, updating the website, and other duties as assigned."
    ],
    "qualifications": [
      "Ability to write clearly, persuasively, and concisely.",
      "Flexibility to work under tight deadlines and write about a wide range of topics.",
      "Creativity and collaboration.",
      "Attention to detail.",
      "Ability to capture Ranking Member Rosa DeLauro's voice.",
      "Extensive communications experience, with a preference for candidates with knowledge of the Appropriations process."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three professional references, and two relevant writing samples to AppropsDemJobs@mail.house.gov with the following subject line: [Full Name] - Speechwriter",
    "salary_info": null,
    "contact": "AppropsDemJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-244-25",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Rosa L. DeLauro (CT-03)",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "Congresswoman Rosa L. DeLauro (CT-03) is hiring a full-time Staff Assistant in her Washington, DC office to start in the beginning of September 2025. This role provides a unique entry level opportunity to work closely with a prominent Member of Congress.\n\nThe staff assistant reports to the scheduler and chief of staff.",
    "responsibilities": [
      "Driving the Member",
      "Helping execute her daily schedule",
      "Providing logistical support for events and meetings",
      "Managing the front office and the internship program",
      "Coordinating tours and constituent requests",
      "Processing incoming phone calls, mail, and other inquiries",
      "Providing operational, administrative, and technology support for the office and staff",
      "Performing other duties as assigned"
    ],
    "qualifications": [
      "Detail-oriented",
      "Proactive",
      "Calm under pressure",
      "Able to exercise discretion",
      "Eager to work in a fast-paced office",
      "Willing to work flexible-and sometimes long-hours when the Member is in DC",
      "Strong communication, logistical, interpersonal, and organizational skills are essential",
      "Must have a valid driver's license",
      "A clean driving record",
      "Should be comfortable driving in DC",
      "Access to a personal car is preferred, although not required",
      "Connecticut ties are a plus"
    ],
    "how_to_apply": "please send a cover letter, resume, writing sample (maximum of 1-2 pages), and two reference contacts (name, title, email, phone, and relationship) in a single pdf file to Daniel.Robillard@mail.house.gov with the subject line \"Staff Assistant: Your name (First/Last)\" No calls or walk-ins, please.",
    "salary_info": null,
    "contact": {
      "email": "Daniel.Robillard@mail.house.gov",
      "subject": "Staff Assistant: Your name (First/Last)",
      "instructions": "No calls or walk-ins, please."
    },
    "equal_opportunity": "This office is an equal opportunity employer and encourages all qualified candidates to apply."
  },
  {
    "id": "MEM-243-25",
    "position_title": "Press Secretary/Digital Director",
    "office": "Congresswoman Nanette Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2025-08-11",
    "description": "Congresswoman Nanette Barragan (CA-44) is seeking a Press Secretary /Digital Director to join our communications team. The Press Secretary /Digital Director will work under the office's Communications Director to carry out the Congresswoman's communications and outreach strategy. Ideal candidates are motivated self-starters, detail-oriented, highly organized, possess problem solving skills, thrive in a very fast-paced environment - and be willing to work extended hours and oftentimes under tight time constraints. Interested applicants are encouraged to apply by 15 August 2025.",
    "responsibilities": [
      "Work with the Communications Director to build and maintain the Congresswoman's brand.",
      "Develop and manage digital content across platforms (Facebook, Instagram, X, Bluesky, and YouTube). Support the office's social media strategy by drafting social media posts and producing video and graphic materials.",
      "Update and manage the official website.",
      "Monitor national and local media coverage, as well as social media trends.",
      "Clip and caption TV appearances, floor speeches, long and short form videos, and more.",
      "Draft and edit press releases, advisories, franked communications, and other communications materials as assigned",
      "Help plan and execute press events, interviews, and digital outreach.",
      "Maintain press contact lists and support external communications efforts."
    ],
    "qualifications": [
      "Strong writing, editing, and strategic messaging skills",
      "Skilled in Canva, Adobe Suite, or similar platforms",
      "Media relations success and ability to assist with communications in a fast-paced environment",
      "Los Angeles Metro|Southern California ties are a plus",
      "Fluency in Spanish is a plus",
      "Must be a collaborative, high-energy team player committed to advancing the office's mission and responsive to emerging priorities."
    ],
    "how_to_apply": "Send (1) Cover Letter, (2) Resume, (3) 2 writing samples of 500 words or less, (4) digital/photographic portfolio, and (5) and three references - including name, title, organization, contact details, and your relationship. Please send all materials to CA44Resumes@mail.house.gov with \"CA44 Press Secretary\" in the Subject Line.",
    "salary_info": "$60-70,000 based on experience",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-238-25",
    "position_title": "Field Representative/Digital Assistant",
    "office": "Office of Congresswoman Debbie Dingell",
    "location": "Michigan's 6th Congressional District",
    "posting_date": "2025-08-11",
    "description": "The office of Congresswoman Debbie Dingell seeks a Field Representative/Digital Assistant for Michigan's 6th Congressional District. This position will support the Congresswoman in building and maintaining relationships with local elected officials and community members in Ypsilanti and Western Wayne, keeping up to date on local issues and projects and frequently staffing the Member while she's in district. The position will cover: Augusta Township, Belleville, Pittsfield Township, Superior Township, Van Buren Township, York Township, Ypsilanti City, and Ypsilanti Township. This position will also support the Congresswoman's communications by creating district-wide content for the office's social media platforms, website, e-newsletter, and other digital properties.\n\nREPORTS TO: District Director and Communications Director",
    "responsibilities": [
      "Acts as the representative for the Member within an area of responsibility including meeting and communicating with constituents;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Monitors and updates the Member and District Director on district and local issues by reading local news outlets and completing regular check-in calls and meetings with community leaders, businesses, organizations, and stakeholders;",
      "Keeps an up-to-date calendar of community events occurring in assigned areas;",
      "Plans meetings and events for the Member in their respective areas;",
      "Tracks and reports on major projects happening in their areas;",
      "Prepares weekly reports for the District Director on district activities in their assigned issue areas;",
      "Regularly staffs Member at community events, both in-person and virtually;",
      "Meets attendance requirements as established by the office;",
      "Maintains a strong working relationship with the Member, staff, and constituents;",
      "Works quickly and accurately in a fact-paced environment under tight deadlines;",
      "Works a flexible schedule including long hours, nights and weekends as needed;",
      "Captures high-quality photo and video content from district events;",
      "Manages live streams at events including roundtables and town halls;",
      "Edits photos, videos, and other content for social media;",
      "Coordinates closely with DC communications team to elevate the Congresswoman's messaging;",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "Knowledge and pre-determined relationships with local community preferred;",
      "Strong oral and written communication skills;",
      "Thorough knowledge of legislative process;",
      "Prior digital experience including photography, videography, and livestreaming is strongly preferred;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Thoroughness and careful attention to detail;",
      "Skill in organizing and prioritizing work tasks and activities;",
      "Ability to work well under pressure;",
      "Ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "Qualified candidates should submit their application materials including a resume, cover letter, references, one writing sample, and digital samples or portfolio to Dingell.Jobs@mail.house.gov with \"Field Representative/Digital Assistant\" in the subject line.",
    "salary_info": "This position is full time and includes a competitive salary and benefits package including health care and employer contributions to a retirement savings plan.",
    "contact": {
      "email": "Dingell.Jobs@mail.house.gov",
      "phone": null
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-230-25",
    "position_title": "Outreach Coordinator/Press Secretary (OC/PS)",
    "office": "Congresswoman Rosa L. DeLauro (CT-03)",
    "location": "New Haven, CT",
    "posting_date": "2025-08-11",
    "description": "Congresswoman Rosa L. DeLauro (CT-03) is hiring a full time Outreach Coordinator/Press Secretary (OC/PS), to be based in the New Haven office. plays a key role in two critical areas: Community Outreach and District Media Relations. Reporting to the District Director and Communications Director, the OC/PS keeps the Member and senior staff informed on local issues, while serving as the lead on all district press operations and outreach efforts. This includes engaging with constituents, maintaining strong relationships with key community stakeholders, and organizing local media events. The balance of work will shift depending on the Member's schedule.",
    "responsibilities": [
      "Play a key role in Community Outreach and District Media Relations.",
      "Report to the District Director and Communications Director.",
      "Keep the Member and senior staff informed on local issues.",
      "Serve as the lead on all district press operations and outreach efforts.",
      "Engage with constituents.",
      "Maintain strong relationships with key community stakeholders.",
      "Organize local media events."
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should send a cover letter, resume and two writing samples to CT03jobs@gmail.com.",
    "salary_info": "$60-70,000",
    "contact": "CT03jobs@gmail.com",
    "equal_opportunity": null
  }
]