[
  {
    "id": "MEM-512-24",
    "position_title": "Washington, D.C.-Based Executive Assistant/Scheduler",
    "office": "Office of Congresswoman Sara Jacobs (CA-51)",
    "location": "Washington, D.C.",
    "posting_date": "2024-12-16",
    "description": "The Office of Congresswoman Sara Jacobs (CA-51) is looking for an organized, adaptable, and detail-oriented Executive Assistant/Scheduler for her Washington, D.C. office.\n\nIdeal candidates will have good judgment, an eye for detail, and the ability to work in a fastpaced, collaborative environment. They will be able to anticipate the needs of the Congresswoman and problem-solve on their feet.\n\nThis is not a 9-5 job; many nights and weekends will be required, especially during legislative sessions. Advance, sales, or service industry skills are preferred; a valid driver’s license and a good driving record are required.",
    "responsibilities": [
      "Driving and staffing the Congresswoman while she is in Washington, D.C",
      "Overseeing the member’s daily and long-term schedule, in coordination with the Deputy Chief of Staff and the district-based Executive Assistant/Scheduler",
      "Compiling the daily briefing book and ensuring the member is prepared ahead of engagements",
      "Managing member travel, logistics, and records",
      "Liaising between all staff and the member to effectively communicate needs",
      "Assisting the Deputy Chief of Staff with office operations, events, and project management, as needed",
      "Maintaining setup and presentation of the Member Office and upkeep of official vehicle",
      "Aiding in front office management during non-session weeks"
    ],
    "qualifications": [],
    "how_to_apply": "TO APPLY, please send a resume and cover letter to SaraJacobs.Resumes@mail.house.gov with “DC Scheduler – NAME” in the subject line.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Applications will be accepted through Friday, January 3, 2025, though priority will be given to earlier applicants. No phone calls, emails, or drop-ins, please."
  },
  {
    "id": "MEM-510-24",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Congresswoman Angie Craig (MN-02)",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "Congresswoman Angie Craig (MN-02) is in search of a highly-motivated Communications Director in her Washington, DC office. This position reports to the Chief of Staff.\n\nThe Communications Director will manage all aspects of the Congresswoman’s communications portfolio – including her earned media strategy, digital media presence, and robust franked communications program – and will oversee a comms team that spans both the DC and District offices.\n\nThe ideal candidate should have several years of demonstrated communications experience – including experience working with reporters. The candidate should be a strategic thinker and dynamic writer with strong interpersonal skills, solid political instincts, a good sense of humor, and a keen attention to detail.\n\nThis position is part of the Congresswoman’s senior staff – this is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and two writing samples to repcraigresumebank@gmail.com with the subject line “Communications Director [applicant’s full name].",
    "salary_info": "The position is full time with federal benefits, including student loan repayment program (if eligible), transit or parking benefits, and an annual salary of between $85,000 and $95,000 commensurate with experience.",
    "contact": "repcraigresumebank@gmail.com",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, or sexual orientation. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-511-24",
    "position_title": "Research Assistant",
    "office": "House Committee on Veterans' Affairs (Majority), Subcommittee on Health",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "The Majority staff of the House Committee on Veterans' Affairs is seeking a Research Assistant for the Subcommittee on Health. This position will support the Subcommittee Staff Director and Professional Staff Members in conducting oversight of and drafting legislation related to the Department of Veterans Affairs’ (VA) including its Veterans Health Administration (VHA), the largest integrated health care system in the United States, providing care at 1,380 health care facilities. The role involves administrative assistance, research, some policy work, and other duties as assigned. Prior congressional or federal agency experience is beneficial. Subject matter expertise is not required. Veterans are strongly encouraged to apply. This is a full-time, on-site position in Washington, DC. Some domestic travel is required.",
    "responsibilities": [
      "Provide administrative assistance including answering the phone and responding to phone and email inquiries, reviewing incoming correspondence and documents, maintaining Subcommittee records, scheduling meetings, supporting hearings, and other administrative duties as assigned.",
      "Assisting with oversight including organizing and participating in meetings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities by searching for and compiling documents and information.",
      "Assisting with legislation in a limited capacity including reading and tracking pending and enacted legislation.",
      "Representing the Committee in a limited capacity including meeting with other congressional staff, veteran service organizations, and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Staff Director, Committee Staff Director, or Committee Deputy Staff Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Veterans are strongly encouraged to apply",
      "Graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Problem solving skills",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Qualified candidates should send their resume to VAR.Resumes@mail.house.gov with “Health Research Assistant” in the subject line. Please include a short description of why you are interested in the position in the body of the email. Writing and editing tests, and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-506-24",
    "position_title": "Social Media Assistant",
    "office": "Office of Congresswoman Sara Jacobs (CA-51)",
    "location": "Washington, D.C. or San Diego, CA",
    "posting_date": "2024-12-16",
    "description": "The Social Media Assistant will be responsible for creating and executing digital strategies under the guidance of the Communications Director. The ideal candidate will be a strong writer and a digital native with an eye for detail and a passion for innovative digital engagement.\n\nThis is not a 9-5 job; some nights and weekends as well as frequent travel will be required. California ties are helpful; good judgment and common sense are a must.",
    "responsibilities": [
      "Manage the Congresswoman’s social media platforms – including Twitter, Facebook, Threads, Instagram, TikTok, and others – in addition to her website.",
      "Proactively draft content in the voice of the Congresswoman each day in addition to quickly responding to breaking news, Capitol Hill and San Diego developments, and other rapid response opportunities.",
      "Proficient in graphic design and video editing.",
      "Proactively creating graphics, videos, and other digital content that is compelling, engaging, on-brand, and error-free.",
      "Regularly take photos and videos of the Congresswoman at events and in meetings.",
      "Managing a strategic content calendar, they will be expected to create content for rollouts and rapid response opportunities.",
      "Clipping, captioning, and posting committee remarks, floor speeches, and interviews.",
      "Spearheading the e-newsletter program, including drafting, franking, and sending content related to grant opportunities, the Congresswoman’s legislative priorities, and her work in San Diego."
    ],
    "qualifications": [],
    "how_to_apply": "TO APPLY, please send a resume, cover letter, video sample, graphic sample, and short writing sample to SaraJacobs.Resumes@mail.house.gov with “Social Media Assistant – NAME” in the subject line.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Applications will be accepted through Friday, January 3, 2025, though priority will be given to earlier applicants."
  },
  {
    "id": "MEM-504-24",
    "position_title": "Legislative Assistant",
    "office": "House Committee on Veterans’ A&airs, Subcommittee on Technology Modernization",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "The House Committee on Veterans' A&airs majority is seeking a Legislative Assistant for the Subcommittee on Technology Modernization. This position will conduct oversight of the Department of Veterans A&airs’ (VA) enterprise technology programs and projects as well as its information technology operations. Information technology is a key aspect of all VA operations including, but not limited to, supply chain, health care delivery, cybersecurity, human resources, ﬁnancial management, and beneﬁts delivery. The role involves collecting technical information and translating it into brieﬁngs, memoranda, and policy recommendations for a general audience in an extremely fast-paced environment. Some level of subject matter expertise in information technology and federal agency administrative or management issues is also required. This is a full-time, on-site position in Washington, DC. Some domestic travel is required.",
    "responsibilities": [
      "Under the supervision of the Subcommittee Sta& Director, conduct oversight of the Department of Veterans A&airs (VA) enterprise technology programs and projects as well as its information technology operations.",
      "Organizing and participating in meetings, preparing for subcommittee hearings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.",
      "Collect technical information and translate it into brieﬁngs, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Assisting with legislation in a limited capacity including drafting bills as well as reading and tracking pending and enacted legislation.",
      "Representing the Committee in a limited capacity including meeting with other congressional sta&, veteran service organizations, technical organizations, and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Sta& Director, Committee Sta& Director, and Committee Deputy Sta& Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "At least three years of relevant work experience, prior congressional or federal agency experience is preferred but not required",
      "Some level of subject matter expertise in information technology and federal agency administrative or management issues",
      "Veterans are strongly encouraged to apply",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Knowledge of current issues and events relevant to the Committee and VA",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume to VAR.Resumes@mail.house.gov with “Technology Modernization Legislative Assistant” in the subject line. Writing samples and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-503-24",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Emilia Sykes (OH-13)",
    "location": null,
    "posting_date": "2024-12-16",
    "description": "Congresswoman Emilia Sykes (OH-13) is seeking an experienced and enthusiastic Legislative Assistant to manage healthcare and other issues as assigned. Ideal candidates will have 2+ years of Hill experience, a good understanding of House procedures, an understanding of developing and tracking legislative initiatives, and political awareness. Experience with healthcare policy is required. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. Job responsibilities will include meeting with constituent groups and stakeholders, preparing and sta&ing the Congresswoman, drafting legislation, advancing the Congresswoman’s legislative agenda, providing vote recommendations, drafting legislative memos and brieﬁng materials, and reviewing constituent correspondence, in addition to other duties as assigned.",
    "responsibilities": [
      "Meeting with constituent groups and stakeholders",
      "Preparing and sta&ing the Congresswoman",
      "Drafting legislation",
      "Advancing the Congresswoman’s legislative agenda",
      "Providing vote recommendations",
      "Drafting legislative memos and brieﬁng materials",
      "Reviewing constituent correspondence",
      "Other duties as assigned"
    ],
    "qualifications": [
      "2+ years of Hill experience",
      "A good understanding of House procedures",
      "An understanding of developing and tracking legislative initiatives",
      "Political awareness",
      "Experience with healthcare policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter"
    ],
    "how_to_apply": "Qualiﬁed candidates should submit a resume and two writing samples to JoinTeamSykes@mail.house.gov with “Healthcare Legislative Assistant” in the Subject Line. Applications will be accepted until the end of business on Friday, December 13. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "This o&ice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-502-24",
    "position_title": "Communications Director",
    "office": "Congressman Steven Horsford (NV-04)",
    "location": null,
    "posting_date": "2024-12-16",
    "description": "Congressman Steven Horsford (NV-04) seeks an experienced Communications Director to lead and execute an aggressive and strategic integrated communications strategy. In close collaboration with the Member, Chief of Staff, and legislative and district teams, the Communications Director will oversee the Member’s communications agenda and manage a fast-paced communications team. This position reports to the Chief of Staff and is not an entry level position.",
    "responsibilities": [
      "Maintaining relationships with both national and local reporters, organizing and replying to inquiries, and proactively pitching stories",
      "Drafting and editing press releases",
      "Developing media strategies to roll out legislative wins creating relatable content for constituents from complex policy",
      "Spearheading communications components of district outreach and events",
      "Overseeing an aggressive and responsive social media program",
      "Creating targeted audience messaging and media strategies",
      "Writing op-eds, talking points, newsletters, mailers, letters, and speeches",
      "Managing and coaching the communications team",
      "Working collaboratively with District Office and legislative staff to amplify the office’s work",
      "Overseeing franked communications and a robust 499 program"
    ],
    "qualifications": [
      "5-7 years of political communications experience",
      "A strong history of drafting all forms of communications materials",
      "Sharp attention to detail",
      "Experience managing a team",
      "A track record of successfully pitching national and local media outlets",
      "Collaborative, creative, detail-oriented, able to multitask, politically astute, and willing to work long hours in a fast-paced and demanding setting",
      "Nevada ties are a plus",
      "Prior Hill experience is preferred"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and any relevant examples of digital content you have created (links to social media accounts, video work, written content, etc.) to Yvanna Cancela at Yvanna.Cancela@mail.house.gov.\nApplications will be reviewed on a rolling basis until the position is filled. The position will be filled quickly, so please apply soon if interested.",
    "salary_info": null,
    "contact": "Yvanna.Cancela@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Horsford is an equal opportunity employer and encourages applicants from all backgrounds to apply."
  },
  {
    "id": "MEM-501-24",
    "position_title": "House GOP Member Seeks National Security Advisor",
    "office": "House GOP Member",
    "location": null,
    "posting_date": "2024-12-16",
    "description": "CORE RESPONSIBILITIES:\n1. to develop and plan legislative initiatives related to a national security, cyber\nsecurity, foreign a&airs, and armed services portfolio.\n2. to monitor legislative developments within Committees and on the House floor;\n3. to meet with constituents and advocacy groups on behalf of the Member.\nQUALIFICATIONS:\n1. at least 1 year of legislative experience in a full-time, paid position or legislative\nfellowship\n2. excellent oral and written communication skills;\n3. thorough knowledge of the legislative process;\n4. ability to exercise discretion and independent judgment in the formulation and\nrecommendation of policy positions for the Member;\n5. ability to work cooperatively and courteously with others;\n6. ability to work well under pressure;\n7. thoroughness and careful attention to detail",
    "responsibilities": [
      "to develop and plan legislative initiatives related to a national security, cyber security, foreign a&airs, and armed services portfolio.",
      "to monitor legislative developments within Committees and on the House floor",
      "to meet with constituents and advocacy groups on behalf of the Member."
    ],
    "qualifications": [
      "at least 1 year of legislative experience in a full-time, paid position or legislative fellowship",
      "excellent oral and written communication skills",
      "thorough knowledge of the legislative process",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member",
      "ability to work cooperatively and courteously with others",
      "ability to work well under pressure",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-500-24",
    "position_title": "Legislative Assistant, U.S. House Committee on Veterans' Affairs, Republican Staff",
    "office": "U.S. House Committee on Veterans' Affairs",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "This is a full-time, onsite, position in Washington, DC",
    "responsibilities": [
      "Conduct oversight of Subcommittee issue areas, including Department implementation of laws, regulations, and programs",
      "Review evidence and data to analyze, develop, and provide detailed written and oral reports of findings",
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Draft hearing, markup, and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Draft trip reports, requests to agencies for information, letters to agencies, hearing recaps, and other work product relevant to the Subcommittee's jurisdiction",
      "Assist in determining Full Committee and Subcommittee hearing topics and preparing for hearings",
      "Coordinate with Member office staff on logistics, including Subcommittee Member attendance for Subcommittee activities",
      "Meet with congressional staff and internal/external organizations on the Subcommittee's behalf",
      "Analyze current law and proposed legislation; assist with the drafting of legislation; and draft policy memoranda as assigned",
      "Assist with developing policy recommendations and serve as a resource for Members both on and off Committee",
      "Organize and maintain Subcommittee electronic records",
      "Engage with whistleblowers",
      "Travel and conduct oversight visits at agency facilities",
      "Perform other duties as assigned by the Subcomittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "Knowledge of the legislative drafting process",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communications skills",
      "Thoroughness and careful attention to detail",
      "Strong Microsoft Office proficiency, including expertise in Word and ability to use Excel",
      "Demonstrate the ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions",
      "Knowledge of current issues and events in which the Full Committee leadership is involved",
      "Ability to work long hours under pressure and be cooperative and courteous with others",
      "Ability to manage fluctuating workloads",
      "Strong research skills",
      "Potential to work independently"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, and writing sample to VAR.Resumes@mail.house.gov with “O&I Republican Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "U.S. House of Representatives employment is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Applicants must pay for all transportation and all related travel expenses associated with the interview and hiring process."
  },
  {
    "id": "MEM-498-24",
    "position_title": "Legislative Assistant",
    "office": "Subcommittee on Disability Assistance and Memorial A&airs, House Committee on Veterans’ A&airs, Majority Sta& (DAMA)",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "The Subcommittee on Disability Assistance and Memorial A&airs, House Committee on Veterans’ A&airs, Majority Sta& (DAMA) is seeking a Legislative Assistant to provide administrative, legislative, and research support to Subcommittee sta&, and assists with duties as assigned.",
    "responsibilities": [
      "Maintain Subcommittee archives of activities, including identifying and tracking pending legislation.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notiﬁcations, and schedule meetings with parties as appropriate.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Analyze current law and proposed legislation; assist with the drafting of legislation within the Majority agenda as assigned; participate in sta&-level discussions with knowledge of background information on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including developing recommendations of hearing topics, brieﬁng of Subcommittee Members, drafting memoranda and remarks for Chairman, and development of questions.",
      "Coordinate with Member o&ice sta& on logistics, including Subcommittee Member attendance, for Subcommittee activities, including hearings.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Draft memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and sta&.",
      "Assist with developing policy recommendations and serve as a resource for Members both on and o& Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Sta& Director or Deputy Sta& Director, and Subcommittee Sta& Director, and assisting other Committee sta&, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science.",
      "Strong writing and editing skills, including for work product of di&erent types with di&erent audiences.",
      "Strong Microsoft O&ice proﬁciency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "S.trong verbal communication, including with di&erent audiences.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage ﬂuctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "how_to_apply": "Qualiﬁed candidates please send their cover letter, resume, and three (3) writing samples to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Legislative Assistant” in the subject line.\nNo calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-497-24",
    "position_title": "Scheduler",
    "office": "Midwest Republican",
    "location": "Washington, D.C.",
    "posting_date": "2024-12-16",
    "description": "Midwest Republican seeks a Scheduler in the Washington, D.C. office. Strong preference for applicants with prior or current Hill experience.",
    "responsibilities": [
      "Maintaining the Member’s day-to-day schedule, sharing appropriate event details, points of contact, and locations for meetings and events with the Member and staff as appropriate.",
      "Preparing daily itineraries for the Member along with all applicable briefing materials for the day ahead.",
      "Working closely with the Member, Chief of Staff, and Legislative Director to process all incoming meeting requests, invitations, committee hearings, and coordinating travel arrangements.",
      "Working closely with the Communications Director to schedule radio and television press, and interviews both in D.C. and in the district.",
      "Organizing expense reimbursements and working with the office’s Financial Administrator to reconcile office accounts.",
      "Working closely with the District Director to plan and facilitate travel to district visits.",
      "Maintains a good working relationship with constituents, committee staff, other Congressional offices, and other government offices/agencies."
    ],
    "qualifications": [
      "Excellent organizational skills and attention to detail are required.",
      "Ideal candidates should have at least 1-2 years of relevant experience and the ability to multitask in a very fast-paced environment."
    ],
    "how_to_apply": "Interested applicants can send their resume and any references to GOPMidwestScheduler@gmail.com.",
    "salary_info": null,
    "contact": "GOPMidwestScheduler@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-495-24",
    "position_title": "Scheduler",
    "office": "Representative-elect Eugene Vindman (VA-07)",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "Representative-elect Eugene Vindman (VA-07) seeks a Scheduler to manage his schedule\nin both Washington, DC and Virginia’s Seventh Congressional District. The position will be\nbased in his Washington, DC o&ice. The Scheduler will be responsible for managing the\nRepresentative’s daily and long-term schedule; keeping track of and responding to\ninvitations and meeting requests; working with the District, Communications, and\nLegislative teams to prioritize among competing events and to proactively schedule and\nbuild out events in the district and in Washington, DC; compiling brieﬁng materials;\nmanaging logistics and travel for the Representative; and assisting with o&ice operations\nand administration. The position requires exceptional attention to detail, excellent\ncustomer service skills, a high level of responsiveness, excellent communication skills, the\nability to work outside of normal business hours (particularly when Congress is in session), \nand the ability to juggle competing priorities in a fast-paced environment. Note: for more\nexperienced candidates, this could become a Director of Operations role that would cover\nscheduling as well as additional responsibilities.",
    "responsibilities": [
      "Managing the Representative’s daily and long-term schedule",
      "Keeping track of and responding to invitations and meeting requests",
      "Working with the District, Communications, and Legislative teams to prioritize among competing events and to proactively schedule and build out events in the district and in Washington, DC",
      "Compiling brieﬁng materials",
      "Managing logistics and travel for the Representative",
      "Assisting with o&ice operations and administration"
    ],
    "qualifications": [
      "Exceptional attention to detail",
      "Excellent customer service skills",
      "A high level of responsiveness",
      "Excellent communication skills",
      "The ability to work outside of normal business hours (particularly when Congress is in session)",
      "The ability to juggle competing priorities in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, two writing samples, and contact information\nfor three references to vindmanjobsva@gmail.com with the subject line “Scheduler – [Your\nName].”",
    "salary_info": null,
    "contact": "vindmanjobsva@gmail.com",
    "equal_opportunity": "The o&ice is an equal-opportunity employer and does not discriminate on the basis of race,\ncolor, religion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status. Qualiﬁed people of color\nand people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-494-24",
    "position_title": "District Director",
    "office": "Representative-elect Eugene Vindman (VA-07)",
    "location": "Prince William County district office, with regular travel throughout the Seventh District",
    "posting_date": "2024-12-16",
    "description": "Representative-elect Eugene Vindman (VA-07) seeks a District Director to manage his\nconstituent services and district outreach operation in Virginia’s Seventh District. The\nposition will be based in his Prince William County district office, with regular travel\nthroughout the Seventh District. The District Director will be responsible for hiring, training,\nand managing the district team; ensuring constituent casework is done efficiently and\neffectively; developing and executing an outreach strategy to ensure that the\nRepresentative’s team is reaching every corner and every community of the district;\nplanning district events for the Representative during district work periods; developing and\nmaintaining relationships across the district with local government officials, businesses,\nnonprofits, and other stakeholders; opening additional district offices as necessary; and\nmaintaining strong channels of communication with the DC office so that constituent\nconcerns are heard and are at the forefront of the entire team’s work. The position requires\nexceptional customer service skills, strong management skills (including the ability to\nmanage team members working in different locations), attention to detail, proactivity, longterm planning, the ability to work outside of normal business hours to attend community\nevents, and an in-depth understanding of various communities in Virginias’s Seventh\nDistrict.",
    "responsibilities": [
      "Hiring, training, and managing the district team",
      "Ensuring constituent casework is done efficiently and effectively",
      "Developing and executing an outreach strategy to ensure that the Representative’s team is reaching every corner and every community of the district",
      "Planning district events for the Representative during district work periods",
      "Developing and maintaining relationships across the district with local government officials, businesses, nonprofits, and other stakeholders",
      "Opening additional district offices as necessary",
      "Maintaining strong channels of communication with the DC office so that constituent concerns are heard and are at the forefront of the entire team’s work"
    ],
    "qualifications": [
      "Exceptional customer service skills",
      "Strong management skills (including the ability to manage team members working in different locations)",
      "Attention to detail",
      "Proactivity",
      "Long-term planning",
      "The ability to work outside of normal business hours to attend community events",
      "An in-depth understanding of various communities in Virginias’s Seventh District"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, two writing samples, and contact information\nfor three references to vindmanjobsva@gmail.com with the subject line “District Director –\n[Your Name].”",
    "salary_info": null,
    "contact": "vindmanjobsva@gmail.com",
    "equal_opportunity": "The office is an equal-opportunity employer and does not discriminate on the basis of race,\ncolor, religion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status. Qualified people of color\nand people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-493-24",
    "position_title": "Communications Director",
    "office": "Representative-elect Eugene Vindman (VA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2024-12-16",
    "description": "Representative-elect Eugene Vindman (VA-07) seeks a Communications Director to manage his public-facing communications operation in his Washington, D.C. office. The Communications Director must have multiple years of communications experience on Capitol Hill, campaigns, or similar environments. The Communications Director will be responsible for training and managing the communications team; pitching stories on the Representative to press; drafting press releases, speeches, talking points, op eds, and other written materials; planning in-district media events; and developing and executing a media strategy that includes earned media, digital media, and franked communications.\nThe position requires an understanding of the Virginia media landscape, an ability to build and maintain relationships with both Capitol Hill and Virginia press, outstanding writing and editing skills, an ability to speak/write in the Representative’s voice, and the ability to meet short deadlines. Virginia ties are a plus.",
    "responsibilities": [
      "Training and managing the communications team",
      "Pitching stories on the Representative to press",
      "Drafting press releases, speeches, talking points, op eds, and other written materials",
      "Planning in-district media events",
      "Developing and executing a media strategy that includes earned media, digital media, and franked communications"
    ],
    "qualifications": [
      "Understanding of the Virginia media landscape",
      "Ability to build and maintain relationships with both Capitol Hill and Virginia press",
      "Outstanding writing and editing skills",
      "Ability to speak/write in the Representative’s voice",
      "Ability to meet short deadlines",
      "Virginia ties are a plus"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, two writing samples, and contact information for three references to vindmanjobsva@gmail.com with the subject line “Communications Director – [Your Name].”",
    "salary_info": null,
    "contact": "vindmanjobsva@gmail.com",
    "equal_opportunity": "The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Qualified people of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-492-24",
    "position_title": "Legislative Director",
    "office": "Representative-elect Eugene Vindman (VA-07)",
    "location": "Washington, DC",
    "posting_date": "2024-12-16",
    "description": "Representative-elect Eugene Vindman (VA-07) seeks a Legislative Director to manage his\nlegislative operation in Washington, DC. The Legislative Director must have several years of\nexperience working on Capitol Hill, preferably in a House office and with a Frontline\nMember. The Legislative Director will be responsible for training and managing the\nlegislative team, providing vote recommendations, supervising committee work, tracking\nlegislative accomplishments, introducing original legislation, meeting with constituent\ngroups, recommending legislation to cosponsor, and developing and executing on a longterm legislative agenda in line with the Representative’s priorities. The position requires\ndeep policy expertise, an understanding of how to get things done on Capitol Hill, strong\nmanagement skills, excellent writing and communication skills, and the ability to work\noutside of normal business hours (especially during in-session weeks). Virginia ties are a\nplus.",
    "responsibilities": [
      "Training and managing the legislative team",
      "Providing vote recommendations",
      "Supervising committee work",
      "Tracking legislative accomplishments",
      "Introducing original legislation",
      "Meeting with constituent groups",
      "Recommending legislation to cosponsor",
      "Developing and executing on a long-term legislative agenda in line with the Representative’s priorities"
    ],
    "qualifications": [
      "Deep policy expertise",
      "An understanding of how to get things done on Capitol Hill",
      "Strong management skills",
      "Excellent writing and communication skills",
      "The ability to work outside of normal business hours (especially during in-session weeks)",
      "Virginia ties are a plus"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, two writing samples, and contact information\nfor three references to vindmanjobsva@gmail.com with the subject line “Legislative\nDirector – [Your Name].”",
    "salary_info": null,
    "contact": "vindmanjobsva@gmail.com",
    "equal_opportunity": "The office is an equal-opportunity employer and does not discriminate on the basis of race,\ncolor, religion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status. Qualified people of color\nand people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-484-24",
    "position_title": "Caseworker",
    "office": "Congressman Gabe Amo (RI-01)",
    "location": "Rhode Island",
    "posting_date": "2024-12-16",
    "description": "Congressman Gabe Amo (RI-01) seeks a Caseworker to join his district office in Rhode Island. Candidates must have exceptional written and verbal communication skills, be organized, and pay attention to detail. Candidates will be expected to be a liaison to other government entities on behalf of the Congressman to serve constituents. Candidates should have a strong ability to exercise discretion and judgment in resolving casework. The Caseworker will report to the District Director, work with the staff in Washington D.C. as appropriate, and may have other duties as assigned.\n\nCandidates should have experience working in a fast-paced office and maintain a professional, flexible, and positive demeanor while managing competing tasks and projects. The Caseworker will be expected to maintain accurate and complete files on all assigned casework matters and be able to respond to constituent request for information. Casework or other relevant experience is strongly preferred. This is not an entry-level position. Rhode Island ties are a plus. Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin.",
    "responsibilities": [
      "Liaison to other government entities on behalf of the Congressman to serve constituents.",
      "Maintain accurate and complete files on all assigned casework matters.",
      "Respond to constituent request for information."
    ],
    "qualifications": [
      "Exceptional written and verbal communication skills.",
      "Organized and pay attention to detail.",
      "Strong ability to exercise discretion and judgment in resolving casework.",
      "Experience working in a fast-paced office.",
      "Maintain a professional, flexible, and positive demeanor while managing competing tasks and projects.",
      "Casework or other relevant experience is strongly preferred.",
      "Rhode Island ties are a plus."
    ],
    "how_to_apply": "To apply, send in a single PDF with a resume, a cover letter, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01JobsAmo@gmail.com, with the following subject line: “Full Name – Caseworker”.",
    "salary_info": null,
    "contact": "RI01JobsAmo@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-476-24",
    "position_title": "Legislative Assistant (LA)",
    "office": "Congressman Dan Crenshaw (R-TX-02)",
    "location": "Washington, D.C.",
    "posting_date": "2024-12-16",
    "description": "Congressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative Assistant (LA), based in our Washington, D.C. office. This position reports to the Legislative Director. The LA will handle an economic facing portfolio, including Budget and Appropriations, Financial Services, and Tax, with other issues to follow.\n\nIdeal candidates will have strong written and oral communications skills and be detailoriented, organized, and creative. They must be able to quickly learn the member’s voice and think in a proactive, communications-focused manner.\n\nOther key qualities include:\n\nCommitment to a collaborative work environment\n\nAbility to work in a fast-paced environment and manage competing priorities\n\nAbility to communicate up and down within the team\n\nAbility to learn the Congressman’s voice and legislative priorities\n\nInterest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
    "responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and staffing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas Working with external stakeholders, Congressional Research Service (CRS), Legislative Counsel, and committee staff to draft legislation based on the Member’s priorities"
    ],
    "qualifications": [
      "Hill experience is required."
    ],
    "how_to_apply": "Qualified applicants should submit a resume and writing sample (no more than 3 pages) as one combined PDF to Kenneth.Depew@mail.house.gov. Include “Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on a rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "Kenneth.Depew@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-410-24",
    "position_title": "Full Time Constituent Services Representative",
    "office": "Congressional",
    "location": null,
    "posting_date": "2024-12-16",
    "description": "The Constituent Services Representative position acts as a liaison to federal, district, and local agencies for the Member/constituents and answers casework correspondence and verbal communications with constituents. Candidates must be a selfstarter, excited to problem solve, hardworking, dependable, and organized as well as possess strong oral and written communication skills. This position requires the ability to work well under pressure, good judgment, strong customer service skills, and a commitment to public service. Availability to work some evenings and weekends is required. Ability to communicate in multiple languages is also highly desirable. A vehicle to travel to evening and weekend events is also recommended.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Handles casework assignments and special projects at the direction of the Director of Constituent Services;",
      "Continually screens active cases/ constituent service requests and acts as a liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Attends and monitors scheduled district meetings on behalf of the Member with constituents and groups during regular office hours, some evenings and weekends;",
      "Logging incoming and outgoing correspondence, handling visitors & telephone calls;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework and constituent concerns in Congressional Management System Database;",
      "Performs cross functional tasks with other departments, as needed.",
      "Meets attendance requirements as established by the office; Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;"
    ],
    "qualifications": [
      "Strong customer service, oral and written communication skills;",
      "Familiarity with local, state and federal agencies; Strong knowledge of issues and events in the district in which the Member is involved;",
      "Professional telephone manner and excellent customer and client service skills;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge and proficiency in Microsoft office suite and other office computer applications."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter and resume to ny08team@gmail.com with the Subject Line: Constituent Services Representative Position.",
    "salary_info": null,
    "contact": "ny08team@gmail.com",
    "equal_opportunity": "Women, people of color, and LGBTQ candidates are strongly encouraged to apply."
  }
]