[
  {
    "id": "MEM-137-25",
    "position_title": "Caseworker",
    "office": "Congresswoman Sarah Elfreth (MD-03)",
    "location": "District Office in Columbia, Maryland",
    "posting_date": "2025-04-21",
    "description": "Congresswoman Sarah Elfreth (MD-03) seeks a self-motivated and organized individual to join her team as a Caseworker based in her District Office in Columbia, Maryland. This position serves as a liaison between federal, state, and local agencies on behalf of the Member and her constituents. The Caseworker will handle a portfolio of issue areas through casework correspondence and verbal communication with constituents.",
    "responsibilities": [
      "Serve as the representative for the Member in their assigned portfolio, including responding to casework requests, meeting/corresponding with constituents and serving as a liaison to federal agencies.",
      "Inform the Member and District Director of trends and policy updates in his or her assigned issue areas.",
      "Handle and prioritize casework assignments while assisting with general intake, constituent service requests, and communication in an office environment.",
      "Assess casework inquiries for problems requiring legislative action and provide recommendations to the District Director, Chief of Staff and the Member.",
      "Screen and refer cases, when appropriate, to other federal, state and local elected officials.",
      "Prepare periodic memos/reports for senior leadership and the Member on pending cases and district activities in his or her assigned issue areas.",
      "Monitor active cases and act as a liaison on behalf of constituents to ensure inquiries are handled in a responsive manner.",
      "Maintain up-to-date files on all cases, constituent correspondence and issues of importance to the office.",
      "Direct and guide constituents to private and public resources at the federal, state and local level.",
      "Maintain a good working relationship with the Member, staff, and constituents.",
      "Demonstrate an ability to accept performance-based feedback and direction.",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Demonstrate strong interpersonal skills, including the ability to empathize and active listening.",
      "Ability to exercise discretion and independent judgment to handle and respond appropriately to casework inquiries.",
      "Strong oral and written communication skills.",
      "General knowledge of casework process.",
      "General knowledge and ability to identify federal, state and local issues.",
      "Professional and compassionate telephone manner.",
      "Strong organizational and follow-up skills.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others.",
      "Thoroughness and careful attention to detail.",
      "Proficient in word processing, general computer programming and office equipment: scanner, copier, printer, desktop computer."
    ],
    "how_to_apply": "All interested candidates should email a resume and cover letter directly to MD03Resumes@mail.house.gov with the subject line “Caseworker – [Applicant’s First Name and Last Name].",
    "salary_info": null,
    "contact": "MD03Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-136-25",
    "position_title": "Immigration Caseworker",
    "office": "Office of Congresswoman Suzanne Bonamici (OR-01)",
    "location": "Beaverton District Office",
    "posting_date": "2025-04-21",
    "description": "Congresswoman Bonamici is hiring an Immigration Caseworker to join the Beaverton\nDistrict Office. The caseworker’s primary responsibility is to be the Congresswoman’s\nliaison to federal, state, and local agencies and constituents. The caseworker is a critical\npart of the Congresswoman’s team and spends most of their time working directly with\nconstituents and federal agencies. The caseworker’s issue portfolio may grow or evolve\nover time based on skill and experience and office needs.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman to constituents and federal\nagencies, primarily with the Department of Homeland Security and the Department\nof State;",
      "Handles immigration casework, as well as Small Business Administration, Internal\nRevenue Service, Federal Student Loans, and others as assigned;",
      "Writes casework correspondence, meets with constituents, and communicates\ndirectly with federal agencies, constituents, and community partners;",
      "Informs the Congresswoman and the District Director of important issues in their\nassigned issue areas and seeks assistance as needed;",
      "Assesses casework for problems requiring legislative action and makes\nrecommendations to the District Director and legislative staL;",
      "Is an active member of the policy team working on immigration issues;",
      "Assists field staL with outreach activities related to this portfolio;",
      "Screens and refers cases, when appropriate, to other district oLices, or state\nlegislators or local governments;",
      "Logs all incoming and outgoing mail and incoming telephone calls relating to their\ncasework portfolio, and maintains updated electronic files;",
      "Prepares periodic reports for the Congresswoman and staL on pending cases and\ndistrict activities in their assigned issue areas;",
      "Continually screens active cases to make sure that cases are being handled in a\nresponsive manner;",
      "Maintains a good working relationship with the Congresswoman, staL, and\nconstituents; and",
      "Performs other duties as assigned, including staLing the Congresswoman for indistrict meetings and town hall meetings, and temporarily covering other\nassignments during staL absences."
    ],
    "qualifications": [
      "Strong oral and written communication skills;",
      "Collaborative problem-solving;",
      "Temperament to communicate in a tactful, clear, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment when fulfilling casework\nresponsibilities including respecting the privacy of constituents seeking\nassistance;",
      "Maintain up-to-date knowledge of policy developments related to immigration\nand other assignments.",
      "Bachelor’s degree or equivalent experience;",
      "Excellent verbal and written communication skills;",
      "Experience working with members of the public, in customer or constituent service."
    ],
    "how_to_apply": "Please email a cover letter and resume to sarah.baessler@mail.house.gov by April\n25, 2025.",
    "salary_info": "$60,000-$68,000 annually commensurate with experience.\nPosition includes federal benefits including health care and student loan\nrepayment program.",
    "contact": "sarah.baessler@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis\nof race, color, religion, sex, national origin, age, disability, gender identity, or sexual\norientation and encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-135-25",
    "position_title": "DC-Based Scheduler and Office Manager",
    "office": "Office of Representative Sharice Davids (KS-03)",
    "location": "DC",
    "posting_date": "2025-04-21",
    "description": "The Office of Representative Sharice Davids (KS-03) is seeking a DC- based\nScheduler/Office Manager to coordinate the Representative’s schedule and manage\noverall operations in the DC office.\n\nCandidates must have exceptional organizational skills, attention to detail, and an ability\nto manage competing demands and deadlines. Candidates must handle conflicting\nrequests, anticipate the needs of the Member, and exercise sound and efficient judgment\nwhen scheduling meetings, events, and travel. Candidate must have strong\ncommunication skills. Capitol Hill or other relevant administrative, operations, or\nscheduling experience is strongly preferred. Kansas ties are a plus.",
    "responsibilities": [
      "Maintaining and managing the Member’s daily and long-term DC and district schedule, including coordinating with District staff.",
      "Responding to all incoming meeting and scheduling requests.",
      "Coordinating closely with appropriate legislative or communications staff to ensure efficient delivery of the Member’s briefing materials.",
      "Coordinating travel and booking flight, train, and lodging reservations for the Member and staff as needed",
      "Communicating key information and scheduling changes to the Member, staff, and effected stakeholders in a timely and efficient manner",
      "Coordinating with Caucus, Leadership, and Committee staff to efficiently coordinate the Member's schedule while the House is in session",
      "Provide operational support to the office, including time-off requests, office supply needs, tech management, and other duties, to ensure staff is supported.",
      "Work closely with Chief of Staff and Financial Admin to ensure compliance with annual budget.",
      "The position requires flexible, non-traditional working hours and availability by phone as needed."
    ],
    "qualifications": [
      "Bachelor’s Degree preferred.",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred.",
      "Kansas ties are a plus."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and three references to\nks03.jobs@mail.house.gov with the subject line “Full Name – DC Office Scheduler\".\nApplications will be processed on a rolling basis.",
    "salary_info": null,
    "contact": "ks03.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race,\ncolor, religion, sex, sexual orientation, gender identity and expression, national origin, age,\ndisability, military status, marital or parental status. Women, people of color, and other\nmembers of underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-134-25",
    "position_title": "Staff Assistant",
    "office": "House Committee on Energy and Commerce Democratic Staff (minority)",
    "location": null,
    "posting_date": "2025-04-21",
    "description": "The House Committee on Energy and Commerce Democratic Staff (minority) seeks an\nenthusiastic, motivated, and highly organized Staff Assistant for fast-paced committee\noffice.",
    "responsibilities": [
      "Tasks associated with a front office such as receptionist duties",
      "Answering phones",
      "Greeting visitors",
      "Ensuring that office and meeting rooms are kept in order",
      "Supporting staff in preparations for committee events such as hearings, markups, meetings, and events",
      "Training and supervising interns",
      "Handling and sorting incoming mail",
      "Maintaining both digital and paper records and files",
      "Maintaining office supplies and mastering basic equipment operations",
      "Assisting other staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "Must possess excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Exceptional time management skills",
      "An ability to work collaboratively",
      "Hill experience preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, references, and a short writing sample to\necdjobs@mail.house.gov with the subject line “Staff Assistant Application 2025.” No\nphone calls or walk-ins please.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Our office deeply values the diversity of our employees and encourages candidates from\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-133-25",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Rashida Tlaib",
    "location": "DC",
    "posting_date": "2025-04-21",
    "description": "Congresswoman Rashida Tlaib, representing Michigan’s 12th Congressional District, is\r\nseeking a DC Staff Assistant. The Staff Assistant will help to support all team members.\r\nTheir primary role is to provide strong administrative support to team members for\r\nmeetings, ensuring that constituent services are addressed by appropriate staff, and\r\ncreating a welcoming environment for residents and advocates visiting our DC office.",
    "responsibilities": [
      "Create a welcoming and organized front office;",
      "Lead administrative support for calls, voicemails, and email messages;",
      "Develop a system for resident follow ups and requests as needed;",
      "Management of all front of office duties including but not limited to signing for deliveries,\r\nand forwarding mail or other materials to the appropriate staff;",
      "Work closely with the Scheduler to ensure that the Member's appointments are on time\r\nand that the team is aware of the visitors' arrival; assisting with staffing of meetings as\r\nrequired or needed;",
      "Follow up and complete constituent requests for flags, White House and U.S. Capitol\r\ntours and other requests for tours;",
      "Manage the organization and updating of the office cheat sheet that has all important\r\ncontacts for staff and constituent services;",
      "Support constituent service team as needed in intake process;",
      "Lead the work on letter responses to constituent mail not related to legislation, including\r\nthank you letters;",
      "Manages follow-ups or call list for the member as needed or requested;",
      "Organizes general email box for the office;",
      "Support Operations Manager with office supply management and office inventory\r\ntracking;",
      "Tracks commendation and greeting requests received from stakeholders and\r\nconstituents;",
      "Processes and tracks ledger for in-kind gifts;",
      "Manages inventory and supplies needed for the office, staff and for the member;",
      "Supports management of internship programs and assists with assignments of\r\nresponsibilities and tasks as needed;",
      "Support with all other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please email Rashida.Jobs@mail.house.gov (SUBJECT LINE: Staff Assistant,\r\nYOUR NAME) with a cover letter, resume and 2-3 references (no office walk-ins).\r\nA strong candidate will be able to work a flexible schedule. Michigan ties are highly\r\ndesirable but not required.",
    "salary_info": "The starting salary for this position is $55,000 with some\r\nflexibility based on experience.",
    "contact": "Rashida.Jobs@mail.house.gov",
    "equal_opportunity": "The Office is unionized and offers robust, competitive benefits.\r\nWomen, people of color, LGBTQIA+, and other members of other marginalized\r\ncommunities are strongly encouraged to apply. The office is an equal opportunity employer\r\nand does not discriminate based on race, color, religion, sex, sexual orientation, gender\r\nidentity and expression, national origin, disability, military status, age, marital status. This\r\nposition reports to the Operations Manager, Chief of Staff and Member."
  },
  {
    "id": "MEM-132-25",
    "position_title": "Legislative Correspondent/Staff Assistant",
    "office": "The Office of Representative Emanuel Cleaver (D-MO)",
    "location": "Washington, D.C.",
    "posting_date": "2025-04-21",
    "description": "This position is responsible for opening and managing the front office each day, greeting visitors, and managing constituent communications, including tour and flag requests. The LC/SA is responsible for maintaining the office's constituent response program and recruiting and managing the DC interns.\n\nThis is a customer service focused position. The ideal candidate has superb organizational and problem-solving skills, attention to detail, strong time and project management skills, a good sense of humor, and a desire to be part of a highly-collaborative, high-achieving team. The successful candidate will have strong writing skills, the ability to communicate clearly in a fast-paced environment and can work effectively with teams in both the DC and District offices. Prior Hill internship and familiarity with the IQ system is preferred. Access to a car and a license in good standing to help with driving the Congressman is helpful but not required.",
    "responsibilities": [
      "Opening and managing the front office each day",
      "Greeting visitors",
      "Managing constituent communications, including tour and flag requests",
      "Maintaining the office's constituent response program",
      "Recruiting and managing the DC interns"
    ],
    "qualifications": [
      "Superb organizational and problem-solving skills",
      "Attention to detail",
      "Strong time and project management skills",
      "A good sense of humor",
      "A desire to be part of a highly-collaborative, high-achieving team",
      "Strong writing skills",
      "The ability to communicate clearly in a fast-paced environment",
      "Ability to work effectively with teams in both the DC and District offices",
      "Prior Hill internship and familiarity with the IQ system is preferred",
      "Access to a car and a license in good standing to help with driving the Congressman is helpful but not required"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a cover letter, resume, and writing sample (no more than 3 pages), and at least 2 references to Midwest.Jobs@mail.house.gov with the subject line \"Last Name – LC/Staff Assistant\". Applications will be accepted until April 25th.",
    "salary_info": "$55,000-57,000, depending on experience. Benefits with this position include health, vision and dental insurance, retirement benefits, paid sick and annual leave, transit or parking benefits, and access to the Student Loan Repayment Program.",
    "contact": "Midwest.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-131-25",
    "position_title": "Scheduler/Director of Operations",
    "office": "The Office of Congressman Jimmy Panetta (CA-19)",
    "location": "Washington",
    "posting_date": "2025-04-21",
    "description": "The Office of Congressman Jimmy Panetta (CA-19) seeks candidates for an open\nScheduler/Director of Operations position. Prior experience with scheduling for a\nMember of Congress or scheduling for a political campaign is preferred, but scheduling for\na similar organization will be considered.\n\nIdeal candidates possess attention to detail, ability to handle a fast-paced environment,\nand strong communication and organizational skills. Responsibilities include maintaining\nMember's daily and long-term schedule in Washington, working with stakeholders to\nbalance the Member's time, evaluating incoming meeting requests and invitations,\ncoordinating domestic and international travel arrangements, and performing other\nadministrative and operational duties.",
    "responsibilities": [
      "Maintaining Member's daily and long-term schedule in Washington",
      "Working with stakeholders to balance the Member's time",
      "Evaluating incoming meeting requests and invitations",
      "Coordinating domestic and international travel arrangements",
      "Performing other administrative and operational duties"
    ],
    "qualifications": [
      "Attention to detail",
      "Ability to handle a fast-paced environment",
      "Strong communication and organizational skills",
      "Prior experience with scheduling for a Member of Congress or scheduling for a political campaign is preferred, but scheduling for a similar organization will be considered."
    ],
    "how_to_apply": "Please send a resume, cover letter, and\nreferences in a single PDF document with “Scheduler/Director of Operations” as the\nsubject line to ca19.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ca19.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer."
  },
  {
    "id": "MEM-130-25",
    "position_title": "Inspector General",
    "office": "Office of the Inspector General",
    "location": null,
    "posting_date": "2025-04-21",
    "description": "The Inspector General is accountable for the evaluation of internal controls and organizational structures, as well as determining the extent and quality of conformance with policies and procedures within the House. In collaboration with the Deputy Inspector General, provides executive management to the Office of Inspector General and its major areas of responsibility including the performance of Information Systems Audits, Management Advisory Services, Performance Audits, Financial Audits, Investigations, and internal OIG administration.",
    "responsibilities": [
      "Directs the mission and functions of the Office of Inspector General, including the supervision of approximately twenty-five (25) employees in executing the duties of the Office, which include, but are not limited to:",
      "Providing audit, investigative, and advisory services to the House and other legislative branch entities in a manner consistent with government-wide standards including periodic audits of the financial and administrative functions of the House and other legislative branch entities.",
      "Informing House Leadership and appropriate House Committees based as outline in House Rules concerning the results of audits, investigations, and advisory services.",
      "Coordinating, compiling, and presenting an annual work plan for the Office of the Inspector General to the Committee on House Administration for approval."
    ],
    "qualifications": [],
    "how_to_apply": "1) ALL applicants must submit a resume and cover letter on or before the closing date that presents their knowledge, experience, and education and meet the position's requirements.\n2) Submit your resume and cover letter via email to House.Apply@mail.house.gov ONLY. Reference our vacancy announcement ID, \" IG-25-04 IS-HGOV”, in the Subject Line of your email.",
    "salary_info": "$212,000 - $217,000",
    "contact": "House.Apply@mail.house.gov",
    "equal_opportunity": "The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin. Transportation and all related travel expenses associated with the interview and hiring process must be paid by\nthe applicant. Moving and related relocation expenses are not available. Employment with the U.S. House of Representatives is at-will. All qualified candidates are encouraged to apply"
  },
  {
    "id": "MEM-129-25",
    "position_title": "LEGISLATIVE DIRECTOR",
    "office": "The Washington, D.C. Office of Rep. Lauren Underwood (D-IL)",
    "location": "Washington, D.C.",
    "posting_date": "2025-04-21",
    "description": "The Legislative Director works with the Member and other senior staff to lead development and implementation of her policy, legislative, and appropriations strategy, managing a legislative team of 6-8 staff, fellows, and interns while also covering a small individual portfolio of legislative issues.",
    "responsibilities": [
      "developing and advancing the Member’s policy priorities through the legislative and appropriations processes",
      "overseeing operations of the legislative team",
      "developing high-quality memos, remarks, committee materials, and other briefing materials for the Member/office",
      "supporting the press team on policy-related communications",
      "working with the district team to support their work and address constituents’ policy concerns",
      "monitoring activity on the House Floor and the Member’s committee(s) and working with the legislative team to develop vote recommendations",
      "building and maintaining positive and effective relationships with district, D.C., and national stakeholders and advocacy organizations",
      "proactively tracking relevant state and local policy changes and working with local officials",
      "overseeing the office’s constituent correspondence program",
      "other duties and special projects as assigned"
    ],
    "qualifications": [
      "Candidates should have deep expertise in policy, legislative drafting and procedure, and congressional appropriations, as well as at least one year of professional experience managing direct reports.",
      "Essential skills include an expert-level working knowledge of Congress; strong oral and written communication skills, including rigorous editing and fact-checking; excellent attention to detail; the ability to execute on multiple deadlines and tasks in a fast-paced environment; strong interpersonal and relationship-building skills; the ability to make quick decisions when advising a principal; a proven track record navigating complex constituent and political situations; and the responsiveness and professional demeanor to represent the office well to a wide range of communities.",
      "Candidates with a background in health policy are encouraged to apply.",
      "Candidates must be available for occasional weekend and evening work to support the Member when the congressional schedule requires."
    ],
    "how_to_apply": "To apply, please email Underwood.DCJobs@mail.house.gov with “Legislative Director” in the subject line and the following application materials attached as one combined PDF:\n(1) Resume\n(2) Cover letter\n(3) 2-3 professional references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference. We will not reach out to these references without your permission.",
    "salary_info": "The annual salary range for this position is $100,000 - $110,000, dependent on experience and qualifications. The position offers health coverage; comp time; telework opportunities during congressional recesses; retirement benefits with an employer match; paid sick, bereavement, and vacation leave; transit or parking benefits; 16 weeks of paid parental leave; 12 weeks of paid FMLA leave; access to life insurance coverage; professional development opportunities; and access to the Student Loan Repayment Program.",
    "contact": "Underwood.DCJobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-121-25",
    "position_title": "Communications Director",
    "office": "Problem Solvers Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2025-04-21",
    "description": "The bipartisan Problem Solvers Caucus is seeking an experienced Communications Director to join its office in Washington, D.C. The Communications Director will be responsible for developing and executing the Problem Solvers Caucus’ communications strategy.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Writing press releases",
      "Pitching stories and responding to reporter inquiries",
      "Creating and posting social media content",
      "Booking interviews with national and local press outlets",
      "Writing internal and external newsletters",
      "Compiling press clips",
      "Managing the caucus’ website",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Prior experience working on Capitol Hill",
      "Excellent written and oral communications skills",
      "Proficient in photo and video editing and graphic design",
      "Detail-oriented",
      "Organized",
      "Highly motivated to serve on a small, collaborative team",
      "Candidates must be comfortable working for both Democratic and Republican Members"
    ],
    "how_to_apply": "To apply, please email a resume, cover letter, and two writing samples in a single PDF to problemsolverscaucus@gmail.com with the subject line “Communications Director.”",
    "salary_info": null,
    "contact": "problemsolverscaucus@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-127-25",
    "position_title": "Press Secretary/ Digital Director",
    "office": "Pennsylvania Republican",
    "location": "D.C. office",
    "posting_date": "2025-04-21",
    "description": "This position reports directly to the Communications Director and is ideal for a highly motivated individual who excels in a high-energy, deadline-driven environment. The right candidate will have strong writing and editing skills, experience in digital content creation, website editing, and the ability to quickly adapt to the fast-moving political landscape.",
    "responsibilities": [
      "Assist the Communications Director in drafting and editing press releases, statements, floor speeches, and op-eds",
      "Draft the Member’s weekly newsletters",
      "Manage the Member’s social media pages—draft posts, create graphics, and keep engagement growing",
      "Clip media interviews and monitor mentions",
      "Update and maintain content on the Member’s official website",
      "Assist Communications Director with media prep for interviews and other public appearances",
      "Keep the Member informed of breaking news and media coverage",
      "Assist in executing the Franking plan"
    ],
    "qualifications": [
      "Prior experience on Capitol Hill is preferred but not required."
    ],
    "how_to_apply": "To apply, please send a resume to PaPressSecJob@gmail.com.",
    "salary_info": null,
    "contact": "PaPressSecJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-126-25",
    "position_title": "Legislative Director",
    "office": "The Office of Congressman Alma S. Adams, Ph.D.",
    "location": "DC",
    "posting_date": "2025-04-21",
    "description": "The LD will drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio, and manage their own legislative portfolio with the Agriculture Committee.\n\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects. This is not an entry level position; extensive Hill experience and knowledge of the legislative process are required. The successful applicant will have crisp and thorough written and oral communications skills, an entrepreneurial and self-starting attitude, strong attention to detail, creativity, and be a team player. Supervisory experience and expertise on agricultural policy is strongly preferred.",
    "responsibilities": [
      "Drive the proactive legislative agenda for the office.",
      "Develop and implement the strategy to push policy priorities and legislative goals.",
      "Supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio.",
      "Manage their own legislative portfolio with the Agriculture Committee.",
      "Work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations.",
      "Help ensure coordination between DC and district offices on important legislative updates and district-based events and projects."
    ],
    "qualifications": [
      "Extensive Hill experience",
      "Knowledge of the legislative process",
      "Crisp and thorough written and oral communications skills",
      "An entrepreneurial and self-starting attitude",
      "Strong attention to detail",
      "Creativity",
      "Team player",
      "Supervisory experience (preferred)",
      "Expertise on agricultural policy (preferred)"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to nc12.resume@mail.house.gov.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-125-25",
    "position_title": "Press Assistant/Deputy Press Secretary",
    "office": "Congresswoman Andrea Salinas (D-OR)",
    "location": "District Office",
    "posting_date": "2025-04-21",
    "description": "Congresswoman Andrea Salinas (D-OR) is seeking a Press Assistant/Deputy Press Secretary in her district office to join an aggressive, fast-paced communications team. The ideal candidate will have excellent writing, editing, and photography skills. Additionally, they will assist the Communications Director in drafting releases, talking points, speeches, and quotes for in-district press events, maintaining press lists, distributing daily press clips, and staffing the Member at district-based press events. Strong proofreading and copyediting skills are a must. This role primarily assists the Communications Director with drafting outgoing communications. Candidates seeking to join a highly active press team across national, local, and digital media with opportunities for growth are encouraged to apply.\n\nThis is a full-time position based in district that often requires availability on nights and weekends to support the Member’s communications plan and District Office operations.\n\nThe position requires attention to detail and strong written and oral communication skills along with the ability to work collaboratively in a fast-paced, team environment. Spanish fluency is a plus but not required.",
    "responsibilities": [
      "Assist the Communications Director with drafting press releases, quotes, statements, speeches and talking points.",
      "Compile and distribute daily press clips.",
      "Help identify and cultivate relationships with local reporters and content creators in the district.",
      "Staff and manage reporter interactions with the Member at OR-based press events; Work with the District Office and Digital Manager to publicize constituent services and events.",
      "Manage live-streaming and photography at OR-based press conferences and events.",
      "Support the District Office with events.",
      "Work well under pressure and with quick turnarounds"
    ],
    "qualifications": [],
    "how_to_apply": "Please email a resume, cover letter, and two writing samples in a single PDF to OR06resumes@mail.house.gov with “First Name Last Name—Press Assistant/Deputy PressSecretary” in the Subject Line. Applicants may also provide one example of their digital designwork and/or photography (this is optional but not required). Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": "$55,000-$60,000, depending on experience, with full benefits including up to $833/month in student loan repayments; health, dental, and vision insurance; and both defined-benefit and defined-contribution retirement plans.",
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-123-25",
    "position_title": "CASEWORKER AND FIELD REPRESENTATIVE",
    "office": "Congressman Dan Goldman",
    "location": "Brooklyn District Office (Sunset Park, Brooklyn NY)",
    "posting_date": "2025-04-21",
    "description": "The Caseworker / Field Representative manages incoming casework requests with care, promptness and high-touch constituent service; and monitors and updates the Deputy Chief of Staff on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents in a timely and professional manner.",
    "responsibilities": [
      "Acts as the representative for the Congressman within the area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Manages casework assigned to them.",
      "Assesses casework for problems requiring legislative action and makes recommendations to the Deputy Chief and Director of Constituent Services",
      "Screens and refers cases, when appropriate, to city and state offices.",
      "Logs all incoming and outgoing mail and incoming telephone calls relating to casework.",
      "Prepares periodic reports for the Director of Constituent Services on pending cases and for the Deputy Chief on district activities in their assigned issue areas.",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner.",
      "Maintains up-to-date files on all cases and categories of information of importance to the office.",
      "Serves as a liaison to community boards, precinct councils, and other community groups.",
      "Meets attendance requirements as established by the office.",
      "Maintains a good working relationship with the Congressman, staff, and constituents.",
      "Works well under pressure and handles stress.",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "A minimum 1 year in a government office in a similar role.",
      "Bilingual (Spanish language) skills strongly preferred."
    ],
    "how_to_apply": "Submit your resume and cover letter to jobs.goldman@mail.house.gov.",
    "salary_info": "$60,000 per year",
    "contact": "jobs.goldman@mail.house.gov",
    "equal_opportunity": "The office of Congressman Dan Goldman is committed to diversity among its staff and recognizes that the success of its operations requires the highest commitment to obtaining and retaining a diverse staff. We are an equal opportunity employer and prohibit discrimination in employment, promotion, compensation, terms, conditions, or privileges of employment on the basis of gender, physical and or mental disability, race, age, national origin, color, sexual orientation, gender identity or expression, family status, religion, veteran’s status, or any other basis prohibited by applicable law."
  },
  {
    "id": "MEM-122-25",
    "position_title": "Creative Director",
    "office": "Representative Maxwell Frost (D-FL)",
    "location": null,
    "posting_date": "2025-04-21",
    "description": "The office of Representative Maxwell Frost (D-FL) is seeking a dynamic and creative individual to join our communications team as a Creative Director. This is a fast-paced, progressive environment with a forward-thinking principal who is not afraid to try new things. This office prides itself on fostering a collaborative work environment where creativity, teamwork, and an outside-the-box approach are highly valued. A passion for digital strategy, visual storytelling, and innovative political communication is a must. This is not an entry-level position.\n\nThe Creative Director will work closely with and report to the Communications Director to help shape and execute the visual and digital strategy for the Representative’s publicfacing and internal initiatives, and offer strategic digital insight and assistance related to the Member’s leadership role as part of the Democratic Policy and Communications Committee. This role will manage the day-to-day operations of the office’s design work and digital content, including but not limited to graphic design, social media assets, digital video, website visuals, and email campaigns.",
    "responsibilities": [
      "Digital Strategy & Creative Leadership -- Lead the development and execution of innovative digital strategies to elevate the Representative’s presence on social media, websites, email campaigns, and other digital platforms. Ensure that all creative work is aligned with the office’s values and goals.",
      "Graphic Design & Visual Communication -- Design high-quality graphics for digital and print materials, including social media assets, infographics, posters, digital ads, and more, all in line with the Member’s existing branding and style guide. Expertise in the Adobe Creative Suite is required.",
      "Content Creation & Coordination -- Collaborate with the Communications Director, Legislative and District teams, and Member to create compelling multimedia content. This includes coordinating the production of graphics, videos, and other creative content for various platforms – from ideation to creation.",
      "Media Buys & Metrics & Evaluation -- Make strategic suggestions for paid communications campaigns on various digital platforms and assist in tracking the effectiveness of creative strategies, using data and feedback to iterate and improve future content. Monitor the performance of digital content across platforms, adjusting strategies as needed.",
      "Artist & Influencer Relations -- Collaborate with the Communications Director help maintain and establish relationships with artists and digital thought leaders and content creators through strategic partnership opportunities aimed at advancing the Member’s policy and legislative initiatives. Our office is uniquely plugged into local and national music and creative arts issues so a passion for this is a plus."
    ],
    "qualifications": [
      "At least 2-3 years of experience in creative or digital strategy, with a focus on graphic design and content creation.",
      "Prior experience working in political campaigns, progressive causes, or government oLices is preferred.",
      "Advanced proﬁciency in Adobe Creative Suite (Photoshop, Illustrator, InDesign, After ELects, Premiere Pro) and other design tools.",
      "Strong understanding of digital platforms and the role of design in social media, online engagement, and web communication.",
      "Experience with digital video production and editing.",
      "Ability to juggle multiple projects and work under tight deadlines in a fast-paced, team-oriented environment.",
      "Strong attention to detail and a keen eye for visual storytelling and design.",
      "Florida and Orlando ties are a plus."
    ],
    "how_to_apply": "Visit repfrost.us/CreativeDirector",
    "salary_info": "Salary range is $70,000 -$90,000, commensurate with experience.\nHealth, dental, and vision beneﬁts.\nGenerous paid leave, including vacation, sick days, and parental leave.\nGenerous student loan repayment program.\nRetirement plan options.\nOpportunities for professional development and training.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-119-25",
    "position_title": "Press/Digital Assistant",
    "office": "Congresswoman Luz Rivas (CA-29)",
    "location": "Los Angeles",
    "posting_date": "2025-04-21",
    "description": "This position is responsible for working with the Communications Director and District Director to identify press and digital opportunities in the District; develop branded content for social media, including graphics, videos, and photos of the Member.\n\nAdditionally, this position will staff and advance press and community events in the District with the Member; compile and distribute daily press clips; track media coverage; develop promotional materials of the Member’s events; and build relationships with local reporters and outlets. Additionally, this position will assist the Communications Director in drafting quotes and press releases; developing newsletters; and drafting constituent outreach materials such as resource packets, and other duties as assigned.\n\nThis position works closely with the Communications Director and District Director.\nCandidates should have prior experience working with media and press and creating digital content. The position requires the flexibility to work long hours, including nights and weekends. Diverse and bilingual candidates are encouraged to apply.\n\nThis is an entry-level position but may be expanded for the right candidate with more experience.",
    "responsibilities": [
      "Identify press and digital opportunities in the District",
      "Develop branded content for social media, including graphics, videos, and photos of the Member",
      "Staff and advance press and community events in the District with the Member",
      "Compile and distribute daily press clips",
      "Track media coverage",
      "Develop promotional materials of the Member’s events",
      "Build relationships with local reporters and outlets",
      "Assist the Communications Director in drafting quotes and press releases",
      "Develop newsletters",
      "Draft constituent outreach materials such as resource packets, and other duties as assigned"
    ],
    "qualifications": [
      "Excellent writing and verbal skills",
      "Editing and digital experience, including experience in graphic design and video editing",
      "Sound editorial judgement",
      "A baseline understanding of the key stakeholders in the District",
      "The ability to work well and respectfully with others in a fast-paced environment",
      "Prior experience working with media and press and creating digital content",
      "Ties to California’s 29th Congressional District are a plus",
      "Diverse and bilingual candidates are encouraged to apply"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a cover letter, resume, one writing sample and one creative sample in a single PDF document to CA29jobs@gmail.com with the following subject line: “District Press/DigitalAssistant [candidate’s full name]”.",
    "salary_info": null,
    "contact": "CA29jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-117-25",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2025-04-21",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include assisting\nthe technology needs of Committee staff; editing and maintaining the Committee's\nwebsite; answering telephones; assisting with the tracking and processing of committee\ncorrespondence; providing administrative support in setting up committee meetings; and\nentering data and navigating databases with accuracy. This is a non-partisan position\nwhich requires the ability to serve all Members of Congress equally and refrain from\npolitical or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee's website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Applicants with experience or interest in learning information technology assistance are strongly encouraged to apply"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$52,003 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-115-25",
    "position_title": "EXPERIENCED OFFICE ADMINISTRATOR",
    "office": "U.S. HOUSE OF REPRESENTATIVES COMMITTEE ON ETHICS",
    "location": "Washington, DC",
    "posting_date": "2025-04-21",
    "description": "The Committee on Ethics seeks an experienced Office Administrator to serve as the Director of Administration for the Committee. The Director of Administration will oversee the Committee's administrative, financial, and human resource functions. The Director will manage the nonpartisan administrative staff who are responsible for ensuring a high level of customer service to the House community as well as the efficient operation of the Committee's work.\n\nThis is a non-partisan position which requires the ability to maintain strict confidentiality, to serve all Members of Congress equally, and to refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess a minimum of 5 years of experience with government administrative, financial, or human resource processes; outstanding analytical and written and oral communication skills; and sound judgment.",
      "Experience in one or more of the following areas is also desirable: CAO finance and human resource processes, office administration, and familiarity with Congress.",
      "Previous management experience and proficiency with PeopleSoft and Finmart preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a list of references to ethicsjobs@mail.house.gov. Please include the phrase “Director of Administration” in the subject line.",
    "salary_info": "$132,638 to $140,667",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-113-25",
    "position_title": "Export Controls Professional",
    "office": "U.S. House Committee on Foreign Affairs Majority",
    "location": null,
    "posting_date": "2025-04-21",
    "description": "The U.S. House Committee on Foreign Affairs Majority seeks experienced Export Controls Professional with a background in legislative authorization processes. Primary duties of the role will include day to day oversight of the Commerce Department’s Bureau of Industry and Security and International Trade Administration. In addition, employee will support overseeing and authorizing the State Department’s Bureau of South and Central Asia and Public Diplomacy and Public Affairs (R) family. Candidates should have previous foreign policy experience in the Legislative and/ or Executive branches.",
    "responsibilities": [
      "Day to day oversight of the Commerce Department’s Bureau of Industry and Security",
      "Oversight of the International Trade Administration",
      "Support overseeing and authorizing the State Department’s Bureau of South and Central Asia and Public Diplomacy and Public Affairs (R) family"
    ],
    "qualifications": [
      "Previous foreign policy experience in the Legislative and/ or Executive branches."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and brief writing sample to HFACGOP.Resumes@mail.house.gov, with the following subjective line: “HFAC SCA Vacancy”",
    "salary_info": null,
    "contact": "HFACGOP.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-112-25",
    "position_title": "SCHEDULER & OPERATIONS COORDINATOR",
    "office": "OFFICE of CONGRESSMAN RO KHANNA",
    "location": "Santa Clara",
    "posting_date": "2025-04-21",
    "description": "Congressman Ro Khanna's district office in Santa Clara has an immediate\nopening for a Scheduler & Operations Coordinator, which offers responsibility for a range\nof scheduling, administrative, community outreach and casework duties. This is a nonsupervisory, exempt position. The starting salary is $71,000 per year. The application\nprocess may include several interviews and a practical test of relevant skills. There is one\ncurrent job vacancy, and the office has the right to fill any number of positions vacant or\nbecoming vacant during the life of postings.",
    "responsibilities": [
      "Coordinate with district office and Washington DC staff -- especially our Senior\nAdvisor for Scheduling (in DC) -- and directly with Rep. Khanna to set up, schedule\nand facilitate the congressman's meetings and engagements both in the\ncongressional district and across the country.",
      "Ensure all necessary information is on the calendar including flights, hotels, and\nbackground information on meetings, and provide a daily check on the calendar that\ngets sent to the Chief, District Director and DC Senior Advisor for Scheduling.",
      "Work with fellow staff members on a variety of tasks and projects that directly\nbenefit our constituents.",
      "Prepare detailed daily itineraries, including contact information, locations, travel\ntimes and staffing assignments for those activities.",
      "In real time, anticipate and stay up to date on schedule changes/obstacles and\ncommunicate them to Rep. Khanna and staff.",
      "Maintain prioritized listings of upcoming events and potential constituent meetings\nfor future visits.",
      "Serve as the default driver for Rep. Khanna when he is in the San Francisco Bay Area\nand be physically present whenever the Member is in the office.",
      "Perform administrative duties that facilitate logistical operations in the local office,\nsuch as overseeing equipment and supplies, assisting with office administration, as\nwell as answering phones, logging calls and helping to serve walk-in constituents.",
      "The position also involves representing the Congressman in a variety of community\nactivities, including interacting with leaders of community groups and local\norganizations, as well as local and state elected officials and stakeholders.",
      "The duties include special project coordination and helping the staff team manage\nmonthly town hall meetings and special events hosted by the Congressman, such\nas issues-based forums and roundtable meetings.",
      "Another secondary role will be casework, helping residents resolve problems with\nfederal government agencies, including US Citizenship & Immigration Services,\nDepartment of State, Veterans Affairs and Social Security Administration. The staff\nmember will liaison to federal agencies and state/local representatives and\nresponds to constituent inquiries through written and oral communication.",
      "The Scheduler & Operations Coordinator is expected to both work in the office and\nperform activities out in the community as outlined below under Work Conditions,\nSchedule and Benefits.",
      "The successful candidate will also help train and mentor student interns."
    ],
    "qualifications": [
      "A bachelor's degree with strong academic\ncredentials, or equivalent experience/training in legislation or public service (e.g.,\ncasework, constituent service, community outreach) is required.",
      "Ability to work cooperatively and courteously with others (both co-workers and\nconstituents). Past customer service experience is strongly preferred.",
      "Strong oral and written communication skills, as well as public speaking\nexperience.",
      "Professional telephone manner and temperament to communicate with a variety of\npersonalities in a tactful, pleasant, and professional manner.",
      "Must have a driver's license, ready access to a car and the ability to drive to both\nstaff Rep. Khanna and perform field work.",
      "Residency in the district is preferred, as is a knowledge of the region.",
      "Knowledge of local, state, and federal agencies and departments; and awareness of\nissues and events in the district in which the Congressman is involved.",
      "Thoroughness, organizational skills, and careful attention to detail.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework\nresponsibilities.",
      "Knowledge of office policies, practices, and procedures; office computer\napplications; and proficiency in word processing."
    ],
    "how_to_apply": "Please e-mail a cover letter, brief writing sample and resume to District Director Tom Pyke\n(tom.pyke@mail.house.gov) and Director of Constituent Services Simeone Chien\n(simeone.chien@mail.house.gov). Phone (408) 436-2720",
    "salary_info": "$71,000 per year",
    "contact": "tom.pyke@mail.house.gov, simeone.chien@mail.house.gov",
    "equal_opportunity": "The Office of U.S. Congressman Ro Khanna is an equal opportunity employer;\nwe do not discriminate based on race, color, religion or lack thereof, national origin, sex,\ngender identity, sexual orientation, age, marital or family status, disability, arrest history,\nmilitary service, organizing activity, or any ground that is specifically prohibited by law or\nregulation applicable to the Office; all are welcome and encouraged to apply. Note that all\nsuccessful candidates must meet citizenship-related requirements and undergo a security\ncheck."
  },
  {
    "id": "MEM-111-25",
    "position_title": "District Office Staff Assistant",
    "office": "Rep. Dina Titus",
    "location": "Las Vegas",
    "posting_date": "2025-04-21",
    "description": "Rep. Dina Titus seeks an organized and detail-oriented Staff Assistant for her Las Vegas office. Primary responsibilities include managing the front office, answering and logging telephone calls, coordinating constituent requests, assisting with constituent correspondence, recruiting and supervising interns, and other administrative duties.\n\nCandidates should be motivated self-starters with excellent oral, written, and interpersonal communication skills, strong organizational skills, an ability to think quickly when troubleshooting, and a positive demeanor in a busy environment. State and local government or other relevant experience is preferred.",
    "responsibilities": [
      "Managing the front office",
      "Answering and logging telephone calls",
      "Coordinating constituent requests",
      "Assisting with constituent correspondence",
      "Recruiting and supervising interns",
      "Other administrative duties"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Excellent oral, written, and interpersonal communication skills",
      "Strong organizational skills",
      "Ability to think quickly when troubleshooting",
      "Positive demeanor in a busy environment",
      "State and local government or other relevant experience is preferred"
    ],
    "how_to_apply": "Those interested in applying should e-mail a cover letter, resume, and one short writing sample to NV01Jobs@gmail.com subject: “District Office Staff Assistant”. Applications will be accepted on a rolling basis and will remain open until the position is filled.",
    "salary_info": null,
    "contact": "NV01Jobs@gmail.com",
    "equal_opportunity": "Candidates with a diverse background, Nevada state ties, and Spanish-language proficiency are strongly encouraged to apply. Rep. Titus is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-110-25",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2025-04-21",
    "description": "The Office of Congresswoman Pramila Jayapal (WA-07) is seeking an experienced\nSenior Legislative Assistant to handle a comprehensive portfolio that could include\nthe following issues: tax, financial services, housing, childcare, education, and\nlabor. The issue set will depend on the candidate’s experience and interests. We\nencourage individuals with legislative, research and writing experience to apply\nand we will discuss the issue set more in depth through the interview process.\n\nThis position requires the ability to advance Congresswoman Jayapal's legislative\npriorities in their issue portfolio. The ideal candidate will come with previous\nlegislative experience, including the knowledge and abilities to drive issues with\ntraditional legislative tools (i.e. committee work, bill introductions) as well as\norganizing tools (i.e. events with partners, in district town halls).",
    "responsibilities": [
      "Driving current and new legislative initiatives including idea generation,",
      "legislative drafting and producing accompanying materials, such as",
      "speeches, policy memos, and factsheets.",
      "Preparing and staLing the Congresswoman for relevant committee hearing",
      "and markups; drafting hearing remarks and questions.",
      "Representing the Congresswoman’s priorities with external stakeholders.",
      "Building and maintaining relationships with external and internal",
      "stakeholders including advocacy organizations; academics; fellow",
      "Congressional and Committee oLices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "4 -6 years of relevant experience including policy development and analysis.",
      "Issue advocacy; and strategic planning.",
      "Passionate about public service and committed to progressive values.",
      "Excellent writing and time management skills.",
      "Ability to digest new content with a political and ideological lens that is",
      "appropriate for the oLice.",
      "Poised, level-headed, ﬂexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Applicants must submit a resume, cover letter, two writing samples, and references\nin PDF format to jobs.pramila@mail.house.gov. Please include your full name and\n“Senior Legislative Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": "Salary is $70,000 - 85,000 and will depend on experience. The\nposition offers health coverage; retirement benefits with an employer match; paid\nsick, bereavement, and vacation leave; transit or parking benefits; access to life\ninsurance coverage; and access to the Student Loan Repayment Program.",
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer.\nWomen, people of color, LGBTQ+ individuals, new Americans, people with\ndisabilities, and members of other underrepresented communities are strongly\nencouraged to apply. State and/or district ties are a plus. Prior Hill experience is\nstrongly preferred."
  },
  {
    "id": "MEM-108-25",
    "position_title": "Digital Assistant",
    "office": "Republican member",
    "location": "Charleston, South Carolina",
    "posting_date": "2025-04-21",
    "description": "Republican member in Charleston, SC is seeking a motivated Digital Assistant to support\nour digital communications efforts. This role will involve engaging with constituents\nthrough social media, assisting in content creation, and helping manage the office's online\npresence. The Digital Assistant will work closely with the Digital Director to ensure the\noffice’s social media strategy aligns with our values and priorities, while fostering positive\nengagement with the community.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please send your resume, a brief cover letter, and any relevant social media or\ncontent samples to sydney.long@mail.house.gov.",
    "salary_info": null,
    "contact": "sydney.long@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-107-25",
    "position_title": "Scheduler|Executive Assistant",
    "office": "Rep. Nanette Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2025-04-21",
    "description": "Congresswoman Nanette Barragan (CA-44) seeks an experienced Scheduler for her Washington, DC office.\n\nThis position requires availability outside of regular business hours including some weekend availability as needed.\n\nPrevious experience in scheduling or operations is preferred. Salary is commensurate with experience.\n\nSouthern California | Los Angeles Metro area ties, access to a car, and Spanish fluency are a plus.",
    "responsibilities": [
      "maintaining the Member’s daily and long-term schedules for both DC and the District.",
      "organizing and evaluating all incoming meeting requests and invitations.",
      "keeping the Member on schedule throughout the day.",
      "working with legislative and communications staL to ensure the Member is prepared for events/meetings.",
      "coordinating travel arrangements;",
      "processing and managing expenses and reimbursements for the Member;",
      "supporting planning and scheduling for the Congressional Hispanic Caucus related to the Chairwoman.",
      "Facilitate weekly scheduling meetings with the Member and Chief of StaL to evaluate meeting requests;",
      "Coordinating with the Member and Chief of StaL regarding political scheduling requests.",
      "Communicating with constituents by phone and email to address requests.",
      "Driving the Member and staLing the Member at events.",
      "And additional administrative responsibilities as necessary."
    ],
    "qualifications": [
      "highly organized, detail-oriented and able to multi-task;",
      "resourceful and self-starters.",
      "Team-oriented.",
      "proﬁcient in Microsoft Outlook, Word, and Excel.",
      "Proﬁcient in Google Suite applications.",
      "Able to work well under pressure and on tight timelines; and have a positive attitude."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with “SCHEDULER” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "$55,000 - $80,000, depending on experience and qualifications.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-105-25",
    "position_title": "Investigative Support Analyst",
    "office": "Office of Congressional Conduct (OCC)",
    "location": "Washington, DC",
    "posting_date": "2025-04-21",
    "description": "The Office of Congressional Conduct (OCC), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks an Investigative Support Analyst with 2-6 years of experience. The Investigative Support Analyst provides operational, administrative, and strategic support to the OCC in its sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives.\n\nThe OCC is seeking candidates interested in supporting ethics and transparency within the House of Representatives. The Investigative Support Analyst would join a small, Washington, DC-based, investigative team.\n\nThe ideal candidate for this position is highly motivated and proactive with a significant interest in anti-corruption enforcement (or related disciplines). They should have experience developing and implementing small-scale projects, using data analytics tools to inform strategic decision making, and supporting executive leadership all with minimal oversight.",
    "responsibilities": [
      "Assume primary responsibility for managing documentary evidence submitted to the OCC from the public and in the course of its investigations;",
      "Perform legal research, data analysis, and document review to support OCC investigations;",
      "Develop, manage, and implement key administrative, operational, and logistical processes; and",
      "Otherwise support OCC Investigative Counsel investigations as required."
    ],
    "qualifications": [
      "Bachelor’s degree;",
      "Ability to pass Security Background Investigation to obtain Top Secret clearance and U.S. Capitol Police Background Investigation; and",
      "At least two years of research, consulting, analyst, or other investigative experience.",
      "Experience with Casepoint or other eDiscovery and litigation support platforms;",
      "Legal research skills;",
      "Strong organizational skills;",
      "Strong interpersonal skills and professionalism;",
      "Advanced proficiency in Microsoft Excel and Microsoft Word;",
      "Desirable but not required:",
      "Investigative experience with high-profile and sensitive matters;",
      "Experience with campaign finance or ethics law;",
      "Experience writing reports or legal documents;",
      "Experience developing and improving business processes; and",
      "Experience using data analytics tools (i.e., Excel, Power Query, R, Python) for investigative and exploratory analysis.",
      "Demonstrated ability to:",
      "Work independently or as part of an investigative team;",
      "Communicate technical findings to a non-technical audience;",
      "Manage multiple tasks and projects; and",
      "Exercise discretion and independent judgment."
    ],
    "how_to_apply": "Please send a one-page cover letter and resume via email to:",
    "salary_info": null,
    "contact": {
      "name": "Omar S. Ashmawy",
      "title": "Staff Director and Chief Counsel",
      "office": "Office of Congressional Conduct",
      "address": "P.O. Box 895\nWashington, DC 20515-0895",
      "email": "OCCJOB@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-104-25",
    "position_title": "Healthcare Investigator",
    "office": "House Committee on Veterans’ Affairs (Majority)",
    "location": "Washington, DC",
    "posting_date": "2025-04-21",
    "description": "The House Committee on Veterans’ Affairs Majority staff seeks a Healthcare Investigator",
    "responsibilities": [
      "Under the supervision of the Staff Director of the Subcommittee on Health, the individual will conduct oversight of the Department of Veterans Affairs (VA) Veterans Health Administration and affiliated VA Central office organizations",
      "Collect technical information and translate it into briefings, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Meet with congressional staff, veteran service organizations, industry organizations, and internal and external stakeholders.",
      "Perform other duties as assigned by the General Counsel, Committee Deputy Staff Director, and Committee Staff Director."
    ],
    "qualifications": [
      "Undergraduate degree or higher",
      "Clinical expertise preferred by not required",
      "Work experience investigating an executive branch agency or healthcare system",
      "Knowledge of healthcare policy and procedures for a large healthcare organization",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "Domestic travel is required.",
      "This is not an entry level position."
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume to VAR.Resumes@mail.house.gov with “Healthcare Investigator” in the subject line. Writing samples and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Veterans are strongly encouraged to apply. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-100-25",
    "position_title": "Military Legislative Assistant (Rep. Tony Gonzales, TX-23)",
    "office": "Rep. Tony Gonzales, TX-23",
    "location": null,
    "posting_date": "2025-04-21",
    "description": "CORE RESPONSIBILITIES:\n1. to develop legislative initiatives related to a national security portfolio, including\ncybersecurity, veterans, foreign affairs, and armed services.\n2. to monitor legislative developments within Committees and on the House floor;\n3. to meet with constituents and advocacy groups on behalf of the Member.\nQUALIFICATIONS:\n1. at least 1 year of legislative experience in a full-time, paid position or legislative\nfellowship\n2. prior Capitol Hill experience is strongly preferred\n3. excellent oral and written communication skills;\n4. thorough knowledge of the legislative process;\n5. ability to exercise discretion and independent judgment in the formulation and\nrecommendation of policy positions for the Member;\n6. ability to work cooperatively and courteously with others;\n7. ability to work well under pressure;\n8. thoroughness and careful attention to detail",
    "responsibilities": [
      "to develop legislative initiatives related to a national security portfolio, including cybersecurity, veterans, foreign affairs, and armed services.",
      "to monitor legislative developments within Committees and on the House floor;",
      "to meet with constituents and advocacy groups on behalf of the Member."
    ],
    "qualifications": [
      "at least 1 year of legislative experience in a full-time, paid position or legislative fellowship",
      "prior Capitol Hill experience is strongly preferred",
      "excellent oral and written communication skills;",
      "thorough knowledge of the legislative process;",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member;",
      "ability to work cooperatively and courteously with others;",
      "ability to work well under pressure;",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-523-24",
    "position_title": "Digital Assistant",
    "office": "Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "location": "Washington D.C.",
    "posting_date": "2025-04-21",
    "description": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02) seek a creative and detail-oriented Digital Assistant to support digital communications and public engagement efforts. This position will be split between the committee office and personal office and will be based out of Washington D.C.\n\nThis position involves creating and scheduling content for social media platforms, maintaining the committee's website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\n\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor's degree in communications, political science, or a related field is preferred.",
    "responsibilities": [
      "Creating and scheduling content for social media platforms",
      "Maintaining the committee's website",
      "Producing multimedia materials (graphics, videos, and infographics)",
      "Monitoring digital analytics to optimize outreach"
    ],
    "qualifications": [
      "1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred)",
      "Proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva)",
      "Strong writing and editing skills",
      "Passion for progressive policymaking",
      "Highly organized",
      "Comfortable working under tight deadlines",
      "Familiar with social media analytics and website content management systems",
      "A bachelor's degree in communications, political science, or a related field is preferred"
    ],
    "how_to_apply": "To apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: \"[Name] - Digital Assistant Application.\" Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary is commensurate with experience, and the position includes a competitive benefits package.",
    "contact": "budget-democrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply."
  }
]