[
  {
    "id": "MEM-476-24",
    "position_title": "Legislative Assistant (LA)",
    "office": "Congressman Dan Crenshaw (R-TX-02)",
    "location": "Washington, D.C.",
    "posting_date": "2024-11-11",
    "description": "Congressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative Assistant (LA), based in our Washington, D.C. office. This position reports to the Legislative Director. The LA will handle an economic facing portfolio, including Budget and Appropriations, Financial Services, and Tax, with other issues to follow.\n\nIdeal candidates will have strong written and oral communications skills and be detailoriented, organized, and creative. They must be able to quickly learn the member’s voice and think in a proactive, communications-focused manner.",
    "responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and staffing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas Working with external stakeholders, Congressional Research Service (CRS), Legislative Counsel, and committee staff to draft legislation based on the Member’s priorities"
    ],
    "qualifications": [
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
      "Hill experience is required."
    ],
    "how_to_apply": "Qualified applicants should submit a resume and writing sample (no more than 3 pages) as one combined PDF to Kenneth.Depew@mail.house.gov. Include “Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on a rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "Kenneth.Depew@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-475-24",
    "position_title": "Constituent Services Representative",
    "office": "Senior Democratic Member of Congress",
    "location": "Santa Rosa, California",
    "posting_date": "2024-11-11",
    "description": "Senior Democratic Member of Congress seeks Constituent Services Representative for his oDice in Santa Rosa, California. The Constituent Services Representative responsibilities include answering casework correspondence and verbal communications with constituents; acting as liaison with federal, district, and local agencies for the Member and constituents; oDice administrative responsibilities and other duties important to serving the people of the congressional district.",
    "responsibilities": [
      "Serves as a liaison with federal government entities for individual constituent concerns",
      "Assesses casework trends and identiﬁes issues requiring legislative action and/or additional Congressional oversight",
      "Prepares incoming and outgoing constituent casework to manage casework in assigned areas of expertise",
      "Maintains accurate and complete ﬁles on all assigned casework to keep track of all casework progress",
      "Screens and monitors cases to determine if referring the case to other government entities is appropriate",
      "Answers casework correspondence, meets with constituents, and serves as a liaison with federal, state, and local authorities to act as the representative for the Member within their areas of responsibility",
      "Writes responses to constituent letters relating to casework to answer questions or inform them of case progress",
      "Support ODice in executing public meetings and annual Congressional activities such as the Congressional Art Competition, Congressional App Competition, and other similar events.",
      "Orders all oDice supplies to maintain oDice functionality and similar administrative duties",
      "Acts as the Intern Coordinator supporting the onboarding, training, and supervision of interns",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an eDicient and eDective manner"
    ],
    "qualifications": [
      "Candidates must be a self-starter, hard-working, highly dependable, and organized as well as possess strong oral and written communication skills and the ability to work quickly under pressure.",
      "Good judgment, strong customer service and interpersonal skills, attention to detail, ability to work in a team environment, a passion for public service, and availability to work some evenings and weekends are required.",
      "Driver’s license and access to vehicle is required.",
      "Bachelor's degree or equivalent combination of education and experience preferred.",
      "Prior experience working for federal, state, or local government, especially related to casework is preferred.",
      "Familiarity with Member's district, especially the Sonoma Valley, is preferred.",
      "Ability to communicate in multiple languages, especially Spanish, is highly desirable."
    ],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-474-24",
    "position_title": "Digital Director, House Committee on Veterans’ ADairs, Republican StaD",
    "office": "House Committee on Veterans’ ADairs",
    "location": null,
    "posting_date": "2024-11-11",
    "description": "The Republican (Majority) staD of the House Committee on Veterans’ ADairs is seeking a full-time Digital Director.\n\nThe ideal candidate will possess strong written, verbal, and digital communication skills, an interest in veterans’ issues, the ability to work in a fast-paced, collaborative, forwardthinking environment, professionalism, and a good sense of humor. This is not an entry level position; prior Capitol Hill communications experience or private-sector equivalent is required.",
    "responsibilities": [
      "Drafting press releases, floor speeches, quotes, talking points, social media posts, one-pagers, and scripts for speaking engagements and video productions.",
      "Creating, developing, and managing social media posts and a broader social media strategy.",
      "Managing sending out press releases, oDicial statements, media advisories, and other external communications.",
      "Managing the Committee website.",
      "Managing the internal and external Committee press list, to include growing the external press list.",
      "Managing hearing livestreams.",
      "Clipping and posting Committee Members’ hearing and floor remarks in real-time.",
      "Photographing hearings, events, and meetings, to include occasional videography.",
      "Creating graphics for social media and visual aids.",
      "Compiling, monitoring, and distributing daily press clips.",
      "Perform other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references, and three writing samples to VAR.Resumes@mail.house.gov with “Digital Director” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-473-24",
    "position_title": "Staff Assistant, House Committee on Veterans’ Affairs, Republican Staff",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2024-11-11",
    "description": "Staff assistants often serve as the first point of contact for constituents, guests, and VIPs, setting the tone for the office. The Staff Assistant provides general administrative support to staff, staffs front office and phones, preparation for hearings/committee business, processes mail, and assists with other duties as assigned. Previous Hill experience is recommended but not required.",
    "responsibilities": [
      "Foster a welcoming atmosphere and create a positive first impression for the office's constituents, visitors, and VIPs.",
      "Provide front office administrative coverage to include answering phones, and processing mail.",
      "Maintain files for mail, bills, reports, and public laws, and other legislative papers.",
      "Prepare binders for full committee events (hearings, markups, floor, etc.).",
      "Prepares hearing room for hearings, markups, and other committee business.",
      "Review the Congressional Record daily for information that impacts the Committee.",
      "Maintain contact lists for committee staff and committee member personal office staff.",
      "Oversee the internship program, which includes supervising and training interns.",
      "Manages hearing room reservations",
      "Maintain Republican email distribution and contact lists.",
      "Monitor office supplies to ensure that staff have needed supplies.",
      "Serve as the secondary Office Safety Coordinator.",
      "Perform other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send their cover letter, resume, and references to VAR.Resumes@mail.house.gov with “Staff Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-471-24",
    "position_title": "HEALTH POLICY ADVISOR/SENIOR HEALTH POLICY ADVISOR",
    "office": "Congressman Ami Bera, M.D. (CA-06)",
    "location": "Washington, DC",
    "posting_date": "2024-11-11",
    "description": "Congressman Ami Bera, M.D. (CA-06) seeks a qualiﬁed candidate to support his legislative activities related to health care, including but not limited to: Medicare/Medicaid ﬁnancing, graduate medical education (GME), workforce issues, drug pricing, childhood cancer, social isolation, mental health, pandemic preparedness, biosecurity, and the intersection of health care and artiﬁcial intelligence.\n\nThis is NOT an entry level position. Successful candidates must be highly self-motivated, enthusiastic about thinking outside the box, be detail-oriented, work well under pressure, be able to explain complex ideas clearly and concisely, have strong interpersonal and networking skills, think creatively, and be able to handle multiple projects at once.\n\nCandidates will report directly to the member and travel to the district on a quarterly basis. Hill or agency experience is preferred. California or Sacramento ties preferred. This oDice is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression.",
    "responsibilities": [
      "To research, develop and plan legislative and event/caucus initiatives",
      "StaD the member on the Bipartisan House AI Taskforce, Doctor’s Caucus, and lead his work on the Health Care Innovation Caucus and Childhood Cancer Caucus",
      "To monitor legislative developments within various Committees of jurisdiction in the House and Senate, and the House ﬂoor",
      "To draft/prepare Congressman Bera with the necessary information, such as talking points or background",
      "To draft constituent, stakeholder, and industry correspondence for the Member",
      "To meet with constituents, stakeholders, special interests groups, industry representatives on behalf of the Member",
      "To maintain vital relationships with District stakeholders, constituents, academics, patient groups, relevant industry experts to maintain an open line of communication and holistic understanding of key issues",
      "To travel to the district once per quarter for events and meetings"
    ],
    "qualifications": [
      "Highly self-motivated",
      "Enthusiastic about thinking outside the box",
      "Detail-oriented",
      "Ability to work well under pressure",
      "Able to explain complex ideas clearly and concisely",
      "Strong interpersonal and networking skills",
      "Think creatively",
      "Able to handle multiple projects at once",
      "Hill or agency experience preferred",
      "California or Sacramento ties preferred"
    ],
    "how_to_apply": "Interested applicants should submit: a resume, cover letter, and a 1-2 page writing sample and email to jobs.ca06@gmail.com",
    "salary_info": null,
    "contact": "jobs.ca06@gmail.com",
    "equal_opportunity": "This oDice is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-470-24",
    "position_title": "Staff Assistant",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2024-11-11",
    "description": "The Democratic staff of the House Judiciary Committee seeks a Staff Assistant.\n\nCandidates should have excellent organizational skills and strong research, writing, and communication skills.\n\nThe ideal candidate will be willing to learn from our counsels and grow into more substantive role over time.",
    "responsibilities": [
      "Overseeing logistics for hearings and markups",
      "Providing administrative and research support to committee and subcommittee counsels",
      "Coordinating calendars for the committee, the subcommittees, and the senior staff",
      "Serving as an assistant clerk during markups",
      "Managing the committee’s internship program"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Strong research skills",
      "Strong writing skills",
      "Strong communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to JDEM.job@mail.house.gov and include “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-469-24",
    "position_title": "Counsel for the House Judiciary Committee – National Security",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2024-11-11",
    "description": "The Democratic Staff of the House Judiciary Committee seeks a dedicated, hard-working lawyer with a minimum of five years of relevant legal experience to serve as a committee counsel, working with counsels across multiple subcommittees and reporting to the Chief Oversight Counsel.\n\nResponsibilities include serving as a resource for Democratic Members of the Committee on matters of law and policy within the Committee’s jurisdiction, with a focus on national security, surveillance, and civil liberties; drafting legislation; preparing hearings; drafting statements, memos, and briefing materials; attending classified briefings; and providing guidance to Democratic House offices on matters of national security and constitutional law.\n\nA successful candidate must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and an ability to work on novel and complex matters. This candidate must also be able to work collaboratively with a broad range of personalities. In addition, sound political judgment, prior legislative or policy experience, a substantive background in national security law, an active security clearance, and a demonstrated commitment to public service are strongly preferred. A sense of humor is a plus.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Committee on matters of law and policy within the Committee’s jurisdiction, with a focus on national security, surveillance, and civil liberties",
      "Drafting legislation",
      "Preparing hearings",
      "Drafting statements, memos, and briefing materials",
      "Attending classified briefings",
      "Providing guidance to Democratic House offices on matters of national security and constitutional law"
    ],
    "qualifications": [
      "Minimum of five years of relevant legal experience",
      "Exceptional writing and legal research skills",
      "Strong work ethic",
      "Professional temperament",
      "Ability to work on novel and complex matters",
      "Ability to work collaboratively with a broad range of personalities",
      "Sound political judgment, prior legislative or policy experience, a substantive background in national security law, an active security clearance, and a demonstrated commitment to public service are strongly preferred",
      "A sense of humor is a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to Job.JDEM@mail.house.gov. Please include “National Security Counsel” in the subject line.",
    "salary_info": null,
    "contact": "Job.JDEM@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee also encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin"
  },
  {
    "id": "MEM-468-24",
    "position_title": "Counsel for the House Judiciary Subcommittee on the Constitution – Reproductive Rights",
    "office": "House Judiciary Committee’s Subcommittee on the Constitution",
    "location": null,
    "posting_date": "2024-11-11",
    "description": "The Democratic StaD of the House Judiciary Committee’s Subcommittee on the Constitution seeks a dedicated, hard-working lawyer with a minimum of five years of relevant legal experience to serve as subcommittee counsel, reporting to the chief counsel for the subcommittee.\n\nResponsibilities include serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee’s jurisdiction, with a focus on reproductive rights and the privacy of patients and health care providers; drafting legislation; preparing hearings; drafting statements, memos, and brieﬁng materials; and providing guidance to Democratic House oDices on matters of constitutional and civil rights law.\n\nA successful candidate must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and an ability to work on novel and complex matters. This candidate must be able to work collaboratively with a broad range of personalities. In addition, sound political judgment, prior legislative or policy experience, a substantive background in civil rights or constitutional law, and a demonstrated commitment to public service are strongly preferred. A sense of humor is a plus.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee’s jurisdiction, with a focus on reproductive rights and the privacy of patients and health care providers",
      "Drafting legislation",
      "Preparing hearings",
      "Drafting statements, memos, and brieﬁng materials",
      "Providing guidance to Democratic House oDices on matters of constitutional and civil rights law"
    ],
    "qualifications": [
      "Exceptional writing and legal research skills",
      "Strong work ethic",
      "Professional temperament",
      "Ability to work on novel and complex matters",
      "Ability to work collaboratively with a broad range of personalities",
      "Sound political judgment (preferred)",
      "Prior legislative or policy experience (preferred)",
      "Substantive background in civil rights or constitutional law (preferred)",
      "Demonstrated commitment to public service (preferred)",
      "A sense of humor (a plus)"
    ],
    "how_to_apply": "Qualiﬁed candidates should submit a resume, cover letter, and writing sample to Job.JDEM@mail.house.gov. Please include “Constitution Counsel” in the subject line.",
    "salary_info": null,
    "contact": "Job.JDEM@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staD represents the diversity of the country’s population. The Committee also encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-467-24",
    "position_title": "Press Secretary/Communications Director",
    "office": "Congressman Tom Suozzi",
    "location": "Washington, D.C.",
    "posting_date": "2024-11-11",
    "description": "Congressman Tom Suozzi seeks a Press Secretary or Communications Director to serve in his Washington, D.C. office. Successful candidates will have very strong writing skills, a close eye to detail, fluency with social media platforms and digital tools, and experience working with national and local press. Responsibilities include writing press releases, statements and media advisories; creating and managing social media content, including graphics and videos; drafting talking points and op-eds; and creating franked communications, including e-newsletters, mailers and telephone townhalls.",
    "responsibilities": [
      "writing press releases, statements and media advisories",
      "creating and managing social media content, including graphics and videos",
      "drafting talking points and op-eds",
      "creating franked communications, including e-newsletters, mailers and telephone townhalls"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and relevant portfolio to NY03.jobs@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "NY03.jobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-458-24",
    "position_title": "Law Clerk",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2024-11-11",
    "description": "The Washington, D.C. ODice of Congresswoman Pramila Jayapal (WA-07), member of the House Judiciary Committee, is seeking a law clerk to work with her legislative team. Under the supervision of the oDice’s Legislative Counsel, the law clerk will conduct legal and policy research, attend and staD Judiciary Committee hearings, make vote recommendations, and draft legal and policy memos and other documents. High-achieving law students interested in public law, policy, politics, or government service are strongly encouraged to apply.\n\nLaw clerks will engage in serious, substantive work across a number of issue areas, including antitrust enforcement, administrative law reform, civil rights and civil liberties, court reform and oversight, criminal justice, voting rights, and intellectual property. The clerkship is unpaid but available for academic credit.",
    "responsibilities": [
      "Conduct legal and policy research",
      "Attend and staD Judiciary Committee hearings",
      "Make vote recommendations",
      "Draft legal and policy memos and other documents"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please email a (1) resume, (2) cover letter, (3) writing sample, and (4) list of three references with email contacts to Jayapal.DCInternships@mail.house.gov. Please send all application documents in a single PDF ﬁle and include “Law Clerk – FirstName Last Name” in the subject line.",
    "salary_info": null,
    "contact": "Jayapal.DCInternships@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-458-24",
    "position_title": "District Representative",
    "office": "Congressman Steven Horsford’s District Office",
    "location": "North Las Vegas, Nevada",
    "posting_date": "2024-11-11",
    "description": "Congressman Steven Horsford’s District Office is seeking to hire a full-time District Representative. We are looking for an enthusiastic and motivated individual to join our high-energy team.\n\nJob Summary:\nUnder the supervision of the District Director, the District Representative acts as the representative for the Member. District Representative responsibilities include strengthening relationships with key stakeholders, as well as attending engagements on behalf of the Member. Caseworker responsibilities include helping constituents resolve problems with federal agencies through written and verbal communication.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals.",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities.",
      "Build and maintain relationships with constituents and key community leaders.",
      "Organize and participate in community events, town halls, and outreach campaigns to engage constituents.",
      "Act as the representative for the Member within his or her area of responsibility, including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies.",
      "Handle casework assignments and assess casework for problems requiring legislative action, making recommendations to the District Director and Chief of Staff.",
      "Monitor scheduled district meetings for the Member with constituents.",
      "Maintain a good working relationship with the Member, staff, and constituents.",
      "Accept performance-based criticism and directions.",
      "Work well under pressure and handle stress.",
      "Work a flexible schedule including long hours, nights, and weekends.",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Political knowledge and comfortable navigating complicated situations",
      "Strong written, verbal, analytical, and organization skills; impeccable customer service manners; public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including occasional nights, weekends and some holidays."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples (no longer than two pages) and three professional references to NV04Resume@mail.house.gov with \"District Representative,” [Last Name, First Name]\" in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is competitive and commensurate with experience",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, minorities, individuals with disabilities, and veteran are encouraged to apply."
  },
  {
    "id": "MEM-457-24",
    "position_title": "Constituent Liaison & Field Representative",
    "office": "Office of Congresswoman Grace Meng (NY-06)",
    "location": "Flushing, Queens",
    "posting_date": "2024-11-11",
    "description": "The oDice of Congresswoman Grace Meng (NY-06) seeks a hardworking, collaborative\nteam-player to serve as a Constituent Liaison & Field Representative in her district oDice\nbased in Flushing, Queens. Candidates should have extensive knowledge of and familiarity\nwith Queens. Successful candidates are well-organized, timely, have access to a safe\nvehicle and a good driving record, and the ability to sometimes work on evenings or\nweekends.",
    "responsibilities": [
      "Managing and conducting constituent casework related to the federal government, as well as helping constituents with local resources",
      "Serving as a liaison with the community and local stakeholders",
      "Identifying federal cases and working with appropriate agencies on behalf of constituents; Connecting constituents with local resources for non-federal cases",
      "Tracking constituent issues and identifying emerging trends",
      "Building relationships with local stakeholders, federal, state, and local agencies and staDers",
      "Building and maintaining relationships with local stakeholders",
      "Attending and participating in community meetings on behalf of the\nCongresswoman, including but not limited to monthly community boards.",
      "Collaborating with district staD to ensure that the Congresswoman and oDice have\nan equitable and highly visible presence across all areas of the district",
      "Staying up to date on local news and issues",
      "Supporting town hall",
      "Providing transportation for the Member",
      "StaDing the Member at events and meetings within the district and across NY area",
      "Additional duties as needed"
    ],
    "qualifications": [
      "Successful candidates are highly organized and possess strong oral and written communication skills.",
      "Successful s candidates possess a bachelor’s or associate degree and equivalent work experience",
      "Candidate should be a team-player with a positive attitude.",
      "Candidate should be collaborative, proactive, and eager to work in a fast-paced environment, in which they are challenged to think creatively and encouraged to grow.",
      "Candidate should be a proﬁcient problem solver, with a keen ability to ask questions and actively seek assistance when needed."
    ],
    "how_to_apply": "Interested applicants should send a resume and writing sample with the subject line “Constituent Liaison & Field Representative” to Ny06resume@mail.house.gov",
    "salary_info": "$50,000.00 - $60,000.00 per year",
    "contact": "Ny06resume@mail.house.gov",
    "equal_opportunity": "The oDice is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-452-24",
    "position_title": "Special Assistant",
    "office": "Congressman Brendan Boyle (PA-2)",
    "location": "Washington, DC",
    "posting_date": "2024-11-11",
    "description": "Congressman Brendan Boyle (PA-2) is seeking a full-time staff member to serve as a Special Assistant in his Washington, DC office.\n\nProspective applicants should have a valid driver’s license, as well as full-time access to a working automobile. Prospective applicants should be able to work in dynamic and rapidly paced work environment, have a defined interest in public service, and should be prepared for the need to work evenings and some weekends as needed (schedule flexibility is a must, particularly during weeks Congress is in session).\n\nCompensation will be commensurate with experience. This position includes paid leave, retirement benefits, full medical, dental, vision insurance, student loan repayment support for qualified individuals, among other benefits.",
    "responsibilities": [
      "Staffing/driving the member when in Washington, DC.",
      "Ensuring that the member has all necessary documents and materials prior to events, including coordinating with the Operations Director and Scheduler regarding member scheduling and logistics.",
      "Working with other Washington, DC based staff to prepare documents and other materials for the member prior to events and meetings.",
      "Managing the office’s phone and voicemail system.",
      "Helping to manage the office’s interns.",
      "Coordinating tours and flag requests.",
      "Assisting the scheduler and legislative staff with record keeping and other administrative tasks.",
      "Other duties as needed."
    ],
    "qualifications": [
      "Strong organizational and communication abilities.",
      "Proficiency in Microsoft Office (Word, Outlook, Excel, Teams).",
      "The ability to multi-task and prioritize effectively.",
      "Being a self-starter, detail oriented and punctual at all times.",
      "Having a strong general knowledge of the physical layout of Washington, DC.",
      "Proficiency in Spanish or any other foreign language.",
      "Previous experience working on a political campaign or in the office of an elected official. Candidates with prior Washington, DC based congressional (i.e. Capitol Hill) experience will be given priority.",
      "Having a connection to Philadelphia or Southeastern Pennsylvania.",
      "Having good general knowledge of the physical layout of Capitol Hill, including House and Senate office buildings, as well as the U.S. Capitol Building.",
      "Proficiency with Intranet Quorum or other CRM software."
    ],
    "how_to_apply": "Prospective applicants should send a resume and cover letter to PA02.Jobs@mail.house.gov. Please no calls or drop ins.",
    "salary_info": "Compensation will be commensurate with experience. This position includes paid leave, retirement benefits, full medical, dental, vision insurance, student loan repayment support for qualified individuals, among other benefits.",
    "contact": "PA02.Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-451-24",
    "position_title": "Deputy Chief of Staff",
    "office": "a conservative mid-western Member of Congress",
    "location": "D.C.",
    "posting_date": "2024-11-11",
    "description": "The Deputy Chief of Staff will work closely with the Member, the Chief of Staff, and District Director to determine and execute the overall strategies of the Office. This includes, but is not limited to, formulating policy positions, overseeing the Office’s legislative and media relations strategies, and collaborating with District staff on important outreach and communication efforts. In addition, the Deputy Chief of Staff will provide leadership and guidance to structure the Office to provide outstanding constituent relations.",
    "responsibilities": [],
    "qualifications": [
      "Bachelor's degree",
      "Demonstrated interest in public service",
      "Previous Hill experience, particularly on policy and legislation"
    ],
    "how_to_apply": "Interested applicants should e-mail a resume and cover letter to ConservativeMidwestGOP@gmail.com.",
    "salary_info": "Dependent upon skills and experience.",
    "contact": "ConservativeMidwestGOP@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-442-24",
    "position_title": "Legislative Assistant",
    "office": "Congressman Jason Crow (CO-06)",
    "location": "Washington, D.C.",
    "posting_date": "2024-11-11",
    "description": "Congressman Jason Crow (CO-06) seeks a highly motivated, hard-working Legislative Assistant, based in our Washington, D.C. office. This position reports to the Legislative Director. The LA will handle a domestic-facing portfolio, including animals, arts, postal, small business, housing, and telecom.",
    "responsibilities": [
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas",
      "Working with external stakeholders, CRS, Legislative Counsel, and committee staff to draft legislation based on the Member’s priorities",
      "Preparing and staffing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates"
    ],
    "qualifications": [
      "Strong written and oral communications skills",
      "Detail-oriented, organized, and creative",
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
      "Colorado ties are a plus and prior Hill experience is preferred."
    ],
    "how_to_apply": "Qualified applicants should submit a resume, cover letter, and writing sample (no more than 3 pages) as one combined PDF to co06.resumes@mail.house.gov. Include “Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on a rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "co06.resumes@mail.house.gov",
    "equal_opportunity": "This office is committed to building a diverse and inclusive team: candidates of color, women, and LGBTQIA+ candidates are encouraged to apply. This office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-438-24",
    "position_title": "District Director",
    "office": "Office of Congresswoman Jill Tokuda",
    "location": "District Office",
    "posting_date": "2024-11-11",
    "description": "Rep. Jill Tokuda is looking for a highly motivated individual to manage her Hawaii staff and oversee operations and objectives to ensure community and constituent needs are met fully and in a timely manner. This position develops outreach and constituent service strategies, represents the Congresswoman in meetings and at events, supervises district staff, and plans/assigns work. The ideal candidate would have supervisory experience and leadership skills, the ability to manage multiple tasks, and extremely strong written and verbal communication skills. Attention to detail and ability to work collaboratively is required.",
    "responsibilities": [
      "Works with staff to put together the Congresswoman’s district schedule.",
      "Ensures casework is being handled in a timely manner and that messages, commendations, and correspondence are being delivered before deadlines. Proofs documents sent out from the district office.",
      "Oversees the annual congressional competitions for art & computer applications, as well as the military academy nominations process.",
      "Directly oversees district staff including field representatives.",
      "Maintains communication with the Congresswoman and the Chief of Staff, ensuring they are abreast of local concerns and any Hawaii staff issues, suggests strategies for handling when needed."
    ],
    "qualifications": [
      "Supervisory experience and leadership skills",
      "Ability to manage multiple tasks",
      "Extremely strong written and verbal communication skills",
      "Attention to detail",
      "Ability to work collaboratively",
      "Ability to work a flexible schedule, including occasional nights and weekends"
    ],
    "how_to_apply": "Interested candidates are requested to submit a cover letter, resume, and three references to hawaii02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-431-24",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Alma Adams",
    "location": "Hill",
    "posting_date": "2024-11-11",
    "description": "Congresswoman Alma Adams, member of the House Education and the Workforce Committee, seeks an experienced Legislative Assistant to join her team. The policy portfolio and areas of responsibility for this position is mostly focused on Education and Workforce Committee work. The portfolio of work will include other issues however they will be assigned based on experience and need.\n\nThis position reports to the Legislative Director and Chief of Staff and will include extensive work with the Congresswoman and the rest of her team. Qualified candidates should have knowledge of the legislative process and demonstrate an ability to take initiative.\n\nHill experience is required.",
    "responsibilities": [
      "Preparing and staffing Member for meetings, committee hearings and markups, floor votes, and related events;",
      "Representing Member in meetings with constituents and both national- and local-level advocacy groups, think thanks, and other groups relevant to policy portfolio;",
      "Tracking legislation and other developments in assigned issue area(s), monitor relevant committee and floor activity, track developing local/international news events, make recommendations for votes, cosponsor ships and letters for Member to sign;",
      "Building and maintaining positive relationships with congressional staff, district and national stakeholders, advocacy organizations, Executive Branch officials, and other key stakeholders relevant to policy portfolio;",
      "Building support for Member’s policy priorities and developing/implementing ideas for new initiatives (legislation, letters, events, press, etc.)",
      "Drafting legislation, letters, floor/committee remarks, talking points, press related materials, and other written material related to policy portfolio; and",
      "Other duties as assigned by senior staff."
    ],
    "qualifications": [
      "Hill experience is required.",
      "Qualified candidates should have knowledge of the legislative process and demonstrate an ability to take initiative."
    ],
    "how_to_apply": "To apply, please submit a cover letter, resume, and writing sample to NC12.Resume@mail.hosue.gov with “Legislative Assistant” in the subject line. Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": "NC12.Resume@mail.hosue.gov",
    "equal_opportunity": "The Office of Representative Alma Adams is an equal opportunity employer, committed to developing an organization that is reflective of and attentive to the needs of the diverse community we serve. The Office does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-425-24",
    "position_title": "Legislative Correspondent",
    "office": "Office of Rep. Greg Landsman",
    "location": "DC",
    "posting_date": "2024-11-11",
    "description": "The oDice of Rep. Greg Landsman seeks a highly motivated, energetic, and organized individual to serve as a Legislative Correspondent, based in our DC oDice. The LC reports to the Legislative Director and works in close collaboration with the Member, Chief of StaD, and communications and district teams. The LC will manage the\n\nCongressman’s constituent mail program and provide support to the full legislative team.",
    "responsibilities": [
      "Drafting tailored letters in response to constituent inquiries",
      "Maintain and update current response letter library",
      "Sorts/batches incoming constituent mail by issue area",
      "Ensures accurate batching and a timely response to all constituents",
      "Meeting with constituents, stakeholders, and advocacy groups as needed",
      "Communicating clearly and consistently with the Legislative Director, Chief of StaD, and Member"
    ],
    "qualifications": [
      "Strong verbal and written communications skills and ability to communicate both up and down within the team",
      "Excellent organizational skills and ability to prioritize assignments",
      "Ability to work in a fast-paced environment and quickly respond to requests from the Member and the team",
      "Commitment to a collaborative work environment",
      "Ability to quickly learn and adapt to the Congressman’s voice, style, and legislative priorities",
      "Comfort with receiving and delivering feedback",
      "Attention to detail, creativity, and most of all, hustle."
    ],
    "how_to_apply": "To apply, please email jobs.landsman@mail.house.gov with “Legislative Correspondent” in the subject line and the following application materials attached as one combined PDF:\nCover letter\nResume\nBrief writing sample\nTwo references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\nNo phone calls or drop bys, please.",
    "salary_info": "Salary range is $50,000 - $55,000, commensurate with experience. Title commensurate with experience.",
    "contact": "jobs.landsman@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. Ohio ties are a plus. The oDice is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-424-24",
    "position_title": "Legislative Aide",
    "office": "Office of Rep. Greg Landsman",
    "location": "DC",
    "posting_date": "2024-11-11",
    "description": "The oDice of Rep. Greg Landsman seeks a highly motivated, energetic, and detail-oriented individual to serve as a Legislative Aide, based in our DC oDice.\nThe Legislative Aide reports to the Legislative Director and works in close collaboration with the Member, Chief of StaD, and communications and district teams. Exact issue area portfolio is ﬂexible, and applicants with backgrounds in any issue area are encouraged to apply.",
    "responsibilities": [
      "Preparing and staDing the Member for meetings",
      "Working with committee staD, external stakeholders, Legislative Counsel, and the Congressional Research Service to draft legislation based on the Member’s priorities",
      "Creating vote recommendations on legislation coming to the Floor within a given issue area",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas",
      "Communicating clearly and consistently with the Member, Chief of StaD, and legislative, communications, and district teams on legislative updates",
      "Overseeing special projects, that may include drafting letters of support, and researching and advising local stakeholders on federal funding/grant opportunities"
    ],
    "qualifications": [
      "Strong verbal and written communications skills and ability to communicate both up and down within the team",
      "Ability to work in a fast-paced environment and quickly respond to requests from the Member and the team",
      "Commitment to a collaborative work environment",
      "Ability to quickly learn and adapt to the Congressman’s voice, style, and legislative priorities",
      "Comfort with receiving and delivering feedback",
      "Attention to detail, creativity, and most of all, hustle"
    ],
    "how_to_apply": "To apply, please email jobs.landsman@mail.house.gov with “Legislative Aide” in the subject line and attach the following application materials as one combined PDF:\nCover letter\nResume\nTwo references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\nNo phone calls or drop bys, please.",
    "salary_info": "$65,000",
    "contact": "jobs.landsman@mail.house.gov",
    "equal_opportunity": "The oDice is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status.\nCandidates of diverse backgrounds are encouraged to apply. Ohio ties are a plus."
  },
  {
    "id": "MEM-410-24",
    "position_title": "Full Time Constituent Services Representative",
    "office": "Congressional Staff",
    "location": null,
    "posting_date": "2024-11-11",
    "description": "The Constituent Services Representative position acts as a liaison to federal, district, and local agencies for the Member/constituents and answers casework correspondence and verbal communications with constituents. Candidates must be a selfstarter, excited to problem solve, hardworking, dependable, and organized as well as possess strong oral and written communication skills. This position requires the ability to work well under pressure, good judgment, strong customer service skills, and a commitment to public service. Availability to work some evenings and weekends is required. Ability to communicate in multiple languages is also highly desirable. A vehicle to travel to evening and weekend events is also recommended.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Handles casework assignments and special projects at the direction of the Director of Constituent Services;",
      "Continually screens active cases/ constituent service requests and acts as a liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Attends and monitors scheduled district meetings on behalf of the Member with constituents and groups during regular office hours, some evenings and weekends;",
      "Logging incoming and outgoing correspondence, handling visitors & telephone calls;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework and constituent concerns in Congressional Management System Database;",
      "Performs cross functional tasks with other departments, as needed.",
      "Meets attendance requirements as established by the office; Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;"
    ],
    "qualifications": [
      "Strong customer service, oral and written communication skills;",
      "Familiarity with local, state and federal agencies; Strong knowledge of issues and events in the district in which the Member is involved;",
      "Professional telephone manner and excellent customer and client service skills;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge and proficiency in Microsoft office suite and other office computer applications."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter and resume to ny08team@gmail.com with the Subject Line: Constituent Services Representative Position.",
    "salary_info": null,
    "contact": "ny08team@gmail.com",
    "equal_opportunity": "Women, people of color, and LGBTQ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-392-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Emilia Sykes",
    "location": "Washington, D.C.",
    "posting_date": "2024-11-11",
    "description": "Congresswoman Emilia Sykes seeks a Communications Director to serve in their Washington, D.C. office. Candidates must be proactive, possess superior written and oral communication skills, and be able to execute a robust communications strategy. This is not an entry-level position. Only candidates with prior political or legislative communications experience will be considered.",
    "responsibilities": [
      "Creating and executing a robust communications plan",
      "Establishing and maintaining relationships with Ohio, national, and D.C.-based media",
      "Advancing press events and staffing the Member as needed, including occasional night and weekend commitments",
      "Drafting and distributing press releases, statements, and media advisories",
      "Creating, editing, and strategically placing op-eds",
      "Overseeing the development of social media content creation, including rapid response",
      "Managing a franked communications plan including text messages, e-newsletters, digital ads, radio ads, 499s, mailers, etc",
      "Pitching to reporters and producers, responding to press inquiries, and serving as the main point-of-contact for media",
      "Updating the website as needed",
      "Managing the Press Secretary",
      "Performing other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, three references, and two writing samples in one pdf to JoinTeamSykes@mail.house.gov with the following subject line: Full Name – Communications Director.",
    "salary_info": "$90,000-$100,000 based on experience",
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equalopportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-382-24",
    "position_title": "Military and Veterans Affairs Liaison",
    "office": "Congressman Max Miller",
    "location": "Medina and Parma, Ohio",
    "posting_date": "2024-11-11",
    "description": "The Military and Veterans Affairs Liaison is responsible for maintaining relationships with veterans, military members, military installations and organizations, veterans organizations and offices, and other like entities within the district. Additionally, the liaison will be responsible for all military and veterans related casework and lead the office’s service academy nomination process.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents, organizations, etc;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Acts as a liaison to and notifies the appropriate media when the Member will be in the liaison’s area and works with the Member’s Scheduler and Press Secretary to ensure appropriate media participation;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Director of Constituent Services;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Assists with the handling of office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Bachelor's degree or equivalent combination of education and experience preferred;",
      "Previous office experience is preferred;",
      "Previous experience working for a Member of Congress, elected official, or government agency preferred;",
      "Meets attendance requirements as established by the office;",
      "Accepts performance based criticism and directions;",
      "Strong oral and written communication skills;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including some nights and weekends;",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing.",
      "Work is mainly performed in an office environment;",
      "Ability to work in a small work station without an expectation of privacy.",
      "This job is primarily performed in-person"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume to Raymond.Paoletta@mail.house.gov.",
    "salary_info": null,
    "contact": "Raymond.Paoletta@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-135-24",
    "position_title": "PRESS SECRETARY",
    "office": "Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-11-11",
    "description": "The ODice of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. oDice. Candidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\n\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staD the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the oDice’s larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The ODice of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  }
]