[
  {
    "id": "MEM-086-25",
    "position_title": "Staff Assistant",
    "office": "Office of Rep. Latta",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "Responsibilities include staffing and overseeing the front office, answering phones and sorting incoming mail, greeting constituents and visitors, handling tour and flag requests, managing the internship program, and providing general office support. In addition, candidates should have excellent attention to detail and strong writing skills as the role may include drafting constituent letters and assisting legislative staff with various projects.\n\nThe ideal candidate will be able to multi-task efficiently, be able to work in a fast-paced environment, and have strong organizational and communication skills. Ties to Ohio are preferred and preference will be given to candidates who have a car and are able to drive to assist in responsibilities driving the member.",
    "responsibilities": [
      "Staffing and overseeing the front office",
      "Answering phones and sorting incoming mail",
      "Greeting constituents and visitors",
      "Handling tour and flag requests",
      "Managing the internship program",
      "Providing general office support",
      "Drafting constituent letters",
      "Assisting legislative staff with various projects"
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Strong writing skills",
      "Ability to multi-task efficiently",
      "Ability to work in a fast-paced environment",
      "Strong organizational skills",
      "Strong communication skills",
      "Ties to Ohio (preferred)",
      "Ability to drive (preferred)"
    ],
    "how_to_apply": "Please send resumes to Andrew.Henthorn@mail.house.gov.",
    "salary_info": null,
    "contact": "Andrew.Henthorn@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-082-25",
    "position_title": "Field Representative",
    "office": "Office of Congressman Greg Steube (FL-17)",
    "location": "Sarasota, Florida",
    "posting_date": "2025-03-03",
    "description": "The Field Representative serves as a liaison between Congressman Steube and constituents, including municipal, county, state, and federal entities, non-profits, and businesses. This role represents the Congressman at community events, facilitates casework, and monitors district issues. The ideal candidate should have a strong understanding of congressional operations and established ties to Southwest Florida.",
    "responsibilities": [
      "Represent the Congressman at community events and meetings in Florida’s 17th District, serving as the primary point of contact for local governments, organizations, and stakeholders.",
      "Act as a liaison between constituents and the DC office to facilitate federal policy needs, funding opportunities, and legislative solutions.",
      "Manage constituent casework, monitor district issues, and support policy discussions to ensure local concerns are effectively communicated and addressed at the federal level.",
      "Assist with core district office projects, including Service Academy Nominations and the Congressional App Challenge.",
      "Occasionally answer office phones and oversee junior staff and interns.",
      "Maintain and update records using the office’s constituent relationship management system (IQ).",
      "Work flexible hours, including nights and weekends.",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Education: Bachelor’s degree from an accredited institution.",
      "Experience: Minimum of 2 years, with strong academic credentials.",
      "Skills & Knowledge:",
      [
        "Strong oral and written communication skills.",
        "Understanding of the legislative process and government agencies.",
        "Knowledge of district issues and events.",
        "Ability to manage multiple priorities and work under pressure.",
        "Proficiency in office software and database management.",
        "Strong organizational skills and ability to exercise discretion in casework."
      ]
    ],
    "how_to_apply": "Please send resumes to floridarepublicanjobs@gmail.com",
    "salary_info": "$55,000 - $75,000 (commensurate with experience)",
    "contact": "floridarepublicanjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-081-25",
    "position_title": "House GOP Appropriator Seeks Legislative Assistant",
    "office": "House GOP",
    "location": null,
    "posting_date": "2025-03-03",
    "description": "CORE RESPONSIBILITIES:\nto develop legislative initiatives related to a national security portfolio, including\ncybersecurity, foreign a&airs, and armed services.\nto monitor legislative developments within Committees and on the House floor;\nto meet with constituents and advocacy groups on behalf of the Member.\nQUALIFICATIONS:\nat least 1 year of legislative experience in a full-time, paid position or legislative\nfellowship",
    "responsibilities": [
      "to develop legislative initiatives related to a national security portfolio, including cybersecurity, foreign a&airs, and armed services.",
      "to monitor legislative developments within Committees and on the House floor;",
      "to meet with constituents and advocacy groups on behalf of the Member."
    ],
    "qualifications": [
      "at least 1 year of legislative experience in a full-time, paid position or legislative fellowship",
      "excellent oral and written communication skills;",
      "thorough knowledge of the legislative process;",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member;",
      "ability to work cooperatively and courteously with others;",
      "ability to work well under pressure;",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-080-25",
    "position_title": "Legislative Correspondent",
    "office": "Texas House Member",
    "location": null,
    "posting_date": "2025-03-03",
    "description": null,
    "responsibilities": [
      "to manage a robust constituent correspondence and outreach program"
    ],
    "qualifications": [
      "prior Capitol Hill experience, either in a full-time capacity or through an internship",
      "excellent writing skills and attention to detail",
      "familiarity with Indigov or a similar CRM software",
      "ability to work cooperatively and courteously with others",
      "ability to work well under pressure"
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-076-25",
    "position_title": "Special Assistant",
    "office": "Congressman Mike Flood (NE-01)",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "The primary responsibility of the Special Assistant is to transport the Member and other staff members to meetings and appointments as necessary, deliver and pickup materials for the office, staff the Member at various meetings, plan for and cater to various constituents and VIPs in DC, and serve as a personal aide to the Member when he is in Washington, DC. When the Member is in the district, the Special Assistant will assist the Operations Team with special projects and other misc. tasks.",
    "responsibilities": [
      "Driving the Member and other staff members as required for their official duties, sometimes before or after typical business hours.",
      "Driving the Member to and from the airport, sometimes before or after typical business hours.",
      "Deliver and pickup materials for the office, including letters, packages, and documents from other government agencies.",
      "Working with the Operations Director to be aware of the Member’s schedule in order to prepare the Member for his events/meetings.",
      "Running errands and assisting the Operations Team with supplies and other misc. administrative matters.",
      "Assisting in sorting and delivering mail.",
      "Staffing the Member at various meetings and events.",
      "Catering to constituents and VIPs who happen to be in Washington, DC.",
      "Serving as a personal aide to the Member, tending to various needs as they arise while he is in Washington, DC."
    ],
    "qualifications": [
      "Located in Washington, DC.",
      "Regular, predictable and punctual attendance at assigned locations required for performance of duties.",
      "Ability to communicate effectively with the Member and office staff, Members and representatives from other offices, outside organizations, and others.",
      "Ability to work outside of traditional business hours as the Member’s schedule dictates.",
      "Ability to handle difficult and sometimes tense interactions with members of the public, including constituents, with tact while also prioritizing the well-being of the Member.",
      "Work is public-facing and requires frequent interaction with members of the public, including constituents, in a courteous and tactful manner. Work requires extended and unscheduled hours as dictated by the Member’s schedule and office needs.",
      "Must possess a valid driver’s license and have a good driving record. A personal vehicle used to drive the Member is not necessarily required.",
      "Regularly lifts and moves luggage, books, files, documents, and other office materials.",
      "Must be able to prioritize and perform duties under pressure in a fast-paced environment.",
      "Regularly use typical office equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc."
    ],
    "how_to_apply": "Interested applicants may submit their resume and cover letter to FloodHiring@mail.house.gov.",
    "salary_info": null,
    "contact": "FloodHiring@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-074-25",
    "position_title": "Press/Digital Assistant",
    "office": "Congressman Jonathan L. Jackson",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "Congressman Jonathan L. Jackson seeks a full-time Press/Digital Assistant to work in his Washington, D.C. office. This position reports to the Communications Director.",
    "responsibilities": [
      "Create and manage content for the Member’s social media platforms, including copy, graphics, and videos",
      "Assist with drafting and circulating the Member’s newsletter, press releases, statements, talking points, and speeches",
      "Work with the Communications Director to develop content and graphics for franked communications",
      "Monitor news outlets and social media and compile press clips that mention the Member",
      "Maintain Chicago and D.C. press lists",
      "Handle photography and videography at D.C.-based events",
      "Assist with updating the website"
    ],
    "qualifications": [
      "Heart for public service and helping others",
      "Exceptional attention to detail",
      "Strong writing and creative skills",
      "Experience in graphic design and video editing",
      "An ability to work collaboratively in a fast-paced, team environment",
      "Temperament to communicate with a variety of personalities in a friendly and professional manner",
      "Chicago ties and experience in competitive districts are preferred but not required.",
      "Experience in Congressional offices of political campaigns preferred but not required."
    ],
    "how_to_apply": "Please submit a resume and brief cover letter to Robert.patillo@mail.house.gov with “LAST NAME - Press/Digital Assistant Application” in the subject line. Please do not call or drop by the office.",
    "salary_info": null,
    "contact": "Robert.patillo@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-072-25",
    "position_title": "Press Assistant",
    "office": "The Office of Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2025-03-03",
    "description": "The Office of Congressman Rob Wittman (VA-01) is seeking a Press Assistant to help execute the congressman’s communications strategy and plan.\n\nThey will work with the communications director to find new ways to grow the congressman’s following, increase his name ID in the district, and maintain synergy across communications materials.",
    "responsibilities": [
      "Drafting press releases and talking points",
      "Writing email newsletters for targeted constituent coalitions",
      "Promoting the congressman’s district events and engagements",
      "Maintaining the communications content calendar",
      "Overseeing website management and updates",
      "Branding through graphic design and video/audio editing",
      "Managing social media accounts and analyzing their performance metrics",
      "Maintaining the congressman’s photo and video database"
    ],
    "qualifications": [
      "A strong candidate will be a creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing.",
      "Excellent writing and organizational skills are required.",
      "An ability to multitask and work under tight deadlines is necessary.",
      "Strong candidates will have previous congressional or political communications experience; ties to Virginia are helpful but not required."
    ],
    "how_to_apply": "Interested applicants should email a resume, cover letter, and two writing samples to Julianne.Heberlein@mail.house.gov with “Press Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Julianne.Heberlein@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-071-25",
    "position_title": "Press/Digital Assistant",
    "office": "Congresswoman Kristen McDonald Rivet (MI-08)",
    "location": "Washington D.C.",
    "posting_date": "2025-03-03",
    "description": "Congresswoman Kristen McDonald Rivet (MI-08) seeks a fulltime Press/Digital Assistant, based in her Washington D.C. office. This position reports to the Communications Director.",
    "responsibilities": [
      "Create and manage content for the Member’s social media platforms, including copy, graphics, and videos",
      "Assist with drafting and circulating the Member’s newsletter, press releases, statements, talking points, and speeches",
      "Work with Communications Director to develop content and graphics for franked communications",
      "Monitor mentions of the Congresswoman across news outlets and social media, and compile press clips",
      "Maintain Michigan and D.C. press lists",
      "Handle photography and videography at D.C.-based events",
      "Assist with updating the website"
    ],
    "qualifications": [
      "Heart for public service and helping others",
      "Exceptional attention to detail",
      "Strong writing and creative skills",
      "Experience in graphic design and video editing",
      "An ability to work collaboratively in a fast-paced, team environment",
      "Temperament to communicate with a variety of personalities in a friendly and professional manner",
      "Michigan ties and experience in competitive districts are preferred but not required",
      "Experience in Congressional offices of political campaigns preferred but not required"
    ],
    "how_to_apply": "Please submit a resume and brief cover letter to tom.grandon@mail.house.gov with “LAST NAME - Press/Digital Assistant Application” in the subject line. Please do not call or drop-by the office.",
    "salary_info": "$55,000 per year",
    "contact": "tom.grandon@mail.house.gov",
    "equal_opportunity": "The office is an equal-opportunity employer."
  },
  {
    "id": "MEM-067-25",
    "position_title": "District Director",
    "office": "Congressman Jonathan L. Jackson (D-IL-1)",
    "location": "Chicago O&ice",
    "posting_date": "2025-03-03",
    "description": "Congressman Jackson has an immediate need to hire a dynamic leader to fill the District Director role in the Chicago O&ice. This is a full-time position. Interested candidates are encouraged to submit a resume and cover letter by Saturday, March 8, 2025. Once the application period closes, the o&ice will contact the best qualiﬁed candidates to begin the interview process.\n\nThe District Director serves as the Member's senior sta&er in the Congressional District. This position works closely with the Chief of Sta&, Legislative Director, and Communications Director to establish strategies, plans, and activities for the Member. Additionally, the District Director represents the Member at events and meetings throughout the local community. The District Director also manages and oversees all district o&ice operations, workﬂow, assignments of responsibilities, and performance of the team (e.g., constituent service representative/caseworker, sta& assistant). Occasional travel to the Washington, D.C. o&ice is required.",
    "responsibilities": [
      "Collaborates with the Member, Chief of Staff, Legislative Director, and Communications Director to ensure district office strategies and operating plans align with the Member's strategic vision and goals",
      "Attends events, speaks to local groups, and meets with elected officials and representatives in the district to serve as a primary representative on behalf of the Member",
      "Oversees the Member's constituent casework activities with Federal departments and agencies to monitor progress and schedule meetings as necessary",
      "Conducts district office staff meetings to ensure tasks are delegated and addressed appropriately",
      "Facilitates information sharing between the Member's district office and the D.C. office",
      "Understands and navigates differing perspectives and opinions to resolve conflicts and develop solutions effectively",
      "Interviews, selects, and trains employees of the district office to ensure the office is appropriately staffed",
      "Plans, assigns, and directs work of employees in the district office to manage staff and evaluate their work",
      "Oversees district office staff to ensure compliance with office policies, practices, and procedures",
      "Travels throughout the district at regular intervals to keep abreast of local concerns",
      "Partners with the Member’s communications team to plan district-based media and press events"
    ],
    "qualifications": [
      "Decision Making: Makes sound, well-informed, and objective decisions; perceives the impact and implications of decisions. Commits to action to accomplish organizational goals. Maintains appropriate levels of conﬁdentiality.",
      "Advising: Provides guidance and persuades others; utilizes give and take to make sure input is considered on important decisions; considers the legislative and political situation to provide valuable guidance.",
      "Managing Others: Plans, distributes, and monitors work assignments of others; evaluates work performance and provides ongoing feedback to others on their performance and opportunities to learn through formal and informal methods.",
      "Planning and Coordination: Organizes work and sets priorities. Coordinates with others to accomplish goals; monitors progress and evaluates outcomes.",
      "Political Acumen: Identiﬁes the internal and external politics that impact work. Perceives organizational and political reality and acts accordingly."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume by Saturday, March 8, 2025, to edward.hamb@mail.house.gov.",
    "salary_info": "Commensurate with Experience.",
    "contact": "edward.hamb@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-064-25",
    "position_title": "Oversight and Investigations Law Clerk",
    "office": "House Committee on Energy and Commerce, Subcommittee on Oversight and Investigations (Democratic Staff)",
    "location": null,
    "posting_date": "2025-03-03",
    "description": "The House Committee on Energy and Commerce, Subcommittee on Oversight and Investigations (Democratic Staff) is seeking a Law Clerk for Summer 2025 to assist in conducting oversight and investigations of issues within the Committee’s broad jurisdiction. Law Clerks will work closely with Subcommittee counsel and professional staff on a wide range of issues related to the environment, energy, health care, and consumer protection sectors. This is a paid position.",
    "responsibilities": [
      "Assisting in the preparation for Congressional hearings",
      "Contributing to the management of investigations of governmental and private entities",
      "Conducting research, document review, and analysis",
      "Drafting letters, memoranda, and investigative reports",
      "Coordinating with other Subcommittees of the full Committee"
    ],
    "qualifications": [
      "The ideal candidate will be in at least their second year of law school or is a recent law school graduate who is a detail-oriented and proactive problem-solver with strong communication and legal research and writing skills.",
      "Women, people of color, veterans, and LGBTQ+ candidates are strongly encouraged to apply."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and short writing sample to InternshipResume.EC@mail.house.gov with the subject line, “E&C O&I Law Clerk.” Applications are due on March 21, 2025.",
    "salary_info": "Law clerks will receive a stipend, and applicants may request the Committee’s assistance to receive credit from their educational institution.",
    "contact": "InternshipResume.EC@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-063-25",
    "position_title": "Digital/Press Assistant",
    "office": "Congresswoman Maxine Dexter, M.D. (OR-03)",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "The Digital/Press Assistant reports to the Communications Director and will play a crucial role in executing the office's strategic communications plan, specifically in executing the office's social media and digital communications.\n\nThis position requires a comprehensive understanding of social media trends, superior writing skills, considerable experience with photography, graphic design, and video editing, and the ability to work collaboratively in a fast-paced, team environment. Oregon ties are a plus but not required.",
    "responsibilities": [
      "Develop and implement the office's digital and social media strategy; create and maintain a consistent stream of digital content for member's social media platforms and website; includes rapid response",
      "Assist with drafting newsletters, press releases, talking points, scripts, opeds/letters to the editor, newsletters, and other written materials",
      "Film and edit videos for social media, including Instagram, Facebook, YouTube, etc.",
      "Develop and update website content",
      "Create/maintain press lists",
      "Clip TV appearances, floor speeches, and other video content for social media.",
      "Other tasks as needed"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should submit a resume, cover letter, 2-3 digital samples, mail to:OR3Resumes@gmail.com. and with the subject line “Digital/Press Assistant - [Your Name]” to OR3Resumes@gmail.com.",
    "salary_info": "$60,000-70,000",
    "contact": "OR3Resumes@gmail.com",
    "equal_opportunity": "This office is an equal-opportunity employer committed to developing an organization that is reflective of the district that we serve. The office does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-054-25",
    "position_title": "Communications Advisor",
    "office": "Congresswoman Melanie Stansbury (NM-01)",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "Congresswoman Melanie Stansbury (NM-01) is hiring a strategic Communications Advisor to support her Office's work on the DOGE Subcommittee of the House Oversight Committee and on behalf of New Mexico's First Congressional District.\n\nThis is not an entry level position. Previous experience on Capitol Hill and/or high-level political communications experience is required, along with a solid understanding of Congress and the legislative process.\n\nStrong preference for New Mexico ties, where possible. This Communications Advisor will be joining a dedicated, hard-working, and upbeat team working to defend our democracy and serving the state of New Mexico. This role will require strong coordination and writing skills.\n\nThis Communications Advisor will report to the Communications Director and work closely with the Congresswoman's Leadership, Legislative and District Office teams to develop and execute a coordinated communications plan to keep the public and constituents informed on critical matters before Congress and affecting the state.",
    "responsibilities": [
      "Strategic planning",
      "Drafting speeches",
      "Written remarks",
      "Press statements"
    ],
    "qualifications": [
      "Exceptional writing and researching skills.",
      "Ability to work long hours (including weekends and evenings as needed), under pressure, while remaining collaborative and effective.",
      "Thoroughness and attention to detail.",
      "Discretion and sound judgment.",
      "An independent self-starter and team-player.",
      "Strong organizational, time-management, and project management skills with the ability to juggle multiple priorities simultaneously.",
      "Self-starting, high dependability, adaptability, and organization skills."
    ],
    "how_to_apply": "Interested candidates must submit a resume to repstansburyresumes@mail.house.gov by March 7 with the following subject line: “Last Name – Communications Advisor.” Interviews will be conducted on a rolling basis.\n\nOut of fairness to all candidates, those who do not submit their materials to this email will not be considered. Qualified candidates should submit a single PDF saved with LastName.FirstName.CommunicationsAdvisor to include:\n1. Cover letter\n2. Resume\n3. Two writing samples",
    "salary_info": null,
    "contact": "repstansburyresumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-053-25",
    "position_title": "Counsel to the Subcommittee on Capital Markets",
    "office": "House Committee on Financial Services",
    "location": null,
    "posting_date": "2025-03-03",
    "description": "The House Committee on Financial Services is seeking an experienced securities attorney to serve as Counsel to the Subcommittee on Capital Markets of the House Committee on Financial Services.\n\nPosition Overview:\nThe Counsel will play a vital role in advancing the Subcommittee's work on capital formation and SEC institutional reforms, among other issue areas. The Counsel will work closely with Committee leadership and staff to develop legislation and policy initiatives.",
    "responsibilities": [
      "Conduct comprehensive legal research and analysis to support the Subcommittee's initiatives",
      "Draft and review legislation within the Subcommittee's jurisdiction",
      "Represent the Subcommittee in meetings with Members of Congress, interest groups, government agencies, and other stakeholders",
      "Analyze complex documents, legislation, and regulatory materials to prepare briefing materials for Committee members and staff",
      "Provide legal counsel to the Chairman",
      "Develop briefing papers and policy documents",
      "Prepare and support Committee hearings and markups",
      "Contribute to additional projects based on expertise and interests"
    ],
    "qualifications": [
      "Juris Doctor (JD) degree from an accredited law school",
      "Active membership in good standing with a state bar",
      "Minimum 5 years of experience",
      "Strong understanding of federal securities laws and regulations",
      "Excellent analytical, research, and writing skills",
      "Outstanding interpersonal and communication abilities",
      "Demonstrated ability to manage multiple complex projects simultaneously",
      "Experience in analyzing and drafting legislation"
    ],
    "how_to_apply": "Please email Zach.Gates@mail.house.gov to apply with a resume and cover letter.",
    "salary_info": null,
    "contact": "Zach.Gates@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-051-25",
    "position_title": "DISTRICT STAFF ASSISTANT - Communications and O&ice Logistics",
    "office": "Office of U.S. Representative Greg Landsman (OH-01)",
    "location": "Cincinnati and Lebanon, OH",
    "posting_date": "2025-03-03",
    "description": "The O&ice of U.S. Representative Greg Landsman (OH-01) seeks an organized and proactive professional to serve as a Sta& Assistant in our Cincinnati and Lebanon, OH o&ices.\n\nThis position is responsible for driving the Congressman to and from the airport on ﬂy-in and ﬂy-out days and to and from district events. Additionally, the role serves as a critical part of the communications team, capturing photos; videos and writing copy for the Congressman’s social media and public communications. Lastly, this role will support district o&ice operations by serving as the point of contact for o&ice logistics, including managing equipment, shipping and receiving supplies, and essential IT support, such as helping with onboarding and o&boarding new hires and interns.\n\nCandidates for this role should have an exceptional driving record, a car, and car insurance. They should also have a background in graphic design, video production, photography, or social media. The ideal candidate should also possess strong writing and communication skills, exceptional customer service; time management and organizational skills, paying close attention to detail. The ability to prioritize and follow through on multiple competing priorities in a fast-paced environment is foundational to working in the o&ice.\n\nA valid U.S. driver’s license and consistent access to a vehicle are required for the position.",
    "responsibilities": [
      "Driving the Congressman to and from the airport on fly-in and fly-out days and to and from district events.",
      "Capturing photos, videos and writing copy for the Congressman’s social media and public communications.",
      "Supporting district office operations by serving as the point of contact for office logistics, including managing equipment, shipping and receiving supplies, and essential IT support, such as helping with onboarding and offboarding new hires and interns."
    ],
    "qualifications": [
      "Exceptional driving record, a car, and car insurance.",
      "Background in graphic design, video production, photography, or social media.",
      "Strong writing and communication skills.",
      "Exceptional customer service, time management and organizational skills, paying close attention to detail.",
      "Ability to prioritize and follow through on multiple competing priorities in a fast-paced environment.",
      "A valid U.S. driver’s license and consistent access to a vehicle"
    ],
    "how_to_apply": "To apply, please email reginald.harris@mail.house.gov with “Sta& Assistant” in the subject line and the following application materials attached as one combined PDF:\n• Cover letter\n• Resume\n• Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\n• An attachment or link to any video editing, photography, and/or social media content entirely produced by the applicant\nNo phone calls or drop bys, please.",
    "salary_info": "$45,000-$55,000, commensurate with experience.",
    "contact": "reginald.harris@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The o&ice is an equalopportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-047-25",
    "position_title": "Caseworker",
    "office": "Office of Congressman Brad Sherman (CA-32)",
    "location": "Sherman Oaks",
    "posting_date": "2025-03-03",
    "description": "Caseworker responsibilities include: Interact with constituents via phone, email and in-office meetings; Assist senior staff with administrative responsibilities; Input, file and review constituent inquiries; Contact federal agencies on behalf of constituents.\n\nApplicant should be organized, professional, highly motivated and must possess strong writing, typing and interpersonal skills. Must be able to work in a fast-paced environment and meet deadlines. Proficiency with Microsoft Office and database software preferred.\n\nPosition is entry-level, but past experience in a social work or government field is preferred.\n\nCandidate should have graduated from an accredited four-year college or university with a bachelor's degree.",
    "responsibilities": [
      "Interact with constituents via phone, email and in-office meetings",
      "Assist senior staff with administrative responsibilities",
      "Input, file and review constituent inquiries",
      "Contact federal agencies on behalf of constituents"
    ],
    "qualifications": [
      "Organized, professional, highly motivated",
      "Strong writing, typing and interpersonal skills",
      "Able to work in a fast-paced environment and meet deadlines",
      "Proficiency with Microsoft Office and database software preferred",
      "Past experience in a social work or government field is preferred",
      "Graduated from an accredited four-year college or university with a bachelor's degree"
    ],
    "how_to_apply": "Please submit cover letter and resume attn: Scott Abrams to scott.abrams@mail.house.gov . No calls please",
    "salary_info": "Salary starts at $45,000 annually, with additional considerations made for relevant experience. We offer a generous student loan reimbursement package.",
    "contact": "scott.abrams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-046-25",
    "position_title": "Counsel (JD required) or Professional Staff Member",
    "office": "House Committee on Homeland Security Republican Staff",
    "location": null,
    "posting_date": "2025-03-03",
    "description": "The House Committee on Homeland Security Republican Staff is hiring for a Counsel (JD required) or Professional Staff Member supporting the Director of Investigations and the Subcommittee on Oversight, Investigations, and Accountability.\n\nThe ideal candidate will have at least two years of experience with a background or strong interest in congressional oversight and investigations. Experience in homeland security issues is a plus.",
    "responsibilities": [
      "Staffing Subcommittee and some Full Committee congressional hearings",
      "Drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations",
      "Conducting depositions/ transcribed interviews",
      "Reviewing document productions, legislation, research",
      "Managing external sources of information",
      "Interacting with various congressional committee and personal offices"
    ],
    "qualifications": [
      "Must possess a strong work ethic, superior attention to detail, be self-motivated, work well under pressure, and possess excellent written and oral communication skills.",
      "The ability to work both independently and as part of a team are critical.",
      "Prior Hill experience preferred."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to Resumes.CHS@mail.house.gov with the subject line “OIA Counsel <Applicant First and Last Name> - OIA Counsel” or “OIA PSM - <Applicant First and Last Name>.”",
    "salary_info": null,
    "contact": "Resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-042-25",
    "position_title": "Scheduler",
    "office": "Office of Congressman Gabe Vasquez (NM-02)",
    "location": "Washington, DC",
    "posting_date": "2025-03-03",
    "description": "The O&ice of Congressman Gabe Vasquez (NM-02) seeks an experienced, highly organized, and detail-oriented Scheduler to be based in his Washington, DC o&ice. This is not an entry-level position. Candidates must have exceptional organizational skills, meticulous attention to detail, expertise prioritizing and managing multiple tasks under tight deadlines, and the ability to work under pressure in a fast-paced environment for a battleground Member.\n\nThe Scheduler serves as a key player of the team by managing the Member’s time. This role reports to and works closely with the Chief of Sta& but is expected to be a leader and team player in coordinating closely with the full team regarding the Member’s schedule.",
    "responsibilities": [
      "Evaluating, organizing, and responding to all incoming meeting and event requests in coordination with the Chief of Sta& in a timely manner.",
      "Maintains the Member’s daily and long-term schedule, coordinates travel, and acts as a liaison for the Member with other congressional o&ices, constituents, and stakeholders.",
      "Briefs the Member weekly on upcoming events, meetings, and other scheduling matters in Washington, DC and New Mexico.",
      "Collaborates with the Member and Senior Sta& to determine and ﬁnalize the Member’s daily and long-term schedules, and collect brieﬁng materials (e.g., memos, talking points, and speeches).",
      "Manages Member and o&ice operations in Washington, D.C. including coordination of Member movements, meetings, and o&-campus events.",
      "Works closely with ﬁnancial administrator for travel and o&icial expenses.",
      "Reports directly to the Chief of Sta& and Member."
    ],
    "qualifications": [
      "The ideal candidate will have congressional work experience and prior scheduling experience.",
      "New Mexico ties and Spanish-language proﬁciency are a plus."
    ],
    "how_to_apply": "To apply, please send a cover letter and resume as a single document to NM02applications@mail.house.gov with “Scheduler: [Your Name]” as the subject line.",
    "salary_info": null,
    "contact": "NM02applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; the office does not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-040-25",
    "position_title": "Legislative Director",
    "office": "Congressman Rob Wittman",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "Congressman Rob Wittman is seeking a highly motivated and experienced Legislative Director to lead his legislative agenda and coordinate policy initiatives in his Washington, D.C. office. The Legislative Director would handle the Congressman’s Natural Resources Committee assignment, as well as Energy, Environment and Chesapeake Bay, Tax, Telecom/Broadband, Transportation & Infrastructure, Appropriations and the Budget, Immigration, Labor/Workforce/Federal Employees. In addition, the Legislative Director will have a close working relationship with the Chief of Staff in building and maintaining relationships with other lawmakers, committee staff, and advocacy groups.\n\nThe Legislative Director should be knowledgeable about issues relating to Virginia and VA01, and work closely with the District Director and district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative efforts. Most importantly, the Legislative Director should have a genuine commitment to public service and advocating for the best interests of Virginia’s First District.",
    "responsibilities": [
      "Develop and implement a comprehensive legislative strategy aligned with the Congressman’s priorities and constituents' needs.",
      "Manage and mentor a legislative team, provide guidance, and foster collaboration among staff members.",
      "Build and maintain relationships with other lawmakers, committee staff, advocacy groups, and stakeholders to advance the Congressman’s legislative goals.",
      "Engage with district stakeholders, including local leaders, businesses, and community organizations, to understand their needs and incorporate their perspectives into legislative efforts.",
      "Understand the political landscape and anticipate the implications of legislative actions as it relates to VA-01.",
      "Draft legislation, amendments, and policy papers, ensuring clarity and adherence to congressional procedures.",
      "Maintains up-to-date tracking reports on all legislative items including Sponsored and Cosponsored legislation and letters, provisions in larger bills, and district wins.",
      "Review responses to all constituent mail, and review content produced by the communications team.",
      "Represent the Congressman in meetings with constituents, interest groups, and other legislative offices.",
      "Monitor legislative developments and provide timely updates to the Congressman and his staff."
    ],
    "qualifications": [
      "Minimum of 5 years of experience in legislative affairs, public policy, or a related field, preferably in a congressional office.",
      "Strong understanding of the legislative process and federal government operations.",
      "Excellent writing, research, and communication skills.",
      "Proven ability to work collaboratively in a fast-paced environment and manage multiple priorities.",
      "Commitment to public service and the values of Congressman Wittman.",
      "Virginia ties Preferred"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and references to Carolyn.King@mail.house.gov with the subject line “Legislative Director Application.”",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-034-25",
    "position_title": "Contracts Investigator",
    "office": "House Committee on Veterans’ Aﬀairs (Majority)",
    "location": "Washington, DC",
    "posting_date": "2025-03-03",
    "description": "The House Committee on Veterans’ Aﬀairs Majority staﬀ seeks a subject matter expert on government procurement, contracting, and acquisition.",
    "responsibilities": [
      "Under the supervision of the General Counsel for the Committee, the individual will conduct oversight and develop policies relating to Department of Veterans Aﬀairs (VA) procurement, contracting, and acquisition.",
      "The responsibilities encompass the entire VA, which includes the Veterans Beneﬁts Administration, Veterans Health Administration, National Cemetery Administration, and VA Central Oﬀice organizations. This also covers a wide range of activities such as small-dollar procurement, contracting by negotiation, major acquisition, Federal Supply Schedules, category management, construction, leasing, information technology, health care, research and development, and small business.",
      "Collect technical information and translate it into brieﬁngs, memoranda, hearing materials, and policy recommendations for a general audience.",
      "Meet with congressional staﬀ, veteran service organizations, industry organizations, and internal and external stakeholders.",
      "Perform other duties as assigned by the General Counsel, Committee Deputy Staﬀ Director, and Committee Staﬀ Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Work experience in procurement operations, preferably as a contract specialist or contracting oﬀicer in a federal agency",
      "Command of the Federal Acquisition Regulation and familiarity with major procurement laws",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume to VAR.Resumes@mail.house.gov with “Contracts Investigator “in the subject line. Writing samples and references may be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Veterans are strongly encouraged to apply. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-530-24",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Majority Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs",
    "location": "Washington, DC",
    "posting_date": "2025-03-03",
    "description": "Provide administrative and research support to Subcommittee staff and assists with duties as assigned.\n\nThis is a full-time, on-site position in Washington, DC.",
    "responsibilities": [
      "Maintain Subcommittee archives of activities, including Member and stakeholder engagements.",
      "Travel and conduct oversight visits at agency locations.",
      "Draft trip reports, requests to agencies for information (including tracking deadlines), hearing recaps, and other work product relevant to the Subcommittee’s jurisdiction.",
      "Subcommittee casework as assigned.",
      "Answer telephone and respond to caller inquiries.",
      "Keep abreast of emails, including Member inquiries and agency notifications.",
      "Organize and maintain Subcommittee electronic records, including meeting notes, agency reports, other documents.",
      "Participate in staff-level discussions on legislation being considered; draft policy memoranda as assigned.",
      "Assist with due diligence being performed as part of the Subcommittee’s oversight duties, including requesting information from agencies on matters within the Subcommittee jurisdiction.",
      "Assist with hearing preparation and coordination of hearings, including drafting memoranda and remarks for Chairman.",
      "Attend meetings with agencies, veteran service organizations, and other parties, and maintain notes on such meetings.",
      "Assist with the drafting of memoranda for the full Committee and Subcommittee Chairman on matters within the jurisdiction of the Subcommittee.",
      "Review the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to Subcommittee Members and staff.",
      "Assist with developing policy recommendations and serve as a resource for Members both on and off Committee.",
      "Responsible for all other duties assigned by the full Committee Chairman, Subcommittee Chairman, full Committee Staff Director or Deputy Staff Director, and Subcommittee Staff Director, and assisting other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science.",
      "Strong research skills. Legal research skills (e.g., LexisNexis) is a plus.",
      "Strong writing and editing skills.",
      "Strong Microsoft Office proficiency, including expertise in Word and the ability to use Excel.",
      "Strong organizational skills.",
      "Strong verbal communication.",
      "Excellent attention to detail.",
      "Excellent listening skills.",
      "Strong ability to manage fluctuating workloads and juggle and prioritize tasks, including managing short-, medium-, and long-term tasks.",
      "Team oriented.",
      "Excellent ability to work well under pressure and time constraints.",
      "Problem solving and analytical skills are a plus.",
      "Potential to work independently."
    ],
    "how_to_apply": "Qualified candidates please send their cover letter, resume, and one (1) writing sample to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-523-24",
    "position_title": "Digital Assistant",
    "office": "The Democratic Staff of the House Budget Committee and Ranking Member Brendan F. Boyle (PA-02)",
    "location": "Washington D.C.",
    "posting_date": "2025-03-03",
    "description": "This position involves creating and scheduling content for social media platforms, maintaining the committee’s website, producing multimedia materials (graphics, videos, and infographics), and monitoring digital analytics to optimize outreach. The ideal candidate will have 1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred), proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva), strong writing and editing skills, and a passion for progressive policymaking.\n\nCandidates should be highly organized, comfortable working under tight deadlines, and familiar with social media analytics and website content management systems. A bachelor’s degree in communications, political science, or a related field is preferred.\n\nSalary is commensurate with experience, and the position includes a competitive benefits package.",
    "responsibilities": [],
    "qualifications": [
      "1-3 years of experience in digital communications, social media management, or a similar role (Hill or campaign experience preferred)",
      "Proficiency with design and editing tools (e.g., Adobe Creative Suite, Canva)",
      "Strong writing and editing skills",
      "Familiar with social media analytics and website content management systems",
      "Bachelor’s degree in communications, political science, or a related field is preferred"
    ],
    "how_to_apply": "To apply, email a cover letter, resume, three examples of digital content, and contact information for three references to budget-democrat.jobs@mail.house.gov with the subject line: \"[Name] – Digital Assistant Application.\" Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary is commensurate with experience, and the position includes a competitive benefits package.",
    "contact": "budget-democrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status. Candidates with diverse backgrounds, women, people of color, and LGBTQIA+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-522-24",
    "position_title": "Press Secretary",
    "office": "Office of Congressman Pat Ryan (NY-18)",
    "location": "Washington DC",
    "posting_date": "2025-03-03",
    "description": "The ideal candidate should demonstrate excellent writing and editing skills in addition to a strong work ethic, good sense of humor, and keen attention to detail. The position will require working non-traditional hours.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Drafting talking points and op-eds",
      "Staffing the Congressman for interviews and media events",
      "Planning press conferences and in-district events",
      "Responding to press inquiries",
      "Maintaining relationships and booking interviews with local press outlets",
      "Other tasks as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should submit a cover letter, resume, two writing samples, and three references in a single PDF to ny18resumes@mail.house.gov with the job title and your full name in the subject line (e.g.: “Press Secretary - Bryson Daily). No phone calls, faxes or drop-ins, please. Applications will be considered on a rolling basis.",
    "salary_info": "$60,000 - $80,000, commensurate with experience",
    "contact": "ny18resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-517-24",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Susie Lee (D-NV)",
    "location": "DC",
    "posting_date": "2025-03-03",
    "description": "Congresswoman Susie Lee (D-NV) seeks a highly organized, good-humored, hard-working DC Scheduler to develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC. The DC Scheduler will report to the Chief of Staff and work closely with the Member, DC staff, and District staff, including a District-based scheduler responsible for in-district scheduling. This is not an entry-level role; prior scheduling experience is preferred, and salary will be commensurate with experience.\n\nResponsibilities also include tracking, evaluating, and responding to all invitations and scheduling requests, coordinating travel for the Member, compiling the Congresswoman’s nightly briefing materials, and managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties. Responsibilities will also include providing staffing support, including driving the Congresswoman as needed. Strong candidates will be creative problem solvers, have excellent attention to detail, communicate succinctly and effectively, and thrive in a fastpaced work environment. The position requires the ability to multi-task, work well under pressure, and the flexibility to be responsive to urgent scheduling needs on nights and weekends.",
    "responsibilities": [
      "Develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC.",
      "Tracking, evaluating, and responding to all invitations and scheduling requests.",
      "Coordinating travel for the Member.",
      "Compiling the Congresswoman’s nightly briefing materials.",
      "Managing office operations, including but not limited to facilitating Member meetings and calls, coordinating internal and external events, assisting with onboarding and training for staff and interns, and other administrative duties.",
      "Providing staffing support, including driving the Congresswoman as needed."
    ],
    "qualifications": [
      "Prior scheduling experience is preferred.",
      "Creative problem solvers.",
      "Excellent attention to detail.",
      "Communicate succinctly and effectively.",
      "Thrive in a fast-paced work environment.",
      "Ability to multi-task.",
      "Work well under pressure.",
      "Flexibility to be responsive to urgent scheduling needs on nights and weekends."
    ],
    "how_to_apply": "Candidates should submit in PDF format a resume, cover letter, and three references (including name, title and organization, phone number, email, and relationship to the candidate) to nv03resumes@gmail.com with the following subject line: “Full Name – DC Scheduler.”",
    "salary_info": "salary will be commensurate with experience.",
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-476-24",
    "position_title": "Legislative Assistant (LA)",
    "office": "Congressman Dan Crenshaw (R-TX-02)",
    "location": "Washington, D.C.",
    "posting_date": "2025-03-03",
    "description": "Congressman Dan Crenshaw (R-TX-02) seeks a highly motivated, hard-working Legislative Assistant (LA), based in our Washington, D.C. office. This position reports to the Legislative Director. The LA will handle an economic facing portfolio, including Budget and Appropriations, Financial Services, and Tax, with other issues to follow.\n\nIdeal candidates will have strong written and oral communications skills and be detailoriented, organized, and creative. They must be able to quickly learn the member’s voice and think in a proactive, communications-focused manner.\n",
    "responsibilities": [
      "Communicating clearly and consistently with the Member, Legislative Director, and legislative, communications, and district teams on legislative updates",
      "Preparing and staffing the Member for meetings, and assisting in the drafting of remarks, as needed",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas Working with external stakeholders, Congressional Research Service (CRS), Legislative Counsel, and committee staff to draft legislation based on the Member’s priorities"
    ],
    "qualifications": [
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate and adapt to challenges",
      "Hill experience is required."
    ],
    "how_to_apply": "Qualified applicants should submit a resume and writing sample (no more than 3 pages) as one combined PDF to Kenneth.Depew@mail.house.gov. Include “Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on a rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "Kenneth.Depew@mail.house.gov",
    "equal_opportunity": null
  }
]