[
  {
    "id": "MEM-622-19",
    "position_title": "Legislative Director",
    "office": "Rep. Abigail Spanberger (VA-7)",
    "location": "Washington, DC",
    "posting_date": "2019-11-25",
    "description": "The Office of Rep. Abigail Spanberger (VA-7) is seeking an experienced, highly-motivated Legislative Director to lead the Representative’s legislative work and manage a team of Legislative Assistants and Fellows. The LD will work with the Chief of Staff, Member, and other senior team members to develop a legislative strategy and priorities. S/he will train and supervise the legislative team members, review/approve work from other legislative team members, track legislative accomplishments and statistics, provide vote recommendations, and develop and advance legislative proposals from initial idea to final passage.\n\nThe LD will also work closely with the District team to ensure that the team’s legislative focus aligns with District priorities and legislative ideas are coming from District issues and casework. As the senior member of the Legislative Team and as a member of the office’s Senior Leadership Team, the Legislative Director should be knowledgeable about procedure in the House of Representatives, have a handle on major legislation across policy areas, and be able to provide legislative ideas and process/procedural guidance to other team members.\n\nThe LD will also manage his/her own portfolio of legislative work. The portfolio will have a domestic policy focus, with flexibility as to the specific policy topics. (The portfolio could include some but not all of: healthcare, finance, taxes, appropriations, small business, agriculture, rural broadband, transportation, infrastructure, energy, environment, education, civil rights, workforce development, labor, gun violence prevention.) As the office is currently also in the process of hiring an LA and legislative fellow(s), there is substantial flexibility in portfolios. Cover letters should include a sentence on the portfolio you would like to cover.",
    "responsibilities": [
      "Lead the Representative’s legislative work.",
      "Manage a team of Legislative Assistants and Fellows.",
      "Work with the Chief of Staff, Member, and other senior team members to develop a legislative strategy and priorities.",
      "Train and supervise the legislative team members.",
      "Review/approve work from other legislative team members.",
      "Track legislative accomplishments and statistics.",
      "Provide vote recommendations.",
      "Develop and advance legislative proposals from initial idea to final passage.",
      "Work closely with the District team to ensure that the team’s legislative focus aligns with District priorities and legislative ideas are coming from District issues and casework.",
      "Provide legislative ideas and process/procedural guidance to other team members.",
      "Manage his/her own portfolio of legislative work with a domestic policy focus."
    ],
    "qualifications": [
      "Several years of Hill experience, preferably in the House and ideally in more than one office.",
      "Strong writing and analytical skills.",
      "A substantial policy background.",
      "Attention to detail.",
      "Facility at managing multiple competing tasks.",
      "The ability to operate with grace and humor in a fast-paced environment.",
      "Experience in a frontline or Blue Dog office (advantageous).",
      "Ties to Central Virginia (advantageous).",
      "Advanced education (advantageous).",
      "Management experience (advantageous).",
      "The ability to motivate others (advantageous)."
    ],
    "how_to_apply": "Applicants should email a cover letter, resume, two writing samples, and three references to Spanberger.Inquiries@mail.house.gov with “Legislative Director – [Last Name]” as the subject line. For consideration in the first round of interviews, please apply by 12pm Eastern time on Sunday, December 1. (Applications will continue to be accepted and considered on a rolling basis after that time.)",
    "salary_info": null,
    "contact": "Spanberger.Inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-621-19",
    "position_title": "Legislative Assistant",
    "office": "Rep. Abigail Spanberger (VA-7)",
    "location": "Washington, D.C.",
    "posting_date": "2019-11-25",
    "description": "The Office of Rep. Abigail Spanberger (VA-7) is seeking an experienced, highly-motivated Legislative Assistant. The Legislative Assistant will handle one of the following two portfolios:\n1) Agriculture (including Agriculture Committee work), rural broadband, transportation, infrastructure, and other domestic policy issues.\n2) Healthcare, taxes, finance, small business, workforce development, and other domestic policy issues.",
    "responsibilities": [
      "Drafting and advancing legislative proposals",
      "Preparing the Member for hearings and markups",
      "Meeting with stakeholders and constituents",
      "Providing vote recommendations",
      "Performing additional tasks as assigned"
    ],
    "qualifications": [
      "Policy experience in one or more of those issue areas",
      "Hill experience",
      "Strong writing and analytical skills",
      "Ability to operate with grace and humor in a fast-paced environment",
      "Experience in a frontline or Blue Dog office (advantage)",
      "Ties to Central Virginia (advantage)",
      "Advanced education (advantage)",
      "This is not an entry level position."
    ],
    "how_to_apply": "Applicants should email a cover letter, resume, two writing samples, and three references to Spanberger.Inquiries@mail.house.gov with “Legislative Assistant – [Last Name]” as the subject line. Please include in your cover letter a sentence describing your preferred portfolio.",
    "salary_info": null,
    "contact": "Spanberger.Inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-613-19",
    "position_title": "Legislative Director",
    "office": "Midwest Republican office",
    "location": "Capitol Hill",
    "posting_date": "2019-11-25",
    "description": "Midwest Republican office seeks a detail-oriented, highly motivated and proactive Legislative Director to handle a diverse policy portfolio. The ideal candidate will have 3-5 years of experience on Capitol Hill, with an in-depth understanding of House procedures.",
    "responsibilities": [
      "Drafting legislation",
      "Overseeing committee activity",
      "Making vote recommendations",
      "Writing statements",
      "Drafting legislative memos",
      "Tracking legislation",
      "Meeting with constituents and stakeholders"
    ],
    "qualifications": [
      "Self-starter",
      "Highly motivated",
      "Detailed oriented",
      "Possess strong writing and verbal communication skills"
    ],
    "how_to_apply": "Interested candidates who meet these qualifications should submit their resume, cover letter and a writing sample to ResumeIN@mail.house.gov",
    "salary_info": null,
    "contact": "ResumeIN@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-610-19",
    "position_title": "Senior Advisor",
    "office": "The House Democratic Policy and Communications Committee (DPCC)",
    "location": null,
    "posting_date": "2019-11-25",
    "description": "The House Democratic Policy and Communications Committee (DPCC) seeks a senior staff member to join a dynamic leadership office team.\n\nThis position will work with the Executive Director to design and execute strategies that advance the message priorities and values of the House Democratic Caucus; Assist with planning and execution of regular message meetings for Members and staff; Engage in outreach to Democratic offices and provide support with message strategies and communications planning; Assist with daily tasks and long-term planning as needed.\n\nSuccessful candidates will be creative self-starters, come with ideas and have experience planning meetings and events. They will be organized, politically astute and able to collaborate with others in a tight-knit, fast-paced environment. Familiarity with the House and an understanding of the priorities and values of the House Democratic Caucus, as well as previous experience interacting with elected officials required. Communications experience preferred.\n\nThe position will report to the executive director of the DPCC and work collaboratively with Chair and Co-Chair staff and other leadership staff. Non-traditional work hours are expected.",
    "responsibilities": [
      "Design and execute strategies that advance the message priorities and values of the House Democratic Caucus",
      "Assist with planning and execution of regular message meetings for Members and staff",
      "Engage in outreach to Democratic offices and provide support with message strategies and communications planning",
      "Assist with daily tasks and long-term planning as needed"
    ],
    "qualifications": [
      "Creative self-starters, come with ideas and have experience planning meetings and events",
      "Organized, politically astute and able to collaborate with others in a tight-knit, fast-paced environment",
      "Familiarity with the House and an understanding of the priorities and values of the House Democratic Caucus",
      "Previous experience interacting with elected officials required",
      "Communications experience preferred"
    ],
    "how_to_apply": "Qualified applicants should email a cover letter and resume to jobs.DPCC@mail.house.gov with “DPCC Senior Advisor” in the subject line.",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "We are equal opportunity employers; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-606-19",
    "position_title": "Press Secretary",
    "office": "Midwest Republican",
    "location": "Capitol Hill",
    "posting_date": "2019-11-25",
    "description": "The ideal candidate must be a strong writer, have the ability to work in a fastpace environment and be able to manage multiple tasks.\nIn addition, the successful candidate must have a keen attention to detail and a strong work ethic. Primary responsibilities include writing press releases, opeds, franked mail, managing social media and the official website. The individual would also develop and maintain good relationships with district, state and national media.",
    "responsibilities": [
      "Writing press releases",
      "Opeds",
      "Franked mail",
      "Managing social media",
      "Managing the official website",
      "Develop and maintain good relationships with district, state and national media"
    ],
    "qualifications": [
      "At least two to three years of relevant experience on Capitol Hill"
    ],
    "how_to_apply": "Interested candidates who meet these qualifications should submit their resume, cover letter and a writing sample to ResumeIN@mail.house.gov",
    "salary_info": null,
    "contact": "ResumeIN@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-599-19",
    "position_title": "Communications Director",
    "office": "Progressive Southern California Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-11-25",
    "description": "Progressive Southern California Democrat seeks an experienced Communication Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, energetic, and be attentive to detail. This position will be based in the Member’s Washington, DC office.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets. Moreover, the Communications Director will oversee day-to-day press operations including responding to media inquiries, booking the Member for interviews, pitching news opportunities to media outlets, updating and maintaining the Member’s social media accounts, and producing speeches, talking points, floor statements, press releases, op-eds and e-newsletters. They will also be responsible for managing a Press Secretary and working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations including responding to media inquiries, booking the Member for interviews, pitching news opportunities to media outlets, updating and maintaining the Member’s social media accounts, and producing speeches, talking points, floor statements, press releases, op-eds and e-newsletters.",
      "Managing a Press Secretary and working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging."
    ],
    "qualifications": [
      "Previous press-related experience",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political acumen and instincts",
      "Superior writing, editing, and proof-reading skills",
      "Willing to work extended hours and oftentimes under time constraints, while maintaining a positive demeanor and sense of humor.",
      "Capitol Hill experience is preferred",
      "Fluency in Spanish is a plus."
    ],
    "how_to_apply": "Please e- mail your resume, a cover letter including salary requirements, and a writing sample to\nResume.inbox7@mail.house.gov with “Communications Director Position”\nin the subject line.",
    "salary_info": "$60-75K commensurate with experience",
    "contact": "Resume.inbox7@mail.house.gov",
    "equal_opportunity": "The Office is an Equal Opportunity Employer and all qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-592-19",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Abby Finkenauer (IA-01)",
    "location": "Washington DC or Iowa",
    "posting_date": "2019-11-25",
    "description": "The Office of Congresswoman Abby Finkenauer (IA-01) seeks an experienced, creative, and motivated Communications Director to be a senior member of the team. The ideal candidate will possess excellent written and verbal communication skills, the ability to work in a fast-paced environment, experience developing and pitching stories, and the ability to execute a communications plan encompassing DC and in Iowa activities. The candidate will also have congressional and/or campaign experience, a good sense of humor, be able to foster a positive work environment, and have Iowa ties.\n\nThis position would be based out of Washington DC or Iowa, with associated travel as needed. The Communications Director will be expected to, among other duties: act as the primary spokesperson for the Member; develop and maintain relationships with media outlets in Iowa and nationally; implement a communications plan in-district and in DC; develop and successfully pitch press stories; oversee digital operations; mentor the Press Secretary; develop talking points, speeches, and press releases; hold regular media preparation sessions; work collaboratively with Iowa and national team members on all aspects of the office; and facilitate successful events and earned media in the district.",
    "responsibilities": [
      "Act as the primary spokesperson for the Member",
      "Develop and maintain relationships with media outlets in Iowa and nationally",
      "Implement a communications plan in-district and in DC",
      "Develop and successfully pitch press stories",
      "Oversee digital operations",
      "Mentor the Press Secretary",
      "Develop talking points, speeches, and press releases",
      "Hold regular media preparation sessions",
      "Work collaboratively with Iowa and national team members on all aspects of the office",
      "Facilitate successful events and earned media in the district"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Ability to work in a fast-paced environment",
      "Experience developing and pitching stories",
      "Ability to execute a communications plan encompassing DC and in Iowa activities",
      "Congressional and/or campaign experience",
      "Good sense of humor",
      "Be able to foster a positive work environment",
      "Iowa ties"
    ],
    "how_to_apply": "Please e-mail a detailed resume and two writing samples to IA01Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "IA01Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-587-19",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Senior House Member",
    "location": null,
    "posting_date": "2019-11-25",
    "description": "Senior House Member seeks an experienced communications director to develop and execute press, media, and communications operations. This is not an entry-level position.",
    "responsibilities": [
      "cultivating and maintaining relationships with local and national outlets and reporters",
      "confidentiality, thoughtful discretion, and independent judgement in representing the Member’s position on policy issues",
      "writing speeches, opinions, press releases, statements, book forwards, and other public documents"
    ],
    "qualifications": [
      "exceptional communications (written, verbal, and listening) skills",
      "expertise in all aspects of media standards and relations, including on- and off-record press management",
      "digital media and newsroom experience",
      "a proven attention to detail",
      "the capacity to work under short deadlines in a high profile office",
      "knowledge of the legislative process and current events"
    ],
    "how_to_apply": "To apply, please e-mail a resume, cover letter and two writing samples in a single combined PDF file to NewJobOpening@mail.house.gov with “Communications Director” in the subject line. Drop-ins, phone calls, correspondence, and inquiries sent anywhere other than to the above e-mail address will not be considered.",
    "salary_info": null,
    "contact": "NewJobOpening@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer committed to and benefitting from an inclusive and diverse work environment."
  },
  {
    "id": "MEM-568-19",
    "position_title": "Counsel",
    "office": "House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law",
    "location": null,
    "posting_date": "2019-11-25",
    "description": "The House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law seeks a hard-working lawyer with significant legal experience to serve as counsel.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Subcommittee on matters of law and policy",
      "Drafting legislation",
      "Reviewing documents submitted in response to Committee information requests",
      "Coordinating hearings and witnesses",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to offices both on and off the Subcommittee on matters of antitrust law"
    ],
    "qualifications": [
      "A strong background in antitrust is required.",
      "Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are also strongly preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Antitrust Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-567-19",
    "position_title": "Counsel",
    "office": "The Subcommittee on Oversight and Investigations of the Committee on Energy and Commerce Majority",
    "location": null,
    "posting_date": "2019-11-25",
    "description": "The Subcommittee on Oversight and Investigations of the Committee on Energy and Commerce Majority, seeks a counsel to work on investigative issues related to federal departments and agencies, especially those associated with the committee’s broad jurisdiction. Experience with federal agencies under the committee’s jurisdiction, including environment, energy, public health, communications, or consumer protection, is a plus. Desired skills include experience in congressional oversight and investigations and related processes and procedures.\n\nThis position includes responsibilities in planning and conducting congressional hearings, overseeing federal agencies, conducting research and investigations, writing and editing, and conducting document review and analysis. Successful candidate will be detail-oriented and possess strong communication and writing skills. Applicants should have a record of professional experience; J.D. required unless applicant has significant experience in the areas described for this position.",
    "responsibilities": [
      "Planning and conducting congressional hearings",
      "Overseeing federal agencies",
      "Conducting research and investigations",
      "Writing and editing",
      "Conducting document review and analysis"
    ],
    "qualifications": [
      "Detail-oriented",
      "Strong communication and writing skills",
      "Record of professional experience",
      "J.D. required unless applicant has significant experience in the areas described for this position"
    ],
    "how_to_apply": "Please send resume, cover letter, writing sample, and at least two professional references to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-566-19",
    "position_title": "Legislative Assistant",
    "office": "Rep. Paul Cook’s office",
    "location": "Washington, DC",
    "posting_date": "2019-11-25",
    "description": "Rep. Paul Cook’s office seeks a Legislative Assistant to cover Native American, public lands, environmental, and agricultural issues, among others.\n\nExperience with House Natural Resources Committee, House Appropriations Interior Subcommittee, and/or the Department of the Interior preferred. California or Western state ties preferred. Strong writing proficiency required.\n\nCandidate will be expected to prepare materials for committee hearings and vote recommendations for markups in the House Natural Resources Committee.\n\nThis person will also be responsible for drafting, introducing, and managing legislation related to his/her issue areas. Additionally, this person will work with fellow staffers to prepare vote recommendations for legislation before the House. This person will work with the Communications Director to draft press releases, editorials, and social media posts related to the aforementioned policy areas.\n",
    "responsibilities": [
      "Prepare materials for committee hearings",
      "Prepare vote recommendations for markups in the House Natural Resources Committee",
      "Draft, introducing, and managing legislation related to his/her issue areas",
      "Prepare vote recommendations for legislation before the House",
      "Draft press releases, editorials, and social media posts related to the aforementioned policy areas"
    ],
    "qualifications": [
      "Minimum of 1-2 years legislative-branch, executive-branch, or relevant experience"
    ],
    "how_to_apply": "Please send a resume and cover letter to anna.dove2@mail.house.gov.",
    "salary_info": null,
    "contact": "anna.dove2@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-555-19",
    "position_title": "Press Assistant",
    "office": "Democratic Staff of the Committee on Science, Space and Technology",
    "location": "Washington, DC",
    "posting_date": "2019-11-25",
    "description": "The Democratic Staff of the Committee on Science, Space and Technology seeks a Press Assistant. The ideal candidate will be detail-oriented, have strong writing skills, and a strong work ethic.\n\nHill experience and an interest in science policy is a plus.",
    "responsibilities": [
      "Drafting press releases, statements, and op-eds",
      "Staffing Committee hearings and markups",
      "Assisting with maintenance of the official website and social media platforms"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should email a resume, cover letter, writing sample, and sample social media graphic to sciresumes@mail.house.gov with “Press Assistant” in the subject line.",
    "salary_info": null,
    "contact": "sciresumes@mail.house.gov",
    "equal_opportunity": "We are equal opportunity employers; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2019-11-25",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others. The ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position. Excellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Job responsibilities will include drafting legislation, writing hearing statements and legislative memos, and preparing briefing materials.",
    "responsibilities": [
      "drafting legislation",
      "writing hearing statements and legislative memos",
      "preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "solid grasp of House procedures",
      "deep understanding of relevant policy",
      "excellent writing skills",
      "excellent verbal skills",
      "excellent organizational skills",
      "ability to be a self-starter",
      "ability to work in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-462-19",
    "position_title": "Attorney",
    "office": "The Office of the Law Revision Counsel",
    "location": "U.S. House of Representatives",
    "posting_date": "2019-11-25",
    "description": "The Office of the Law Revision Counsel-a small, nonpartisan office within the U.S. House of Representatives-seeks an attorney to assist in the editing and publishing of the United States Code, the codification of general and permanent Federal statutory law.\n\nIn addition to the basic tasks required to integrate new laws into the Code, other duties may be required, such as reviewing drafts of bills to enact titles as positive law, doing extensive research and editorial work to improve the organization of existing provisions in the Code, and assisting in the continuing modernization of the Office, including support of online and machine readable versions of the Code.\n\nPlease be aware that this is a long-term career position with the Office, not a stepping stone to another position within Congress or the Federal Government.",
    "responsibilities": [
      "reading new laws to determine which provisions should appear in the Code and where",
      "updating the Code to reflect new law and amendments to existing law",
      "writing concise editorial notes to explain amendments, effective dates, references within the text to other laws, and a variety of other legislative concepts",
      "preparing statutory citations and tables",
      "identifying errors in grammar and spelling"
    ],
    "qualifications": [
      "J.D. degree and attorney license in any U.S. jurisdiction or intention to obtain license within one year.",
      "At least one year of professional experience in editing or publishing, preferably in the legal field.",
      "Meticulous attention to detail and dedication to accuracy.",
      "Excellent verbal and written communication skills.",
      "Absolute proficiency in grammar, spelling, and usage.",
      "Ability to analyze and summarize complex legal issues.",
      "Ability to identify issues affecting Federal statutes and explain them clearly and concisely within firmly established parameters."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter with salary requirements to:\nuscodeapplicant@mail.house.gov\n\nApplicants will be evaluated based on the ability to meet the qualifications stated above. Significant weight will be given to the applicant's cover letter. If chosen for an interview, an applicant will be requested to submit a writing sample.",
    "salary_info": null,
    "contact": "uscodeapplicant@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2019-11-25",
    "description": "Qualified candidates should have a minimum of 2 years’ experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects. A flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Ability to meet deadlines",
      "Ability to manage multiple projects",
      "Flexible schedule",
      "Ability to travel throughout the district is required"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]