[
  {
    "id": "MEM-476-22",
    "position_title": "Front Office clerk",
    "office": "House Armed Services Committee (HASC)",
    "location": null,
    "posting_date": "2022-09-26",
    "description": "The House Armed Services Committee (HASC) Front Office is seeking to fill a clerk vacancy. The Front Office clerk position is a non-partisan position that supports both the majority and minority in the effort to support members of the Armed Forces.\n\nThe successful applicant must have a positive attitude and a genuine desire to serve the men and women in uniform. Applicants must possess strong communication, organizational, and writing skills. Customer service skills are a plus.\n\nThis is an excellent entry level opportunity for someone considering a career in national security and government.",
    "responsibilities": [
      "Able to operate in a non-partisan manner to perform essential duties",
      "Filing reporting requirements from the Department of Defense, State Department, and other relevant agencies",
      "Maintaining conference and hearing room schedules",
      "Setting up conference/hearing room spaces for briefings and hearings",
      "Assist with administrative duties including sorting mail, maintaining staff rosters, and other operational duties as assigned by Office Manager, Operations Manager, and/or Personnel Administrator"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should submit a cover letter and resume in a single pdf to Hayden.Ehlich@mail.house.gov with \"FO Clerk - Last Name, First Name\" in the subject line. If interested, please send the required information by 5pm EST on Friday, October 7, 2022. No phone calls please.",
    "salary_info": null,
    "contact": "Hayden.Ehlich@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-472-22",
    "position_title": "Staff Assistant/Driver",
    "office": "Rep. A. Donald McEachin (VA-04)",
    "location": "D.C.",
    "posting_date": "2022-09-26",
    "description": "Duties include driving the Congressman in D.C., helping to manage the front office, answering phones, greeting visitors, processing flag and tour requests, assisting with constituent mail responses, managing the office intern program, and performing other tasks as assigned. The ideal candidate will be energetic, organized, flexible, and efficient, with strong interpersonal skills and a good sense of humor. Access to a car is not required. Ability to work late nights when necessary is a must. Capitol Hill experience and Virginia ties preferred but not required.",
    "responsibilities": [
      "Driving the Congressman in D.C.",
      "Helping to manage the front office",
      "Answering phones",
      "Greeting visitors",
      "Processing flag and tour requests",
      "Assisting with constituent mail responses",
      "Managing the office intern program",
      "Performing other tasks as assigned"
    ],
    "qualifications": [
      "Energetic, organized, flexible, and efficient",
      "Strong interpersonal skills and a good sense of humor",
      "Ability to work late nights when necessary is a must",
      "Capitol Hill experience and Virginia ties preferred but not required."
    ],
    "how_to_apply": "To apply, please send your resume, cover letter, and a brief writing sample in a single PDF document to McEachin.Jobs@mail.house.gov with “Staff Assistant” in the subject line.",
    "salary_info": "$55,000",
    "contact": "McEachin.Jobs@mail.house.gov",
    "equal_opportunity": "Diverse candidates are encouraged to apply. No calls or dropbys, please. Equal opportunity employer."
  },
  {
    "id": "MEM-471-22",
    "position_title": "Staff/Digital Assistant",
    "office": "Rep. Dutch Ruppersberger’s office",
    "location": "Timonium, MD",
    "posting_date": "2022-09-26",
    "description": "The ideal candidate is an organized, empathetic, self-starter with excellent interpersonal communication and time management skills.\n\nThis is a utility position that is responsible for managing all administrative duties, such as, answering phones, drafting letters, processing vouchers, invoices, and staff reimbursements, preparing congressional citations, processing mail, and other duties as needs arise. The Digital Assistant portion of the position would require you to manage our website, coordinate all social media (Twitter, Instagram and YouTube), and assist our Director of Communications as needed.\n\nAccess to a vehicle is required, as driving the Congressman on evenings and weekends is sometimes needed.",
    "responsibilities": [
      "Managing all administrative duties",
      "Answering phones",
      "Drafting letters",
      "Processing vouchers, invoices, and staff reimbursements",
      "Preparing congressional citations",
      "Processing mail",
      "Managing website",
      "Coordinating all social media (Twitter, Instagram and YouTube)",
      "Assisting Director of Communications"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Ability to work collaboratively",
      "Flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Interested candidates should submit their resume to jasmine.ginn@mail.house.gov.",
    "salary_info": "The starting salary for this position is 45k base pay with an annual bonus structure. We offer a tuition reimbursement program that is a 10k a year benefit for eligible candidates. We earn 12 paid sick days and 15 vacations days each the first year, with one additional day every year after.",
    "contact": "jasmine.ginn@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-470-22",
    "position_title": "Press Secretary/Digital Director",
    "office": "Office of Congresswoman Frederica S. Wilson",
    "location": "DC- and district-based",
    "posting_date": "2022-09-26",
    "description": "The Office of Congresswoman Frederica S. Wilson seeks an experienced, creative, and tech-savvy press secretary/digital director to join our communications team.\n\nThe press secretary/digital director will work closely with the communications director to implement an ambitious communications strategy. Candidates should have strong writing and creative skills, strong editing and proofreading skills, and work well under pressure.\n\nThe ideal candidate will have at least one year or one federal campaign cycle of communications experience, including digital strategy, social media management, content creation, editing of graphics, photos, and videos using multimedia software including Adobe Creative Cloud. Experience with Facebook business manager, Google Ads, and digital analytics is a preferred!\n\nCandidates from diverse backgrounds and with Florida ties are highly encouraged to apply. Fluency in Spanish or Kreyòl is a plus.",
    "responsibilities": [
      "Managing the member’s social media accounts, official website, media lists, newsletters, mailers, advertisements, communications schedule, and other resources",
      "Compiling daily press clips, creating communications briefings, monitoring analytic data",
      "Assisting in the development of materials intended for the media, such as press releases, talking points, newsletters, pitches, media kits, and weekly reports",
      "Creating graphics, editing photos, and videos",
      "Planning and staffing virtual, DC- and district-based events such as press conferences, tele-townhalls, and roundtables.",
      "Building relationships with local and national reporters",
      "Maximizing the member’s visibility through digital solutions and advertising",
      "Pitching innovative strategies to expand the Congresswoman’s reach on social media and elsewhere",
      "Photographing the Congresswoman at press conferences and other events",
      "Managing press interns and fellows"
    ],
    "qualifications": [
      "at least one year or one federal campaign cycle of communications experience, including digital strategy, social media management, content creation, editing of graphics, photos, and videos using multimedia software including Adobe Creative Cloud.",
      "Experience with Facebook business manager, Google Ads, and digital analytics is a preferred!",
      "Fluency in Spanish or Kreyòl is a plus."
    ],
    "how_to_apply": "Please submit your resume, cover letter, two writing samples, and digital samples to FL24.Resumes@mail.house.gov and include “Press Secretary/Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-469-22",
    "position_title": "Legislative Director",
    "office": "Office of Congressman Alma S. Adams, Ph.D.",
    "location": "Washington, DC",
    "posting_date": "2022-09-26",
    "description": "The LD will help drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the Congresswoman's legislative portfolio, and manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.\n\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects.\n\nThis is not an entry level position; extensive Hill experience and knowledge of the legislative process are required. The successful applicant will have crisp and thorough written and oral communications skills, an entrepreneurial and self starting attitude, strong attention to detail, creativity, and be a team player. Supervisory experience and expertise on healthcare policy is strongly preferred.",
    "responsibilities": [],
    "qualifications": [
      "Extensive Hill experience",
      "Knowledge of the legislative process",
      "Crisp and thorough written and oral communications skills",
      "Entrepreneurial and self starting attitude",
      "Strong attention to detail",
      "Creativity",
      "Team player",
      "Supervisory experience (preferred)",
      "Expertise on healthcare policy (preferred)"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples (no more than two pages) to nc12.resume@mail.house.gov. Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with North Carolina ties.\n\nDue to the volume of applications we receive, we will only contact you if we decide to move forward with your application.\n\nPlease no calls, direct emails, or walk-ins. Application deadline is 8pm ET on Friday, September 30, 2022.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-466-22",
    "position_title": "Communications Director",
    "office": "Congressmember Judy Chu (CA-27)",
    "location": "Washington, D.C.",
    "posting_date": "2022-09-26",
    "description": "Responsibilities include managing all aspects of the Congressmember's communications, including writing speeches and press releases, working closely with legislative and district staff to effectively communicate the Member's message, handling daily media inquiries, maintaining relationships with national and local reporters, pitching op-eds, managing the website, producing videos and social media content, planning and pitching press events, overseeing daily clips, and keeping press lists up-to-date.\n\nThis position will also work closely with the Executive Director of the Congressional Asian Pacific American Caucus (CAPAC) to manage the Caucus's press operations. Ideal applicants will have Hill press experience, strong writing and oral communication skills, the ability to multitask and prioritize under pressure, and a great sense of humor.",
    "responsibilities": [
      "Managing all aspects of the Congressmember's communications",
      "Writing speeches and press releases",
      "Working closely with legislative and district staff to effectively communicate the Member's message",
      "Handling daily media inquiries",
      "Maintaining relationships with national and local reporters",
      "Pitching op-eds",
      "Managing the website",
      "Producing videos and social media content",
      "Planning and pitching press events",
      "Overseeing daily clips",
      "Keeping press lists up-to-date",
      "Working closely with the Executive Director of the Congressional Asian Pacific American Caucus (CAPAC) to manage the Caucus's press operations"
    ],
    "qualifications": [
      "Hill press experience",
      "Strong writing and oral communication skills",
      "The ability to multitask and prioritize under pressure",
      "A great sense of humor"
    ],
    "how_to_apply": "To apply, please email a cover letter, resume, and a writing sample as one combined PDF to ca27jobs@gmail.com and list “Communications Director” in the subject line.",
    "salary_info": "The salary range begins at $80,000 and is commensurate with experience. The office offers federal student loan repayment, paid vacation, and paid sick leave, in addition to retirement and health care benefits.",
    "contact": "ca27jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Consistent with applicable law, this office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment."
  },
  {
    "id": "MEM-465-22",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2022-09-26",
    "description": "Duties include assisting the technology needs of Committee staff; editing and maintaining the Committee’s website; answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Applicants must have excellent organizational skills and a professional telephone manner; good computer skills; proficiency in Microsoft Word and Excel; ability to work cooperatively and courteously with others; ability to use good judgment in responding to inquiries and requests; and flexibility in assisting with daily tasks and projects.\n\nApplicants with experience or interest in learning information technology assistance are strongly encouraged to apply. This is an entry level position",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee’s website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance (strongly encouraged)"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$47,093 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-462-22",
    "position_title": "Policy Advisor",
    "office": "Congressional Asian Pacific American Caucus (CAPAC)",
    "location": "Washington, DC",
    "posting_date": "2022-09-26",
    "description": "The Congressional Asian Pacific American Caucus (CAPAC) seeks a Policy Advisor to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with Executive Director and other Caucus staff to advance CAPAC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CAPAC priorities forward",
      "Collaborating with CAPAC Member office staff to further Caucus policy objectives and managing communication with CAPAC policy liaisons",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CAPAC’s policy priorities and familiarity working with the Asian American, Native Hawaiian, and Pacific Islander community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multitask, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to congressional.apa.caucus@gmail.com. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "congressional.apa.caucus@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-461-22",
    "position_title": "LEGISLATIVE DIRECTOR",
    "office": "Congressman Raja Krishnamoorthi (D-IL)",
    "location": "Washington, DC",
    "posting_date": "2022-09-26",
    "description": "Congressman Raja Krishnamoorthi (D-IL), a member of the House Permanent Select Committee on Intelligence and the House Oversight Committee (Chairman of the Subcommittee on Economic and Consumer Policy and Member of the Coronavirus Subcommittee) seeks a hardworking Legislative Director to oversee his policy team and legislative agenda.\n\nThis is not an entry-level position and previous policy and Capitol Hill experience is required. The person in this role will also have a legislative portfolio of domestic policy issues, including workforce development, tax, finance, small business, and labor.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff",
      "Manages a legislative team of 4-5 staff",
      "Works closely with the communications team and helps influence the successful messaging of legislative issues",
      "Coordinates the preparation of legislative and policy memos, hearings, and Town Halls",
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise",
      "Occasionally assists with the creation and execution of events in the District and in DC",
      "Regularly monitors activity on the House Floor and the Member’s committees",
      "Builds relationships with district and national stakeholders and advocacy organizations",
      "Takes constituent and advocacy group meetings as necessary"
    ],
    "qualifications": [
      "Works quickly under pressure and manages time efficiently",
      "Is creative and has an entrepreneurial spirit",
      "Possesses strong written and verbal communications skills",
      "5+ years of congressional, policy, or political experience (Capitol Hill experience strongly preferred)",
      "Policy experience in domestic policy issues a plus",
      "Knowledge of or ties to Illinois a plus"
    ],
    "how_to_apply": "Email a cover letter and resume to il08careers@gmail.com with the subline, “Legislative Director: [Your Full Name]”",
    "salary_info": null,
    "contact": "il08careers@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-457-22",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Republican Conference",
    "location": "Capitol Hill",
    "posting_date": "2022-09-26",
    "description": "A conservative Member of the Republican Conference on an “A” committee seeks a Legislative Correspondent/Press Assistant.\n\nThe Legislative Correspondent will work with the Legislative Director to draft responses to constituent inquiries while assisting senior staff with various projects. This position will also be responsible for managing content for social media channels, tracking and analyzing daily press clips and weekly social media traffic, and other communications-centric duties as assigned.\n\nThe ideal candidate will be detail-oriented, creative, and have an interest in legislative issues and communications as well as a strong work ethic. Excellent writing skills are a must, and a writing test will be required as part of the application process. This is an excellent opportunity for a current or former Congressional intern, or a current or former Staff Assistant interested in getting additional exposure to legislative and communications paths within a Congressional office.\n\nCapitol Hill experience and Tennessee ties are strongly preferred.",
    "responsibilities": [
      "Draft responses to constituent inquiries",
      "Assist senior staff with various projects",
      "Manage content for social media channels",
      "Track and analyze daily press clips",
      "Track weekly social media traffic",
      "Other communications-centric duties as assigned"
    ],
    "qualifications": [
      "Detail-oriented",
      "Creative",
      "Interest in legislative issues and communications",
      "Strong work ethic",
      "Excellent writing skills",
      "Capitol Hill experience and Tennessee ties are strongly preferred"
    ],
    "how_to_apply": "Interested applicants should submit their resume with the subject line “Legislative Correspondent/Press Assistant—First Name, Last Name” to tn06jobs@mail.house.gov",
    "salary_info": null,
    "contact": "tn06jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-456-22",
    "position_title": "Staff Assistant",
    "office": "Republican Conference",
    "location": "Capitol Hill",
    "posting_date": "2022-09-26",
    "description": "A conservative Member of the Republican Conference on an “A” committee seeks a Staff Assistant with strong writing skills.\n\nThe Staff Assistant will serve as the first point of contact for the office, coordinate constituent arrangements including tours and flag requests, and assist the Director of Operations and office staff with the daily responsibilities and duties of a Congressional office.\n\nThe ideal candidate will be detail-oriented, creative, possess a strong willingness and desire to learn and grow, and have an interest in legislative issues and a strong work ethic.\n\nCapitol Hill experience and Tennessee ties are strongly preferred.",
    "responsibilities": [
      "Serve as the first point of contact for the office",
      "Coordinate constituent arrangements including tours and flag requests",
      "Assist the Director of Operations and office staff with the daily responsibilities and duties of a Congressional office"
    ],
    "qualifications": [
      "Detail-oriented",
      "Creative",
      "Possess a strong willingness and desire to learn and grow",
      "Have an interest in legislative issues",
      "Strong work ethic",
      "Capitol Hill experience (strongly preferred)",
      "Tennessee ties (strongly preferred)"
    ],
    "how_to_apply": "Interested applicants should submit their resume with the subject line “Staff Assistant—First Name, Last Name” to tn06jobs@mail.house.gov",
    "salary_info": null,
    "contact": "tn06jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-455-22",
    "position_title": "Staff Assistant",
    "office": "Southern California Democratic Office",
    "location": "Capitol Hill",
    "posting_date": "2022-09-26",
    "description": "Southern California Democratic Office seeks Staff Assistant to join front office team.\nCandidates should be well-organized, hard-working, and detail-oriented. High degree of professionalism required, as well as an ability to work a flexible schedule, including long hours. Duties include answering telephone calls, greeting visitors, supervising interns, assisting legislative staff, and driving the Member.\nCapitol Hill experience and California ties preferred. Spanish language skills a plus. MUST have a reliable and safe vehicle and driving record.",
    "responsibilities": [
      "Answering telephone calls",
      "Greeting visitors",
      "Supervising interns",
      "Assisting legislative staff",
      "Driving the Member"
    ],
    "qualifications": [
      "Well-organized",
      "Hard-working",
      "Detail-oriented",
      "High degree of professionalism",
      "Ability to work a flexible schedule, including long hours",
      "Capitol Hill experience preferred",
      "California ties preferred",
      "Spanish language skills a plus",
      "MUST have a reliable and safe vehicle and driving record"
    ],
    "how_to_apply": "Email cover letter, resume, and references to: ryan.viessman@mail.house.gov with subject heading \"Staff Assistant Position.\"\nPlease no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ryan.viessman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-452-22",
    "position_title": "Congressional Aide",
    "office": "Office of Congresswoman Dina Titus (NV-01)",
    "location": "Las Vegas Nevada",
    "posting_date": "2022-09-26",
    "description": "ABOUT US: Congresswoman Dina Titus (NV-01) seeks a highly motivated fulltime Congressional Aide for the district office in Las Vegas Nevada.\n\nTHE OPPORTUNITY: This position acts as a liaison to federal, state, and local municipal agencies on behalf of the Congresswoman and constituents. The position can also entail casework correspondence and verbal communications. The ideal candidate is mission-driven, passionate, and excited about serving the people of Nevada's 1st Congressional District. This person must deeply understand the landscape of the district, its critical stakeholders and be able to act as the Congresswoman’s representative. Portfolios and areas of focus may change depending on the candidate.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman in the Las Vegas office, which can include but is not limited to answering casework correspondence, meeting with constituents and stakeholders, and serving as a liaison with federal, state, and local municipal agencies.",
      "Informs the District Director and the Director of Constituent Services of all happenings in the assigned regions by screening district media sources and interacting with constituents and community organizations.",
      "Has a deep understanding of casework issues and can administer effective intergovernmental solutions.",
      "Assesses casework for problems that require legislative action and makes recommendations.",
      "Prepares periodic reports for the District Director and Director of Constituent Services on pending cases and district activities."
    ],
    "qualifications": [
      "Strong oral and written communication skills.",
      "Thorough knowledge of Southern Nevada.",
      "A valid driver’s license, reliable transportation and appropriate automobile insurance.",
      "Service-oriented attitude, strong organizational skills, proficiency at prioritizing and managing multiple projects at one time",
      "A capacity to work both independently and as part of a team",
      "Thorough knowledge of local, state, and federal agencies and departments.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Prior experience in government, the non-profit sector, community or grassroots organizing is preferred",
      "Spanish language fluency, orally and written, a plus."
    ],
    "how_to_apply": "To apply, please email a cover letter and resume to NV01resumes@gmail.com with the following subject line: [First Name Last Name] - District Representative",
    "salary_info": "This is a salary position and comes with a competitive benefits package that includes health insurance, dental, and can include federal student loan payments.",
    "contact": "NV01resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin. Constituents of the district or those deeply familiar will also be prioritized. No phone calls, faxes, or walk-ins, please."
  }
]