[
  {
    "id": "MEM-051-16",
    "position_title": "Press Assistant and Digital Manager",
    "office": "House Committee on Veterans' Affairs",
    "location": "Washington",
    "posting_date": "2016-02-16",
    "description": "The Republican staff of the House Committee on Veterans' Affairs is seeking a full-time press assistant and digital manager in its Washington office.",
    "responsibilities": [
      "compiling and monitoring press clips",
      "drafting talking points, press releases, speeches and op-eds",
      "managing the committee website and updating social media"
    ],
    "qualifications": [
      "strong written and verbal communication skills",
      "the ability to work in a fast-paced environment",
      "professionalism",
      "a good sense of humor"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to curt.cashour@mail.house.gov with “press assistant” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "curt.cashour@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-050-16",
    "position_title": "Caseworker",
    "office": "Congressman Raul Ruiz, M.D. of California",
    "location": "district offices",
    "posting_date": "2016-02-16",
    "description": "Caseworkers in the Office of Congressman Ruiz assist constituents by navigating complex casework through federal agencies in areas such as veterans’ affairs, social security, housing, immigration. Caseworkers also assess casework and community activities for matters warranting legislative action.",
    "responsibilities": [
      "Assist constituents by navigating complex casework through federal agencies in areas such as veterans’ affairs, social security, housing, immigration.",
      "Assess casework and community activities for matters warranting legislative action."
    ],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Comfortable working both independently and as part of a team",
      "Prior experience working for federal, state, or local government is a plus.",
      "Candidates with fluency or strong verbal and written proficiency in Spanish are strongly preferred.",
      "Strong knowledge or connection with Riverside County and California’s 36th Congressional District is a plus.",
      "Availability for evening and weekend assignments is required."
    ],
    "how_to_apply": "Interested candidates should send their resume and cover letter to Octavio.Gonzalez@mail.house.gov. Please write “Caseworker” in the subject line of your email message.\nPLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "Octavio.Gonzalez@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-048-16",
    "position_title": "Economist/Policy Analyst",
    "office": "U.S Congress Joint Economic Committee (JEC)",
    "location": "Washington",
    "posting_date": "2016-02-16",
    "description": "The Democratic staff of the U.S Congress Joint Economic Committee (JEC) is seeking an economist/policy analyst with substantive experience in applied microeconomics and public policy research. Duties include working collaboratively with JEC staff on a wide variety of U.S. economic policy issues; researching, writing and editing reports on various federal policies and legislative proposals; proposing ideas for new research topics on issues relevant to current public policy debates; aggregating and analyzing economic data; researching, writing and editing briefing documents for Congressional hearings; advising the Ranking Member and the Staff Director on economic issues; communicating with House and Senate Committees, federal agencies and think tanks.",
    "responsibilities": [
      "Working collaboratively with JEC staff on a wide variety of U.S. economic policy issues",
      "Researching, writing and editing reports on various federal policies and legislative proposals",
      "Proposing ideas for new research topics on issues relevant to current public policy debates",
      "Aggregating and analyzing economic data",
      "Researching, writing and editing briefing documents for Congressional hearings",
      "Advising the Ranking Member and the Staff Director on economic issues",
      "Communicating with House and Senate Committees, federal agencies and think tanks"
    ],
    "qualifications": [
      "Advanced degree in Economics or Public Policy required; Ph.D. level preferred",
      "2+ years of professional experience in research and data analysis, including applied microeconomics and public policy",
      "Proficiency with STATA and U.S. Census microdata",
      "Strong background in applied econometrics",
      "Excellent writing skills, with the ability to convey complex policy issues to non-economists",
      "Significant understanding of the American political system",
      "Washington experience preferred"
    ],
    "how_to_apply": "To apply, please submit a cover letter and resume to dems@jec.senate.gov with subject line “Economist/Policy Analyst position.” Applicants who are called for an interview will be asked to submit writing samples and a list of references. Position available immediately. Applications will be considered on a rolling basis.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "dems@jec.senate.gov",
    "equal_opportunity": "The Joint Economic Committee is an equal opportunity employer and does not discriminate on the basis of race, color, gender, age, religion, disability, national origin, uniformed service, genetic information, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-047-16",
    "position_title": "Press Secretary",
    "office": "Southern Republican office",
    "location": null,
    "posting_date": "2016-02-01",
    "description": "Southern Republican office seeking a Press Secretary to implement a comprehensive communications strategy. Responsibilities include working with Legislative team to proactively move message, prepare Member for media events including developing a standard messaging sheet, proactive in identifying new media opportunities, draft press releases, media advisories, newspaper columns, and content for website. Also must be able to implement social media strategy including Facebook, Twitter accounts and website and compile, file and email out media clips.",
    "responsibilities": [
      "Working with Legislative team to proactively move message",
      "Prepare Member for media events including developing a standard messaging sheet",
      "Proactive in identifying new media opportunities",
      "Draft press releases, media advisories, newspaper columns, and content for website",
      "Implement social media strategy including Facebook, Twitter accounts and website",
      "Compile, file and email out media clips"
    ],
    "qualifications": [],
    "how_to_apply": "Please e-mail resume to TN08.HouseJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "TN08.HouseJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-044-16",
    "position_title": "Communications Director",
    "office": "Senior Appropriations Democrat",
    "location": "Washington, DC",
    "posting_date": "2016-02-16",
    "description": "Senior Appropriations Democrat seeks candidates for the position of Communications Director for a fast-paced and highly engaged office. The successful candidate will have excellent written and verbal skills, the proven ability to manage multiple communications projects, and the ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues. S/he will be responsible for coordinating with the legislative team to develop, manage and organize all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website, implementing social media strategy, maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include briefing the Member for interviews, writing and implementing PSAs, interacting with the press as the Member's principal spokesperson and coordinating the Member's overall press relations. Position may include limited legislative portfolio. The ideal candidate will have Hill experience, a depth of legislative and policy knowledge including that of the appropriations process, and Ohio connections a benefit. Candidates must be able to work extended hours and under time pressure, while maintaining a positive attitude and demeanor.",
    "responsibilities": [
      "Coordinating with the legislative team to develop, manage and organize all communications activities",
      "Writing press releases, op-eds, mail pieces, talking points",
      "Organizing press events",
      "Maintaining the official website",
      "Implementing social media strategy",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Briefing the Member for interviews",
      "Writing and implementing PSAs",
      "Interacting with the press as the Member's principal spokesperson",
      "Coordinating the Member's overall press relations",
      "May include limited legislative portfolio"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects",
      "Ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues",
      "Hill experience",
      "Depth of legislative and policy knowledge including that of the appropriations process",
      "Ohio connections a benefit",
      "Ability to work extended hours and under time pressure, while maintaining a positive attitude and demeanor"
    ],
    "how_to_apply": "Please submit resume, cover letter, two writing samples, and salary requirements to Midwestern.Resume@mail.house.gov. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-042-16",
    "position_title": "Communications Director",
    "office": "Southern Republican Member",
    "location": "Hill",
    "posting_date": "2016-02-16",
    "description": "Southern Republican Member seeks Communications Director to manage and coordinate all communications activities, including media contacts for the Member and the office. Previous Hill experience preferred. Candidate must have strong writing, editing, and oral communication skills. Will act as the formal spokesperson and media liaison for the Member. Knowledge of social media including website maintenance required. Applicants will develop and implement media and communications strategy for the Member and must have an understanding of print and broadcast media. Position will also be responsible for a legislative portfolio.",
    "responsibilities": [
      "Manage and coordinate all communications activities",
      "Develop and implement media and communications strategy for the Member"
    ],
    "qualifications": [
      "Previous Hill experience preferred",
      "Strong writing, editing, and oral communication skills",
      "Knowledge of social media including website maintenance",
      "Understanding of print and broadcast media"
    ],
    "how_to_apply": "Email Resume and Cover Letter to: HouseCommsDir@gmail.com",
    "salary_info": null,
    "contact": "HouseCommsDir@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-039-16",
    "position_title": "Field Representative/Caseworker",
    "office": "U.S. House of Representatives",
    "location": "Sacramento County, CA",
    "posting_date": "2016-02-16",
    "description": "Sacramento-area member of the U.S. House of Representatives seeks districtbased Field Representative/Caseworker. Position will proactively assist constituents and maintain positive relationships with a wide variety of local entities and federal agencies. Serve as a liaison among local elected officials and representatives of stakeholder groups when the Congressman is out of the district. Previous experience planning and executing events and organized meetings is a plus. Position requires the ability to regularly travel throughout the district located entirely within Sacramento County. Ideal candidate will be highly self-motivated, articulate, outgoing, have a quick sense of humor, and demonstrate unparalleled organizational skills. Previous relevant experience/regional ties a plus.",
    "responsibilities": [
      "Proactively assist constituents",
      "Maintain positive relationships with a wide variety of local entities and federal agencies",
      "Serve as a liaison among local elected officials and representatives of stakeholder groups when the Congressman is out of the district",
      "Planning and executing events and organized meetings"
    ],
    "qualifications": [
      "Highly self-motivated",
      "Articulate",
      "Outgoing",
      "Quick sense of humor",
      "Unparalleled organizational skills",
      "Previous relevant experience/regional ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter and two writing samples to ca07jobs@gmail.com by 5:00 PM, Thursday, February 4, 2016. Absolutely no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-030-16",
    "position_title": "Scheduler",
    "office": "New England Democrat",
    "location": "DC",
    "posting_date": "2016-02-16",
    "description": "Scheduler oversees the Member's schedule both in district and DC, and works closely with the Member, Chief of Staff and District Director to ensure smooth overall operations. Responsibilities include receiving and tracking scheduling requests, making travel reservations and coordinating all event logistics, managing Member correspondence, and other duties as assigned. The Scheduler also works directly with the Chief of Staff to process and manage expenses, reimbursements, and procurement. Applicants must have strong written and verbal communication skills, the ability to thrive in a fast-paced environment, and be a team player. New England ties preferred but not required. Access to a vehicle a plus.",
    "responsibilities": [
      "Receiving and tracking scheduling requests",
      "Making travel reservations and coordinating all event logistics",
      "Managing Member correspondence",
      "Other duties as assigned",
      "Works directly with the Chief of Staff to process and manage expenses, reimbursements, and procurement"
    ],
    "qualifications": [
      "Strong written and verbal communication skills",
      "Ability to thrive in a fast-paced environment",
      "Team player",
      "New England ties preferred but not required",
      "Access to a vehicle a plus"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and writing sample to hill.jobs@mail.house.gov. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-029-16",
    "position_title": "Communications Director",
    "office": "Senior Democrat",
    "location": null,
    "posting_date": "2016-02-16",
    "description": "Senior Democrat seeks Communications Director to manage legislative and local press priorities. The applicant must be a hard worker who possesses excellent written, verbal and interpersonal skills. The ideal candidate has Hill and political experience.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-027-16",
    "position_title": "Press Secretary/Communications Director",
    "office": "Northeast Republican in the House",
    "location": "Washington, D.C.",
    "posting_date": "2016-02-16",
    "description": "Northeast Republican in the House seeks a hard-working Press Secretary/Communications Director in Washington, D.C. office to implement a dynamic communications strategy. Duties include performing day-to-day operations of an active press office; managing the website and all social media accounts; developing and generating content for press releases, e-newsletters, talking points, speeches, columns, advertisements, and franked mail; and building press relations with local, regional, and DC press.",
    "responsibilities": [
      "Performing day-to-day operations of an active press office",
      "Managing the website and all social media accounts",
      "Developing and generating content for press releases, e-newsletters, talking points, speeches, columns, advertisements, and franked mail",
      "Building press relations with local, regional, and DC press"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Demonstrated abilities in digital media and communication",
      "Previous Hill or campaign experience",
      "Able to execute a media and communications plan in line with the unique priorities of the Congressman and views of the district"
    ],
    "how_to_apply": "Send resume, writing sample, cover letter, and salary range to PressRez@gmail.com.",
    "salary_info": null,
    "contact": "PressRez@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-021-16",
    "position_title": "General Counsel",
    "office": "Senior Member of Congress",
    "location": null,
    "posting_date": "2016-02-01",
    "description": "Senior Member of Congress seeks General Counsel – the ideal candidate would have experience in a wide range of legal and administrative, legislative, and ethics issues relevant to a small government agency. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines. Individuals must be U.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas travel will be required.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-16",
    "position_title": "Global Security/Political Military Affairs Policy Advisor",
    "office": "Commission on Security and Cooperation in Europe",
    "location": null,
    "posting_date": "2016-02-16",
    "description": "Ideal candidate would have experience in areas including: transnational security threats; arms control; monitoring compliance with international instruments; and working with international organizations with a security dimension such as OSCE and NATO. Area studies expertise in Europe and Eurasia is also a plus. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines. Individuals must be U.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas travel will be required.",
    "responsibilities": [],
    "qualifications": [
      "Experience in areas including: transnational security threats; arms control; monitoring compliance with international instruments; and working with international organizations with a security dimension such as OSCE and NATO.",
      "Area studies expertise in Europe and Eurasia is also a plus.",
      "Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work.",
      "Strong commitment to public service",
      "Strong writing, speaking and analytical skills",
      "Proactive, resourceful, well-organized, and able to meet deadlines.",
      "U.S. citizens",
      "Have, or be able to obtain, a Top Secret Clearance."
    ],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-019-16",
    "position_title": "Middle-Eastern Policy Advisor",
    "office": "Commission on Security and Cooperation in Europe",
    "location": null,
    "posting_date": "2016-02-16",
    "description": "The ideal candidate would have extensive and broad experience as a Middle East expert with experience in formulating policies to deal with political movements, security issues, and human rights challenges in the Middle East. Area studies expertise in the Middle East is also a plus as is deep knowledge of Arab cultures and fluency in Arabic language. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines. Individuals must be U.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas travel will be required.",
    "responsibilities": [],
    "qualifications": [
      "Extensive and broad experience as a Middle East expert",
      "Experience in formulating policies to deal with political movements, security issues, and human rights challenges in the Middle East",
      "Area studies expertise in the Middle East is a plus",
      "Deep knowledge of Arab cultures and fluency in Arabic language",
      "Relevant policy experience and advanced degree(s)",
      "Strong commitment to public service",
      "Strong writing, speaking and analytical skills",
      "Proactive, resourceful, well-organized",
      "Able to meet deadlines",
      "U.S. citizens",
      "Have, or be able to obtain, a Top Secret Clearance"
    ],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-018-16",
    "position_title": "Russian Policy Advisor",
    "office": "Commission on Security and Cooperation in Europe",
    "location": null,
    "posting_date": "2016-02-16",
    "description": "The ideal candidate would have extensive and broad expertise as a Russia expert with experience in formulating policies to deal with both security and human rights challenges posed by Russia. Specific expertise on Russia’s interaction with international organizations such as the OSCE and international instruments such as the Conventional Forces in Europe (CFE) treaty and the Open Skies Agreement are a plus. Area studies expertise in Eurasia is also a plus as is proficiency in Russian and other Eurasian languages. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines.",
    "responsibilities": [],
    "qualifications": [
      "U.S. citizens",
      "have, or be able to obtain, a Top Secret Clearance"
    ],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-16",
    "position_title": "Press Secretary",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington, D.C.",
    "posting_date": "2016-02-01",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a press secretary for his Washington office. Spanish skills and Hill experience a plus.",
    "responsibilities": [],
    "qualifications": [
      "Spanish skills a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-454-15",
    "position_title": "Staff Assistant",
    "office": "U.S. Member of Congress in New York",
    "location": "D.C. Office",
    "posting_date": "2016-02-01",
    "description": "Individuals should demonstrate strong interpersonal skills and ability to manage multiple tasks, possess strong computing skills, and have a solid work ethic. Responsibilities include, but are not limited to, answering and screening telephone calls, organizing and managing the front office, greeting constituents and visitors, preparing and coordinating requests for tours, congressional proclamations and other recognitions, monitoring deliveries, tracking and managing office supplies and materials, assisting staff with projects, research and assignments. Must be proficient in Microsoft Word, Outlook and Excel and experience with communications or graphic design is desired but not required.",
    "responsibilities": [
      "Answering and screening telephone calls",
      "Organizing and managing the front office",
      "Greeting constituents and visitors",
      "Preparing and coordinating requests for tours, congressional proclamations and other recognitions",
      "Monitoring deliveries",
      "Tracking and managing office supplies and materials",
      "Assisting staff with projects, research and assignments"
    ],
    "qualifications": [
      "Strong interpersonal skills",
      "Ability to manage multiple tasks",
      "Strong computing skills",
      "Solid work ethic",
      "Proficient in Microsoft Word, Outlook and Excel",
      "Experience with communications or graphic design is desired but not required"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov Please be sure to put STAFF ASSISTANT in the subject line. PLEASE NO WALK-INS OR PHONE CALLS",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-453-15",
    "position_title": "District Caseworker",
    "office": "U.S. Member of Congress in New York",
    "location": "Congressional District Office",
    "posting_date": "2016-02-16",
    "description": "Congressional District Office is seeking a full time Caseworker. A highly motivated and experienced candidate will be responsible for helping navigate constituents through governmental services, particularly in the policy/issue areas of: immigration, veterans’ affairs, social security, housing, and assessing casework and community outreach activities for matters affecting or warranting potential legislative action.\nThe successful candidate must possess previous experience in immigration laws, outreach, organizing and case management. Prior experience working for federal, state or local unit of government is a plus. Ideal candidate must have excellent oral and written skills, the ability to work independently and as part of a team, highly organized, self-motivated and able to perform in a fast pace environment. Bilingual/multilingual is a plus. Valid driver’s license desired. Availability for Evening and Weekend assignments is required.",
    "responsibilities": [
      "Helping navigate constituents through governmental services",
      "Assessing casework and community outreach activities for matters affecting or warranting potential legislative action"
    ],
    "qualifications": [
      "Previous experience in immigration laws, outreach, organizing and case management",
      "Prior experience working for federal, state or local unit of government is a plus",
      "Excellent oral and written skills",
      "Ability to work independently and as part of a team",
      "Highly organized",
      "Self-motivated",
      "Able to perform in a fast pace environment",
      "Bilingual/multilingual is a plus",
      "Valid driver’s license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Please e-mail resume and cover letter to ResumeNY@mail.house.gov. Please be sure to put CASEWORKER in the subject line.\nPLEASE NO WALK-INS OR PHONE CALLS",
    "salary_info": "Salary commensurate with experience",
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-452-15",
    "position_title": "District Representative",
    "office": "U.S. Member of Congress in New York",
    "location": "New York",
    "posting_date": "2016-02-16",
    "description": "Seeking a team player capable of representing the Member and the office of the Congressional district within his/her designated area. Duties for this position include, but are not limited to community outreach activities and public speaking; responding to constituent case work through correspondence, meeting with constituents, as well as, with local businesses, merchants associations, community-based organizations and agencies to assist in navigating the services provided by the federal government. Organizing and participating in community projects and events. Working with the District Director to develop and execute outreach strategies for the district. Serve as liaison to Community Boards, Precincts Councils and Block Associations. Attend and speak at meetings and/or events on the Member's behalf.",
    "responsibilities": [
      "Community outreach activities and public speaking",
      "Responding to constituent case work through correspondence",
      "Meeting with constituents, as well as, with local businesses, merchants associations, community-based organizations and agencies to assist in navigating the services provided by the federal government",
      "Organizing and participating in community projects and events",
      "Working with the District Director to develop and execute outreach strategies for the district",
      "Serve as liaison to Community Boards, Precincts Councils and Block Associations",
      "Attend and speak at meetings and/or events on the Member's behalf"
    ],
    "qualifications": [
      "Must have extraordinary interpersonal skills",
      "Be constituent service oriented",
      "Exhibit a professional demeanor and work ethic",
      "Have excellent writing skills",
      "Bilingual a plus",
      "Highly motivated and organized individual",
      "Detail-oriented",
      "Able to work well under pressure",
      "Valid driver's license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Please send resume and cover letter to ResumeNY@mail.house.gov Please be sure to put DISTRICT REPRESENTATIVE in the subject line. PLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-15",
    "position_title": "Communications Director",
    "office": "U.S. Member of Congress in New York",
    "location": "New York",
    "posting_date": "2016-02-16",
    "description": "U.S. Member of Congress in New York seeking a Communications Director to develop and implement aggressive communications strategy with local and national media. Ideal applicant is a quick and clean writer, detail-oriented, able to juggle numerous tasks successfully and best under tight deadlines.\n\nAvailability for Evening and Weekend assignments is required.",
    "responsibilities": [
      "writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters",
      "coordinating interviews with reporters",
      "set up press events and press conferences",
      "developing relationships with the media",
      "implementing district outreach activities (as it relates to press)",
      "responding to media inquiries",
      "coordinating the office's online and social media operations"
    ],
    "qualifications": [
      "Requires strong written and oral communication skills, creativity, and the ability to work well with legislative and district office staff.",
      "An ideal candidate will possess a minimum of 3-5 years of communications experience, a demonstrated understanding of federal politics and policy and a desire to work in a fast-paced and fluid environment.",
      "Bilingual a plus.",
      "Valid driver's license desired."
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume and three writing samples to ResumeNY@mail.house.gov. Please be sure to put COMMUNICATIONS DIRECTOR in the subject line.\nPLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-449-15",
    "position_title": "Constituent Services Representative",
    "office": "Congressman Brendan Boyle",
    "location": "Norristown district office",
    "posting_date": "2016-02-16",
    "description": "General responsibilities will include working with constituents and federal agencies on individual and community-based issues, answering constituent phone calls, sorting mail, maintaining office files and supply inventories, as well as other administrative tasks as needed.",
    "responsibilities": [
      "Working with constituents and federal agencies on individual and community-based issues",
      "Answering constituent phone calls",
      "Sorting mail",
      "Maintaining office files and supply inventories",
      "Administrative tasks as needed"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Team oriented",
      "Comfortable working both independently and as part of a group",
      "Self-starters, able to take and listen to direction",
      "Willingness to continuously learn new skills",
      "Fluency or strong verbal and written proficiency in Spanish are strongly preferred",
      "Strong working knowledge of or connection with Montgomery County and the 13th congressional district is a plus"
    ],
    "how_to_apply": "Interested candidates should send your resume and cover letter to pa13jobs@gmail.com. Please list “Constituent Services Representative” in the subject line.",
    "salary_info": null,
    "contact": "pa13jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-448-15",
    "position_title": "Special Assistant/Constituent Service Representative",
    "office": "Congressman Brendan Boyle",
    "location": "District Office",
    "posting_date": "2016-02-01",
    "description": "The district office of Congressman Brendan Boyle is looking for a Special Assistant/Constituent Service Representative to help coordinate the Member’s in-district events and other logistics, in addition to working with the constituents of the 13th congressional district.\n\nSuccessful candidates will possess strong oral and written communication skills and a temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner at all times.",
    "responsibilities": [
      "Transporting the Member to in-district and regional events as needed and ensuring the member is keeping to his schedule at all times.",
      "Ensuring that the Member has necessary event related materials, talking points, and other items as needed.",
      "Coordinating event photo records, taking pictures at events of the Member.",
      "Ensuring that the member has all nonspecific event materials available at all times (business cards, office information).",
      "Possessing the ability to exercise discretion and independent judgment with respect to prioritization as related to the member’s schedule and itinerary within specific events.",
      "Other miscellaneous tasks as needed.",
      "Working with constituents in the district office to resolve or address issues with various federal agencies or other community problems.",
      "Answering phones and interacting with constituents via email and written correspondence.",
      "Working with other district staff to maintain office filing system.",
      "Other administrative tasks as needed."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail",
      "Full-time availability",
      "Flexible scheduling (including working evenings and weekends on an as-needed basis)",
      "Ownership of a car and having a valid driver’s license are all required.",
      "Successful applicants will be able to work in a fast paced environment and be able to improvise in a variety of settings.",
      "Previous experience working legislative or government affairs is a plus.",
      "Candidates with a strong working knowledge of the City of Philadelphia, Montgomery County, personal connections or residency in the 13th congressional district and familiarity with local transportation are strongly preferred."
    ],
    "how_to_apply": "Interested candidates should send your resume and cover letter to pa13jobs@gmail.com. Please list “Special Assistant” in the subject line.",
    "salary_info": null,
    "contact": "pa13jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-440-15",
    "position_title": "Staff Assistant",
    "office": "Congressman French Hill (AR-02)",
    "location": "Washington, D.C.",
    "posting_date": "2016-02-01",
    "description": "Congressman French Hill (AR-02) is seeking a Staff Assistant in his\nWashington, D.C. office beginning immediately. General responsibilities\ninclude greeting constituents, answering constituent phone calls, opening and\nsorting mail, guiding U.S. Capitol building tours, processing flag requests,\norganizing supplies and inventory, and assisting staff with administrative and\nlegislative tasks.",
    "responsibilities": [
      "Greeting constituents",
      "Answering constituent phone calls",
      "Opening and sorting mail",
      "Guiding U.S. Capitol building tours",
      "Processing flag requests",
      "Organizing supplies and inventory",
      "Assisting staff with administrative and legislative tasks"
    ],
    "qualifications": [
      "Positive attitude",
      "Strong work ethic",
      "Excellent written and oral communication skills",
      "Social media and other communications experience a strong plus",
      "Self-starters, take and listen to direction",
      "Be able to work both independently and as part of a team",
      "Working knowledge of current events and policy topics",
      "Willingness to assist with daily office tasks",
      "Arkansas ties strongly preferred"
    ],
    "how_to_apply": "Those interested please send your resume and cover letter\nto ar02.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ar02.applications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-438-15",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2016-02-01",
    "description": "Duties include: answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Applicants must have excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  }
]