[
  {
    "id": "MEM-129-16",
    "position_title": "Press Secretary",
    "office": "Progressive Florida Democrat",
    "location": "D.C.",
    "posting_date": "2016-04-16",
    "description": "Progressive Florida Democrat seeks a Press Secretary to serve in his D.C. office. Candidates should be proactive, and possess superior written and oral communication skills (including strong writing, editing, and proofreading capabilities). The ideal candidate will have prior political/legislative and communications experience.",
    "responsibilities": [
      "Establishing and maintaining relationships with national and D.C.-based media",
      "Coordinating all media efforts and communications-related events",
      "Drafting and distributing press releases and media advisories; drafting, editing, and placing op-eds",
      "Pitching stories to reporters, responding to press inquiries, and serving as the point-of-contact for national press",
      "Monitoring media narratives and identifying opportunities to promote the Member",
      "Overseeing franked communications strategy, including: the drafting, design, and distribution of franked mail content; executing telephone town hall events; and managing congressional e-newsletter",
      "Managing the congressional website and ensuring that it features timely content",
      "Coordinating and staffing the Congressman for interviews and events (including occasional night and weekend commitments)",
      "Compiling and distributing press clippings"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a current resume, cover letter with salary requirement, two writing samples (not to exceed one page each), and three references to FL09job@gmail.com. No calls, emails or walk-ins, please.",
    "salary_info": null,
    "contact": "FL09job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-128-16",
    "position_title": "Legislative Assistant",
    "office": "California Republican",
    "location": "DC",
    "posting_date": "2016-04-16",
    "description": "Duties will include tracking legislation and other developments to brief the Member on floor votes and pending legislative matters, developing and implementing policy initiatives in line with office goals, meeting with constituents and other interest groups, and coordinating with DC and district staff regarding legislation, messaging, and events. Qualified candidates must be proactive and hard working with exceptional writing and communication skills and the ability to work effectively in a fast paced environment. Legislative experience required. California ties are a plus.",
    "responsibilities": [
      "Tracking legislation and other developments to brief the Member on floor votes and pending legislative matters",
      "Developing and implementing policy initiatives in line with office goals",
      "Meeting with constituents and other interest groups",
      "Coordinating with DC and district staff regarding legislation, messaging, and events"
    ],
    "qualifications": [
      "Proactive and hard working with exceptional writing and communication skills",
      "Ability to work effectively in a fast paced environment",
      "Legislative experience required",
      "California ties are a plus"
    ],
    "how_to_apply": "Please email resume and cover letter to cagopjobs@gmail.com.",
    "salary_info": null,
    "contact": "cagopjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-119-16",
    "position_title": "Scheduler",
    "office": "House Democrat",
    "location": "Capitol Hill",
    "posting_date": "2016-04-16",
    "description": "House Democrat is seeking an energetic and detail oriented individual to serve as Scheduler. Responsibilities will include, but are not limited to: drafting correspondence; making travel arrangements; developing and managing scheduling system, tracking requests and invitations; schedule maintenance and coordination with district scheduling requests, in addition to providing administrative and clerical support to Member and chief of staff.\n\nSuccessful candidates will demonstrate outstanding interpersonal, written and oral communication skills, be very hard working, highly detail oriented, responsive, organized, will demonstrate acute professional and political judgment, and discretion at all times. In addition to the scheduling responsibilities, the Scheduler will work very closely with the chief of staff on various tasks and projects.\n\n",
    "responsibilities": [
      "Drafting correspondence",
      "Making travel arrangements",
      "Developing and managing scheduling system",
      "Tracking requests and invitations",
      "Schedule maintenance and coordination with district scheduling requests",
      "Providing administrative and clerical support to Member and chief of staff"
    ],
    "qualifications": [
      "Earned Bachelor's degree",
      "Minimum 1-2 years of prior scheduling experience on a campaign or in a Capitol Hill office",
      "Proficiency in Outlook/Excel/Word",
      "Flexibility with work hours per the demands of the Member's schedule",
      "Willingness to learn and adapt",
      "Interest in administrative work",
      "Direct ties to the U.S. Virgin Islands or Caribbean strongly encouraged",
      "Fluency in Spanish is a major plus",
      "Strong work ethic, sense of humor and team players highly desired"
    ],
    "how_to_apply": "Please send resume, cover letter, and 2-3 references to: VI.Resume@mail.house.gov. Please reference “Scheduler” in the subject line. Calls and drop-ins are not encouraged and subject to disqualification.",
    "salary_info": null,
    "contact": "VI.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-118-16",
    "position_title": "Communications Director",
    "office": "Active Democrat House Member",
    "location": "D.C. and the district",
    "posting_date": "2016-04-16",
    "description": "Duties include: managing day-to-day press operations in D.C. and the district, developing communication strategy, drafting press releases, op-eds, talking points and other content, overseeing and planning media events, preparing member, developing relationships with local and national reporters, and working in conjunction with outreach director and district staff. Ideal candidate will have a sense of humor, on-the-record experience and excellent writing skills. Hill or other political experience/California ties a plus.",
    "responsibilities": [
      "Managing day-to-day press operations in D.C. and the district",
      "Developing communication strategy",
      "Drafting press releases, op-eds, talking points and other content",
      "Overseeing and planning media events",
      "Preparing member",
      "Developing relationships with local and national reporters",
      "Working in conjunction with outreach director and district staff"
    ],
    "qualifications": [
      "Sense of humor",
      "On-the-record experience",
      "Excellent writing skills",
      "Hill or other political experience/California ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and two writing samples to ca07jobs@gmail.com. Please, no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-116-16",
    "position_title": "Staff Assistant",
    "office": "Energy and Commerce Committee Democratic Staff",
    "location": null,
    "posting_date": "2016-04-16",
    "description": "The Energy and Commerce Committee Democratic Staff seeks an enthusiastic, highly organized, and detail-oriented Staff Assistant for fastpaced committee office. Responsibilities include answering telephones, greeting visitors, managing office and meeting space, conducting research, organizing and disseminating materials for hearings, and assisting professional staff in preparing for Committee activities.",
    "responsibilities": [
      "Answering telephones",
      "Greeting visitors",
      "Managing office and meeting space",
      "Conducting research",
      "Organizing and disseminating materials for hearings",
      "Assisting professional staff in preparing for Committee activities"
    ],
    "qualifications": [
      "Excellent written, verbal, research, and organizational skills",
      "Ability to juggle multiple tasks with competing priorities",
      "Hill experience preferred"
    ],
    "how_to_apply": "Please submit a cover letter, resume and a short writing sample to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-109-16",
    "position_title": "Scheduler",
    "office": "California Republican",
    "location": "District and DC",
    "posting_date": "2016-04-16",
    "description": "California Republican seeks a high energy, highly-organized, detail-oriented\nScheduler to manage the Member’s District and DC schedule.\n\nAdditional responsibilities include: finances, interns, tours, and flags.\n\nCandidates must be on call and available to assist the Member after regular business hours. Additionally, the Scheduler will work closely with the Chief of Staff and District Director to ensure efficient and seamless office operations.",
    "responsibilities": [
      "Organizing and tracking invitations, meetings, speaking engagements, in District tours and meetings",
      "Scheduling requests for the Member",
      "Managing travel reservations for staff as well as the Member",
      "Finances",
      "Interns",
      "Tours",
      "Flags"
    ],
    "qualifications": [
      "High energy",
      "Very positive attitude",
      "Strong organizational skills",
      "Orientation to detail",
      "Possess strong verbal and written communication skills",
      "Strong interpersonal skills",
      "Savvy political instincts",
      "Poise and ability to thrive in a fast-paced environment",
      "Ability to multi-task",
      "California ties are a plus"
    ],
    "how_to_apply": "Interested parties should email a cover letter and resume to CARepublicanJobs@gmail.com. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "CARepublicanJobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-107-16",
    "position_title": "Senior Legislative Assistant/Legislative Assistant",
    "office": "Congresswoman Gabbard",
    "location": "Washington, DC",
    "posting_date": "2016-04-16",
    "description": "Congresswoman Gabbard is seeking a dynamic, passionate staffer with experience working on Asia-Pacific issues and on the Hill to support her foreign policy work, among other duties.\n\nThis position opening is for a Senior Legislative Assistant/Legislative Assistant, depending on experience and qualifications. The staffer will manage the Members’ work on the Foreign Affairs Committee, with a focus on Asia and the Pacific, as well as the Middle East and North Africa. While the LA’s duties will primarily focus on foreign policy, they will also include a portfolio of issues including Energy, Environment/Natural Resources, and Financial Services. Responsibilities include preparing and staffing the Member for committee hearings, developing and advancing legislation and other policy priorities of the Member, researching and advising the Member on bills and other issues, and representing the Member in meetings and events.\n\nWe are seeking someone to join our fun, team-oriented, hard-working office. The successful candidate will possess a can-do attitude and will be solutions oriented. He or she will also be an independent worker, a self-starter and will possess the capacity to produce high quality work on short deadlines. He or she will also have a demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment. Ideal Candidates should have experience working on Asia-Pacific issues in a policy context, two years of Hill experience, or both. Hawaii ties are a plus.",
    "responsibilities": [
      "Preparing and staffing the Member for committee hearings",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings and events"
    ],
    "qualifications": [
      "Experience working on Asia-Pacific issues in a policy context",
      "Two years of Hill experience, or both",
      "Can-do attitude and will be solutions oriented",
      "Independent worker and a self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment",
      "Hawaii ties are a plus"
    ],
    "how_to_apply": "To submit your application, please email a resume, cover letter, and two short writing samples with the subject line “legislative assistant” to hi02jobs@gmail.com. Please no calls or walk-ins.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-104-16",
    "position_title": "Communications Director",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2016-04-16",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and hard-working communications director to join our Washington, DC-based team.\n\nThe communications director will be responsible for coordinating with the member and legislative team to develop and implement all communications activities for the office, including acting as the member's spokesperson and drafting press releases, newsletters, speeches, and op-eds.\n\nThe successful applicant will be an excellent writer and editor, clear thinker, and persuasive advocate for individual liberty, economic freedom, and the Constitution. He or she must demonstrate a breadth of policy knowledge, familiarity with the legislative process, and the ability to exercise sound, independent judgment. Individuals who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Coordinating with the member and legislative team to develop and implement all communications activities for the office",
      "Acting as the member's spokesperson",
      "Drafting press releases, newsletters, speeches, and op-eds"
    ],
    "qualifications": [
      "BA or equivalent",
      "Journalism experience is preferred",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to mi03.apply@gmail.com. Please include \"communications director applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-098-16",
    "position_title": "Communications Professional",
    "office": "Energy and Commerce Committee Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2016-04-16",
    "description": "The Energy and Commerce Committee Democratic Staff seeks a motivated and hardworking communications professional to join fast-paced three-person communications team. Responsibilities include writing communications materials (news releases, op-eds, talking points and newsletters), managing press inquiries, maintaining strong relationships with reporters who cover the Committee and coordinating with the communications staff of Committee members.",
    "responsibilities": [
      "Writing communications materials (news releases, op-eds, talking points and newsletters)",
      "Managing press inquiries",
      "Maintaining strong relationships with reporters who cover the Committee",
      "Coordinating with the communications staff of Committee members"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Ability to comprehend and summarize complex legislation quickly",
      "Proven ability to perform under pressure while juggling multiple tasks",
      "Sound political judgment",
      "Prior Hill or campaign experience is preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and three writing samples to ecdjobs@mail.house.gov. Please no walk ins or phone calls.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-092-16",
    "position_title": "Communications Director",
    "office": "Active Democrat House Member",
    "location": "D.C. and the district",
    "posting_date": "2016-04-16",
    "description": "Duties include: managing day-to-day press operations in D.C. and the district, developing communication strategy, drafting press releases, op-eds, talking points and other content, overseeing and planning media events, preparing member, developing relationships with local and national reporters, and working in conjunction with outreach director and district staff. Ideal candidate will have a sense of humor, on-the-record experience and excellent writing skills. Hill or other political experience/California ties a plus.",
    "responsibilities": [
      "Managing day-to-day press operations in D.C. and the district",
      "Developing communication strategy",
      "Drafting press releases, op-eds, talking points and other content",
      "Overseeing and planning media events",
      "Preparing member",
      "Developing relationships with local and national reporters",
      "Working in conjunction with outreach director and district staff"
    ],
    "qualifications": [
      "Sense of humor",
      "On-the-record experience",
      "Excellent writing skills",
      "Hill or other political experience/California ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and two writing samples to ca07jobs@gmail.com. Please, no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-091-16",
    "position_title": "Administrative Assistant",
    "office": "Georgia Democrat",
    "location": "Washington, DC",
    "posting_date": "2016-04-16",
    "description": "Responsibilities include serving as confidential assistant to the Chief of Staff and Member, supporting Member’s daily activities, and other tasks as assigned. This position is completely administrative in nature.",
    "responsibilities": [
      "Serving as confidential assistant to the Chief of Staff and Member",
      "Supporting Member’s daily activities",
      "Other tasks as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should submit cover letter, resume, and brief writing sample to GADemJobs@gmail.com. Please include Administrative Assistant in the subject line. No phone calls or drop-bys.",
    "salary_info": null,
    "contact": "GADemJobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-089-16",
    "position_title": "Scheduler",
    "office": "Senior Democratic Member from California",
    "location": "Washington, D.C.",
    "posting_date": "2016-04-16",
    "description": "Responsibilities include maintaining the Member’s daily and long-term schedules, coordinating all travel arrangements, and assisting the Member with meeting requests and changes to the calendar. The Scheduler is responsible for communicating and directing D.C. staff on the materials required for meetings/events and the execution of the daily office schedule. Individuals applying for this position should be prepared to have flexible work hours and be able to adapt to a fast-paced, team oriented, and dynamic environment. Valid driver's license required.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedules",
      "Coordinating all travel arrangements",
      "Assisting the Member with meeting requests and changes to the calendar",
      "Communicating and directing D.C. staff on the materials required for meetings/events and the execution of the daily office schedule"
    ],
    "qualifications": [
      "Flexible work hours",
      "Ability to adapt to a fast-paced, team oriented, and dynamic environment",
      "Valid driver's license required"
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to twaun.samuel@mail.house.gov.",
    "salary_info": null,
    "contact": "twaun.samuel@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-088-16",
    "position_title": "Systems Manager",
    "office": "U.S. Rep. Lloyd Doggett (D)",
    "location": "Washington office",
    "posting_date": "2016-04-16",
    "description": "Texas contacts preferred.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Email cover letter, resume, and three references to: DoggettJobs@mail.house.gov. (No calls please).",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-087-16",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D)",
    "location": null,
    "posting_date": "2016-04-16",
    "description": "U.S. Rep. Lloyd Doggett (D) seeks Legislative Assistant to cover health, education, and other issues. Law or graduate degree and Hill experience preferred. This is not an entry level position. Proven writing and research skills required.",
    "responsibilities": [],
    "qualifications": [
      "Law or graduate degree and Hill experience preferred.",
      "Proven writing and research skills required."
    ],
    "how_to_apply": "Email cover letter, resume, three references, and brief writing sample to: DoggettJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  }
]