[
  {
    "id": "MEM-022-15",
    "position_title": "Caseworker",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2015-01-12",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible constituent services staff as a Caseworker.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nCandidate must be able to deal with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while responding to constituent requests and concerns and meeting deadlines. A successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful. The ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Responding to constituent requests and concerns",
      "Meeting deadlines",
      "Working independently",
      "Thinking outside the box about various constituent issues and community events"
    ],
    "qualifications": [
      "Prior community or casework experience is helpful",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Resident of the District of Columbia or willing to become one"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: (202) 225-1129 (fax) or to dc00.nortonresume@mail.house.gov. NO PHONE CALLS PLEASE!",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-15",
    "position_title": "Tax and Finance Counsel/ Advisor",
    "office": "Ways and Means Committee Member",
    "location": null,
    "posting_date": "2015-01-12",
    "description": "Senior, Progressive, Democratic Ways and Means Committee Member has an opening for a Tax and Finance Counsel/ Advisor to handle tax, pension, financial services, small business, immigration, and homeland security policy.\nThis is not an entry-level position. Ideal candidates have Congressional experience and substantive tax policy/ legal knowledge. Applicants should be strong writers with the abilities to learn quickly, multi-task, and work independently in a fluid environment. Great interpersonal skills and a good sense of humor are a requisite. Women and minorities are encouraged to apply.\nCandidates should be prepared to start as soon as possible.",
    "responsibilities": [],
    "qualifications": [
      "Congressional experience",
      "Substantive tax policy/ legal knowledge",
      "Strong writing abilities",
      "Abilities to learn quickly",
      "Ability to multi-task",
      "Ability to work independently in a fluid environment",
      "Great interpersonal skills",
      "Good sense of humor"
    ],
    "how_to_apply": "Please email a cover letter, resume, and references to leg.job@mail.house.gov. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "leg.job@mail.house.gov",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-018-15",
    "position_title": "Legislative Assistant",
    "office": "Progressive Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-12",
    "description": "Progressive Democratic Member seeks an organized, energetic and savvy Legislative Assistant to handle a broad portfolio focusing on issues concerning our domestic agenda – including health care, the economic development of America’s legacy cities, and immigration. This position requires flexibility and the desire to learn about a number of diverse issues required to push the Member’s goals forward. The selected individual will be joining a fast-paced, team-oriented Washington, D.C. office.\n\nThis is a one year temporary position, but with the potential for permanent placement.",
    "responsibilities": [
      "Monitoring legislative developments on the House floor",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Contributing to floor speeches and other external communications",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "qualifications": [
      "Superior organizational skills",
      "Strong written and oral communication skills",
      "Strong interpersonal skills",
      "Ability to multi-task and thrive in a fast paced environment",
      "Poise, patience and a sense of humor",
      "Michigan ties a plus"
    ],
    "how_to_apply": "Please email a resume and cover letter to Michigan05jobs@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-017-15",
    "position_title": "Executive Assistant",
    "office": "Member of Congress",
    "location": "Washington, DC and Brooklyn, NY",
    "posting_date": "2015-01-12",
    "description": "The Executive Assistant is responsible for assisting with administrative support for the Member of Congress and general office management of the Washington, DC and Brooklyn, NY office staff. Individual must be a dynamic and seasoned professional who is up to the challenge of being the right hand to a busy Member of Congress. Position requires an organized and flexible individual who is able to juggle multiple priorities. Ideal candidate will be self-motivated, detail-oriented, reliable, energetic and well organized. Position involves exposure to sensitive and confidential information, requiring discretion and professionalism. Must have at least 4 to 6 years of administrative experience. Must work well independently, take initiative on projects, and demonstrate skill in thinking conceptually and analytically. Must have excellent verbal and written communication skills and outstanding customer service skills. Experience using Microsoft Office Suite including Word, Excel, Outlook and PowerPoint. Must be a resourceful self-starter who thrives in a fast paced, professional environment.",
    "responsibilities": [
      "Provides administrative support to the Member of Congress.",
      "Coordinates and maintains calendar for the Member of Congress. Coordinates all aspects of meetings, travel, trainings and other events. Monitors deadlines, follows up on delegated tasks, and provides appropriate reminders.",
      "Coordinates any mailings or other distributions of information from the department, both internally and externally.",
      "Provides meeting prep including printing materials and agendas.",
      "Prepares briefing materials and nightly legislative updates collected from Senior Staff.",
      "Initiates telephone calls on the Member of Congress’s behalf.",
      "Greet constituents and coordinate with campaign, district, and Capitol Hill staff.",
      "Collects, compiles, assembles, reproduces, and distributes materials as needed.",
      "Schedules, coordinates, and organizes events such as meetings, conferences.",
      "Provides travel support including booking, monitoring plans, creating binders, completing reimbursements and expense reports.",
      "Completes and assists with special administrative projects, as needed."
    ],
    "qualifications": [
      "BA/BS degree from an accredited college or university and 4 years of executive assistant experience; OR",
      "Eight (8) years of relevant work experience",
      "Proficiency in Microsoft Office Suite.",
      "Excellent interpersonal and customer service skills",
      "Flexible work schedule, primary hours of 9am-5pm but occasional telework on nights and weekends"
    ],
    "how_to_apply": "Interested applicants send resumes to:",
    "salary_info": null,
    "contact": "Bklynny09@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-010-15",
    "position_title": "Communications Director",
    "office": "North Carolina Democratic Congresswoman",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-12",
    "description": "North Carolina Democratic Congresswoman seeks an experienced Communications Director. The ideal applicant will be an excellent writer and editor with a proven ability to prioritize and handle multiple tasks in a fastpaced environment, while meeting tight deadlines.",
    "responsibilities": [
      "planning and implementing national and local media strategies",
      "managing social media platforms",
      "writing press releases, talking points, op-eds and other materials",
      "build and maintain excellent relationships with members of the national and local media and editorial boards",
      "have on-the-record experience"
    ],
    "qualifications": [
      "excellent writer and editor",
      "proven ability to prioritize and handle multiple tasks in a fast-paced environment",
      "Hill experience is highly desired"
    ],
    "how_to_apply": "Please send resume and two writing samples to NCCongressionalJobs@gmail.com. No phone calls, e-mails or walk-ins, please.",
    "salary_info": null,
    "contact": "NCCongressionalJobs@gmail.com",
    "equal_opportunity": "Minorities and women encouraged to apply, North Carolina ties preferred."
  },
  {
    "id": "MEM-009-15",
    "position_title": "Communications Director/Policy Advisor",
    "office": "Senior Democrat",
    "location": null,
    "posting_date": "2015-01-12",
    "description": "Senior Democrat seeks candidates for the position of Communications\nDirector/Policy Advisor for a fast-paced and highly engaged office. The\nsuccessful candidate will have excellent written and verbal skills, the proven\nability to manage multiple communications projects, and the ability to exercise\ndiscretion and independent judgment in the representation of the Member’s\nposition on policy issues. S/he will be responsible for developing, managing\nand coordinating all communications activities, including writing press\nreleases, op-eds, mail pieces, talking points, organizing press events,\nmaintaining the official website, implementing social media strategy,\nmaintaining press database, writing e-newsletters & coordinating Tele-town\nhalls. Duties will also include briefing the Member for interviews, writing and\nimplementing PSAs, interacting with the press as the Member’s principal\nspokesperson and coordinating the Member’s overall press relations. The ideal\ncandidate will have Hill experience, a depth of legislative and policy\nknowledge including that of the appropriations process, and Ohio connections\nof benefit. Candidates must be able to work extended hours and under time\npressure, while maintaining a positive attitude and demeanor.",
    "responsibilities": [
      "Developing, managing and coordinating all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website, implementing social media strategy, maintaining press database, writing e-newsletters & coordinating Tele-town halls.",
      "Briefing the Member for interviews, writing and implementing PSAs, interacting with the press as the Member’s principal spokesperson and coordinating the Member’s overall press relations."
    ],
    "qualifications": [
      "Hill experience",
      "A depth of legislative and policy knowledge including that of the appropriations process",
      "Ohio connections of benefit",
      "Ability to work extended hours and under time pressure, while maintaining a positive attitude and demeanor."
    ],
    "how_to_apply": "Please submit resume, cover letter, two writing samples, and salary requirements to Midwestern.Resume@mail.house.gov with “Communication Director/Policy Advisor” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-15",
    "position_title": "Legislative Director",
    "office": "Progressive Senior Appropriator",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-12",
    "description": "Progressive Senior Appropriator seeks a Legislative Director to lead staff in a team-oriented office and serve as liaison to DHS appropriations subcommittee.",
    "responsibilities": [
      "Supervise day to day activity of legislative staff",
      "Contribute to office communications plan",
      "Proactively promote the office legislative agenda",
      "Manage a personal legislative issue portfolio which may include homeland security, defense, civil rights, judiciary, trade and foreign affairs among others",
      "Perform other related duties as assigned"
    ],
    "qualifications": [
      "Thorough knowledge of the legislative process and House procedures",
      "Previous supervisory experience",
      "Excellent organizational and communication skills",
      "Ability to work under pressure and meet deadlines",
      "Flexibility with priorities and ever changing deadlines",
      "Detail orientation",
      "Ability to meet attendance requirements including a varied and often unpredictable work schedule",
      "Knowledge of immigration/DHS issues, California ties and Spanish proficiency (pluses)"
    ],
    "how_to_apply": "Interested applicants should submit via email the following documents: cover letter, resume and one writing sample. Care should be taken to include each document as a separate attachment in the same email to: SoCalDCstaffOpening@mail.house.gov.",
    "salary_info": null,
    "contact": "SoCalDCstaffOpening@mail.house.gov",
    "equal_opportunity": "People of color, women and LGBT persons strongly encouraged to apply."
  },
  {
    "id": "MEM-414-14",
    "position_title": "Director of Investigations",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2015-01-12",
    "description": "The Committee on Ethics seeks an experienced attorney to serve as the Director of Investigations for the Committee. The Director will manage the Committee’s nonpartisan staff of attorneys and other professionals who are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess a minimum of 5 years of experience with complex investigations, outstanding analytical and written and oral communication skills, and the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is also desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and familiarity with Congress and its unique institutional prerogatives.",
      "Previous management experience preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Director of Investigations” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-409-14",
    "position_title": "Senior Field Deputy",
    "office": "Congressman Xavier Becerra",
    "location": "District office",
    "posting_date": "2015-01-12",
    "description": "The Senior Field Deputy serves as the congressman's liaison with the community, local organizations and government agencies; staff and/or represent the congressman at events; advise the congressman about local issues; help organize community based meetings and events; implement proactive constituent outreach program; prepare Member for speeches and Meetings; draft correspondence. Supervise field team and district activities.\n\nThis position may require work hours beyond the normal 8-hour work day and may also include work on weekends and holidays.",
    "responsibilities": [
      "Serves as the congressman's liaison with the community, local organizations and government agencies",
      "Staff and/or represent the congressman at events",
      "Advise the congressman about local issues",
      "Help organize community based meetings and events",
      "Implement proactive constituent outreach program",
      "Prepare Member for speeches and Meetings",
      "Draft correspondence",
      "Supervise field team and district activities"
    ],
    "qualifications": [
      "Strong written, communication, analytical, and organization skills; an ability to relate well with individuals of diverse backgrounds; impeccable customer service manners; and superior public speaking skills.",
      "Prefer four years of experience working directly with the community at large. Supervisorial experience required.",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point.",
      "Bachelor's degree preferred.",
      "Candidate must have a thorough understanding of government agencies and structure (county, state and federal).",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines, balance multiple projects simultaneously and work under pressure. Attention to detail and accuracy is essential.",
      "Candidate should demonstrate a positive attitude, commitment to excellence, upbeat demeanor and flexibility.",
      "Candidate should expect weekend, some holidays, and after-hours assignments."
    ],
    "how_to_apply": "All interested individuals should email or fax a cover letter, resume (including salary history) to: Resume.California@mail.house.gov or fax (213) 481-1429. No phone calls please.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "Resume.California@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-406-14",
    "position_title": "Legislative Assistant/Counsel, potentially to fill Legislative Director position",
    "office": "Judiciary Committee",
    "location": "Washington, DC",
    "posting_date": "2015-01-12",
    "description": "Progressive Democratic Member of the Judiciary Committee seeks Legislative Assistant/Counsel, potentially to fill Legislative Director position, to staff Member on committee matters. Qualified applicants will also be considered for Legislative Director position. Legislative portfolio will include criminal justice and drug policy, civil rights and civil liberties, immigration, and intellectual property. Responsibilities include assisting with management of legislative staff, preparing materials for hearings, drafting legislation, meeting with stakeholders, writing talking points, coordinating with Communications Director and representing the Member at meetings and events. If selected as Legislative Director, will be responsible for directing legislative agenda, managing legislative staff, and editing constituent correspondence and all other written material. Applicants should have strong organizational, writing, and communication skills and be detail oriented. This is not an entry level position. A JD and substantial Hill experience, including thorough knowledge of House rules and legislative process are required. Should also have ability to work in a fast-paced environment while keeping a sense of humor.\n\nManagement/supervision experience preferred. Tennessee ties are a plus.",
    "responsibilities": [
      "Assisting with management of legislative staff",
      "Preparing materials for hearings",
      "Drafting legislation",
      "Meeting with stakeholders",
      "Writing talking points",
      "Coordinating with Communications Director",
      "Representing the Member at meetings and events",
      "Directing legislative agenda (if selected as Legislative Director)",
      "Managing legislative staff (if selected as Legislative Director)",
      "Editing constituent correspondence and all other written material (if selected as Legislative Director)"
    ],
    "qualifications": [
      "Strong organizational, writing, and communication skills",
      "Detail oriented",
      "A JD",
      "Substantial Hill experience",
      "Thorough knowledge of House rules and legislative process",
      "Ability to work in a fast-paced environment while keeping a sense of humor",
      "Management/supervision experience preferred",
      "Tennessee ties are a plus"
    ],
    "how_to_apply": "Please send a cover letter, resume and two writing samples to cohen.jobs@mail.house.gov. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "cohen.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-401-14",
    "position_title": "Press Secretary",
    "office": "Hawai‘i Democratic member",
    "location": "DC",
    "posting_date": "2015-01-12",
    "description": "Hawai‘i Democratic member seeks a hardworking DC-based Press Secretary to join a busy and proactive team. Applicant must have previous speech writing experience; experience working with the media; thrive at multitasking and working long hours; have sound political judgment; and a social media background.",
    "responsibilities": [
      "speech writing",
      "drafting news releases, talking points, and op-eds",
      "preparing the member for television and print interviews",
      "responding to press inquiries in a timely and appropriate manner",
      "oversee compilation of daily news clips",
      "monitoring the news/social media platforms throughout the day",
      "maintaining and growing the office’s new media presence",
      "developing website content",
      "staffing the member at public events",
      "booking interviews and pitching stories",
      "developing relationships with national and Hawai‘i reporters",
      "managing and updating official website",
      "developing and implementing strategic communications plans"
    ],
    "qualifications": [
      "This is not an entry-level position.",
      "Professional communications and on-the-record experience is required.",
      "Capitol Hill experience and Hawai‘i ties are preferred.",
      "Candidates should have knowledge of the legislative process, as well as the ability to identify local and national press opportunities.",
      "Must be a team player and have a good sense of humor."
    ],
    "how_to_apply": "Please send cover letter, resume, salary requirements, and two writing samples to hi02jobs@gmail.com. Please, no phone calls or drop bys.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-400-14",
    "position_title": "Staff Assistant/Scheduler",
    "office": "Liberal Northeastern House full committee chairman",
    "location": null,
    "posting_date": "2015-01-12",
    "description": "to manage the Members schedule, staff the front desk, greet constituents, and answer telephones and to arrange tours.",
    "responsibilities": [
      "opening and sorting mail and faxes",
      "assisting in data entry and management of the constituent mail system",
      "drafting constituent correspondence",
      "assisting the Member and staff with various projects",
      "some office administration, including maintaining office supplies and supervising office interns"
    ],
    "qualifications": [
      "very positive attitude",
      "strong organizational skills",
      "orientation to detail",
      "strong verbal and written communication skills",
      "the ability to multi-task"
    ],
    "how_to_apply": "Interested parties should email a cover letter and resume to Pa.CongressionalResume@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "Pa.CongressionalResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-397-14",
    "position_title": "Communications Manager",
    "office": "Senior, progressive California member",
    "location": "District",
    "posting_date": "2015-01-12",
    "description": "Senior, progressive California member seeks highly proactive, experienced communications professional to serve as district-based Communications Manager. Responsibilities include developing and implementing a strategic district – based communications plan, including substantial media and constituent outreach. Potential candidate must have proven track record with traditional and ethnic press, broadcast and digital media, and strong pitching skills. Outstanding writing skills are required for varying mediums including: remarks for events, press statements, social media, op-eds, and keynote speeches. Demonstrated ability to organize constituencies and stakeholders is also required. Ideal candidates will have political savvy, depth of communications experience, and desire to work long hours in a fast-paced and results- oriented environment.",
    "responsibilities": [
      "Developing and implementing a strategic district – based communications plan, including substantial media and constituent outreach"
    ],
    "qualifications": [
      "Proven track record with traditional and ethnic press, broadcast and digital media, and strong pitching skills",
      "Outstanding writing skills are required for varying mediums including: remarks for events, press statements, social media, op-eds, and keynote speeches.",
      "Demonstrated ability to organize constituencies and stakeholders"
    ],
    "how_to_apply": "Qualified candidates should submit resume, cover letter, and two writing samples and salary requirements to lee.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "Minority candidates are strongly encouraged to apply."
  },
  {
    "id": "OGC-001-14",
    "position_title": "Paralegal",
    "office": "Office of General Counsel (“OGC”) of the United States House of Representatives",
    "location": null,
    "posting_date": "2015-01-12",
    "description": "The Office of General Counsel (“OGC”) of the United States House of Representatives is accepting applications for the position of Paralegal. OGC is a non-partisan office that provides legal advice and representation, without regard to political affiliation, to the House of Representatives as an institution, as well as to Members, committees, officers, and employees of the House on matters related to their official responsibilities. OGC litigates at both the trial and appellate levels in various courts around the country. It also provides dayto-day legal advice on a broad array of legal issues including, but not limited to, constitutional law, the interpretation and application of federal statutes, the construction and application of House rules, contracts, torts, immigration, and intellectual property. For more information about OGC, please see http://www.ogc.house.gov/.\n\nOGC’s Paralegal will be responsible for formatting, cite checking and proof reading legal pleadings; ensuring that all legal pleadings comply with applicable court rules; filing legal pleadings in federal and state courts; otherwise assisting OGC lawyers as needed, including assisting in preparing them for court appearances; conducting factual research; drafting correspondence; maintaining, managing, and archiving office files; assisting with the management of OGC’s electronic database; assisting with general office management; and performing other tasks that may be assigned from time to time. Normal hours for this position are 9:00 a.m. to 6:00 p.m., although additional hours will be required from time to time.",
    "responsibilities": [
      "Formatting, cite checking and proof reading legal pleadings",
      "Ensuring that all legal pleadings comply with applicable court rules",
      "Filing legal pleadings in federal and state courts",
      "Otherwise assisting OGC lawyers as needed, including assisting in preparing them for court appearances",
      "Conducting factual research",
      "Drafting correspondence",
      "Maintaining, managing, and archiving office files",
      "Assisting with the management of OGC’s electronic database",
      "Assisting with general office management",
      "Performing other tasks that may be assigned from time to time"
    ],
    "qualifications": [
      "Excellent academic credentials",
      "At least five years’ experience as a litigation paralegal or in a similar position",
      "Excellent organizational skills",
      "Excellent research skills",
      "Excellent computer skills (including familiarity with Westlaw, Word/WordPerfect, Adobe Acrobat, PACER and ECF, document review platforms, and database management applications)",
      "Strong writing skills",
      "A non-partisan temperament",
      "The ability to work well with colleagues in a fast-paced environment"
    ],
    "how_to_apply": "Email resume and cover letter to OGC.Employment@mail.house.gov. Your cover letter should indicate the date you are available to start work.",
    "salary_info": null,
    "contact": "OGC.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-395-14",
    "position_title": "Press Secretary",
    "office": "Ohio Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-12",
    "description": "Ohio Democratic Member seeks a hardworking Press Secretary to join a busy and proactive team. Applicant must have previous speech writing experience; thrive at multitasking and working long hours; and, have sound political judgment.\n\nResponsibilities include, but may not be limited to, speech writing, drafting news releases, talking points, and op-eds; responding to press inquiries in a timely and appropriate manner; early daily news clips; monitoring the news/ social media platforms throughout the day; and supervising the development of website and social media content. Duties also include: booking interviews and pitching stories; developing relationships with reporters; organizing events; and developing and implementing media, communications, and public relations strategies. The successful applicant must be a team player, and will work closely with the Chief of Staff, Communications Director, and D.C./ District team.\n\nThis is not an entry-level position. Professional communications and on-the-record experience is required. Hill experience and familiarity with Ohio, especially Northeastern Ohio, is strongly preferred. Candidates should have knowledge of the legislative process, as well as the ability to identify local and national press opportunities. Salary is commensurate with experience.",
    "responsibilities": [
      "Speech writing",
      "Drafting news releases, talking points, and op-eds",
      "Responding to press inquiries in a timely and appropriate manner",
      "Early daily news clips",
      "Monitoring the news/ social media platforms throughout the day",
      "Supervising the development of website and social media content",
      "Booking interviews and pitching stories",
      "Developing relationships with reporters",
      "Organizing events",
      "Developing and implementing media, communications, and public relations strategies"
    ],
    "qualifications": [
      "Professional communications and on-the-record experience is required",
      "Hill experience and familiarity with Ohio, especially Northeastern Ohio, is strongly preferred",
      "Knowledge of the legislative process",
      "Ability to identify local and national press opportunities"
    ],
    "how_to_apply": "Please send cover letter, resume, and three original writing samples to District11Resumes@mail.house.gov with “PRESS SECRETARY” in the subject line. No walk-ins or phone calls",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "District11Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-393-14",
    "position_title": "Deputy Scheduler/Office Manager",
    "office": "Florida Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-12",
    "description": "Responsibilities include organizing and tracking invitations, speaking engagements and scheduling requests for the Member; travel reservations; and coordinating with district office. Additionally, the Deputy Scheduler/Office Manager will work closely with the Chief of Staff to ensure efficient and seamless office operations. Ideal candidates are nimble, can work under pressure, be a team player, and are able to navigate competing demands. Candidates must be on call and available to assist the Member after regular business hours. Applicants must also have excellent organizational skills, strong written and verbal communication skills, strong interpersonal skills, savvy political instincts, poise and ability to thrive in a fast paced environment. This is not an entry-level position. Previous Capitol Hill operational and/or scheduling experience is required. Florida ties preferred.",
    "responsibilities": [
      "Organizing and tracking invitations, speaking engagements and scheduling requests for the Member",
      "Travel reservations",
      "Coordinating with district office",
      "Working closely with the Chief of Staff to ensure efficient and seamless office operations"
    ],
    "qualifications": [
      "Nimble",
      "Able to work under pressure",
      "Team player",
      "Able to navigate competing demands",
      "Must be on call and available to assist the Member after regular business hours",
      "Excellent organizational skills",
      "Strong written and verbal communication skills",
      "Strong interpersonal skills",
      "Savvy political instincts",
      "Poise and ability to thrive in a fast paced environment",
      "Previous Capitol Hill operational and/or scheduling experience is required",
      "Florida ties preferred"
    ],
    "how_to_apply": "Please submit resume to FL23Resume@mail.house.gov. No phone calls, emails or drop-bys.",
    "salary_info": null,
    "contact": "FL23Resume@mail.house.gov",
    "equal_opportunity": null
  }
]