[
  {
    "id": "MEM-049-24",
    "position_title": "Press Secretary/Communications Director",
    "office": "Rep. Mary Peltola’s office",
    "location": "Washington, DC",
    "posting_date": "2024-02-05",
    "description": "Rep. Peltola (AK-AL), member of the Transportation & Infrastructure and Natural Resources Committees, seeks an energetic and well-organized professional to manage her communications portfolio. The position is based in Washington, DC and will travel to the district as needed. Personal or familial ties to Alaska are beneficial but not required.\nCandidates should be self-motivated, diligent, a team player, and able to develop and maintain relationships with local, state, and national media reporters.\nThe ideal candidate will have a passion for practical policymaking and digital organizing / communications in all formats. Other duties include developing messaging and talking points; overseeing all communications materials, including press releases, website content, franked mail, and social media accounts; working with policy staff on short- and long-term communications goals; and regularly briefing and staffing the member.\nSalary is between $70-$90K based on experience. This is not an entry-level position.",
    "responsibilities": [
      "Developing messaging and talking points",
      "Overseeing all communications materials, including press releases, website content, franked mail, and social media accounts",
      "Working with policy staff on short- and long-term communications goals",
      "Regularly briefing and staffing the member"
    ],
    "qualifications": [
      "Strong written and oral communications skills (writing, editing, proofreading) with at least two years of political communications experience including producing Op-Ed’s, Press Releases & other communications",
      "Understanding of print, broadcast, & online social media tools / platforms (Instagram, Facebook, Twitter, CanvaPro, Adobe Premier, etc.)",
      "Strong skills & experience producing excellent written & visual content, including graphics & video, for a variety of social media platforms",
      "An ability to amplify media coverage & grow its impact",
      "Thorough knowledge of the legislative process, procedures & organization of the House – a plus",
      "Familiarity with Alaskan issues and stakeholders—a plus",
      "Ability to work with legislative staff on short / long-term communications goals",
      "Ability to exercise discretion & judgment in the representation of the Representative’s position on policy issues",
      "Must have the ability to prioritize duties & manage staff in a fast-paced work environment while meeting rapid timelines",
      "Ability to translate complex policy issues into simple language",
      "Leading, managing & optimizing production needs surrounding virtual & inperson town hall meetings, public forums, & press conferences & creating graphics & media presentations when required",
      "Proactively pitching national/local media and developing media strategy",
      "Creating e-newsletters & managing the franked communication process for the office",
      "Tracking press and social media analytics"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and two writing samples to: akresumes@mail.house.gov with the “Press Secretary/Communications Director- [NAME]” in the subject line.",
    "salary_info": "$70-$90K based on experience",
    "contact": "akresumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all backgrounds to apply."
  },
  {
    "id": "MEM-046-24",
    "position_title": "District Scheduler & Staff Assistant",
    "office": "U.S. Rep. Rick Larsen",
    "location": "Everett Office",
    "posting_date": "2024-02-05",
    "description": "The District Scheduler & Staff Assistant is responsible for maintaining Rep. Larsen’s district schedule and managing all incoming requests for meetings and visits throughout Washington’s Second Congressional District. As Staff Assistant, this position also provides administrative and special project support to the district offices.\n\nThis position is based in Rep. Larsen’s Everett, WA office and reports directly to the District Director. Together, the district staff works in harmony with the staff in Washington, D.C., and all staff members report to the Chief of Staff.",
    "responsibilities": [
      "Coordinate Rep. Larsen’s in-person and virtual meetings during all district work periods, including visit locations, travel logistics, and other relevant details",
      "Organize and maintain incoming requests from constituents, local organizations, and staff from district and Washington D.C. offices",
      "Serve as an official representative for Rep. Larsen with constituents who contact the office",
      "Undertake special projects as needed including research, progress reporting and data collection",
      "Support district team members in scheduling, event staffing, letter writing, supervising interns, and other administrative support, as required",
      "Drive Rep. Larsen to and from the airport, and other times as needed; these trips are often late at night and early in the morning"
    ],
    "qualifications": [
      "Attention to detail and superb organizational practices",
      "Strong typing skills and proficiency with computer database management",
      "Ability to collaborate continually with fellow members of Rep. Larsen’s staff, in both the district and Washington D.C. offices",
      "Ability to exercise discretion and independent thinking while working on sensitive projects and issues",
      "Valid driver's license and vehicle",
      "Flexibility to work nights and weekends"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to ryan.casey@mail.house.gov or:\n\nOffice of U.S. Rep. Rick Larsen\nC/O Ryan Casey\nDistrict Director\n2930 Wetmore Avenue, Ste. 9F\nEverett, WA 98201",
    "salary_info": "The annual salary for this position depends on relevant experience and ranges from $45,000 - $55,000.",
    "contact": "ryan.casey@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability. We are committed to building and maintaining an organization that reflects the needs and diverse community we serve."
  },
  {
    "id": "MEM-044-24",
    "position_title": "Speechwriter",
    "office": "Representative Josh Gottheimer",
    "location": "Washington, DC",
    "posting_date": "2024-02-05",
    "description": "Representative Josh Gottheimer seeks a Speechwriter for their Washington, DC office.",
    "responsibilities": [
      "Drafting speeches, talking points, press releases, media advisories, op-eds, social media copy, and statements for the Member;",
      "Collaborating with the Member, Chief of Staff, and Communications Director to produce speeches;",
      "Working closely with the District Office to ensure accurate and appropriate messaging of local priorities;",
      "Working closely with the legislative team to ensure accurate and appropriate messaging of the Member’s policy priorities;",
      "Executing other press responsibilities as needed and assigned."
    ],
    "qualifications": [
      "A Bachelor’s degree or related job experience;",
      "1-2 years of communications experience in a Congressional office, on a political campaign, or in another fast-paced environment;",
      "Excellent attention to detail;",
      "Sound judgment;",
      "Strong communication skills;",
      "The ability to write clearly, persuasively, and concisely about a variety of topics;",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner;",
      "The ability to work collaboratively;",
      "Willingness to accept direction and guidance on performance and process improvements from the Chief of Staff, Member, and Communications Director;",
      "The ability to thrive in a fast-paced environment and work under tight deadlines;",
      "And the ability to work flexible hours including long hours, nights, and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Speechwriter” as the subject line to NJ5Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-042-24",
    "position_title": "Legislative Correspondent/Staff Assistant",
    "office": "Representative Emanuel Cleaver (D-MO)",
    "location": "Washington, D.C.",
    "posting_date": "2024-02-05",
    "description": "This position is responsible for opening and managing the front office each day, greeting visitors, and managing constituent communications, including tour and flag requests. The LC/SA is responsible for maintaining the office's constituent response program and recruiting and managing the DC interns.\n\nThis is a customer service focused position. The ideal candidate has superb organizational and problem-solving skills, attention to detail, strong time and project management skills, a good sense of humor, and a desire to be part of a highly-collaborative, high-achieving team. The successful candidate will have strong writing skills, the ability to communicate clearly in a fast-paced environment and can work effectively with teams in both the DC and District offices. Prior Hill internship and familiarity with the IQ system is preferred. Access to a car and a license in good standing is also helpful.",
    "responsibilities": [
      "Opening and managing the front office each day",
      "Greeting visitors",
      "Managing constituent communications, including tour and flag requests",
      "Maintaining the office's constituent response program",
      "Recruiting and managing the DC interns"
    ],
    "qualifications": [
      "Superb organizational and problem-solving skills",
      "Attention to detail",
      "Strong time and project management skills",
      "Good sense of humor",
      "Desire to be part of a highly-collaborative, high-achieving team",
      "Strong writing skills",
      "Ability to communicate clearly in a fast-paced environment",
      "Ability to work effectively with teams in both the DC and District offices",
      "Prior Hill internship and familiarity with the IQ system is preferred",
      "Access to a car and a license in good standing is also helpful"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a cover letter, resume, and writing sample (no more than 4 pages), and a reference",
    "salary_info": "$55,000-57,000, depending on experience. Benefits with this position include health, vision and dental insurance, retirement benefits, paid sick and annual leave, transit or parking benefits, and access to the Student Loan Repayment Program.",
    "contact": "Midwest.Jobs@mail.house.gov with the subject line \"Last Name – LC/Staff Assistant\"",
    "equal_opportunity": "The office is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-041-24",
    "position_title": "Press Secretary/ Communications Director",
    "office": "Rep. Raul Ruiz’s office",
    "location": "Washington, DC",
    "posting_date": "2024-02-05",
    "description": "Rep. Ruiz (CA-25), member of the Energy and Commerce Committee, seeks an energetic and well-organized professional to manage his communications portfolio. The position is based in Washington, DC and will travel to the district as needed. Candidates must have professional fluency in both English & Spanish.\nCandidates should be self-motivated, diligent, a team player, and able to develop and maintain relationships with local state, and national media reporters.\nThe ideal candidate will have a passion for practical policies that unite the country and digital organizing / communications in all formats. Other duties include developing messaging and talking points; overseeing all communications materials, including press releases, website content, franked mail, and social media accounts; working with policy staff on short- and long-term communications goals; and regularly briefing and staffing the member. Salary is between $75-$95K based on experience.\nThis position will mentor /manage appropriate press interns in all offices. This is not an entry-level position.",
    "responsibilities": [
      "Developing messaging and talking points",
      "Overseeing all communications materials, including press releases, website content, franked mail, and social media accounts",
      "Working with policy staff on short- and long-term communications goals",
      "Regularly briefing and staffing the member",
      "Mentoring /managing appropriate press interns in all offices",
      "Leading, managing & optimizing production needs surrounding virtual & inperson town hall meetings, public forums, & press conferences & creating graphics & media presentations when required",
      "Proactively pitching national/local media and developing media strategy",
      "Creating e-newsletters & managing the franked mailers process for the office",
      "Tracking press and social media analytics"
    ],
    "qualifications": [
      "Strong written and oral communications skills (writing, editing, proofreading) with at least two years of political communications experience including producing Op-Ed’s, Press Releases & other communications",
      "Understanding of print, broadcast, & online social media tools / platforms (Instagram, Facebook, Twitter, CanvaPro, Adobe Premier, etc.)",
      "Strong skills & experience producing excellent written & visual content, including graphics & video, for a variety of social media platforms",
      "An ability to amplify media coverage & grow its impact",
      "Thorough knowledge of the legislative process, procedures & organization of the House – a plus",
      "Knowledge of current issues & events in which the Congressman is involved in",
      "Ability to with legislative staff on short / long-term communications goals",
      "Ability to exercise discretion & judgment in the representation of the Congressman's position on policy issues",
      "Must have the ability to prioritize duties & manage staff in a fast-paced work environment while meeting rapid timelines",
      "Ability to translate complex policy issues into simple language, creating talking point summaries"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and two writing samples (one English and one Spanish on two different topics) to: CA25Resumes@mail.house.gov with the “Press Secretary /Communications Director- [NAME]” in the subject line. Applications due by February 9, 2024.",
    "salary_info": "$75-$95K based on experience",
    "contact": "CA25Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all identity groups to apply."
  },
  {
    "id": "MEM-040-24",
    "position_title": "Field Representative",
    "office": "Congresswoman Jill Tokuda",
    "location": "West Hawai'i Island",
    "posting_date": "2024-02-05",
    "description": "Congresswoman Jill Tokuda seeks a part-time Field Representative for West Hawai'i Island. This position will work closely with and report to the District Chief in Hawai'i, and in coordination with the East Hawai'i Island Field Representative. This position requires consistent and effective collaboration with all components of the member's office. Work hours for this position are approximately 20-25 hours per month but could become a full-time position for a candidate with the right skillset.",
    "responsibilities": [
      "Coordinating the Member's visits to West Hawai'i Island, including scheduling meetings and events, and transporting and staffing the Member on-island",
      "Preparing briefing sheets and talking points as needed",
      "Connecting with Washington, D.C. staff on relevant notes and contacts",
      "Staffing the Member as appropriate, taking notes and photos, and ensuring that follow up is conducted",
      "Informing the Member and relevant staff of community events and happenings in West Hawai'i",
      "Preparing and delivering West Hawai'i messages and communications, and representing the Member at events as assigned"
    ],
    "qualifications": [
      "Candidates must be able to work a flexible schedule, including occasional nights and weekends."
    ],
    "how_to_apply": "Interested candidates are requested to submit a cover letter and resume in one attachment to Kendra.Oishi@mail.house.gov.",
    "salary_info": null,
    "contact": "Kendra.Oishi@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-039-24",
    "position_title": "Field Representative",
    "office": "Congresswoman Jill Tokuda",
    "location": "Kauai",
    "posting_date": "2024-02-05",
    "description": "Congresswoman Jill Tokuda seeks a part-time Field Representative for the island of Kauai. This position will work closely with and report to the District Chief in Hawai'i. This position requires consistent and effective collaboration with all components of the member's office. Work hours for this position are approximately 20-25 hours per month but could become a full- time position for a candidate with the right skillset.",
    "responsibilities": [
      "Coordinating the Member's visits to Kauai, including scheduling meetings and events, and transporting and staffing the Member on-island;",
      "Preparing briefing sheets and talking points as needed;",
      "Connecting with Washington, D.C. staff on relevant notes and contacts;",
      "Staffing the Member as appropriate, taking notes and photos, and ensuring that follow up is conducted;",
      "Informing the Member and relevant staff of community events and happenings on Kauai; and",
      "Preparing and delivering Kauai messages and communications, and representing the Member at events as assigned."
    ],
    "qualifications": [
      "Candidates must be able to work a flexible schedule, including occasional nights and weekends."
    ],
    "how_to_apply": "Interested candidates are requested to submit a cover letter and resume in one attachment to Kendra.Oishi@mail.house.gov.",
    "salary_info": null,
    "contact": "Kendra.Oishi@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-033-24",
    "position_title": "Communications Director",
    "office": "Rep. Jill Tokuda",
    "location": "Hawaii",
    "posting_date": "2024-02-05",
    "description": "Rep. Jill Tokuda is seeking an experienced and self-motivated Communications Director for a congressional district that spans every island in the State of Hawaii.\n\nThe position would manage the office’s press and communications operations including developing and executing a communications plan. Previous Hill or political communications experience is preferred, but not required. The ideal candidate would possess strong writing skills, the ability to operate in a fastpaced environment under tight deadlines and be able to collaborate with both the DC and district teams.",
    "responsibilities": [
      "Develops, leads, and executes a communications plan for the office.",
      "Handles interview requests and proactively pitches to media.",
      "Prepares and staffs the Congresswoman for events and interviews.",
      "Drafts press releases, talking points, speeches, newsletters, mailers, and op-eds.",
      "Manages the Communications Aide in the District Office."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should email their cover letter and resume in one attachment to hawaii02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-032-24",
    "position_title": "Legislative Director",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-02-05",
    "description": "In close collaboration with the Member, Chief of Staff, and her communications and district teams, the Legislative Director will oversee the Member’s policy agenda, particularly through her work on the House Appropriations and Natural Resources Committees and manage her legislative team. This position reports to the Chief of Staff and works closely with the COS in formulating the Member’s legislative strategy while uplifting the legislative team in their work.",
    "responsibilities": [],
    "qualifications": [
      "Candidate should have a strong track record of managing, training, and supervising a team in a fast-paced environment, translating authorizing and appropriations priorities into successful outcomes, and developing strong relationships with on- and off-Hill stakeholders.",
      "Sound policy judgement and firm grasp of committee, floor, and other House procedures are musts.",
      "Candidate should have strong verbal and written communication skills fit to keep the Member and full team consistently briefed.",
      "Candidate must be driven, creative, good-humored, skilled at receiving and delivering feedback, and committed to furthering a team-first, collaborative work environment.",
      "Candidate will also oversee the office’s constituent correspondence program.",
      "Nevada ties are a plus, as is experience with immigration, defense, foreign affairs, education, and judiciary issues."
    ],
    "how_to_apply": "To apply, send in a single PDF a resume, cover letter, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to nv03resumes@gmail.com, with the following subject line: “Full Name – Legislative Director.”",
    "salary_info": null,
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-030-24",
    "position_title": "Scheduler/Executive Assistant or Director of Operations",
    "office": "Senior Democratic House Member",
    "location": "Washington, D.C.",
    "posting_date": "2024-02-05",
    "description": "The successful candidate will manage all aspects of the Member's daily and long-term schedule in D.C. and in the District.\n\nThe ideal candidate should be well-organized, detail-oriented, self-motivated, and able to work effectively in a fast-paced office. Prior scheduling experience on the Hill or comparable work environment is preferred.",
    "responsibilities": [
      "Tracking, evaluating, and responding to invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Assisting with budgeting",
      "Vouchering invoices for payment",
      "Some office management, including front office staff and other junior staff, depending on experience."
    ],
    "qualifications": [
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office",
      "Prior scheduling experience on the Hill or comparable work environment is preferred"
    ],
    "how_to_apply": "Applicants should send their resume and cover letter to operations2024@yahoo.com",
    "salary_info": "Salary and job title are commensurate with experience.",
    "contact": "operations2024@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-029-24",
    "position_title": "Staff Assistant",
    "office": "Congressman Mike Flood (NE-01)",
    "location": "Washington, DC",
    "posting_date": "2024-02-05",
    "description": "Congressman Mike Flood (NE-01) seeks a Staff Assistant to join his Washington, DC office.\n\nThe primary responsibility of the staff assistant is to serve as support staff for the operations team to maintain the regular daily functions and operations of the Washington, DC office. This could include answering telephones, greeting visitors to the office, assisting with appointments, scheduling constituent tours, answering constituent requests for general information, giving tours of the Capitol, monitoring deliveries, maintaining the front office, and assisting with other various administrative duties.",
    "responsibilities": [
      "Answering and screening telephone calls for the Member and other staff members.",
      "Greeting and screening visitors.",
      "Assisting individuals who have appointments with the Member or other staff members.",
      "Maintaining handout literature regarding the state and Congress.",
      "Signing for deliveries and forwarding deliveries to appropriate staff members.",
      "Assisting the Operations Director with procurement of office equipment and materials.",
      "Maintaining the office answering machine and tracking voicemails.",
      "Ensuring that requests for assistance are directed to appropriate staff members.",
      "Maintaining the reception room.",
      "Maintaining the office guest book.",
      "Maintaining a list of frequently requested contacts.",
      "Recording visitors' opinions, names, addresses, and other relevant information.",
      "Helping to log mail.",
      "Maintaining and delivering a daily call log to the Member and other staff members.",
      "Fulfilling constituent's flag request order in a timely manner.",
      "Tracking achievements from constituents and sending out weekly Certificates of Recognition.",
      "Coordinating tours of the U.S. Capitol, White House, FBI Headquarters, and additional federal buildings for constituents.",
      "Assisting the Operations Director with oversight and coordination of the internship program.",
      "Performing general typing and administrative assignments."
    ],
    "qualifications": [
      "Position is based in the Washington, DC official office. Regular, predictable, and punctual attendance required for the performance of duties.",
      "Ability to communicate effectively with the Member and office staff, Members and representatives from other offices, constituents, outside organizations, and others.",
      "Work is public-facing and requires frequent interaction with Members of Congress and congressional community and the public, including constituents, in a prompt, courteous and tactful manner.",
      "Work is performed in a front office workstation or other commonly traveled areas of the office, meaning that there should be little expectation of privacy.",
      "Work occasionally requires extended and unscheduled hours.",
      "Must be able to prioritize and perform duties under pressure in a fast-paced environment.",
      "Regularly use typical office equipment, software programs, and methods of communication, including, for example, a computer, email, telephone, smartphone, photocopier, fax machine, etc."
    ],
    "how_to_apply": "To apply, please email your resume, cover letter, and a writing sample to FloodHiring@mail.house.gov.",
    "salary_info": null,
    "contact": "FloodHiring@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-028-24",
    "position_title": "Special Projects & Grant Coordinator",
    "office": "Representative Mary Peltola",
    "location": "Anchorage, AK",
    "posting_date": "2024-02-05",
    "description": "Responsibilities include but are not limited to: maintaining lists of current federal grant opportunities, researching federal, state and/or private grant opportunities for constituents, and drafting letters of support.\n\nThis position will require frequent traveling to remote areas of the state. This is not an entry level position and previous grant researching and writing experience is highly desired. The office is open to a remote position for the right candidate.",
    "responsibilities": [
      "Maintaining lists of current federal grant opportunities",
      "Researching federal, state and/or private grant opportunities for constituents",
      "Drafting letters of support"
    ],
    "qualifications": [
      "Not an entry level position",
      "Previous grant researching and writing experience is highly desired"
    ],
    "how_to_apply": "Interested applicants should email a PDF version of their 1-page resume and cover letter to akresumes@mail.house.gov your first initial and last name and the position title in the subject line (ex: A. Smith Caseworker Application). In the body of the email please include your current title and place of employment.",
    "salary_info": null,
    "contact": "akresumes@mail.house.gov",
    "equal_opportunity": "In all employment decisions, the office will give preference to candidates with ties to Alaska."
  },
  {
    "id": "MEM-027-24",
    "position_title": "Caseworker/Field Representative",
    "office": "Representative Peltola",
    "location": "Fairbanks, AK",
    "posting_date": "2024-02-05",
    "description": "A caseworker acts as a liaison with federal, state, and local agencies for constituents and the Member. Other core responsibilities include answering communications and making recommendations to the District Director on problems requiring legislative action.",
    "responsibilities": [
      "Act as a liaison with federal, state, and local agencies for constituents and the Member.",
      "Answering communications",
      "Making recommendations to the District Director on problems requiring legislative action."
    ],
    "qualifications": [
      "Strong verbal and written communication skills",
      "Careful attention to detail",
      "Ability to navigate bureaucracy with independent judgement and discretion",
      "Knowledge of Alaskan issues and current events"
    ],
    "how_to_apply": "Interested applicants should email a PDF version of their 1-page resume and cover letter to akresumes@mail.house.gov your first initial and last name and the position title in the subject line (ex: A. Smith Caseworker Application). In the body of the email please include your current title and place of employment. In all employment decisions, the office will give preference to candidates with ties to Alaska.",
    "salary_info": null,
    "contact": "akresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-026-24",
    "position_title": "Community Relations Manager",
    "office": "Office of Congresswoman Jill Tokuda",
    "location": "Honolulu Office",
    "posting_date": "2024-02-05",
    "description": "Rep. Jill Tokuda is looking for an enthusiastic and highly motivated individual to join her district staff in her Honolulu Office. This position would manage several congressional programs and projects to a successful execution. Responsibilities would also include acting as a liaison to federal, state, and local governments; conducting community outreach; and attending engagements on behalf of the Member. The ideal candidate would have strong writing skills and the ability to write quickly and effectively, as well as the ability to multi-task and plan long-term projects to completion. Attention to detail and the ability to work in a fastpaced environment is required.",
    "responsibilities": [
      "Oversees the execution of congressional programs and other special projects.",
      "Oversees schedule of regularly attended community meetings and ensures follow up is conducted.",
      "Prepares various written material including correspondence, congratulatory messages, and internal background memoranda for the Member.",
      "Engages in community outreach and constituent relations.",
      "Staffs or represents the Member at events and meetings on Oahu, and other islands as needed, including taking notes and conducting follow up."
    ],
    "qualifications": [
      "Candidates must be able to work a flexible schedule, including occasional nights and weekends."
    ],
    "how_to_apply": "Interested candidates are requested to submit a cover letter and resume to Kendra.Oishi@mail.house.gov.",
    "salary_info": null,
    "contact": "Kendra.Oishi@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-023-24",
    "position_title": "Legislative Assistant",
    "office": "Congressman Gabe Amo (RI-01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-02-05",
    "description": "The primary policy areas of responsibility for this position will include issues related to the House Committee on Foreign Affairs, including Defense, Immigration, and Veterans. Additional policy areas may be assigned based on the strengths, interests, and experiences of the candidate and needs of the office. This position reports to the Legislative Director and will work in close collaboration with the Member, Chief of Staff, and communications and district staff.\n\nThe individual will prepare and staff the Member for meetings, committee activity, and related events. The individual is expected to represent the Member in meetings with constituents, local and national stakeholder organizations, and administration officials. The individual will track legislation, monitor relevant committee and floor activity, track news events, and make recommendations in the assigned legislative areas. The individual will build support for the Member’s legislative agenda through developing and implementing new initiatives and be primarily responsible for drafting legislation, letters, remarks, and other written material related to policy portfolio.\n\nThe office is seeking an individual who is driven, creative, and committed to working in a collaborative work environment. Qualified candidates should have knowledge of the legislative process and demonstrate an ability to take initiative. Hill experience is strongly preferred. This is not an entry-level position. Candidates of diverse backgrounds are encouraged to apply. Rhode Island ties are a plus.",
    "responsibilities": [
      "Prepare and staff the Member for meetings, committee activity, and related events.",
      "Represent the Member in meetings with constituents, local and national stakeholder organizations, and administration officials.",
      "Track legislation, monitor relevant committee and floor activity, track news events, and make recommendations in the assigned legislative areas.",
      "Build support for the Member’s legislative agenda through developing and implementing new initiatives.",
      "Draft legislation, letters, remarks, and other written material related to policy portfolio."
    ],
    "qualifications": [
      "Knowledge of the legislative process.",
      "Ability to take initiative.",
      "Hill experience strongly preferred.",
      "Driven, creative, and committed to working in a collaborative work environment.",
      "Candidates of diverse backgrounds are encouraged to apply.",
      "Rhode Island ties are a plus."
    ],
    "how_to_apply": "To apply, send in a single PDF with a resume, cover letter, and brief writing sample, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01AmoJobs@gmail.com, with the following subject line: “Full Name – Legislative Assistant.”",
    "salary_info": null,
    "contact": "RI01AmoJobs@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-013-24",
    "position_title": "Field Representative/Caseworker",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Cypress, CA",
    "posting_date": "2024-02-05",
    "description": "Under the supervision of the Chief of Staff and the District Director, the Field Representative/ Caseworker acts as the representative for the Member. Field Representative responsibilities include strengthening relationships with key stakeholders, as well as attending engagements on behalf of the Member.\n\nCaseworker responsibilities include helping constituents resolve problems with federal agencies through written and verbal communication.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned",
      "Maintain up-to-date files on all cases and categories of information",
      "Continually manage active cases and serve as a liaison with constituents to ensure that cases are handled in a timely and appropriate manner"
    ],
    "qualifications": [
      "Political savvy and comfortable navigating complicated situations",
      "Strong written, verbal, analytical, and organization skills; impeccable customer service manners; public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including occasional nights/weekends",
      "Bachelor’s degree or related job experience is required. A demonstrated interest in public service and familiarity with Orange and Los Angeles Counties is preferred."
    ],
    "how_to_apply": "Submit a cover letter and resume to Stephanie Hu, District Director, Office of Congresswoman Steel, Stephanie.Hu@mail.house.gov.",
    "salary_info": "Salary starts at $50,000 per year. Salary commensurate with experience.",
    "contact": "Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-636-23",
    "position_title": "Chief of Staff",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "Washington, D.C.",
    "posting_date": "2024-02-05",
    "description": "Congressman Glenn Ivey (MD-04) seeks a seasoned and empathetic manager of\nstaff and leader of his strategic vision based in the Washington, D.C., office with\na background in matters before the House Homeland Security and Judiciary\nCommittees, preferably with a knowledge base in oversight and investigations.\nCandidates with J.D. degrees are strongly encouraged to apply but not required\nand familiarity with the district is preferred.\nWorking for this freshman office represents an opportunity to build something\ndynamic and enduring from the ground up, particularly for a Member of\nCongress who is a great communicator and cares deeply about the well-being and\nprofessional development of his staff.",
    "responsibilities": [
      "Formulating policy positions",
      "Overseeing the office’s legislative, constituent, correspondence, and media-relations strategies",
      "Handing all recruiting and hiring efforts, the establishment of office policies and procedures, and supervision of senior staff",
      "Serving as the Member’s chief advisor",
      "Developing and implementing all policy objectives, strategies, and operating plans",
      "Representing the Member with House leadership and committee staff",
      "Managing the office budget and personnel activities"
    ],
    "qualifications": [
      "Extensive experience in Congress or the federal government",
      "Developed and implemented an overarching strategy for an organization or Member before",
      "Strong written and verbal communication skills",
      "Interest in cultivating a warm, supportive, and productive work environment",
      "Comfort balancing responsibilities and competing deadlines",
      "A cool and levelheaded demeanor in fast-paced environments",
      "Political savvy and knowledge of Hill culture",
      "Good judgment and strong decision-making skills",
      "Expertise in developing and maintaining relationships with constituents and community leaders",
      "Background in matters before the House Homeland Security and Judiciary Committees, preferably with a knowledge base in oversight and investigations.",
      "Candidates with J.D. degrees are strongly encouraged to apply but not required",
      "Familiarity with the district is preferred."
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, and a writing\nsample to md04resumes@gmail.com with the subject line: “Full Name – Chief of\nStaff.” We will accept applications until the position is filled.",
    "salary_info": null,
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an\nequal-opportunity employer that does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-546-23",
    "position_title": "Member Services Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": null,
    "posting_date": "2024-02-05",
    "description": "The Congressional Black Caucus (CBC) seeks a Member Services Director who\nis exceptionally motivated, dynamic, strategic, and detail-oriented to engage with\nCBC Member offices and outside partners to advance a robust member services\nportfolio.\n\nThe Member Services Director will be expected to proactively build strong\nrelationships across CBC Member offices and develop strategic opportunities for\nMember engagement advancing shared priorities. The individual will also be\nexpected to coordinate with CBC staff to field and respond to inquiries and\nrequests for support from Member offices and respond to and share external\nopportunities for Member engagement as they arise.\n\nThe Member Services Director is also responsible for assisting in overseeing all\naspects of caucus operations, logistics, designated administrative responsibilities\nand to support caucus leadership.",
    "responsibilities": [
      "Conducting regular outreach to Member offices to build relationships with staff,\nshare opportunities for Member or staff participation in events, messaging, and\nother efforts, and identify new ideas for collaboration with Member offices",
      "Sharing resources with Member offices and working with CBC, congressional,\nand external staff to develop high-quality materials for Member office use",
      "Drafting regular newsletters for Member offices with relevant updates and\nopportunities, as well as for external audiences to uplift Member engagement on\nCBC issues",
      "Developing a network of external partners working on issues relevant to the\nCBC and Member offices",
      "Maintaining staff contact information and distribution lists",
      "Provides orientation and training for new staff;",
      "Assists departing employees with necessary administrative procedures (i.e.,\nreturning keys, House I.D. cards, and other office property; obtaining forwarding\naddresses, work files, and records);",
      "Supervises the mail operations and the administrative files and personnel\nrecords;",
      "Assists staff in scheduling House or Capitol rooms for outside group functions;",
      "Organize and facilitate meetings and other strategic convenings to support institutional\nchange, policies, and programmatic work;",
      "Oversees operations for CBC including organizing weekly meetings and events",
      "Provides logistical support for all programming",
      "Works with the CBC personal office staffs and coordinates with the CBC\nSchedulers to implement the Caucus’ priorities",
      "Builds and maintains databases of internal and external stakeholders"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and\nfamiliarity working with the African American community.",
      "Outstanding writing\nand communication skills, sound political judgment, and the ability to work\nclosely and collaboratively with multiple Member offices and key stakeholders\nare essential.",
      "Top candidates should also be detail-oriented and possess the ability\nto multi-task, work well in a fast-paced setting, and act as a team player.",
      "Candidates should have a demonstrated understanding of House and Senate\nlegislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume to vincent.evans@mail.house.gov.\nNo walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-508-23",
    "position_title": "Press Secretary/Digital Director (PS/DD)",
    "office": "Congresswoman Shontel Brown (OH-11)",
    "location": "Washington, DC",
    "posting_date": "2024-02-05",
    "description": "Working with the Communications Director, located in the District, the PS/DD will develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence. Other primary responsibilities include but are not limited to developing, editing, and producing graphics, videography, and other creative tools to enhance messaging; fielding press requests from local and national media; producing the Member’s newsletters; drafting releases and advisories, speeches , and talking points.\n\nThe successful candidate will have a creative and strategic approach to visual and graphic design, excellent oral and written communications skills, an ability to handle multiple assignments on tight deadlines, a desire to hone the Member’s voice, a strong collaborative approach to cross functional teaming, and a good sense of humor. They will also have a working knowledge of the legislative process, procedures, and organization of the House, with a proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately. Ohio ties are a plus, but not required, but proven effective digital and videography experience is required.\n\nThis is not an entry level position. The ideal candidate will have at least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level.",
    "responsibilities": [
      "Develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence.",
      "Developing, editing, and producing graphics, videography, and other creative tools to enhance messaging.",
      "Fielding press requests from local and national media.",
      "Producing the Member’s newsletters.",
      "Drafting releases and advisories, speeches , and talking points."
    ],
    "qualifications": [
      "A creative and strategic approach to visual and graphic design",
      "Excellent oral and written communications skills",
      "An ability to handle multiple assignments on tight deadlines",
      "A desire to hone the Member’s voice",
      "A strong collaborative approach to cross functional teaming",
      "A good sense of humor",
      "A working knowledge of the legislative process, procedures, and organization of the House",
      "A proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately.",
      "Proven effective digital and videography experience is required.",
      "At least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level."
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume, two writing and one creative samples to Ohio11Resumes@mail.house.gov with the subject line “Press Secretary – Last Name, First Initial.” No drop-ins, direct emails to staff or phone calls, please. The position is open until filled, but applications will be screened as they are received.",
    "salary_info": "The salary is flexible and dependent upon proven experience and expertise.",
    "contact": "Ohio11Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-468-23",
    "position_title": "Investigative Counsel",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2024-02-05",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks one attorney with 5-10 years of experience to serve as Investigative Counsel.\n\nThe Investigative Counsel reports to the Staff Director and Chief Counsel and will be responsible for conducting sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives and advising the Staff Director and Chief Counsel on legal and policy matters.\n\nThe OCE is seeking attorneys interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Counsel would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Review information received by OCE, discern possible violations, and identify facts requiring further investigation",
      "Plan, organize and conduct investigations regarding allegations and advise the Staff Director and Chief Counsel regarding appropriate evaluation of cases",
      "Advise the Staff Director and Chief Counsel on legal issues in matters under investigation and on broader legal and policy issues involved in the operations of OCE",
      "Draft lengthy and detailed memoranda, reports, and referrals for Board consideration and potential public release"
    ],
    "qualifications": [
      "Demonstrated ability to conduct and direct complex legal research and present the results in a clear, precise and persuasive manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Strong legal judgment and demonstrated professional integrity",
      "Experience auditing large sets of data or evidence and providing detailed analysis",
      "Desirable but not required:",
      "*Investigative experience with high-profile and sensitive matters;",
      "*Experience with investigations involving public officials;",
      "*Experience with campaign finance or ethics law;",
      "*Experience conducting interviews or depositions;",
      "*Experience writing public reports or legal documents; and",
      "*Advanced proficiency in development and use of electronic databases, and other computer skills including knowledge of current information technology tools related to investigations",
      "Ability to:",
      "*work independently or as part of an investigative team;",
      "*manage multiple tasks and projects;",
      "*work well under pressure and tight time deadlines; and",
      "*exercise discretion and independent judgment"
    ],
    "how_to_apply": "Please send cover letter, short writing sample, and resume (electronic submissions preferred) to:",
    "salary_info": null,
    "contact": {
      "name": "Omar S. Ashmawy",
      "title": "Staff Director and Chief Counsel",
      "office": "Office of Congressional Ethics",
      "address": "United States House of Representatives\nP.O. Box 895\nWashington, DC 20515-0895",
      "email": "OCEJOB@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-02-05",
    "description": "The Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  }
]