[
  {
    "id": "MEM-086-20",
    "position_title": "Junior Professional Staff Member",
    "office": "Energy & Commerce Committee, Democratic Staff, Consumer Protection Subcommittee",
    "location": null,
    "posting_date": "2020-03-02",
    "description": "The Energy & Commerce Committee, Democratic Staff, seeks dedicated, organized, and enthusiastic candidates to join the Consumer Protection Subcommittee staff as Junior Professional Staff Member. The broad jurisdiction of the subcommittee includes consumer affairs and consumer protection generally; motor vehicle safety; consumer product safety and product liability; regulation of commercial practices, including sports-related matters; interstate commerce; consumer privacy and data security; and regulation of travel, tourism, and time.\n\nThe subcommittee oversees the National Highway Traffic Safety Administration, the Consumer Product Safety Commission, and the Federal Trade Commission, among others.\n\nThe position requires the handling of substantive legislative and administrative tasks, including staffing hearings and markups, conducting oversight, and drafting legislation. Qualified candidates must have strong writing, analytical, legislative, and organizational skills; a proven ability to perform under pressure while juggling multiple tasks with competing priorities; a willingness to work long hours and weekends; and sound political judgment. Candidates should have experience working with relevant public interest groups, relevant agencies, Congress, and industry.",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation"
    ],
    "qualifications": [
      "Strong writing, analytical, legislative, and organizational skills",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Willingness to work long hours and weekends",
      "Sound political judgment",
      "Experience working with relevant public interest groups, relevant agencies, Congress, and industry"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line Consumer Protection Junior PSM Candidate.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age. Women, minority, and veteran candidates are highly encouraged to apply."
  },
  {
    "id": "MEM-084-20",
    "position_title": "Professional Staff/Counsel",
    "office": "Committee on Ways and Means, U.S. House of Representatives",
    "location": null,
    "posting_date": "2020-03-02",
    "description": "The Committee on Ways and Means, U.S. House of Representatives, seeks\napplications to fill a Professional Staff/Counsel position on the Democratic\nstaff of the Health Subcommittee.\n\nThe position entails: arranging and staffing hearings; legislative drafting;\njurisdictional analysis; advising on parliamentary procedure; negotiation and\ncorrespondence with Republican staff, other Congressional committees,\nRepresentatives, Senators, and Executive agencies; and oversight and\ninvestigative activities. Exceptional writing and analytic ability required, as\nwell as ability to quickly master unfamiliar, complex topics.",
    "responsibilities": [
      "arranging and staffing hearings",
      "legislative drafting",
      "jurisdictional analysis",
      "advising on parliamentary procedure",
      "negotiation and correspondence with Republican staff, other Congressional committees, Representatives, Senators, and Executive agencies",
      "oversight and investigative activities"
    ],
    "qualifications": [
      "Candidates for the position must be graduates of an accredited law school and members in good standing of a state or the District of Columbia Bar.",
      "Previous experience with the U.S. Department of Health and Human Services (HHS) is preferred.",
      "A strong academic background and exceptional legal research and writing skills are required.",
      "Candidates must have at least five years of legal or related experience.",
      "Hill experience is preferred."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and references to WMDem.Submissions@mail.house.gov",
    "salary_info": null,
    "contact": "WMDem.Submissions@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-082-20",
    "position_title": "Communications Director",
    "office": "Senior Democrat",
    "location": "D.C.",
    "posting_date": "2020-03-02",
    "description": "Senior Democrat seeks a communications director experienced in all aspects of public relations and social media, who is also organized, energetic and creative to be based in D.C. congressional office to handle all communications strategy and media operations for an unusually busy office, whose Member often has opportunities to appear on TV and radio media.\n\nThis is a very fast-paced office where the communications director overseas all day-to-day press operations including writing press releases, managing the social media portfolio, pitching stories, responding to reporters’ inquiries, producing newsletters, overseeing website content, developing, building relationships with local and national media and organizing press conferences and media events. Excellent research, writing and social media skills are essential.\n\nCandidate must be able to handle multiple tasks and issues effectively while meeting deadlines. A successful candidate will develop and implement a strategic communications plan, think outside the box and possess the political savvy needed to anticipate big news stories and to proactively promote the Member’s message. At least three years of prior media and/or Hill experience and demonstrated experience with both mainstream and new media outlets is preferred. This is NOT an entry level communications position. Candidate must be a DC resident or be willing to become a resident of the District of Columbia. Salary based on skill and experience level.",
    "responsibilities": [
      "Writing press releases",
      "Managing the social media portfolio",
      "Pitching stories",
      "Responding to reporters’ inquiries",
      "Producing newsletters",
      "Overseeing website content",
      "Developing, building relationships with local and national media",
      "Organizing press conferences and media events"
    ],
    "qualifications": [
      "Excellent research, writing and social media skills are essential",
      "Ability to handle multiple tasks and issues effectively while meeting deadlines",
      "Ability to develop and implement a strategic communications plan",
      "Ability to think outside the box",
      "Political savvy needed to anticipate big news stories and to proactively promote the Member’s message",
      "At least three years of prior media and/or Hill experience and demonstrated experience with both mainstream and new media outlets is preferred",
      "Must be a DC resident or be willing to become a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-079-20",
    "position_title": "District Director",
    "office": "Southern California Democrat",
    "location": "District Office",
    "posting_date": "2020-03-02",
    "description": "Southern California Democrat seeks District Director to oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans, as well as direct all activities and staff of the district offices. This position is responsible for recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures; represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.\n\nResponsibilities include strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management. This individual also serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district; and, acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region.",
    "responsibilities": [
      "Oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans",
      "Direct all activities and staff of the district offices",
      "Recruiting, hiring, training, and managing district staff",
      "Ensures that district staff complies with office policies, practices, and procedures",
      "Represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed",
      "Strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management",
      "Serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district",
      "Acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region"
    ],
    "qualifications": [
      "Minimum of 3-5 years of management experience",
      "Strong ability to provide necessary organization, leadership and motivation to manage a Congressional office",
      "Excellent oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "Energetic, detail-oriented, able to multi-task, politically astute",
      "Willing to work long hours (including evenings and weekends) in a fast-paced and demanding setting",
      "Spanish fluency and Southern California ties are a plus"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing samples to CA26Resumes@gmail.com with just “District Director” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-076-20",
    "position_title": "Press Secretary",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, D.C.",
    "posting_date": "2020-03-02",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks a Press Secretary to serve in her Washington, D.C. office. Candidates should be proactive concerning press engagement, and possess superior written and oral communication skills (including editing, and proofreading capabilities). The ideal candidate will have prior political, legislative, and communications experience. Connecticut ties are a plus.",
    "responsibilities": [
      "Establishing and maintaining relationships with Connecticut, national, and D.C.-based media;",
      "Coordinating all media efforts and communication-related events;",
      "Drafting and distributing press releases and media advisories;",
      "Creating, editing, and placing op-eds;",
      "Developing, editing, and posting content across all social media platforms;",
      "Pitching stories to reporters and producers, including national and Connecticut media, responding to press inquiries, and serving as the point-of-contact for media;",
      "Monitoring media narratives and identifying opportunities to promote the Congresswoman;",
      "Overseeing Franked communications strategy. This includes drafting, designing, and distributing Franked mail content; maintaining all social media platforms; and managing the bi-weekly congressional e-newsletter;",
      "Updating the Congresswoman’s website and ensuring that it features timely content;",
      "Coordinating and staffing the Congresswoman for interviews and events (including occasional night and weekend commitments);",
      "Managing a small team of press assistants."
    ],
    "qualifications": [],
    "how_to_apply": "Please send a current resume, cover letter with salary requirements, two writing samples (not to exceed one page each), and three references to ct05jobs@mail.house.gov by Friday, March 6, 2020 by 5pm.\nNo calls, emails or walk-ins, please.",
    "salary_info": null,
    "contact": "ct05jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-073-20",
    "position_title": "Digital Director",
    "office": "House Democratic Policy and Communications Committee (DPCC)",
    "location": null,
    "posting_date": "2020-03-02",
    "description": "The House Democratic Policy and Communications Committee (DPCC) seeks a Digital Director to help design and execute a proactive digital messaging strategy for the DPCC and assist with the digital reach of House Democratic offices.\n\nNon-traditional work hours are expected. This is not an entry-level position.",
    "responsibilities": [
      "Creating graphics and custom videos",
      "Managing relationships with digital media outlets and identifying new audiences for House Democrats to reach online",
      "Managing all digital platforms of the DPCC",
      "Drafting sample digital content to be used by other Democratic offices",
      "Maintaining and updating websites",
      "Tracking analytics",
      "Offering new, proactive ideas for growing the DPCC’s digital presence and supporting House Democrats"
    ],
    "qualifications": [
      "Creative, proactive, team players, who are able to successfully manage multiple tasks at once.",
      "Previous experience and passion for creating video and graphic content and familiarity with Adobe Creative Suite (Photoshop, Premiere, Illustrator), Final Cut Pro or other comparable tools.",
      "HTML/CSS knowledge a plus.",
      "Strong understanding of the digital media landscape and the latest digital trends and the ability to identify opportunities to reach new audiences online.",
      "Existing relationships with digital media outlets, podcasts, YouTube shows and influencers is a plus."
    ],
    "how_to_apply": "Qualified applicants should email a cover letter, resume, an original video, and an original graphic they are proud of to jobs.DPCC@mail.house.gov with “DPCC Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "We are equal opportunity employers; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-066-20",
    "position_title": "Scheduler",
    "office": "The Office of Congresswoman Abby Finkenauer (IA-01)",
    "location": "Washington, DC",
    "posting_date": "2020-03-02",
    "description": "The Office of Congresswoman Abby Finkenauer (IA-01) seeks a Scheduler to be based in the Washington, DC office. Applicants should have scheduling experience, ideally with a Congressional office, a political campaign, or a similarly fast-paced organization. Applicants should be attentive to detail, organized, and proactive.",
    "responsibilities": [
      "Creating and managing the Congresswoman’s schedule in Washington, DC and in Iowa.",
      "Building a long term scheduling plan in conjunction with other staff and the Congresswoman.",
      "Responding to invitations for meetings and events in a timely manner.",
      "Managing the Congresswoman’s travel, and logistics in DC and Iowa.",
      "Managing the Congresswoman’s time throughout the day in DC.",
      "Preparing memos and briefings for all meetings and events in coordination with event participants and the appropriate staff members.",
      "Keeping staff members and the Congresswoman updated in real time about schedule changes.",
      "Maintaining files of invitations that have been declined, accepted, or that are tentative/pending",
      "Processing travel and expense receipts for the Member.",
      "Additional duties related to operation of the DC and District offices."
    ],
    "qualifications": [],
    "how_to_apply": "Please e-mail a resume to IA01Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "IA01Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-064-20",
    "position_title": "Legislative Assistant",
    "office": "Congressman John P. Sarbanes",
    "location": "Washington, D.C.",
    "posting_date": "2020-03-02",
    "description": "Congressman John P. Sarbanes, a senior member of the Health Subcommittee\non the House Energy & Commerce Committee, is seeking a legislative\nassistant to manage a portfolio with a primary focus on health policy and\nother issues as assigned.",
    "responsibilities": [
      "Advising the Member on all matters in the issue portfolio",
      "Developing and advancing policy proposals",
      "Drafting vote recommendations and talking points for related floor and committee proceedings",
      "Staffing the Member in relevant meetings",
      "Representing the Member before constituents and stakeholders"
    ],
    "qualifications": [
      "Previous work expertise on health policy",
      "Prior legislative experience advising a Member of Congress and advancing policy proposals",
      "Excellent written and verbal communication skills",
      "Eagerness to work in a fast-paced, collaborative office",
      "Maryland ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and writing sample to employment@mail.house.gov",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-063-20",
    "position_title": "Legislative Correspondent",
    "office": "Conservative Congressman",
    "location": "Washington, DC",
    "posting_date": "2020-03-02",
    "description": "Responsibilities include drafting constituent letters, sorting and batching mail, and assisting the legislative staff with various projects. Applicants should possess strong conservative credentials, effective writing and research skills, attention to detail, and the ability to manage multiple tasks at once. Previous Capitol Hill experience preferred.",
    "responsibilities": [
      "Drafting constituent letters",
      "Sorting and batching mail",
      "Assisting the legislative staff with various projects"
    ],
    "qualifications": [
      "Strong conservative credentials",
      "Effective writing and research skills",
      "Attention to detail",
      "Ability to manage multiple tasks at once",
      "Previous Capitol Hill experience preferred"
    ],
    "how_to_apply": "To apply, send resume and cover letter to goplc1776@gmail.com",
    "salary_info": null,
    "contact": "goplc1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-056-20",
    "position_title": "Scheduler",
    "office": "Representative Sean Patrick Maloney (NY-18)",
    "location": "Washington, DC",
    "posting_date": "2020-03-02",
    "description": "Representative Sean Patrick Maloney (NY-18) seeks an experienced and highly organized Scheduler to be based in the Washington, DC office.\n\nThis is a senior staff position; previous Hill or other scheduling and/or fastpaced operations role experience highly preferred. Session nights and weekend availability by phone sometimes required.",
    "responsibilities": [
      "Drafting short- and long-term DC and district calendars",
      "Working with internal and external stakeholders to maximize time efficiency",
      "Coordinating all travel, including extensive international committee-based trips",
      "Driving the Member in DC",
      "Assisting with Member’s personal correspondence",
      "Anticipate and proactively provide solutions to expected issues with schedule"
    ],
    "qualifications": [
      "previous Hill or other scheduling and/or fastpaced operations role experience highly preferred",
      "Session nights and weekend availability by phone sometimes required.",
      "Hudson Valley or New York ties are a plus."
    ],
    "how_to_apply": "Please send resume, cover letter, and two references to ny18maloneyleg@gmail.com",
    "salary_info": null,
    "contact": "ny18maloneyleg@gmail.com",
    "equal_opportunity": "Equal Employment Opportunity Employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-055-20",
    "position_title": "Press Assistant",
    "office": "Republican member of Congress",
    "location": null,
    "posting_date": "2020-03-02",
    "description": "Republican member of Congress is seeking a highly motivated, pro-active, and qualified Press Assistant with strong writing and organizational skills to join an active press team.\n\nDuties include assisting the Communications Director with day-to-day operations-including but not limited to: creating daily social media and video content, tracking press clips and traffic on social media, and drafting press releases, op-eds, newsletters, and video scripts.\n\nThe ideal candidate for this position is a self-starter who works well under pressure, has the capacity to problem solve, employs excellent written and verbal communications skills, and pays close attention to detail.",
    "responsibilities": [
      "Digital: Writing and developing content for social media, including videos and graphics.",
      "Writing: Drafts press releases and media advisories for distribution to local and national media. Writes video scripts, weekly newsletter, op-eds, and speeches.",
      "Social Media: Assist Communications Director with drafting and posting social media daily.",
      "Clips TV interviews, floor speeches, and committee hearings. Tracks newsletter, social media metrics, and supports communications team as necessary."
    ],
    "qualifications": [
      "THIS IS NOT AN ENTRY LEVEL POSITION.",
      "Degree in political science, communications, or relevant field.",
      "1-2 years of professional experience in communications, relevant internships accepted.",
      "Outstanding writing and communication skills.",
      "Must be able to work in a fast-paced environment and meet deadlines.",
      "Candidates well-versed in AP style are strongly preferred."
    ],
    "how_to_apply": "To apply, please send your resume to floridarepublicanjobs@gmail.com",
    "salary_info": null,
    "contact": "floridarepublicanjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-052-20",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2020-03-02",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Office of Advice and Education. The Committee’s Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product."
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:",
      "Government ethics",
      "Ethics counseling and training",
      "Employment law, including the laws governing sexual harassment in the workplace",
      "Criminal law"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-051-20",
    "position_title": "Scheduler",
    "office": "Midwestern Republican Office",
    "location": "DC",
    "posting_date": "2020-03-02",
    "description": "Midwestern Republican Office seeking a Scheduler. Applicants should have scheduling experience, ideally with a Congressional office, a political campaign, or a similarly fast-paced organization. Applicants should be extremely attentive to detail, organized, and proactive.\n\nThis position will not involve legislative or press work, but will involve coordinating with those teams and others to ensure the Member’s time is balanced across various priorities.",
    "responsibilities": [
      "Creating and updating the Member's schedule in DC",
      "Responding to invitations for DC meetings and events",
      "Communicating with the District team about invitations for District events",
      "Managing the travel plans and logistics",
      "Preparing meeting briefs and binders for all meetings and events in DC, by coordinating with event participants and the appropriate staff members",
      "Maintain a weekly schedule that balances the Member's official and unofficial time in DC",
      "Working with the Chief of Staff to review schedule requests",
      "Processing vouchers for travel and expense reimbursement for the Member and staff",
      "Oversee and assisting the Staff Assistant as needed with answering the phone, greeting visitors, and managing the intern program.",
      "Additional duties related to managing the overall operation of the DC office"
    ],
    "qualifications": [
      "scheduling experience, ideally with a Congressional office, a political campaign, or a similarly fast-paced organization",
      "extremely attentive to detail",
      "organized",
      "proactive"
    ],
    "how_to_apply": "To apply, please submit resume and 2-3 references to RepJobResume@gmail.com with “Scheduler” in the subject line.",
    "salary_info": null,
    "contact": "RepJobResume@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-049-20",
    "position_title": "Legislative Correspondent",
    "office": "Republican Congressman from Ohio",
    "location": "Washington, DC",
    "posting_date": "2020-03-02",
    "description": "Republican Congressman from Ohio seeks a legislative\ncorrespondent for the Washington, DC office. The successful candidate will\nbe an effective writer and researcher and be able to support the legislative\nteam as needed.\n\nCandidates should have good communication skills, experience with\nmanaging constituent mail systems, and perform well in a fast pace work\nenvironment. Previous Hill experience and Ohio ties are a plus.",
    "responsibilities": [],
    "qualifications": [
      "Good communication skills",
      "Experience with managing constituent mail systems",
      "Ability to perform well in a fast pace work environment",
      "Previous Hill experience (plus)",
      "Ohio ties (plus)"
    ],
    "how_to_apply": "Interested candidates should submit writing samples and resume to midwestern.job@mail.house.gov",
    "salary_info": null,
    "contact": "midwestern.job@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Washington, D.C.",
    "posting_date": "2020-03-02",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others.\n\nThe ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Job responsibilities will include drafting legislation, writing hearing statements and legislative memos, and preparing briefing materials.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2020-03-02",
    "description": "Qualified candidates should have a minimum of 2 years’ experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects. A flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Ability to meet deadlines",
      "Ability to manage multiple projects",
      "Flexible schedule",
      "Ability to travel throughout the district"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]