[
  {
    "id": "MEM-596-22",
    "position_title": "Director of Operations",
    "office": "Congressman Tom McClintock (CA-04)",
    "location": "Washington, DC",
    "posting_date": "2022-12-12",
    "description": "The Office of Congressman Tom McClintock (CA-04) seeks an experienced individual to serve as his Director of Operations. This individual will also serve as the Office Manager and Intern Coordinator.\nPosition duties include, but are not limited to: maintaining Member’s Washington, DC calendar, managing all incoming meeting requests and invitations, coordinating travel and logistics, processing office invoices for vendor payment, maintaining stock of office supplies, overseeing the day-to-day operations of the office, processing/scheduling all incoming tour requests, managing the office’s internship program, and other duties as required.",
    "responsibilities": [
      "Maintaining Member’s Washington, DC calendar",
      "Managing all incoming meeting requests and invitations",
      "Coordinating travel and logistics",
      "Processing office invoices for vendor payment",
      "Maintaining stock of office supplies",
      "Overseeing the day-to-day operations of the office",
      "Processing/scheduling all incoming tour requests",
      "Managing the office’s internship program",
      "Other duties as required"
    ],
    "qualifications": [
      "Well-organized",
      "Possess a keen attention to detail",
      "Work well in a fast-paced environment",
      "Have strong interpersonal skills"
    ],
    "how_to_apply": "Please submit resume and cover letter to gopwesternjobs1776@gmail.com",
    "salary_info": "Commensurate with experience.",
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-595-22",
    "position_title": "Senior Legislative Assistant or Counsel – Financial Services",
    "office": "Senior Democratic House Member",
    "location": null,
    "posting_date": "2022-12-12",
    "description": "Senior Democratic House Member seeking to hire Legislative Assistant to manage and support the Member’s responsibilities for the House Financial Services Committee, which will likely include serving as the top Democrat on a subcommittee of the FSC.\n\nThe ideal candidate will have significant experience in financial services issues. Other areas of responsibility may include consumer protection, small business, tax, in addition to supporting the member’s assignment to the Committee on Financial Services. Experience with Wall Street regulation a major plus.\n\nThe successful candidate will possess excellent writing written and oral communication skills, a solid understanding of the legislative process, and a proven ability to work effectively in a fast-paced office. Law degree/bar membership a plus, but not required. This is a mid- to senior-level position in the office.",
    "responsibilities": [
      "Monitoring and drafting legislation",
      "Representing the Member in meetings/briefings",
      "Preparing materials for committee hearings and markups",
      "Maintaining relationships with advocacy groups",
      "Interfacing with government agencies",
      "Other tasks and assignments as needed"
    ],
    "qualifications": [
      "Excellent writing written and oral communication skills",
      "Solid understanding of the legislative process",
      "Proven ability to work effectively in a fast-paced office",
      "Law degree/bar membership a plus, but not required"
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to congressjob2022@gmail.com",
    "salary_info": null,
    "contact": "congressjob2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-591-22",
    "position_title": "Staff Assistant",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "DC office",
    "posting_date": "2022-12-12",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks highly-motivated, detailoriented Staff Assistant with excellent written and oral communication skills for DC office.",
    "responsibilities": [
      "Driving the Member",
      "General reception duty",
      "Handling tour and flag requests",
      "Processing constituent correspondence",
      "Addressing constituent matters",
      "Assist in managing interns",
      "Assisting the Member and staff in all functions of the office"
    ],
    "qualifications": [
      "Daily access to an automobile preferred – with a valid driver’s license and good driving record.",
      "Previous Hill experience as an intern or staff assistant preferred but not necessary.",
      "Southern California ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Staff Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-590-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2022-12-12",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks an experienced\nCommunications Director to lead a fast-paced and highly engaged press\noperation. Applicants must be creative, dynamic, proactive, and energetic.\nThe Communications Director will serve as the spokesperson and primary\ncommunications advisor to the Member. They will be responsible for developing\nand executing an aggressive strategic communications plan, including social\nmedia, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director is responsible for maintaining the\nCongresswoman's voice across all communications materials, with an emphasis\non clarity, relatability, authenticity, and connecting the Congresswoman's values\nand advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related\nexperience either on or off Capitol Hill, and fluency in Spanish is preferred. They\nmust be highly organized, proficient in multi-tasking, have strong political\njudgment and instincts, and possess superior writing, editing, and proofreading\nskills.\n\nAdditionally, the Communications Director must be willing to work extended\nhours and oftentimes under time constraints, while maintaining a positive\nattitude.",
    "responsibilities": [
      "Oversee day-to-day press operations, including coordinating and managing the press team",
      "Responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member's social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters and franked mailings",
      "Working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging"
    ],
    "qualifications": [
      "Los Angeles Metro|Southern California ties are a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus.",
      "Previous press-related experience either on or off Capitol Hill",
      "Fluency in Spanish is preferred",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political judgment and instincts",
      "Superior writing, editing, and proofreading skills"
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-587-22",
    "position_title": "Legislative Director",
    "office": "Congressman Alma S. Adams, Ph.D.",
    "location": "DC",
    "posting_date": "2022-12-12",
    "description": "The LD will help drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio, and manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.\n\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects.\n\nThis is not an entry level position; extensive Hill experience and knowledge of the legislative process are required. The successful applicant will have crisp and thorough written and oral communications skills, an entrepreneurial and selfstarting attitude, strong attention to detail, creativity, and be a team player. Supervisory experience and expertise on healthcare policy is strongly preferred.",
    "responsibilities": [],
    "qualifications": [
      "Extensive Hill experience",
      "Knowledge of the legislative process",
      "Crisp and thorough written and oral communications skills",
      "Entrepreneurial and self-starting attitude",
      "Strong attention to detail",
      "Creativity",
      "Team player",
      "Supervisory experience and expertise on healthcare policy is strongly preferred."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to nc12.resume@mail.house.gov.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-586-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-12",
    "description": "Congresswoman Susie Lee (NV-03) seeks an experienced Legislative Assistant to join her Washington, D.C.-based legislative team. The Legislative Assistant will help implement the Member’s agenda within the Appropriations Committee and across authorizing committees, and manage a portfolio including but not limited to health care, transportation, and infrastructure issues.\n\nThis is not an entry-level position and sound policy judgement is required. Candidate should have a strong track record of translating policy priorities into successful legislative outcomes and developing proactive relationships with onand off-Hill stakeholders. Candidate will be expected to frequently brief and staff the Member and demonstrate strong verbal communication skills.\n\nCandidate should also be coachable, responsive to feedback, and enjoy working in a team-first, collaborative work environment. Candidate will work directly with the Congresswoman, Chief of Staff, Legislative Director, and intra- and inter-departmental peers to advance the Congresswoman’s authorizing and appropriations priorities. Nevada ties are a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply send in PDF format a resume, cover letter, writing sample of 1,000 words or fewer, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to nv03resumes@gmail.com with the following subject line: “Full Name – Legislative Assistant.”",
    "salary_info": null,
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-585-22",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Susie Lee (D-NV)",
    "location": "DC",
    "posting_date": "2022-12-12",
    "description": "Congresswoman Susie Lee (D-NV) seeks a highly organized, good-humored, hard-working Scheduler to develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC.\n\nThe DC Scheduler will report to the Chief of Staff and work closely with the Member, DC staff, and District staff, including a District-based scheduler responsible for in-district scheduling. The ideal candidate will have prior scheduling experience on the Hill, and salary is commensurate with experience. This is not an entry-level position.\n\nResponsibilities also include tracking, evaluating, and responding to all invitations and scheduling requests, coordinating travel for the Member, compiling the Congresswoman’s nightly briefing materials, and providing operational support for the office, including but not limited to facilitating Member to Member and stakeholder outreach, coordinating internal and external events, and assisting with onboarding process for staff and interns.\n\nStrong candidates will have excellent attention to detail, communicate quickly and effectively both internally and externally, strong conflict-resolution skills, and thrive in a fast-paced work environment. The position requires the ability to multi-task, work well under pressure, and the flexibility to be responsive to urgent scheduling needs on nights and weekends.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Compiling the Congresswoman’s nightly briefing materials",
      "Providing operational support for the office, including but not limited to facilitating Member to Member and stakeholder outreach, coordinating internal and external events, and assisting with onboarding process for staff and interns"
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Communicate quickly and effectively both internally and externally",
      "Strong conflict-resolution skills",
      "Thrive in a fast-paced work environment",
      "Ability to multi-task",
      "Work well under pressure",
      "Flexibility to be responsive to urgent scheduling needs on nights and weekends",
      "Prior scheduling experience on the Hill"
    ],
    "how_to_apply": "Candidates should submit in PDF format a resume, cover letter, writing sample of 1,000 words or fewer, and three references (including name, title and organization, phone number, email, and relationship to the candidate) to nv03resumes@gmail.com with the following subject line: “Full Name – DC Scheduler.”",
    "salary_info": "salary is commensurate with experience",
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-583-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2022-12-12",
    "description": "The Office of Congressman Rob Wittman (VA-01) is seeking an experienced Legislative Assistant to manage his telecommunication, transportation, and Natural Resources Committee issue portfolio.\n\nThe ideal candidate is a current Legislative Assistant who has been a full-time LA for 2+ years, and has handled appropriations requests, staffed committee assignments, and has a proven legislative track record for their Member. Experience working with other Member offices, advocacy groups, industry associations, etc., with the goal of creating a successful coalition to pass a bill/amendment, is preferable. Given that this position works closely with district issues and district stakeholders, the person who fills this position must have a self-starter mentality and strong interpersonal skills. This position will be highly involved in the telecommunications policy area, including managing the Member's responsibilities on the Rural Broadband Caucus and Rural Broadband Task Force.\n\nThe position will also be expected to work routinely with state and federal transportation stakeholders to address the unique transportation issues of the district, which require an independent approach to addressing the issues and curating solutions. The ideal candidate needs to be self-motivated and possess the ability to take proactive and creative initiative on assigned policy areas.",
    "responsibilities": [],
    "qualifications": [
      "Current Legislative Assistant who has been a full-time LA for 2+ years",
      "Handled appropriations requests",
      "Staffed committee assignments",
      "Proven legislative track record for their Member",
      "Experience working with other Member offices, advocacy groups, industry associations, etc., with the goal of creating a successful coalition to pass a bill/amendment is preferable",
      "Self-starter mentality and strong interpersonal skills",
      "Ability to take proactive and creative initiative on assigned policy areas"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Carolyn.King@mail.house.gov with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-582-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Orange County",
    "posting_date": "2022-12-12",
    "description": "The Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.\n\nUnder the supervision of the Chief of Staff and the District Director, the Field Representative briefs the Member in preparation for district meetings with constituents and acts as the representative for the Member by attending events and meetings. This includes public speaking and certificate presentations.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible scheduling, including nights and weekends",
      "Constituent service oriented; patient empathetic, and desire to help constituents",
      "Bachelor’s degree or related job experience is required.",
      "A demonstrated interest in public service and familiarity with Orange County is preferred."
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director, Office of Congresswoman\nSteel Stephanie.Hu@mail.house.gov",
    "salary_info": "Salary range is $49,000-$57,000. Salary commensurate with experience.",
    "contact": "Stephanie Hu, District Director, Office of Congresswoman Steel Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-575-22",
    "position_title": "Senior Legislative Assistant",
    "office": "Congressman Mark DeSaulnier (D-CA)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-12",
    "description": "Congressman Mark DeSaulnier (D-CA), member of the Education and Labor Committee and Transportation and Infrastructure Committee, seeks a Senior Legislative Assistant to handle a diverse legislative portfolio including committee work.\n\nDuties include identifying and advancing policy proposals, committee hearing and mark-up preparation and staffing, building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff, briefing the Congressman and drafting legislative memos, policy background, and constituent correspondence. Title is negotiable based on candidate’s experience.\n\nIdeal candidate will be a strategic, detail-oriented thinker with experience formulating and advancing legislation. Successful applicants will have excellent organizational, research, writing, and communication skills, and have working knowledge of House processes and procedures.\n\nCandidates should possess the ability to concisely communicate and have strong time management skills and a willingness to work in a team environment.\n\nKnowledge of California a plus. This is not an entry level position -- prior legislative experience on Capitol Hill is preferred.",
    "responsibilities": [
      "Identifying and advancing policy proposals",
      "Committee hearing and mark-up preparation and staffing",
      "Building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff",
      "Briefing the Congressman",
      "Drafting legislative memos, policy background, and constituent correspondence"
    ],
    "qualifications": [
      "Strategic, detail-oriented thinker with experience formulating and advancing legislation",
      "Excellent organizational, research, writing, and communication skills",
      "Working knowledge of House processes and procedures",
      "Ability to concisely communicate",
      "Strong time management skills",
      "Willingness to work in a team environment",
      "Knowledge of California a plus",
      "Prior legislative experience on Capitol Hill is preferred"
    ],
    "how_to_apply": "Qualified candidates should send resume and cover letter to DeSaulnierResumes@gmail.com.",
    "salary_info": null,
    "contact": "DeSaulnierResumes@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity, marital status, parental status, or sexual orientation. Candidates from diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-572-22",
    "position_title": "Legislative Director",
    "office": "Congresswoman Susan Wild (D-PA)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-12",
    "description": "Congresswoman Susan Wild (D-PA) seeks a Legislative Director to oversee her\nlegislative team and a fast-paced policy agenda.\n\nThis is not an entry-level position and previous policy and Capitol Hill\nexperience is required. The person in this role will very likely have a legislative\nportfolio as well as be responsible for managing the legislative team and\npotentially other staff.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff;",
      "Manages a legislative team of 3-4 staff;",
      "Works closely with the communications team and helps influence the successful messaging of legislative issues;",
      "Coordinates the preparation of legislative and policy memos and committee hearings;",
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise;",
      "Occasionally assists with the creation and execution of events in the District and in DC;",
      "Regularly monitors activity on the House Floor and the Member’s committees;",
      "Builds relationships with district and national stakeholders and advocacy organizations;",
      "Takes constituent and advocacy group meetings regularly."
    ],
    "qualifications": [
      "Is a leader with strong inter-personal skills who thrives in a collaborative teamfirst environment;",
      "Works quickly under pressure and manages time efficiently;",
      "Is creative and has an entrepreneurial spirit;",
      "Possesses strong written and verbal communications skills;",
      "5+ years of congressional, policy, or political experience (Capitol Hill experience required);",
      "Domestic policy experience – health care policy experience a plus;",
      "Existing relationships and experience working with federal agencies; and",
      "Knowledge of or ties to Pennsylvania a plus."
    ],
    "how_to_apply": "Email a cover letter and resume to repwildjobs@gmail.com with the subject line, “Legislative Director”.",
    "salary_info": null,
    "contact": "repwildjobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-566-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic member of the House Science, Space, and Technology Committee",
    "location": "DC",
    "posting_date": "2022-12-12",
    "description": "Senior Democratic member of the House Science, Space, and Technology Committee seeks a Legislative Assistant to handle the office’s SST committee portfolio.\n\nIdeal candidates will have previous congressional experience and a strong understanding of the legislative process. Excellent writing skills, attention to detail, and the ability to work efficiently in a fast-paced environment are required.\n\nThis is not an entry level-position. Additional legislative responsibilities will be assigned based on a candidate’s experience/interest and office needs.",
    "responsibilities": [
      "staffing and preparing the member for hearings, markups, and relevant briefings",
      "writing legislative memos, talking points and floor statements",
      "drafting legislation, agency letters, and supporting materials",
      "working with the committee staff and stakeholders to advance the member’s priorities",
      "representing the member in meetings and other engagements with constituents, stakeholders, and state/federal government agencies"
    ],
    "qualifications": [
      "previous congressional experience",
      "strong understanding of the legislative process",
      "Excellent writing skills",
      "attention to detail",
      "the ability to work efficiently in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and a writing sample in a single PDF document to ca07jobs@gmail.com with “SST Legislative Assistant - DC” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-560-22",
    "position_title": "Legislative Director",
    "office": "Congressman Raja Krishnamoorthi (D-IL)",
    "location": "Washington, DC",
    "posting_date": "2022-12-12",
    "description": "Congressman Raja Krishnamoorthi (D-IL), a member of the House Permanent Select Committee on Intelligence and the House Oversight Committee (Chairman of the Subcommittee on Economic and Consumer Policy and Member of the Coronavirus Subcommittee) seeks a hardworking Legislative Director to oversee his policy team and legislative agenda.\n\nThis is not an entry-level position and previous policy and Capitol Hill experience is required. The person in this role will also have a legislative portfolio of domestic policy issues, including workforce development, tax, finance, small business, and labor.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff",
      "Manages a legislative team of 4-5 staff",
      "Works closely with the communications team and helps influence the successful messaging of legislative issues",
      "Coordinates the preparation of legislative and policy memos, hearings, and Town Halls",
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise",
      "Occasionally assists with the creation and execution of events in the District and in DC",
      "Regularly monitors activity on the House Floor and the Member’s committees",
      "Builds relationships with district and national stakeholders and advocacy organizations",
      "Takes constituent and advocacy group meetings as necessary"
    ],
    "qualifications": [
      "Works quickly under pressure and manages time efficiently",
      "Is creative and has an entrepreneurial spirit",
      "Possesses strong written and verbal communications skills",
      "5+ years of congressional, policy, or political experience (Capitol Hill experience strongly preferred)",
      "Policy experience in domestic policy issues a plus",
      "Knowledge of or ties to Illinois a plus"
    ],
    "how_to_apply": "Email a cover letter and resume to il08careers@gmail.com with the subline, “Legislative Director: [Your Full Name]”",
    "salary_info": null,
    "contact": "il08careers@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-555-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-12",
    "description": "The legislative assistant will primarily handle health care and Social Security for an active Member of the Ways and Means Committee and House Democratic Leadership, along with other legislative issues including veterans.\n\nResponsibilities are wide-ranging and include preparing for and staffing committee hearings, drafting legislation and amendments, writing talking points and memorandums, and interacting with key constituent groups and stakeholders.\n\nApplicants should have a demonstrated passion for health care policy and Congress.\n\nApplicants must be willing to work on a team, bring an entrepreneurial spirit to a fast-paced office, previously demonstrated pro-active initiative, and possess a desire to continually learn. Applicants must work well under pressure, have excellent written and oral communication skills and demonstrate leadership capabilities. The position requires strategic thinking and the ability to work independently as well as within a team.\n\nThis is not an entry-level position. A minimum of two to three years of experience is required. Applicants with Michigan or Midwest ties are a plus.",
    "responsibilities": [
      "Preparing for and staffing committee hearings",
      "Drafting legislation and amendments",
      "Writing talking points and memorandums",
      "Interacting with key constituent groups and stakeholders"
    ],
    "qualifications": [
      "Demonstrated passion for health care policy and Congress",
      "Willing to work on a team",
      "Bring an entrepreneurial spirit to a fast-paced office",
      "Previously demonstrated pro-active initiative",
      "Possess a desire to continually learn",
      "Work well under pressure",
      "Have excellent written and oral communication skills",
      "Demonstrate leadership capabilities",
      "Strategic thinking and the ability to work independently as well as within a team",
      "A minimum of two to three years of experience is required",
      "Applicants with Michigan or Midwest ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to Michigan05jobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": "Compensation is commensurate with experience.",
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer, committed to developing an organization that is reflective of the district that we serve. The office does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-554-22",
    "position_title": "Communications Director",
    "office": "Representative Mike Levin (CA-49)",
    "location": "DC and California",
    "posting_date": "2022-12-12",
    "description": "Representative Mike Levin (CA-49) seeks Communications Director for a\nfrontline office. This position is responsible for guiding Rep. Levin’s\ncommunications operation, formulating and delivering his message, and\nmanaging a second communications staffer.",
    "responsibilities": [
      "Managing local and national press relationships",
      "Considering newsworthy actions by the Member that should be pitched to local\npress and executing pitches to strategically chosen reporters",
      "Responding to all press inquiries and interview requests in a timely manner",
      "Scheduling print and television interviews for Rep. Levin",
      "Drafting and sending press releases on Rep. Levin’s actions, priorities, and the\nissues of the day",
      "Formulating weekly and long-term communications plans",
      "Overseeing social media post development",
      "Updating the Member’s website with press releases, issue pages, and more",
      "Managing a comprehensive franked mail program",
      "Leading the development process of talking points for the Member’s speeches,\ninterviews, and events in both DC and California",
      "Authoring, pitching, and publishing op-eds",
      "Closely monitoring the news and flagging relevant press and clips for Rep.\nLevin"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Thoroughness and careful attention to detail",
      "Capacity to create strong content on short notice",
      "Creative communications instincts",
      "Strong, independent judgment and discretion",
      "Thorough knowledge of social media accounts and tools including basic graphic\ndesign",
      "Knowledge of legislative process and of House organization and procedures",
      "Knowledge of local, state, and federal agencies and departments"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, writing sample, and a list\nof three references to ca49.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis\nof race, color, religion, sex, national origin, age, disability, gender identity or\nexpression, or sexual orientation. We deeply value the diversity of our employees\nand encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-550-22",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-12",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-548-22",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai’i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-12",
    "description": "Responsibilities run the range of assisting the legislative, constituent services and administrative functions of the office, to include: monitoring, processing and responding to constituent mail and other communications, managing constituent tours and other needs, and coordinating DC and district office issues. As needed and depending on capability, the position also encompasses legislative duties.\n\nDirect report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring, processing and responding to constituent mail and other communications",
      "Managing constituent tours and other needs",
      "Coordinating DC and district office issues",
      "Legislative duties (as needed and depending on capability)"
    ],
    "qualifications": [
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones",
      "Prior Capitol Hill experience (preference given)",
      "Hawai’i background (preference given)"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-547-22",
    "position_title": "Constituent Services Assistant",
    "office": "U.S. Congressman Ed Case (Hawai‘i - 01)",
    "location": "Honolulu office",
    "posting_date": "2022-12-12",
    "description": "The ideal candidate has diverse experience working in the community to address a wide range of statewide and local issues with a strong track record of advocacy for the people of Hawai‘i. The position is responsible for assisting the Congressman to address requests for assistance from individual constituents and organizations, primarily but not exclusively with a wide range of federal government programs and activities.\n\nDuties include but are not limited to dealing directly with constituents and federal state and local agencies and organizations. The position also includes interaction with the Congressman’s D.C. office on related legislative and administrative matters, as well as representing the Congressman at community events, such as neighborhood board meetings, and otherwise assisting with the range of activities in the Congressman’s office. Direct report to the Deputy Chief of Staff in the Honolulu office. Although the position may also interact directly with the Congressman and his Washington, D.C. office from time to time. The ideal candidate is an individual who is seeking to live and work in the community that this position is designed to serve.",
    "responsibilities": [
      "Dealing directly with constituents and federal state and local agencies and organizations.",
      "Interaction with the Congressman’s D.C. office on related legislative and administrative matters.",
      "Representing the Congressman at community events, such as neighborhood board meetings.",
      "Assisting with the range of activities in the Congressman’s office."
    ],
    "qualifications": [
      "Prior experience especially in comparable duties including customer service or social work.",
      "Hawai‘i background/community involvement.",
      "Experience evaluating, synthesizing and articulating issues in a thoughtful and respectful manner in support of constituents’ needs and the Congressman’s initiatives.",
      "Extensive knowledge of a broad range of community resources and services from which to draw on when addressing constituent requests.",
      "An interest in government and in assisting others.",
      "Initiative.",
      "Interpersonal skills.",
      "The ability to multitask.",
      "Work independently and effectively under pressure.",
      "Make decisions and solve problems.",
      "Orientation to detail.",
      "Excellent verbal communication and writing skills.",
      "Long and sometimes unpredictable hours."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Constituent Services Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-546-22",
    "position_title": "Scheduler",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-12",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced and well-organized Scheduler for the Representative’s Washington, D.C. office.",
    "responsibilities": [
      "Developing, coordinating, and managing all aspects of the Representative’s daily and long-term schedule in D.C. and in the district, as well as tracking, evaluating, and responding to all invitations and scheduling requests;",
      "Coordinating all travel for the Representative and her staff and other logistical support tasks as required;",
      "Working closely with and supporting the Chief of Staff, Deputy Chief of Staff/District Director, Legislative Director and Communications Director to ensure smooth daily schedules and operations."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values;",
      "A hard worker with excellent attention to detail;",
      "Adept at juggling complex schedules, competing priorities;",
      "Able to anticipate problems, seek solutions, and effectively communicate them to the Representative and her staff;",
      "Able to work long hours, including some nights and weekends;",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Scheduler” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-543-22",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas), Chair of the Ways & Means Health Subcommittee",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-12",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), Chair of the Ways & Means Health Subcommittee seeks an experienced Legislative Assistant to assist with his health care work and other to be determined issues.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill or other policy or political experience strongly preferred, as well as a law or graduate degree.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor references to DoggettJobs@mail.house.gov. Use this title on your email: “Experienced LA Applicant” -- No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  }
]