[
  {
    "id": "MEM-406-16",
    "position_title": "Professional Staff Member",
    "office": "Democratic Staff of the House Committee on Small Business",
    "location": null,
    "posting_date": "2016-12-12",
    "description": "Democratic Staff of the House Committee on Small Business seeks a professional staff member to handle a broad portfolio of matters including those related to regulatory reform, health care, rural/agriculture, energy, and technology. Exposure to small business policy and SBA programs a plus.\n\nIdeal candidate will be a strong writer, very organized, and have solid interpersonal skills. Primary responsibilities include hearing preparation (witness selection, memo, statements, questions), legislative development (generating ideas, drafting legislation, and advancing legislation), and outreach and engagement to key stakeholders and interest groups. This is NOT an entry level position. No phone calls or drop-ins please.",
    "responsibilities": [
      "Hearing preparation (witness selection, memo, statements, questions)",
      "Legislative development (generating ideas, drafting legislation, and advancing legislation)",
      "Outreach and engagement to key stakeholders and interest groups"
    ],
    "qualifications": [
      "Strong writer",
      "Very organized",
      "Solid interpersonal skills",
      "Exposure to small business policy and SBA programs a plus"
    ],
    "how_to_apply": "Please email resumes and cover letters to resume_opening@yahoo.com",
    "salary_info": null,
    "contact": "resume_opening@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-402-16",
    "position_title": "Administrative Director",
    "office": "Office of General Counsel",
    "location": null,
    "posting_date": "2016-12-12",
    "description": "The Office of General Counsel ('OGC'), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation, seeks a motivated, detail-oriented, and energetic individual with excellent administrative skills to serve as Administrative Director. Candidates should demonstrate strong interpersonal skills, be comfortable with managing multiple tasks, and have a strong work ethic.",
    "responsibilities": [
      "answer incoming calls and distribute requests for advice among office attorneys",
      "assist with personnel/human relations matters and ensure that office policies and procedures are followed",
      "maintain office finance and payroll accounts in accordance with applicable House regulations and office policies",
      "assist with annual budgeting process",
      "procure and maintain software, equipment, office supplies, and library for the office",
      "serve as point of contact for IT-related issues for the office, perform ITrelated tasks, and coordinate with HIR and outside computer vendors as needed",
      "perform general administrative tasks as needed"
    ],
    "qualifications": [
      "bachelor's degree or equivalent",
      "at least three years of office management experience",
      "at least two years of experience working in a congressional office",
      "strong administrative and organizational skills",
      "ability to manage multiple tasks and projects and to work well under pressure",
      "familiarity with House Rules, policies, and procedures relating to use of appropriated funds, purchasing, budgeting, payroll, personnel, and management of IT resources",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "Email cover letter and resume to OGC.Employment@mail.house.gov.",
    "salary_info": null,
    "contact": "OGC.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-400-16",
    "position_title": "Legislative Assistant",
    "office": "House Democrat and member of the House Appropriations Committee",
    "location": "Washington, DC",
    "posting_date": "2016-12-12",
    "description": "The legislative assistant would be responsible for a portfolio of legislative/policy issue areas, with an emphasis on the environment, energy, agriculture, telecommunications, natural disasters/emergency management, science/space, trade, and labor; working with senior staff on new legislative proposals; drafting of memos and talking points for the Member; drafting of speeches and remarks on legislative portfolio topics; drafting, review, and management of related letters; coordination with communications and district staff on press events; stakeholder meetings and proactive outreach; liaising with relevant committees; and developing and justifying co-sponsorship and vote recommendations. The incumbent would work with the full legislative team and report directly to the Legislative Director.",
    "responsibilities": [
      "Managing a legislative/policy issue areas portfolio, with an emphasis on the environment, energy, agriculture, telecommunications, natural disasters/emergency management, science/space, trade, and labor",
      "Working with senior staff on new legislative proposals",
      "Drafting memos and talking points for the Member",
      "Drafting speeches and remarks on legislative portfolio topics",
      "Drafting, review, and management of related letters",
      "Coordination with communications and district staff on press events",
      "Stakeholder meetings and proactive outreach",
      "Liaising with relevant committees",
      "Developing and justifying co-sponsorship and vote recommendations"
    ],
    "qualifications": [
      "A graduate degree in environmental studies or two to three years of environmental policy experience is required.",
      "Excellent writing skills",
      "Proven analytical abilities",
      "The ability to multitask and meet deadlines in a rigorous environment",
      "Strong interpersonal skills",
      "Hill experience and Florida ties a plus"
    ],
    "how_to_apply": "Please send resume and writing sample to DCResumes@mail.house.gov. No phone calls or drop-bys please.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "DCResumes@mail.house.gov",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-392-16",
    "position_title": "Staff Assistant",
    "office": "Ranking Democratic Member of the House Committee on Science, Space, and Technology",
    "location": "Full Committee staff",
    "posting_date": "2016-12-12",
    "description": "Duties include acting as the clerk for each hearing, communicating with Member offices, managing the front office, answering phones, hiring and managing interns, maintaining correspondence system and Committee records, assisting staff with research, and executing other administrative duties as needed.",
    "responsibilities": [
      "Acting as the clerk for each hearing",
      "Communicating with Member offices",
      "Managing the front office",
      "Answering phones",
      "Hiring and managing interns",
      "Maintaining correspondence system and Committee records",
      "Assisting staff with research",
      "Executing other administrative duties as needed"
    ],
    "qualifications": [
      "Strong organizational and communication skills",
      "The ability to work under tight deadlines",
      "Be able to multi-task effectively",
      "An interest in science policy is required",
      "Hill experience is a plus"
    ],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-390-16",
    "position_title": "Executive Assistant/Scheduler",
    "office": "Midwestern Democratic Member of Congress",
    "location": "Washington, DC",
    "posting_date": "2016-12-12",
    "description": "Midwestern Democratic Member of Congress seeks qualified and experienced executive assistant/scheduler with strong communication and organizational skills for the Washington, DC office. Ideal candidates will have at least three (5) years of experience as an executive assistant and/or scheduler/office manager, be detail oriented, have a strong work ethic, and be able to thrive in a fast paced work environment. Responsibilities include managing the Member’s daily schedule, arranging travel, coordinating all Member level meetings and event requests, as well as other duties as assigned. Access to a car is required as the position will involve driving the Member. Midwestern ties are a plus.",
    "responsibilities": [
      "Managing the Member’s daily schedule",
      "Arranging travel",
      "Coordinating all Member level meetings and event requests",
      "Other duties as assigned"
    ],
    "qualifications": [
      "At least three (5) years of experience as an executive assistant and/or scheduler/office manager",
      "Detail oriented",
      "Strong work ethic",
      "Able to thrive in a fast paced work environment",
      "Access to a car is required as the position will involve driving the Member",
      "Midwestern ties are a plus"
    ],
    "how_to_apply": "For consideration, email a cover letter and resume to MI.Opening@gmail.com\nPlease write “Executive Assistant/Scheduler Position” in the subject line. Please No calls or drop-ins.",
    "salary_info": null,
    "contact": "MI.Opening@gmail.com",
    "equal_opportunity": "Women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-389-16",
    "position_title": "Legislative Associate",
    "office": "Senior Democrat",
    "location": "District of Columbia",
    "posting_date": "2016-12-12",
    "description": "Senior Democrat is seeking a highly energetic, motivated and organized individual with strong writing and interpersonal skills who can manage multiple tasks and work well under pressure. The legislative associate is responsible for responding to constituent mail, including any research necessary to write an adequate response to the mail; monitoring House floor procedures; assisting the legislative director with drafting legislation; meeting with constituents and interested individuals/organizations; preparing congressional record entries; assisting the communications director with updating the website and Facebook and Twitter pages; and other duties as assigned.\n\nThe ideal candidate will be a results-oriented problem solver and a motivated self-starter who can think outside the box. Candidate must have a bachelor's degree, excellent writing and communication skills. Candidate must be a resident of, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Responding to constituent mail, including any research necessary to write an adequate response to the mail",
      "Monitoring House floor procedures",
      "Assisting the legislative director with drafting legislation",
      "Meeting with constituents and interested individuals/organizations",
      "Preparing congressional record entries",
      "Assisting the communications director with updating the website and Facebook and Twitter pages",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Excellent writing and communication skills",
      "Resident of, or be willing to become, a resident of the District of Columbia",
      "Results-oriented problem solver",
      "Motivated self-starter who can think outside the box"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to (202) 225-1129(fax) or DC00.NortonResume@mail.house.gov.",
    "salary_info": null,
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-386-16",
    "position_title": "Caseworker",
    "office": "Congressman Raul Ruiz, M.D. of California",
    "location": "Palm Desert, CA District Office",
    "posting_date": "2016-12-16",
    "description": "Caseworkers in the Office of Congressman Ruiz assist constituents by navigating complex casework through federal agencies in areas such as veterans affairs, social security, housing, and immigration. Caseworkers also assess casework and community activities for matters warranting legislative action.",
    "responsibilities": [
      "Assist constituents by navigating complex casework through federal agencies in areas such as veterans affairs, social security, housing, and immigration.",
      "Assess casework and community activities for matters warranting legislative action."
    ],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Prior experience working for state or local government is a plus.",
      "Candidates with fluency or strong verbal and written proficiency in Spanish are preferred.",
      "Strong knowledge or connection with Riverside County and California's 36th Congressional District is a plus.",
      "Availability for evening and weekend assignments maybe required at times."
    ],
    "how_to_apply": "Interested candidates should send their resumes and cover letter to CARuiz.Jobs@mail.house.gov. Please write “Caseworker” in the subject line of your email message.\nPlease NO walk-ins, faxes or phone calls.",
    "salary_info": null,
    "contact": "CARuiz.Jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Raul Ruiz, M.D. (CA-36) is an equal opportunity employer."
  },
  {
    "id": "MEM-374-16",
    "position_title": "Professional Staff Member",
    "office": "Democratic Staff of the House Committee on Small Business",
    "location": null,
    "posting_date": "2016-12-12",
    "description": "Democratic Staff of the House Committee on Small Business seeks a professional staff member to handle procurement policy, with an emphasis on small business contracting issues. Subject matter experience in federal setaside programs, federal agency buying practices, and federal acquisition policy is strongly preferred. The candidate must possess superior writing and analytic abilities, including strong organizational and interpersonal skills. Experience with hearing preparation and legislative development is a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please email cover letter and resume to procurement.job@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "procurement.job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-373-16",
    "position_title": "Caseworker",
    "office": "Congressman Raul Ruiz, M.D. of California",
    "location": "Palm Desert, CA District Office",
    "posting_date": "2016-12-12",
    "description": "Caseworkers in the Office of Congressman Ruiz assist constituents by navigating complex casework through federal agencies in areas such as veterans affairs, social security, housing, and immigration. Caseworkers also assess casework and community activities for matters warranting legislative action.",
    "responsibilities": [
      "Assist constituents by navigating complex casework through federal agencies in areas such as veterans affairs, social security, housing, and immigration.",
      "Assess casework and community activities for matters warranting legislative action."
    ],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Prior experience working for state or local government is a plus",
      "Fluency or strong verbal and written proficiency in Spanish are preferred",
      "Strong knowledge or connection with Riverside County and California's 36th Congressional District is a plus",
      "Availability for evening and weekend assignments maybe required at times"
    ],
    "how_to_apply": "Interested candidates should send their resumes and cover letter to CARuizjobs@mail.house.gov. Please write “Caseworker” in the subject ling of your email message. Please NO walk-ins, faxes or phone calls.",
    "salary_info": null,
    "contact": "CARuizjobs@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Raul Ruiz, M.D. (CA-36) is an equal opportunity employer."
  },
  {
    "id": "MEM-372-16",
    "position_title": "Legislative Assistant, or Senior Legislative Assistant",
    "office": "Senior California Democrat",
    "location": null,
    "posting_date": "2016-12-12",
    "description": "Senior California Democrat seeks Legislative Assistant, or Senior Legislative Assistant depending on qualifications, to handle work on the Financial Services Committee and other issues. Candidates should have substantial experience with financial services issues and substantial Congressional experience. The successful applicant will possess strong writing and oral communication skills, work well with others, be comfortable in a fast-paced environment, and understand the legislative process.",
    "responsibilities": [],
    "qualifications": [
      "Substantial experience with financial services issues",
      "Substantial Congressional experience",
      "Strong writing and oral communication skills",
      "Ability to work well with others",
      "Comfortable in a fast-paced environment",
      "Understand the legislative process"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter, resume, and three writing samples to HouseFinancialServicesLA@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "HouseFinancialServicesLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-367-16",
    "position_title": "Communications Director",
    "office": "Multi-term Southern Republican House Member",
    "location": "Washington, DC",
    "posting_date": "2016-12-12",
    "description": "Multi-term Southern Republican House Member seeks Communications Director with previous Capitol Hill experience",
    "responsibilities": [
      "to manage and coordinate all communications activities, including media contacts, for the Member and the office"
    ],
    "qualifications": [
      "at least 2 years of congressional experience and one year of experience as a Communications Director or Press Secretary",
      "strong academic credentials",
      "strong writing, editing, and proofreading skills",
      "strong oral communication skills",
      "understanding of print and broadcast media with a current working list of Washington and national media contacts",
      "thorough knowledge of legislative process",
      "knowledge of current issues and events in which the Member is involved",
      "ability to exercise discretion and independent judgment in the representation of the Member's positions on policy issues",
      "availability to work long hours",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with office staff, constituents, and media."
    ],
    "how_to_apply": null,
    "salary_info": null,
    "contact": "USHouseStaffJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-361-16",
    "position_title": "Legislative Assistant",
    "office": "A Western Republican member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2016-12-12",
    "description": "A Western Republican member of Congress seeks a Legislative Assistant for his Washington, D.C. office. The Assistant's primary areas of focus are Armed Services and Veteran's Affairs. Additional assignments may include Foreign Affairs and Space/Aerospace. For the assigned subject matter, the Assistant is expected to:",
    "responsibilities": [
      "Support the Representative's legislative priorities through legislative research, the drafting of legislation, acting as the liaison to the relevant committees, work with the Congressional Research Service, and identifying strategies to advance those legislative priorities;",
      "Prepare the member for committee hearings, staff those hearings and monitor/report to the Representative at times when he is unable to attend the meeting;",
      "Assist the Representative in preparing for interviews, meetings with constituents and interest groups, as well as note taking at such meetings and follow up action items;",
      "Draft answers or prepare outlines of responses to constituent mail;",
      "Draft speeches, statements and correspondence with the appropriate executive agencies for review by the Legislative Director, Chief of Staff, and the Representative;",
      "Develop and justify co-sponsorship and vote recommendations for review by the Legislative Director and Chief of Staff and for consideration by the Representative for bills in committee, mark up and on the floor in assigned areas of responsibility."
    ],
    "qualifications": [],
    "how_to_apply": "All interested applicants should send resume and cover letter to WesternRepublicanJobs@gmail.com.",
    "salary_info": null,
    "contact": "WesternRepublicanJobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-358-16",
    "position_title": "Press Secretary",
    "office": "Senior Appropriations Democrat",
    "location": null,
    "posting_date": "2016-12-12",
    "description": "Senior Appropriations Democrat seeks candidates for the position of Press Secretary for a fast-paced and highly engaged office. The successful candidate will have excellent written and verbal skills, the proven ability to manage multiple communications projects, and the ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues. S/he will be responsible for coordinating with the legislative team to develop, manage and organize all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website, implementing social media strategy, maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include briefing the Member\nfor interviews, writing and implementing PSAs, interacting with the press as\nthe Member's principal spokesperson and coordinating the Member's overall\npress relations. The ideal candidate will have Hill experience, a depth of\nlegislative and policy knowledge including that of the appropriations process,\nand Ohio connections of benefit. Candidates must be able to work extended\nhours, under time pressure, and in a strongly collaborative office, while\nmaintaining a positive attitude and demeanor.",
    "responsibilities": [
      "Coordinating with the legislative team to develop, manage and organize all communications activities",
      "Writing press releases",
      "Writing op-eds",
      "Writing mail pieces",
      "Writing talking points",
      "Organizing press events",
      "Maintaining the official website",
      "Implementing social media strategy",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Briefing the Member for interviews",
      "Writing and implementing PSAs",
      "Interacting with the press as the Member's principal spokesperson",
      "Coordinating the Member's overall press relations"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects",
      "Ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues",
      "Hill experience",
      "Depth of legislative and policy knowledge including that of the appropriations process",
      "Ohio connections of benefit",
      "Ability to work extended hours, under time pressure, and in a strongly collaborative office",
      "Maintaining a positive attitude and demeanor"
    ],
    "how_to_apply": "Please submit resume, cover letter, two writing samples, and salary requirements to Midwestern.Resume@mail.house.gov within the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-352-16",
    "position_title": "Investigative Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2016-12-12",
    "description": "The Committee on Oversight and Government Reform is the primary investigative committee of the U.S. House of Representatives. Rep. Elijah E. Cummings, the Ranking Member, is seeking an Investigative Counsel to join the Democratic staff to participate in all matters under the Committee's jurisdiction, including investigations, hearings, depositions, transcribed interviews, and briefings. The ideal candidate will be an attorney with 2-5 years of investigative or litigation experience.",
    "responsibilities": [],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Investigative Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-351-16",
    "position_title": "Community Coordinator",
    "office": "NYC Member of Congress",
    "location": "Lower East Side of Manhattan",
    "posting_date": "2016-12-16",
    "description": "Individual will develop strategies to increase outreach to LES and represent the office at public meetings.",
    "responsibilities": [],
    "qualifications": [
      "Strong knowledge of LES community",
      "Excellent verbal/written communication skills a plus"
    ],
    "how_to_apply": "E-mail resume to: ny20515@yahoo.com",
    "salary_info": null,
    "contact": "ny20515@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-350-16",
    "position_title": "Professional Staff Member",
    "office": "Democratic Staff of the House Committee on Small Business",
    "location": null,
    "posting_date": "2016-12-16",
    "description": "Democratic Staff of the House Committee on Small Business seeks a professional staff member to handle matters including but not limited to agency oversight, procurement, financial services, health, and/or technology.",
    "responsibilities": [
      "Hearing preparation",
      "Legislative development"
    ],
    "qualifications": [
      "Superior writing and analytic abilities, including strong organizational and interpersonal skills.",
      "Previous legislative experience is not necessary but preferred."
    ],
    "how_to_apply": "To apply, please email cover letter and resume to vacancy_employment@yahoo.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "vacancy_employment@yahoo.com",
    "equal_opportunity": null
  }
]