[
  {
    "id": "MEM-426-19",
    "position_title": "Investigator",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-09-03",
    "description": "The Committee on Ethics seeks an experienced investigative professional for an investigator position. The Committee’s investigator is responsible for assisting the Committee in all aspects of its investigative work, including researching and reviewing public data sources, forensic research, document review, data collection and analysis, preparing for and participating in witness interviews, and drafting and editing Committee documents.\n\nThis is a nonpartisan position which requires the ability to assist with impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding organizational, research, and analytical skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Assisting the Committee in all aspects of its investigative work",
      "Researching and reviewing public data sources",
      "Forensic research",
      "Document review",
      "Data collection and analysis",
      "Preparing for and participating in witness interviews",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Outstanding organizational, research, and analytical skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, or financial accounting",
      "Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred"
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigator” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-425-19",
    "position_title": "Communications Director",
    "office": "Midwest Republican Member",
    "location": null,
    "posting_date": "2019-09-03",
    "description": "Midwest Republican Member is seeking an experienced Communications Director to implement a strategic media plan in a fast-paced and resultsdriven environment. Candidates should have experience with the various media tools available, including: social media, video creation, website, e-newsletters and surveys, talking points/speechwriting, press releases, on-the-record experience and interview prep, and op-ed preparation.\nThis is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send submit their resume, cover letter, and two writing samples to communicationsdirectoropening@gmail.com",
    "salary_info": null,
    "contact": "communicationsdirectoropening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-423-19",
    "position_title": "Communications Director",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2019-09-03",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an\nexperienced, creative and highly motivated Communications Director to\nserve on the Congresswoman’s senior team.\n\nThe ideal candidate will be a strong writer and seasoned manager who can\nthink strategically, work collaboratively, and manage an ambitious\ncommunications program in a fast-paced setting under tight deadlines. This is\na senior position, and will be compensated accordingly.\n\nWomen, people of color, LGBTQ+ individuals, new Americans, people with\ndisabilities, and members of other underrepresented communities are strongly\nencouraged to apply. State and/or district ties are a plus.",
    "responsibilities": [
      "Serve as the primary spokesperson for the Congresswoman;",
      "Develop and maintain strong relationships with reporters, editors, producers,\nbookers and social media influencers;",
      "Proactively engage in media outreach, including pitching and fielding press\ninquiries;",
      "Manage the development of press releases, speeches and op-eds;",
      "Oversee an ambitious digital communications program;",
      "Supervise a Press Secretary and Digital Strategist;",
      "Prepare and staff the Congresswoman for press events and interviews; and",
      "Work collaboratively with the District Office to ensure strong local media\nengagement."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter,\nthree writing samples (including one speech) and three references.\n\nPlease send applications to jobs.pramila@mail.house.gov with\n“Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with\ndisabilities, and members of other underrepresented communities are strongly\nencouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-422-19",
    "position_title": "Staff Assistant",
    "office": "The House Committee on Energy and Commerce Democratic Staff (majority)",
    "location": "Washington, DC",
    "posting_date": "2019-09-03",
    "description": "The House Committee on Energy and Commerce Democratic Staff (majority) seeks an enthusiastic, motivated, and highly-organized staff assistant for fastpaced committee office.\n\nResponsibilities include tasks associated with a front office such as receptionist duties, answering phones, greeting visitors, ensuring that office and meeting rooms are kept in order; supporting staff in preparations for committee events such as hearings, markups, meetings, and events; delivering documents and obtaining signatures on letters; training and supervising interns; handling and sorting incoming mail, maintaining both digital and paper records and files, maintaining office supplies and mastering basic equipment operations; assisting other staff with research, work product, web content, special projects, and other duties as assigned.",
    "responsibilities": [
      "Receptionist duties, answering phones, greeting visitors, ensuring that office and meeting rooms are kept in order",
      "Supporting staff in preparations for committee events such as hearings, markups, meetings, and events",
      "Delivering documents and obtaining signatures on letters",
      "Training and supervising interns",
      "Handling and sorting incoming mail, maintaining both digital and paper records and files, maintaining office supplies and mastering basic equipment operations",
      "Assisting other staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Superior time management skills",
      "Ability to work collaboratively",
      "Hill experience preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and a short writing sample to ecdjobs@mail.house.gov",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-419-19",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office, District of Columbia",
    "posting_date": "2019-09-03",
    "description": "Senior Democratic Member of Congress seeks a bilingual English/Spanish speaker who is an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work. Importantly, constituent services staff also assist with neighborhood events and visits community groups in the district.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and in handling multiple tasks and issues effectively while making sure federal agencies respond in a timely manner and assuring our office responds promptly to constituent requests and concerns while meeting deadlines. A successful candidate will be able to communicate fluently in Spanish and English, work independently, and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful. The ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Assisting with neighborhood events",
      "Visiting community groups in the district",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Ensuring federal agencies respond in a timely manner",
      "Assuring the office responds promptly to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Bilingual in English and Spanish",
      "Energetic, organized, creative, self-starter",
      "Ability to work with patience and skill",
      "Ability to communicate fluently in Spanish and English",
      "Ability to work independently",
      "Ability to think outside the box",
      "Experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov",
    "salary_info": null,
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-419-19",
    "position_title": "Policy Advisor",
    "office": "Senior Democratic Member",
    "location": "Washington, DC",
    "posting_date": "2019-09-03",
    "description": "Position will develop and implement legislative initiatives, conduct oversight and investigations, write floor speeches and committee statements, and handle meetings with constituents and interest groups on behalf of Member.\n\nPortfolio will include financial services, housing, education, small business and tax issues. Prior Hill experience is strongly preferred. Law degree is strongly preferred but will consider other advanced degrees with significant Hill experience.",
    "responsibilities": [
      "Develop and implement legislative initiatives",
      "Conduct oversight and investigations",
      "Write floor speeches and committee statements",
      "Handle meetings with constituents and interest groups on behalf of Member"
    ],
    "qualifications": [
      "Prior Hill experience is strongly preferred",
      "Law degree is strongly preferred but will consider other advanced degrees with significant Hill experience"
    ],
    "how_to_apply": "To apply, please email a cover letter and resume with the words “Policy Advisor” in the subject line to job_09@live.com. Please paste your cover letter in the body of the email – do not send letter as an attachment.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-412-19",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "California office",
    "location": "Washington, DC",
    "posting_date": "2019-09-03",
    "description": "The position is responsible for answering constituent mail and e-mail and will coordinate with legislative staff to prepare responses. The staffer will organize and sort all incoming constituent inquiries and will ensure that outgoing responses are sent in a timely manner. This position also monitors all incoming correspondence, analyzes trends, and reports findings to senior staff and the Member.\n\nAdditional responsibilities include greeting visitors, answering the telephone, responding to constituent requests for general information, and handling other inquiries. This position also assists with miscellaneous administrative and legislative duties at the request of staff or the Member.",
    "responsibilities": [
      "Answering constituent mail and e-mail",
      "Coordinating with legislative staff to prepare responses",
      "Organizing and sorting all incoming constituent inquiries",
      "Ensuring that outgoing responses are sent in a timely manner",
      "Monitoring all incoming correspondence",
      "Analyzing trends",
      "Reporting findings to senior staff and the Member",
      "Greeting visitors",
      "Answering the telephone",
      "Responding to constituent requests for general information",
      "Handling other inquiries",
      "Assisting with miscellaneous administrative and legislative duties at the request of staff or the Member"
    ],
    "qualifications": [
      "Excellent writer",
      "Demonstrated interest in legislative issues",
      "Detail-oriented",
      "Able to manage multiple and competing tasks",
      "Excellent organizational and proofreading skills",
      "Affinity for multi-tasking",
      "Good sense of humor",
      "California ties (preferred)",
      "Capitol Hill experience (preferred)",
      "Spanish language fluency (preferred)",
      "Experience using Intranet Quorum (IQ) (preferred)"
    ],
    "how_to_apply": "If interested, please email a resume, cover letter, two writing samples, and references to CAJobs@mail.house.gov with “Staff Assistant/Legislative Correspondent” in the subject line.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": "Women and minorities are strongly encouraged to apply."
  },
  {
    "id": "MEM-402-19",
    "position_title": "Office Manager and Scheduling Assistant",
    "office": "Southern California Member of Congress",
    "location": "District Office",
    "posting_date": "2019-09-03",
    "description": "The Office Manager & Scheduling Assistant will assist the District Director with tracking office expenses, certificate requests, canopy requests, and Congressional Record statement requests.\n\nThe position will also work closely with the DC Scheduler to respond to scheduling requests and invitations, maintain the district requests list, and gather the necessary logistical details for events in the district. This person will also staff the Congressmember at events and will be required to take photos and videos as well.\n\nThe position also entails working with the district staff to plan various events and constituent engagement opportunities throughout the district and around the Congresswoman’s goals, such as health care, climate change and the environment. This person will help the District Director and Scheduler to develop a long- term, local scheduling plan, will work with the district staff to target priority communities, and will balance the Congresswoman’s public appearances in each area of the district and with key constituencies. This position will also oversee the office’s event planning checklist, and assist with the franked mail program.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please e-mail a resume and cover letter, including salary requirements, to Resume.Inbox7@mail.house.gov",
    "salary_info": null,
    "contact": "Resume.Inbox7@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-401-19",
    "position_title": "Staff Assistant",
    "office": "House Committee on Oversight and Reform Democratic Staff",
    "location": "Capitol Hill",
    "posting_date": "2019-09-03",
    "description": "The House Committee on Oversight and Reform Democratic Staff has an opening for a Staff Assistant. Duties include: answering telephones; receiving visitors at the front desk; assisting with the tracking and processing of committee correspondence; receiving, tracking and processing large document productions; providing administrative support for committee hearings, markups and meetings; entering data and navigating databases with accuracy; and proofreading documents and correspondence for style and typographical errors.",
    "responsibilities": [
      "answering telephones",
      "receiving visitors at the front desk",
      "assisting with the tracking and processing of committee correspondence",
      "receiving, tracking and processing large document productions",
      "providing administrative support for committee hearings, markups and meetings",
      "entering data and navigating databases with accuracy",
      "proofreading documents and correspondence for style and typographical errors"
    ],
    "qualifications": [
      "excellent organizational and time management skills",
      "the ability to work cooperatively and courteously with others",
      "strong written and oral communication skills",
      "proficiency in Microsoft Word and Excel",
      "good judgment and discretion",
      "flexibility in assisting with daily tasks and projects",
      "One year of prior Capitol Hill experience is strongly preferred."
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Staff Assistant” in the subject line. No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-400-19",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Marcia L. Fudge",
    "location": "Warrensville Heights, OH",
    "posting_date": "2019-09-03",
    "description": "Congresswoman Marcia L. Fudge seeks a Staff Assistant for her flagship office in Warrensville Heights, OH. The successful candidate will work well under tight deadlines, is organized, hard-working, detail oriented, has excellent customer service skills and is a team player. greets visitors, answers the telephone and constituent requests for general information and other inquiries, assists the District Director & Scheduler as needed, and drafts all proclamations, letters of congratulations, etc. In addition, responsibilities include taking photos at official events, and assisting with other administrative and casework duties as assigned.",
    "responsibilities": [
      "Answers and screens telephone calls for the Member and staff, taking messages when appropriate;",
      "Greets and screens visitors;",
      "Receives and handles all requests for proclamations, congratulatory letters, etc.;",
      "Assists persons who have appointments with the Member or staff, and works closely with the Scheduler/Office Manager to ensure the smooth coordination of the Member's appointments;",
      "Assists with the processing of constituent mail;",
      "Responds to constituent requests for information;",
      "Receives deliveries and distributes them as appropriate in a timely manner;",
      "Ensures that requests for assistance are timely directed to appropriate staff;",
      "Documents visitor opinions on issues communicated via telephone, including full name, address, and all appropriate, relevant information;",
      "Performs general administrative assignments;",
      "Manages the transmission, receipt and distribution of faxes;;",
      "Answers constituent letters, as directed;",
      "Provides information on and generates ideas for press, new media, mass mailings, and newsletters; and",
      "Performs special projects assigned by the Congresswoman, Chief of Staff or District Director."
    ],
    "qualifications": [
      "Maintain a good working relationship with the Congresswoman, staff and constituents;",
      "Communicate with diverse personalities in a tactful, pleasant, and professional manner;",
      "Be able to work cooperatively and courteously with others;",
      "Work well under pressure and handle stress in a productive way;",
      "Be available to work long hours, nights, and weekends as may be needed; and",
      "Perform other duties as assigned.",
      "Bachelor's Degree",
      "Prior Congressional staff assistant or intern experience preferred, but not required",
      "Ability to use digital work center, computers, telephones and other office equipment;",
      "Excellent organizational skills;",
      "Strong ability to organize and prioritize tasks;",
      "Excellent writing and proofreading/editing skills;",
      "Professional telephone etiquette;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications; and",
      "Proficiency in use of most recently revised Microsoft Office Suite applications and new media technology.",
      "Work is mainly performed in an office environment and noise levels are usually moderate; and",
      "Ability to work in a small work station without an expectation of privacy is required.",
      "Familiarity with the state of Ohio, and the 11th Congressional District is preferred but not required."
    ],
    "how_to_apply": "Interested applicants must submit a cover letter, resume, and writing sample to Clifton.Williams@mail.house.gov, including “OH11 Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Clifton.Williams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-398-19",
    "position_title": "Caseworker/Field Representative",
    "office": "Office of Congresswoman Marcia L. Fudge (OH-11)",
    "location": "Warrensville Heights OH",
    "posting_date": "2019-09-03",
    "description": "The Office of Congresswoman Marcia L. Fudge (OH-11) seeks a hardworking, people-oriented, and highly organized Caseworker/Field Representative to join her staff. The position is located in Warrensville Heights OH, but serves the entire Congressional District.\n\nThe successful candidate will provide relevant service to constituents and often represent the Congresswoman within his or her portfolio areas of responsibility.",
    "responsibilities": [
      "establishing and maintaining relationships with local organizations, business and community leaders on behalf of the Congresswoman",
      "monitoring district and local issues",
      "acting as liaison to federal agencies",
      "handling casework",
      "managing special projects",
      "assisting with events and other activities as assigned"
    ],
    "qualifications": [
      "excellent verbal and written communications skills",
      "exceptional organizational skills",
      "the ability to work well in a fast-paced, sometimes high stress environment",
      "the desire and ability to work within and add value to a cross-functional team",
      "the ability to adapt and be flexible",
      "the ability to anticipate problems, take initiative, and offer solutions",
      "valid driver’s license",
      "reliable transportation",
      "appropriate automobile insurance",
      "Familiarity with the state of Ohio, and the 11th Congressional District is preferred."
    ],
    "how_to_apply": "Interested applicants must submit a cover letter, resume, and writing sample to Clifton.Williams@mail.house.gov, including “OH11 Caseworker/Field Rep” in the subject line.",
    "salary_info": null,
    "contact": "Clifton.Williams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-397-19",
    "position_title": "Staff Assistant",
    "office": "Office of Congresswoman Marcia L. Fudge",
    "location": "Akron, Ohio",
    "posting_date": "2019-09-03",
    "description": "The Office of Congresswoman Marcia L. Fudge seeks a Part Time Staff\nAssistant for her Summit County office located in Akron, Ohio. The\nsuccessful candidate will be a well-organized, proactive professional who\ninteracts well with the public, follows instructions, performs well under\npressure and maturely contributes as an effective team member.",
    "responsibilities": [
      "Greet visitors, answer telephones, field inquiries from constituents",
      "Light scheduling for the Outreach Coordinator",
      "Review and distribute correspondence, as needed",
      "Inventory control",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Strong interpersonal skills",
      "Effective and professional phone etiquette",
      "Attention to detail",
      "Proficiency in Microsoft Office Suite",
      "Ability to complete tasks efficiently and thoroughly and meet deadlines",
      "Strong writing skills",
      "Online research skills",
      "Highly motivated and able to take initiative",
      "Ability to work with a cross-functional team"
    ],
    "how_to_apply": "Send cover letter, resume and writing sample to Clifton Williams at\nClifton.Williams@mail.house.gov and Joan Williams at\nJoan.Williams@mail.house.gov. No walk-ins or telephone calls please.",
    "salary_info": "The salary will be based on experience.",
    "contact": "Clifton.Williams@mail.house.gov and Joan.Williams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-395-19",
    "position_title": "District Scheduler/Office Manager",
    "office": "North Bay legislative office",
    "location": "California",
    "posting_date": "2019-09-03",
    "description": "Responsibilities include coordinating the legislator's California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans; working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters.\n\nAlso responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties. Opportunities for additional responsibilities commensurate with skills and abilities. A successful candidate will be highly organized, detail oriented, possess strong writing skills, have experience working in a fast-paced office, and the ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects.",
    "responsibilities": [
      "Coordinating the legislator's California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans",
      "Working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters",
      "Assisting the Capitol office and District Director on maintaining financial and expense records",
      "Assisting with various administrative duties"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov with the subject like “CA02 District Scheduler/Office Manager.”",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-394-19",
    "position_title": "Digital Press Secretary",
    "office": "House Committee on Oversight and Reform Majority Staff",
    "location": null,
    "posting_date": "2019-09-03",
    "description": "The House Committee on Oversight and Reform Majority Staff seeks an active and reliable Digital Press Secretary. Responsibilities include managing the website, crafting content for social media channels, developing graphics and videos, covering hearings and press events, and working with our press team to identify new ways to engage our followers.",
    "responsibilities": [
      "Managing the website",
      "Crafting content for social media channels",
      "Developing graphics and videos",
      "Covering hearings and press events",
      "Working with our press team to identify new ways to engage our followers"
    ],
    "qualifications": [
      "At least 1 to 2 years of communications and digital experience",
      "Proficient in Adobe programs (Photoshop, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects), CMS, CSS, HTML, manual photography, analytics",
      "Enjoy working in a fast-paced, rapid response environment"
    ],
    "how_to_apply": "Candidates should submit a resume and portfolio with the subject line “Digital Press Secretary” to Oversightpress@mail.house.gov. Please, no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "Oversightpress@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-390-19",
    "position_title": "District Field Representative",
    "office": "Congressman Frank Pallone, Jr.",
    "location": "Long Branch and New Brunswick",
    "posting_date": "2019-09-03",
    "description": "The district office of Congressman Frank Pallone, Jr. seeks a hard-working, organized individual for positions available in Long Branch and New Brunswick. These positions entail community outreach, constituent case work, and staffing and driving the Congressman.\n\nOther responsibilities include meeting with local community officials, representing the Congressman at community and governmental events, special projects, as well as general office work.",
    "responsibilities": [
      "Community outreach",
      "Constituent case work",
      "Staffing and driving the Congressman",
      "Meeting with local community officials",
      "Representing the Congressman at community and governmental events",
      "Special projects",
      "General office work"
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Must enjoy working with the public",
      "Dedicated, hard-working, team player",
      "Prior experience in government, the non-profit sector, community and grassroots organizing is preferred"
    ],
    "how_to_apply": "To apply for this position, please send a resume, cover letter, writing sample, and references by email to NJ06.Jobs@mail.house.gov. Valid driver’s license is required. No telephone calls or drop ins, please.",
    "salary_info": null,
    "contact": "NJ06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-385-19",
    "position_title": "LEGISLATIVE AIDE",
    "office": "California Democrat",
    "location": "Capitol Hill",
    "posting_date": "2019-09-03",
    "description": "Candidates should have excellent research, writing, and communication skills. Duties include administrative assistance, research, special projects, and constituent correspondence. Prior experience on Capitol Hill is preferred. Office is an equal opportunity employer.",
    "responsibilities": [
      "Administrative assistance",
      "Research",
      "Special projects",
      "Constituent correspondence"
    ],
    "qualifications": [
      "Excellent research, writing, and communication skills.",
      "Prior experience on Capitol Hill is preferred."
    ],
    "how_to_apply": "Qualified candidates should send resume, cover letter, and one writing sample to CADemocratResumes@gmail.com",
    "salary_info": null,
    "contact": "CADemocratResumes@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer."
  },
  {
    "id": "MEM-384-19",
    "position_title": "Executive Assistant",
    "office": "Republican Energy and Commerce Member",
    "location": "D.C. and the district",
    "posting_date": "2019-09-03",
    "description": "Active Republican Energy and Commerce Member seeks an Executive Assistant to manage the Member's schedule and office logistics. Primary duties include processing all scheduling requests, maintaining the Member's schedule, and ensuring the Member has briefing materials for all meetings in D.C. and the district.",
    "responsibilities": [
      "Processing all scheduling requests",
      "Maintaining the Member's schedule",
      "Ensuring the Member has briefing materials for all meetings in D.C. and the district"
    ],
    "qualifications": [
      "Highly organized and skilled at handling multiple tasks at once",
      "Detail oriented",
      "Able to keep up in a fast paced environment",
      "Proactive, anticipating the needs and expectations of the Member",
      "Team oriented with good communication skills",
      "Resourceful and able to solve problems creatively and independently",
      "Prior Congressional experience is preferred"
    ],
    "how_to_apply": "To apply please send a resume and cover letter to GOPhousescheduler@gmail.com",
    "salary_info": null,
    "contact": "GOPhousescheduler@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-382-19",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Tulsi Gabbard’s Hawaii District Office",
    "location": "Honolulu",
    "posting_date": "2019-09-03",
    "description": "Job responsibilities include fielding constituent calls, processing mail, internship program coordination, processing casework intake and constituent requests for information, maintaining a photographic database, drafting correspondence, maintaining office equipment, and other administrative duties as needed. In addition, the staff assistant occasionally represents Congresswoman Gabbard at community meetings or events.\n\nWe are seeking applicants to join our fun, team-oriented, hard-working office. The ideal candidate will possess a can-do attitude and will be process and solution oriented. He or she will also be an independent worker, a self-starter and will possess the capacity to produce high quality work on short deadlines. He or she will also have a demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment.",
    "responsibilities": [
      "Fielding constituent calls",
      "Processing mail",
      "Internship program coordination",
      "Processing casework intake and constituent requests for information",
      "Maintaining a photographic database",
      "Drafting correspondence",
      "Maintaining office equipment",
      "Other administrative duties as needed",
      "Occasionally represents Congresswoman Gabbard at community meetings or events"
    ],
    "qualifications": [
      "Can-do attitude",
      "Process and solution oriented",
      "Independent worker",
      "Self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment"
    ],
    "how_to_apply": "Please do not call or drop in to the office; qualified applicants may email a cover letter, resume and two writing samples with “Staff Assistant” in the email title to:",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": "Veteran applications are welcome!"
  },
  {
    "id": "MEM-381-19",
    "position_title": "Professional Staff Member or Counsel",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": null,
    "posting_date": "2019-09-03",
    "description": "The Energy & Commerce Committee, Democratic Staff seeks dedicated, organized and enthusiastic candidates to join the Communications and Technology Subcommittee staff as Professional Staff Member or Counsel.\n\nThe jurisdiction of the subcommittee includes traditional and emerging communications technologies generally and as they relate to emergency and public safety communications, consumer protection, cybersecurity, privacy, and data security.\n\nThe subcommittee oversees the Federal Communications Commission, the National Telecommunications and Information Administration, the Office of Emergency Communications in the Department of Homeland Security, and all aspects of the above-referenced jurisdiction related to the Department of Homeland Security.\n\nThe position requires the handling of substantive legislative and administrative tasks, including staffing hearings and markups, conducting oversight, and drafting legislation. Qualified candidates must have strong writing, analytical, legislative, and organizational skills; a proven ability to perform under pressure while juggling multiple tasks with competing priorities; a willingness to work long hours and weekends; and sound political judgment. Candidates should have experience working with relevant public interest groups, the FCC, Congress, and industry. Law degree preferred but not required.",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation"
    ],
    "qualifications": [
      "Strong writing, analytical, legislative, and organizational skills",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Willingness to work long hours and weekends",
      "Sound political judgment",
      "Experience working with relevant public interest groups, the FCC, Congress, and industry",
      "Law degree preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line C&T PSM/Counsel Candidate",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age. Women, minority, and veteran candidates are highly encouraged to apply."
  },
  {
    "id": "MEM-380-19",
    "position_title": "Constituent Services Representative, Palmdale",
    "office": "Office of Congresswoman Katie Hill",
    "location": "Palmdale, CA",
    "posting_date": "2019-09-03",
    "description": "The Office of Congresswoman Katie Hill is looking for a full-time\nConstituent Services Representative to act as an accessible, approachable, and\neffective bridge between the community and the office. The Constituent\nServices Representative will lead the office’s veterans casework and\ncommunity outreach operation to deliver excellent constituent services. The\nright candidate is a self-starter, passionate about civil service, and is able to\nwork both independently and as part of a team. Those with experience and a\nstrong interest in working with veterans are encouraged to apply.\n\nThis is a full-time salaried position, reporting to the Deputy District Director.\nThe Constituent Services Representative will be based out of the Palmdale\ndistrict office during normal operating hours and is also expected to attend\nevents outside the office during the week, some evenings, and on weekends.",
    "responsibilities": [
      "To assist constituents with cases involving federal agencies, predominantly the United States Department of Veterans Affairs",
      "to represent the Member and the office at community events and in meetings",
      "to assist the District team in planning and staffing events hosted by our office",
      "to answer correspondence and verbal communications with constituents including answering the telephone, greeting visitors to the office, and responding to constituent requests for general information",
      "to maintain a professional and courteous front office",
      "to take the lead on various community outreach and legislative projects, as assigned."
    ],
    "qualifications": [
      "Minimum of 3 years work experience, preferably in a related field, such as social work or customer service",
      "a strong track record of community service",
      "demonstrable knowledge of local issues and events in which the Member is involved or in key issue areas",
      "strong oral and written communication skills, including proven ability to convey empathy and exercise discretion and good judgement",
      "proficiency in word processing, operation of office equipment, and general tech savvy",
      "excellent organizational skills, thoroughness, and careful attention to detail",
      "skill in organizing and prioritizing work tasks and activities",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with others",
      "availability to work nights and weekends, as necessary"
    ],
    "how_to_apply": "To apply, please send resume and cover letter to:",
    "salary_info": null,
    "contact": "Andrea.Rosenthal@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-379-19",
    "position_title": "Constituent Services Assistant",
    "office": "Office of Congresswoman Katie Hill",
    "location": "Simi Valley",
    "posting_date": "2019-09-03",
    "description": "The Constituent Services Assistant serves as an accessible, approachable, and effective bridge between the community and the Office of Congresswoman Katie Hill. The Constituent Services Assistant conducts casework and community outreach to deliver excellent constituent services. This individual is a self-starter, passionate about civil service, and is able to work both independently and as part of a team.\n\nThis role is a part-time position, reporting to the Constituent Services Representative in Simi Valley. The Constituent Services Assistant is based out of the Simi Valley district office during normal operating hours and will have the opportunity to attend occasional events on behalf of the office during the week, some evenings, and on weekends.",
    "responsibilities": [
      "To assist constituents with cases involving federal agencies",
      "to assist the District team in planning and staffing events hosted by our office",
      "to answer correspondence and verbal communications with constituents including answering the telephone, greeting visitors to the office, and responding to constituent requests for general information",
      "to maintain a professional and courteous front office",
      "to take the lead on with various community outreach and legislative projects, as assigned."
    ],
    "qualifications": [
      "Prior work or educational experience in a related field, such as social work or customer service",
      "a strong track record of community service",
      "strong oral and written communication skills, including proven ability to convey empathy and exercise discretion and good judgement",
      "proficiency in word processing, operation of office equipment, and general tech savvy",
      "excellent organizational skills, thoroughness, and careful attention to detail",
      "skill in organizing and prioritizing work tasks and activities",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with others."
    ],
    "how_to_apply": "To apply, please send a resume and cover letter to:",
    "salary_info": null,
    "contact": "Melissa.Pender@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-378-19",
    "position_title": "District Representative",
    "office": "Congressman John Garamendi (CA-03)",
    "location": "Fairfield office",
    "posting_date": "2019-09-03",
    "description": "Job responsibilities include monitoring district and local issues; acting as a liaison to federal, district, and local agencies in Solano County; working with constituents who have an issue with a federal agency ensuring they receive a timely response; and ensuring that the office is appropriately staffed during office hours.",
    "responsibilities": [
      "Monitoring district and local issues",
      "Acting as a liaison to federal, district, and local agencies in Solano County",
      "Working with constituents who have an issue with a federal agency ensuring they receive a timely response",
      "Ensuring that the office is appropriately staffed during office hours"
    ],
    "qualifications": [
      "Hard working",
      "Excellent oral and written communications skills",
      "Knowledge of Solano County",
      "Ability to multi-task",
      "Meet deadlines",
      "Produce a quality work product",
      "A flexible schedule and ability to travel throughout the district is required"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to ca.03.resumes@gmail.com, please include District Representative in the subject line.",
    "salary_info": null,
    "contact": "ca.03.resumes@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-376-19",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Jahana Hayes (D-CT)",
    "location": "Washington, DC",
    "posting_date": "2019-09-03",
    "description": "Duties include: greeting visitors, answering the telephone constituent requests for general information, tours, and other inquiries, ordering all office supplies and maintaining office equipment, among other administrative and legislative duties as assigned.\n\nThe ideal candidate will: work well under pressure and handle stress, be able to communicate with a variety of personalities in a tactful, pleasant, and professional manner, have the ability to work cooperatively and courteously with others, accept performance-based criticism and direction, and be able to work a flexible schedule including long hours, nights, and weekends.",
    "responsibilities": [
      "greeting visitors",
      "answering the telephone constituent requests for general information, tours, and other inquiries",
      "ordering all office supplies",
      "maintaining office equipment",
      "other administrative and legislative duties as assigned"
    ],
    "qualifications": [
      "work well under pressure and handle stress",
      "be able to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "have the ability to work cooperatively and courteously with others",
      "accept performance-based criticism and direction",
      "be able to work a flexible schedule including long hours, nights, and weekends"
    ],
    "how_to_apply": "To apply for this position, please email Jahana.Hayes@mail.house.gov with a cover letter and resume, with email subject line “STAFF ASSISANT FIRST NAME LAST NAME.” No walk-ins or calls, please.",
    "salary_info": null,
    "contact": "Jahana.Hayes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-375-19",
    "position_title": "Assistant Clerk/Security Manager",
    "office": "House Committee",
    "location": null,
    "posting_date": "2019-09-03",
    "description": "This person will work with the Chief Clerk & Deputy Clerk to coordinate logistical aspects of hearings, markups, and Committee meetings.\nOther responsibilities include managing the Legislative Calendar, hearing documents, Committee archives, and the transcript review process.\nThis person would also serve as the Committee’s Security Manager to manage classified and sensitive materials, briefings, hearings, meetings, etc. The Assistant Clerk / Security Manager would also manage security clearances for Members and staff, manage the Committee SCIF, and work effectively with the House Security Office.",
    "responsibilities": [
      "Coordinate logistical aspects of hearings, markups, and Committee meetings.",
      "Managing the Legislative Calendar",
      "Managing hearing documents",
      "Managing Committee archives",
      "Managing the transcript review process",
      "Serve as the Committee’s Security Manager to manage classified and sensitive materials, briefings, hearings, meetings, etc.",
      "Manage security clearances for Members and staff",
      "Manage the Committee SCIF",
      "Work effectively with the House Security Office."
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Good written and verbal communication skills",
      "Be able to handle multiple projects simultaneously in a demanding work environment.",
      "TS or TS/SCI clearance is required.",
      "Prior Hill experience is strongly preferred."
    ],
    "how_to_apply": "Interested candidates should e-mail a cover letter and resume to Oversightjobs@mail.house.gov with “Assistant Clerk/Security Manager” in the subject line.",
    "salary_info": null,
    "contact": "Oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-373-19",
    "position_title": "Executive Assistant",
    "office": "House Republican Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2019-09-03",
    "description": "House Republican Member of Congress seeks an experienced individual to serve as his Executive Assistant in his Washington, D.C. office. This individual will also serve as the Office Manager and Intern Coordinator.\n\nPosition duties include, but are not limited to: maintaining Member's Washington, DC and district calendars, managing all incoming meeting requests and invitations, coordinating travel and logistics, processing office invoices for vendor payment, maintaining stock of office supplies, overseeing the day-to-day operations of the office, processing/scheduling all incoming tour requests, managing the office's internship program, and other duties as required.",
    "responsibilities": [
      "Maintaining Member's Washington, DC and district calendars",
      "Managing all incoming meeting requests and invitations",
      "Coordinating travel and logistics",
      "Processing office invoices for vendor payment",
      "Maintaining stock of office supplies",
      "Overseeing the day-to-day operations of the office",
      "Processing/scheduling all incoming tour requests",
      "Managing the office's internship program",
      "Other duties as required"
    ],
    "qualifications": [
      "Well-organized",
      "Possess a keen attention to detail",
      "Work well in a fast-paced environment",
      "Have strong interpersonal skills"
    ],
    "how_to_apply": "Please submit resume and cover letter to executiveassistantjob2019@gmail.com",
    "salary_info": null,
    "contact": "executiveassistantjob2019@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-252-19",
    "position_title": "Legislative Counsel",
    "office": "Rep. Justin Amash (MI-03)",
    "location": "Washington, DC",
    "posting_date": "2019-09-03",
    "description": "The Office of Rep. Justin Amash (MI-03) is seeking a bright, creative, and self-motivated legislative counsel to join our Washington, DC-based policy team.\n\nThe legislative counsel will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The person will be expected to handle a diverse portfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "Applicants must have a JD or equivalent.",
      "Two years of relevant policy experience is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"legislative counsel applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  }
]