[
  {
    "id": "MEM-118-23",
    "position_title": "Digital Manager",
    "office": "Congressman Adam Smith",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-27",
    "description": "This individual will be responsible for overseeing the Congressman’s social media accounts, supporting targeted digital outreach through texting, email, and ads, and assisting with some press duties. This individual reports to the Communications Director.\n\nWe are looking for someone who can help grow the Congressman’s social media presence and convey the Congressman’s voice and priorities into digital content.\n\nThe ideal candidate understands how to use social media and other digital tools to creatively connect with the district and other audiences. Prior experience with digital media and graphic design is preferred.\n\nCandidates should demonstrate skills with photography, videography, and photo and video editing and proficiency in Adobe Creative Suite (Premiere Pro, Photoshop, InDesign) and Canva. Candidates should demonstrate strong creative skills and an interest in thinking outside the box; excellent oral and written communication skills, including writing, editing, and proofreading; thoroughness and careful attention to detail; ability to work cooperatively and courteously with others in a fast-paced office; and a professional manner. Ties to and knowledge of the Ninth Congressional District are desired. This is not an entry-level position.",
    "responsibilities": [
      "Overseeing the Congressman’s social media accounts",
      "Supporting targeted digital outreach through texting, email, and ads",
      "Assisting with some press duties"
    ],
    "qualifications": [
      "Skills with photography, videography, and photo and video editing",
      "Proficiency in Adobe Creative Suite (Premiere Pro, Photoshop, InDesign) and Canva",
      "Strong creative skills and an interest in thinking outside the box",
      "Excellent oral and written communication skills, including writing, editing, and proofreading",
      "Thoroughness and careful attention to detail",
      "Ability to work cooperatively and courteously with others in a fast-paced office",
      "A professional manner",
      "Ties to and knowledge of the Ninth Congressional District are desired"
    ],
    "how_to_apply": "To be considered, please submit a resume, cover letter, and 3 digital/creative samples to wa09jobs@mail.house.gov no later than Friday, March 3rd with “DIGITAL MANAGER” in the subject line. No phone calls or drop-ins, please.",
    "salary_info": "$58k+, dependent on qualifications and experience, with Federal employee benefits",
    "contact": "wa09jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer."
  },
  {
    "id": "MEM-113-23",
    "position_title": "Chief Counsel",
    "office": "House Select Subcommittee on the Coronavirus Pandemic",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "Rep. Raul Ruiz, M.D., the Ranking Member of the House Select Subcommittee on the Coronavirus Pandemic, is seeking a Chief Counsel to join the Democratic staff of the Select Subcommittee.\n\nThe Select Subcommittee on the Coronavirus Pandemic is authorized to investigate a broad range of matters pertaining to the coronavirus pandemic under H. Res. 5. The Select Subcommittee was established within the Committee on Oversight and Accountability, which is the primary investigative committee of the United States House of Representatives, with jurisdiction to investigate “any matter” at “any time” under House Rule X.",
    "responsibilities": [
      "Overseeing investigations, depositions, and transcribed interviews."
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Ability to enjoy collaborative work environments",
      "Prior experience in congressional oversight and direct investigations is strongly preferred."
    ],
    "how_to_apply": "Please send a resume and cover letter as PDFs to SSCPJobs@mail.house.gov, with “Chief Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "SSCPJobs@mail.house.gov",
    "equal_opportunity": "Women, LGBTQI+, and BIPOC candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-108-23",
    "position_title": "Legislative Director",
    "office": "Rep. Josh Gottheimer (NJ-5)",
    "location": "Washington, DC",
    "posting_date": "2023-02-27",
    "description": "Rep. Josh Gottheimer (NJ-5), Co-Chair of the Problem Solvers Caucus, member of the House Permanent Select Committee on Intelligence, and member of the House Committee on Financial Services, seeks qualified candidates for the position of Legislative Director to join his Washington, DC team.",
    "responsibilities": [
      "Leading the development and implementation of the Member’s short-term and long-term legislative priorities with the Member and Chief of Staff;",
      "Monitoring and managing activity on the House Floor, and working with the legislative team to develop vote recommendations;",
      "Managing the legislative team and overseeing their day-to-day progress;",
      "Developing and reviewing memos, remarks, committee materials, and other briefing materials for the Member on related topics;",
      "Working closely with the Chief of Staff and the communications team on messaging legislative issues;",
      "Managing a portfolio of senior legislative projects, especially around major legislative negotiations around the Member’s work with the Problem Solvers Caucus;",
      "Working closely with bi-partisan Member staff in the House and Senate."
    ],
    "qualifications": [
      "A Bachelor’s degree or related job experience;",
      "3-5 years of legislative experience in a Congressional office or legislative environment;",
      "Knowledge of the legislative process and procedures;",
      "Excellent attention to detail and strong organizational skills;",
      "Sound judgment;",
      "Strong communication skills;",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner;",
      "Willingness to accept direction and guidance on performance and process improvements from the Member and the Chief of Staff;",
      "The ability to thrive in a fast-paced environment;",
      "The ability to work flexible hours including long hours, nights, and weekends;",
      "The ability to anticipate challenges and proactively offer solutions."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Legislative Director - Last Name” as the subject line to NJ5Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-107-23",
    "position_title": "Executive Assistant/Scheduler",
    "office": "Office of Congresswoman Sara Jacobs (CA-51)",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-27",
    "description": "The Office of Congresswoman Sara Jacobs (CA-51) is looking for a calm, adaptable, and detail-oriented Executive Assistant/Scheduler for her Washington, D.C. office.\n\nThe primary responsibility will be driving and staffing the Congresswoman while she is in Washington, D.C. Other responsibilities will include assisting the Deputy Chief of Staff and operations team with scheduling meetings, managing the Congresswoman’s calendar, building the Congresswoman’s briefing book, and other administrative duties as assigned.\n\nIdeal candidates will have good judgment, common sense, an eye for detail, and a good sense of humor. They will be able to anticipate the needs of the Congresswoman and problem-solve on their feet.\n\nThis is not a 9-5 job; some nights and weekends will be required, especially during legislative sessions. Sales or service industry skills are preferred; a valid driver’s license and a good driving record are required.",
    "responsibilities": [
      "Driving and staffing the Congresswoman while she is in Washington, D.C.",
      "Assisting the Deputy Chief of Staff and operations team with scheduling meetings",
      "Managing the Congresswoman’s calendar",
      "Building the Congresswoman’s briefing book",
      "Other administrative duties as assigned"
    ],
    "qualifications": [
      "Good judgment",
      "Common sense",
      "An eye for detail",
      "A good sense of humor",
      "Sales or service industry skills preferred",
      "Valid driver’s license and a good driving record are required"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume with “Executive Assistant/Scheduler (DC)” in the subject line to SaraJacobs.Resumes@mail.house.gov. Applications will be considered on a rolling basis, with priority given to earlier applicants.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Jacobs is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Applicants do not need a college degree to apply."
  },
  {
    "id": "MEM-105-23",
    "position_title": "Press Assistant",
    "office": "House Committee on Agriculture Republicans",
    "location": "Capitol Hill",
    "posting_date": "2023-02-27",
    "description": "The House Committee on Agriculture is seeking a detail-oriented and enthusiastic press assistant to join the communications shop.\nThe ideal candidate will have strong writing skills and work well in a rapidresponse environment.\nGeneral knowledge of agriculture is a bonus but not required. While day-to-day responsibilities may vary, the press assistant can expect to perform the following duties with regularity:",
    "responsibilities": [
      "Assist the communications director with drafting speeches, talking points, opeds, blogs, press releases, etc.",
      "Lead media tracking efforts by collecting press hits for the Committee and member offices.",
      "Draft Committee newsletters in consultation with the communications director and deputy communications director.",
      "Assist deputy communications director with member office requests during hearings.",
      "Assist the communications director in handling press inquiries and background conversations."
    ],
    "qualifications": [
      "Minimum 1-2 years in Capitol Hill or political experience",
      "Strong writing and strategic thinking skills",
      "Attention to detail",
      "Able to manage varying priorities and balance multiple deadlines",
      "A good attitude"
    ],
    "how_to_apply": "Interested candidates should send their resume and two writing samples to houseaggop@gmail.com.",
    "salary_info": null,
    "contact": "houseaggop@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-102-23",
    "position_title": "Legislative Correspondent",
    "office": "Conservative Congressman",
    "location": "Washington, DC",
    "posting_date": "2023-02-27",
    "description": "Responsibilities include drafting grant letters of support, constituent letters, sorting and batching mail, and assisting the legislative staff with various projects.\n\nApplicants should possess strong conservative credentials, effective writing and research skills, attention to detail, and the ability to manage multiple tasks at once. Position also includes a potential opportunity to manage a small legislative portfolio. Previous Capitol Hill experience preferred.",
    "responsibilities": [
      "Drafting grant letters of support",
      "Constituent letters",
      "Sorting and batching mail",
      "Assisting the legislative staff with various projects"
    ],
    "qualifications": [
      "Strong conservative credentials",
      "Effective writing and research skills",
      "Attention to detail",
      "Ability to manage multiple tasks at once",
      "Previous Capitol Hill experience preferred"
    ],
    "how_to_apply": "To apply, send resume and cover letter to gopwesternjobs1776@gmail.com",
    "salary_info": null,
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-101-23",
    "position_title": "Scheduler",
    "office": "Bay Area Democrat",
    "location": "Washington DC",
    "posting_date": "2023-02-27",
    "description": "Scheduler will manage all aspects of the Member's daily and long-term schedule in DC and in the district. This individual will work closely with the member, DC and district staff.\nThis person should be well-organized, detail-oriented, self-motivated, and able to work effectively in a fast-paced office.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the member",
      "Managing operational and logistical support for the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill or comparable work environment.",
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office."
    ],
    "how_to_apply": "Please submit your resume, cover letter and two references to CAHouseJob@mail.house.gov and include “Scheduler” in the subject line.",
    "salary_info": null,
    "contact": "CAHouseJob@mail.house.gov",
    "equal_opportunity": "Women, LGBTQ+, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with California ties."
  },
  {
    "id": "MEM-100-23",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Emilia Strong Sykes (OH-13)",
    "location": "Capitol Hill",
    "posting_date": "2023-02-27",
    "description": "Congresswoman Emilia Strong Sykes (OH-13) is seeking a Legislative Assistant to primarily manage her work on the Science, Space, and Technology Committee. Qualified candidates are highly motivated, detail-oriented, able to manage competing demands, and enjoy working as part of a team.\n\nThis position will work closely with and report to the Legislative Director to advance the Congresswoman’s legislative priorities. In addition to staffing the Congresswoman on the Science, Space, and Technology Committee, the Legislative Assistant will also manage a broad portfolio including agriculture, education, energy and environment, healthcare, judiciary, and labor, among others.\n\nThe ideal candidate will be creative, able to staff and brief the Congresswoman for Committee work, an excellent writer, able to build and maintain relationships with a broad swath of stakeholders, and politically astute.",
    "responsibilities": [],
    "qualifications": [
      "Capitol Hill legislative experience is required; this is not an entry-level position."
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume and a cover letter to JoinTeamSykes@mail.house.gov with the following subject line: “Full Name – SST Legislative Assistant.”",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Sykes is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-098-23",
    "position_title": "Assistant General Counsel",
    "office": "Office of General Counsel",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "The Office of General Counsel ('OGC'), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation, is accepting applications for the position of Assistant General Counsel.\n\nCore responsibilities include: drafting district court pleadings and appellate briefs; appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest; analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions; advising and counseling House Members, committees, officers, and employees on a wide range of legal issues; gathering facts necessary to permit OGC to provide sound legal advice; interacting with House leadership, committees, and other House offices; interacting with opposing counsel (both government and private); representing witnesses in connection with investigative proceedings; performing legal research on issues of constitutional, statutory, and common law; and working closely with other OGC attorneys and support staff in performing these functions.",
    "responsibilities": [
      "drafting district court pleadings and appellate briefs",
      "appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest",
      "analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions",
      "advising and counseling House Members, committees, officers, and employees on a wide range of legal issues",
      "gathering facts necessary to permit OGC to provide sound legal advice",
      "interacting with House leadership, committees, and other House offices",
      "interacting with opposing counsel (both government and private)",
      "representing witnesses in connection with investigative proceedings",
      "performing legal research on issues of constitutional, statutory, and common law",
      "working closely with other OGC attorneys and support staff in performing these functions"
    ],
    "qualifications": [
      "excellent academic credentials",
      "at least three years' experience as a practicing attorney",
      "excellent writing, analytical, and people skills",
      "excellent judgment",
      "ability to work with, and to provide high quality legal advice and representation to, House Members, committees, officers, and employees, without regard to political affiliation",
      "appreciation of--or at least the desire to learn about and understand--the role and functioning of the Legislative Branch"
    ],
    "how_to_apply": "Email cover letter, resume, transcript, list of references, and writing sample to OGC.Employment@mail.house.gov. Application deadline, March 7, 2023. Please include in the email subject line 'Assistant General Counsel Vacancy.'",
    "salary_info": null,
    "contact": "OGC.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-097-23",
    "position_title": "Press Secretary",
    "office": "Congressman Dan Goldman (NY-10)",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "The Office of Congressman Dan Goldman (NY-10) is seeking a press secretary to join our communications team. The Press Secretary will work closely with the Communications Director to implement an ambitious and nimble communications strategy. Candidates should have strong writing and creative skills, strong editing and proofreading skills, and work well under pressure. The ideal candidate will have at least a year of communications experience and be prepared to work long hours and weekends as needed.",
    "responsibilities": [
      "Preparing and staffing the Congressman for interviews, press events, and other engagements",
      "Monitoring and pitching stories to local and national media",
      "Coordinating interviews and public appearances",
      "Drafting and editing press releases, floor speeches, event remarks, video scripts, op-eds, newsletters, interview memos, and other written deliverables as needed",
      "Cultivating relationships with reporters, editors, and other members of the press corps",
      "Planning and staffing press conferences and other press-related engagements",
      "Keeping the member and staff apprised of national and local news",
      "Compiling daily press clips",
      "Supervising press interns and fellows"
    ],
    "qualifications": [
      "strong writing and creative skills",
      "strong editing and proofreading skills",
      "work well under pressure",
      "at least a year of communications experience",
      "be prepared to work long hours and weekends as needed"
    ],
    "how_to_apply": "To apply please send a resume, cover letter, and sample press release as one PDF to ny10goldmanresumes@gmail.com with “Full Name – Press Secretary” as the subject line.",
    "salary_info": null,
    "contact": "ny10goldmanresumes@gmail.com",
    "equal_opportunity": "We are an equal opportunity employer and do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, military status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-096-23",
    "position_title": "Legislative Assistant/Policy Advisor",
    "office": "Congresswoman Rashida Tlaib (MI-12)",
    "location": "D.C.",
    "posting_date": "2023-02-27",
    "description": "The Legislative Assistant works to advise and develop legislative ideas for the district and office; monitor legislative updates within committee assigned; assist with drafting remarks, memos and all other related correspondence on assigned legislative portfolios; and staff the Congresswoman and meet with constituents on behalf of the Member.",
    "responsibilities": [
      "Advise and develop legislative ideas for the district and office",
      "Monitor legislative updates within committee assigned",
      "Assist with drafting remarks, memos and all other related correspondence on assigned legislative portfolios",
      "Staff the Congresswoman and meet with constituents on behalf of the Member"
    ],
    "qualifications": [
      "1-3year of legislative Hill experience at minimum",
      "Experience working with Congressional Committees",
      "Financial Services Committee or Senate equivalent committee experience a plus",
      "Michigan ties are highly desirable, but not required",
      "Exceptional candidates may be considered for a Policy Advisor role."
    ],
    "how_to_apply": "To apply, e-mail a cover letter and detailed resume to Rashida.jobs@mail.house.gov with “Financial Services Legislative Assistant/Policy Advisor” in the subject line along with 3-4 references by February 28th.",
    "salary_info": null,
    "contact": "Rashida.jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and women, people of color, members of the LGBTQ+ community, and members of other traditionally underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-094-23",
    "position_title": "Staff Assistant (SA)",
    "office": "House Natural Resources Committee",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "The Democratic staff of the House Natural Resources Committee (HNRC) seeks\nan organized, enthusiastic, and detail-oriented Staff Assistant (SA) with strong\nwriting skills. Candidates should be passionate about issues within the\nCommittee’s jurisdiction, have excellent time management and multitasking\nskills, and display an active willingness to learn.\n\nThe SA for the Democratic staff of the Natural Resources Committee oversees\nday-to-day administrative duties, including carrying out miscellaneous projects\nfor senior staff. The SA will work directly with the Counsel’s Office and Director\nof Legislative Operations to track legislation, prepare for Committee meetings,\nand create reference materials for staff and Members of Congress.",
    "responsibilities": [
      "Oversees day-to-day administrative duties",
      "Carrying out miscellaneous projects for senior staff",
      "Track legislation",
      "Prepare for Committee meetings",
      "Create reference materials for staff and Members of Congress"
    ],
    "qualifications": [
      "Demonstrates an awareness and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.",
      "Understands how HNRC issues intersect with racism, economic and social inequality in the U.S. and has a passion for working to dismantle these systems."
    ],
    "how_to_apply": "Full job description and instructions on how to apply can be found here:\nhttps://democrats-naturalresources.house.gov/contact/job-postings",
    "salary_info": "Salary is commensurate with experience, plus benefits.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-092-23",
    "position_title": "Press Assistant",
    "office": "U.S. House Budget Committee majority",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "The U.S. House Budget Committee majority seeks a Press Assistant to join their active and fast-paced team.",
    "responsibilities": [
      "Creating social media content",
      "Compiling daily press clips",
      "Creating graphic designs",
      "Maintaining press lists",
      "Drafting press releases",
      "Video editing",
      "Aiding the communications team with daily tasks"
    ],
    "qualifications": [
      "Qualified candidates will be highly motivated, creative, organized, and digitally proficient."
    ],
    "how_to_apply": "To apply, please email a resume and any relevant work samples to jill.dickerson@mail.house.gov.",
    "salary_info": null,
    "contact": "jill.dickerson@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-090-23",
    "position_title": "Civil Rights Counsel",
    "office": "House Committee on Education and the Workforce (Democratic staff)",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "Candidates should have familiarity with employment federal civil rights laws, such as Title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act, the Equal Pay Act of 1963 and Title 42, Chapter 21 of the U.S. Code. Knowledge of the EEOC, OFCCP and federal statutes and policies and how they impact civil rights in employment and health care is preferred.\n\nApplicants should have a law degree and experience working with an organization, Congress, or government agency addressing civil rights. Duties will include supporting the development of legislation, providing technical assistance to the Committee and Member offices, researching pertinent issues, preparing written materials and legislative analyses, and supporting the execution of committee proceedings and events related to civil rights. Salary commensurate with experience.",
    "responsibilities": [
      "Supporting the development of legislation",
      "Providing technical assistance to the Committee and Member offices",
      "Researching pertinent issues",
      "Preparing written materials and legislative analyses",
      "Supporting the execution of committee proceedings and events related to civil rights"
    ],
    "qualifications": [
      "Familiarity with employment federal civil rights laws, such as Title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act, the Equal Pay Act of 1963 and Title 42, Chapter 21 of the U.S. Code.",
      "Knowledge of the EEOC, OFCCP and federal statutes and policies and how they impact civil rights in employment and health care is preferred.",
      "Law degree",
      "Experience working with an organization, Congress, or government agency addressing civil rights"
    ],
    "how_to_apply": "To apply, applicants must submit a resume and two short writing samples demonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with \"Civil Rights Counsel Position\" in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-087-23",
    "position_title": "Communications Director",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas), on the Ways & Means Committee",
    "location": "Washington",
    "posting_date": "2023-02-27",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), on the Ways & Means Committee, seeks an\nexperienced Communications Director for his Washington office.\n\nThis is not an entry level position. Excellent written and oral communication\nskills required. Hill experience strongly preferred. Texas ties a plus.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill experience strongly preferred.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor\nreferences to DoggettJobs@mail.house.gov. Please use this title on your email:\n“Comms Director Applicant” -- No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-086-23",
    "position_title": "Legislative Correspondent",
    "office": "Representative Alma Adams (NC-12)",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "Representative Alma Adams (NC- 12) seeks a Legislative Correspondent to run\na robust correspondence program and assist with official communication.\nA successful candidate will be a strong and efficient writer, intellectually curious,\nand a quick study. They must also work well as a part of a team. Responsibilities\ninclude drafting constituent correspondence that reflects the Congresswoman’s\npolicy priorities, managing incoming and outgoing correspondence, tracking\ncorrespondence data, and working with the rest of the staff to ensure the office is\nmaximally responsive too constituents and well informed of their priorities. North\nCarolina ties and a sense of humor are a plus. Prior Congressional experience also\npreferred.",
    "responsibilities": [
      "Draft tailored letters for constituent inquires that require special research or a nuanced response.",
      "Create and maintain a collection of prepared responses for general legislative inquires.",
      "Ensure that legislative responses to constituents are completed in a timely matter.",
      "Consult with the Legislative Director and Legislative Assistants to ensure the Member’s library of legislative letters are accurate, up to date, and reflective of the Member’s policy position.",
      "Learn and lead office in using Constituent Management System software (Fireside).",
      "Engage with district office staff and respond to inquiries of Member’s policy stances.",
      "Flag district-based organized constituent letter writing campaigns to appropriate district staff.",
      "Attend legislative meetings with constituents and assist with Committee hearings and markups.",
      "Assist Scheduler/Executive Assistant in drafting Member-to-Member correspondence, thank you, and special occasion letters."
    ],
    "qualifications": [
      "A successful candidate will be a strong and efficient writer, intellectually curious, and a quick study.",
      "They must also work well as a part of a team.",
      "North Carolina ties and a sense of humor are a plus.",
      "Prior Congressional experience also preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and two writing\nsamples to NC12.resume@mail.house.gov and put “LC - FirstName.LastName”\nin the Subject Line. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate based on race, color,\nreligion, sex, national origin, age, disability, military status, gender identity,\nmarital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-085-23",
    "position_title": "Bilingual Press Secretary",
    "office": "The Office of Congresswoman Sylvia Garcia (TX-29)",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-27",
    "description": "The Office of Congresswoman Sylvia Garcia (TX-29) seeks a bilingual (English/Spanish) Press Secretary for her Washington, D.C. office.\nPrimary responsibilities include, but are not limited to building and maintaining relationships with Houston and DC press; responding to media inquiries; writing press releases and talking points; preparing stories and op-eds for Houston and national media; organizing earned media events in Houston and Washington, D.C.; managing printed and digital paid communications and social media platforms for the Congresswoman; and coordinating and staffing the Congresswoman for interviews and press events, among other things. This is not an entry-level position.",
    "responsibilities": [
      "building and maintaining relationships with Houston and DC press",
      "responding to media inquiries",
      "writing press releases and talking points",
      "preparing stories and op-eds for Houston and national media",
      "organizing earned media events in Houston and Washington, D.C.",
      "managing printed and digital paid communications and social media platforms for the Congresswoman",
      "coordinating and staffing the Congresswoman for interviews and press events"
    ],
    "qualifications": [
      "strong writing skills",
      "prior press and digital experience",
      "the ability to work in a collaborative environment",
      "a candidate to track details across communications projects",
      "file timely reports with House",
      "regularly meet multiple deadlines"
    ],
    "how_to_apply": "Please apply via the following link: https://resumebank.domewatch.us/start?code=UUFg9fO6_",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-083-23",
    "position_title": "DIGITAL STAFFER",
    "office": "Congresswoman Angie Craig (MN-02)",
    "location": "Burnsville, MN",
    "posting_date": "2023-02-27",
    "description": "Congresswoman Angie Craig (MN-02) is in search of a talented Digital/Video Producer for her Burnsville, MN office in a full-time capacity. This position reports to the Communications Director.\n\nThe Digital/Video Producer will work with the Communications Director to create compelling photo and video content for social media, draft and post to the Member’s social media accounts, and assist with other communications duties as needed.\n\nThe ideal candidate should be highly creative, have a strong work ethic and communication skills, a good sense of humor, an eagerness to learn and grow within the office, and a desire to be part of a highly-collaborative, high-achieving team. The candidate should possess a strong attention to detail and be comfortable working with Adobe Creative Suite and Canva. The position is full time with federal benefits, including student loan repayment program (if eligible), transit or parking benefits, and an annual salary of between $50,000 and $60,000 commensurate with experience.",
    "responsibilities": [
      "create compelling photo and video content for social media",
      "draft and post to the Member’s social media accounts",
      "assist with other communications duties as needed"
    ],
    "qualifications": [
      "highly creative",
      "strong work ethic and communication skills",
      "good sense of humor",
      "eagerness to learn and grow within the office",
      "desire to be part of a highly-collaborative, high-achieving team",
      "strong attention to detail",
      "comfortable working with Adobe Creative Suite and Canva"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, writing sample, and 3 examples of previous digital media or video projects to repcraigpress@mail.house.gov with the subject line “Digital/Video Producer [applicant’s last name]” by March 1, 2023.",
    "salary_info": "an annual salary of between $50,000 and $60,000 commensurate with experience",
    "contact": "repcraigpress@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, or sexual orientation. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-082-23",
    "position_title": "Press/Digital Assistant",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "D.C.",
    "posting_date": "2023-02-27",
    "description": "Congresswoman Susie Lee (NV-03) is seeking a highly motivated, detail-orientated, and energetic individual with experience in communications, digital media and social media, video editing, and graphic design to join her team as a press/digital assistant in the D.C. office. This position will report to the Communications Director.\n\nThe ideal candidate will be creative, politically astute, have a strong proficiency in crafting social media content across social media platforms, and will be a detail-oriented team player able to handle multiple tasks at once.",
    "responsibilities": [
      "Drafting and posting content for the member’s social media platforms and website",
      "Graphic design",
      "Video filming and editing",
      "Daily press clips",
      "Managing the newsletter program",
      "Drafting press releases, talking points, and remarks",
      "Organizing press events"
    ],
    "qualifications": [
      "Excellent writing and strong organizational skills are essential",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Capitol Hill experience and Spanish fluency are a plus, but not required",
      "Proficiency with Adobe Suite, Canva, and constituent management platforms, such as IQ, preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, three references, one writing sample, and a digital portfolio or examples of previous digital media, video work, or graphic design products to NV03Resumes@gmail.com with “DC Press/Digital Assistant” in the subject line. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "NV03Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-081-23",
    "position_title": "Caseworker/Outreach Representative",
    "office": "Congresswoman Lisa Blunt Rochester",
    "location": "Georgetown, DE",
    "posting_date": "2023-02-27",
    "description": "Reporting to the State Director, primary responsibilities include answering casework correspondence and communications from constituents; acting as liaison with Federal, State, and local agencies; preparing correspondence to agency contacts and constituents; staffing the Congresswoman and attending community events, building relationships with a range of constituents and stakeholders throughout Kent and Sussex Counties, and handling administrative tasks as assigned.\n\nThis position requires excellence in constituent relations, service delivery, and community engagement. Duties require work during regular office hours and travel throughout Kent and Sussex Counties is required, including occasional meetings and events during evenings and weekends.",
    "responsibilities": [
      "Answering casework correspondence and communications from constituents",
      "Acting as liaison with Federal, State, and local agencies",
      "Preparing correspondence to agency contacts and constituents",
      "Staffing the Congresswoman and attending community events",
      "Building relationships with a range of constituents and stakeholders throughout Kent and Sussex Counties",
      "Handling administrative tasks as assigned"
    ],
    "qualifications": [
      "Ties to the state",
      "Ability to work in a fast-paced environment",
      "Excellent interpersonal skills",
      "Customer relations skills",
      "Strong writing skills",
      "Interest in public service",
      "Fluency in Spanish is preferred but not required",
      "Valid driver’s license and clean driving record"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to lbr.jobposting@gmail.com with “Caseworker/Outreach Representative” in the subject line. No phone calls, drop-ins, or emails please.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This is an Equal Opportunity Employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, sexual orientation, military status, marital status, or parental status."
  },
  {
    "id": "MEM-077-23",
    "position_title": "Legislative Correspondent",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "This position works to ensure the relationship between the Member’s Office and constituents remains positive by providing ample information in response to questions, fielding messages in a timely manner, and ensuring constituents receive consistent, accurate information about legislative happenings and the Member’s agenda. They will also assist in the composition of background memos and talking points for the Member’s meetings and engagements, handling issue areas as assigned to support the Legislative Director and Military Legislative Assistant.",
    "responsibilities": [],
    "qualifications": [
      "Must have excellent writing, communication, and research skills, and the ability to produce quality work in a faced paced environment.",
      "An ability to multitask and work under tight deadlines is necessary.",
      "Candidates must have previous congressional experience; ties to Virginia’s First District are helpful but not required."
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Carolyn.King@mail.house.gov with “Legislative Correspondent” in the subject line.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-076-23",
    "position_title": "Caucus Assistant",
    "office": "Congressional Progressive Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-27",
    "description": "The Congressional Progressive Caucus seeks a Caucus Assistant based in Washington, D.C. The position requires careful attention to logistics associated with managing the Caucus’ day-to-day activities, assisting with office management responsibilities, scheduling, finance, event planning, and performing other duties as required.",
    "responsibilities": [
      "Organizing the logistics for member-level and staff-level meetings",
      "Routinely preparing and sending materials to CPC member offices",
      "Responding to a variety of inquires from CPC member offices",
      "Assisting with policy and communications projects as assigned",
      "Managing various operations tasks",
      "Assisting with processing office finances."
    ],
    "qualifications": [
      "Capitol Hill, executive assistant, and progressive advocacy experience is preferred.",
      "Ideal candidates will be very detail-oriented with good timemanagement skills, able to work in a fast-paced environment, and handle last minute changes to the legislative schedule.",
      "Candidates must possess strong writing and organizational skills, a good sense of humor, creativity, the ability to operate under strict deadlines, and be able to work collaboratively with CPC offices and staff.",
      "Ideal candidates should have familiarity with the progressive movement and progressive policy.",
      "This position can involve long hours and will report to the Executive Director."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to ProgressiveCaucusJobs@gmail.com with “Caucus Assistant LastName” in the subject line. Applications will be accepted on a rolling basis.",
    "salary_info": null,
    "contact": "ProgressiveCaucusJobs@gmail.com",
    "equal_opportunity": "The CPC is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or expression, or sexual orientation. Women, people of color, veterans, and LGBTQIA individuals are strongly encouraged to apply."
  },
  {
    "id": "MEM-075-23",
    "position_title": "Press Secretary/Digital Assistant",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07), Chair of the Congressional Progressive Caucus",
    "location": "Washington, DC",
    "posting_date": "2023-02-27",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07), Chair of the Congressional Progressive Caucus, seeks a highly organized, creative, and teamoriented Press Secretary/Digital Assistant to execute a fast-paced and dynamic communications plan. This position reports to the Communications Director and is based in the Washington, DC office.\n\nAn ideal candidate will:\n\nResponsibilities include:\n\nSkills and knowledge required:",
    "responsibilities": [
      "Drafting written materials including press releases, remarks, speeches, enewsletters, talking points, and social media content",
      "Compiling daily press clips and managing proactive media monitoring",
      "Maintaining local and national press lists",
      "Compiling weekly communications report",
      "Capturing video and photos of the Congresswoman for social media and for events",
      "Staying informed about relevant current events in the district and across the country as well as appropriate legislative and non-legislative issues",
      "Maintaining various press archives for the Congresswoman",
      "Supporting logistics for town halls, press conferences, and other public-facing events, both virtual and in-person"
    ],
    "qualifications": [
      "Be a proficient writer, with experience writing for a principal",
      "Have a knowledge of Adobe Suite, graphic design and video editing skills",
      "Have a familiarity with CRMs including IQ",
      "Understand Facebook Business Manager and digital advertising",
      "Have a deep familiarity with all social media tools (i.e. Instagram, Twitter)",
      "Understand the digital media landscape and current digital trends",
      "Have a strong record of advocating for progressive values",
      "Be willing to work weekends and irregular hours when necessary",
      "Strong communications skills, including writing, editing, and proofreading",
      "Understanding of print, broadcast, and online media and how to use those tools creatively",
      "Strong organizational skills, and ability to manage multiple tasks at once",
      "Ability to exercise discretion in the representation of the Congresswoman's position on policy issues",
      "Ability to work cooperatively and courteously with others, including members of the press"
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Press Secretary/Digital Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Washington state and/or district ties are a plus."
  },
  {
    "id": "MEM-073-23",
    "position_title": "Scheduler",
    "office": "Congressman Jake Auchincloss (MA-04)",
    "location": "Washington, DC",
    "posting_date": "2023-02-27",
    "description": "Congressman Jake Auchincloss (MA-04) is seeking a highly motivated, detail-orientated, and energetic individual with excellent oral and written communications skills for a Scheduler position in the Washington, DC office.\n\nDaily tasks include managing and maintaining the Member’s daily and long-term DC schedule; coordinating travel, booking flight reservations, and managing logistics for events; evaluating and organizing all incoming meeting and event requests; communicating key information regarding the Member and the Member’s schedule to staff; and working closely with both DC and District staff to ensure smooth daily office operations. Candidates must be available to assist the Member outside of regular business hours.\n\nThis position requires proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member, Chief of Staff, District Director, and District Scheduler. Excellent writing, verbal and strong organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Previous Capitol Hill or scheduling experience is required; this is not an entry level position. Access to a car and a clean driving record is preferred.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long-term DC schedule",
      "Coordinating travel, booking flight reservations, and managing logistics for events",
      "Evaluating and organizing all incoming meeting and event requests",
      "Communicating key information regarding the Member and the Member’s schedule to staff",
      "Working closely with both DC and District staff to ensure smooth daily office operations",
      "Assist the Member outside of regular business hours"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member, Chief of Staff, District Director, and District Scheduler",
      "Excellent writing, verbal and strong organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Previous Capitol Hill or scheduling experience is required; this is not an entry level position",
      "Access to a car and a clean driving record is preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and one writing sample to AuchinclossJobs@mail.house.gov with “Scheduler – First Name Last Name” in the Subject Line. Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-072-23",
    "position_title": "Senior Legislative Assistant or Counsel – Financial Services",
    "office": "Congressman Brad Sherman",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-27",
    "description": "Congressman Brad Sherman seeks a Legislative Assistant to staff the House Financial Services Committee including the Capital Markets Subcommittee on which the Congressman serves as ranking Democrat.\n\nThe ideal candidate will have significant experience in financial services issues. Experience with issues falling under the jurisdiction of the Capital Markets Subcommittee is a major plus. Job responsibilities include monitoring and drafting legislation, representing the Member in meetings/briefings, preparing materials for committee hearings and markups, maintaining relationships with advocacy groups, interfacing with government agencies, and other tasks and assignments as needed.\n\nThe successful candidate will possess excellent written and oral communication skills, a solid understanding of the legislative process, and knowledge of, and experience with, the operations of the SEC and other rules-making entities that govern capital markets and securities-related accounting standards.\n\nThis job requires a proven ability to work effectively and independently in a demanding and fast-paced environment. Law degree/bar membership a plus, but not required. This is a mid- to senior-level position in the office.",
    "responsibilities": [
      "monitoring and drafting legislation",
      "representing the Member in meetings/briefings",
      "preparing materials for committee hearings and markups",
      "maintaining relationships with advocacy groups",
      "interfacing with government agencies",
      "other tasks and assignments as needed"
    ],
    "qualifications": [
      "excellent written and oral communication skills",
      "a solid understanding of the legislative process",
      "knowledge of, and experience with, the operations of the SEC and other rules-making entities that govern capital markets and securities-related accounting standards",
      "proven ability to work effectively and independently in a demanding and fast-paced environment",
      "Law degree/bar membership a plus, but not required"
    ],
    "how_to_apply": "Please send cover letter and resume to FSCCapMarketsStaffer@gmail.com",
    "salary_info": null,
    "contact": "FSCCapMarketsStaffer@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-071-23",
    "position_title": "Legislative Staffer",
    "office": "Rep. Marcy Kaptur (D-OH-09)",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "Rep. Marcy Kaptur (D-OH-09), co-chair of the Congressional Ukraine Caucus and a Senior Appropriations Defense Subcommittee member, seeks an experienced legislative staffer to handle a portfolio including defense, foreign affairs, and national security issues.\n\nCandidates must be familiar with the defense portfolio, Ukraine and European security issues, the Appropriations process, have a deep understanding of the legislative process including identifying creative legislation solutions, crafting and advancing legislation, analyzing and briefing a Senior Member of Congress on complex policy issues, and drafting a wide array of written materials (including materials for Committee and Floor activities).\n\nStrong written and verbal communication skills and a demonstrated ability to work collaboratively in a fast-paced environment are critical. At least five years of relevant experience is encouraged as are Congressional experience and Midwest connections.",
    "responsibilities": [],
    "qualifications": [
      "Familiar with the defense portfolio",
      "Knowledge of Ukraine and European security issues",
      "Understanding of the Appropriations process",
      "Deep understanding of the legislative process including identifying creative legislation solutions, crafting and advancing legislation",
      "Ability to analyze and brief a Senior Member of Congress on complex policy issues",
      "Experience drafting a wide array of written materials (including materials for Committee and Floor activities)",
      "Strong written and verbal communication skills",
      "Demonstrated ability to work collaboratively in a fast-paced environment",
      "At least five years of relevant experience is encouraged",
      "Congressional experience is encouraged",
      "Midwest connections are encouraged"
    ],
    "how_to_apply": "Applicants should email a resume, cover letter, two writing samples, and references as individual files in PDF format to Midwestern.Resume@mail.house.gov “MLA/Foreign Affairs” in the subject line. No phone calls, faxes, emails, or walk-ins, please.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-066-23",
    "position_title": "Director of Scheduling",
    "office": "House Democratic Leadership Office",
    "location": "Capitol Hill",
    "posting_date": "2023-02-27",
    "description": "House Democratic Leadership Office seeks a Director of Scheduling to join a three-person team.\nCandidates should also be meticulous, well-organized, hard-working, and ready to operate in a high pressure and fast-paced environment. Highest degree of professionalism and confidentiality required, as well as the ability to work a flexible schedule, including long hours and weekends when necessary.\nResponsibilities include, but are not limited to, supporting the Deputy Chief of Staff for Operations in managing and maintaining the Member’s daily and long term schedules, coordinating travel arrangements, managing scheduling requests, and managing the three-person team. Candidates should have experience working directly with high-level principals.\nCapitol Hill experience preferred.",
    "responsibilities": [
      "Supporting the Deputy Chief of Staff for Operations in managing and maintaining the Member’s daily and long term schedules",
      "Coordinating travel arrangements",
      "Managing scheduling requests",
      "Managing the three-person team"
    ],
    "qualifications": [
      "Meticulous",
      "Well-organized",
      "Hard-working",
      "Ready to operate in a high pressure and fast-paced environment",
      "Highest degree of professionalism and confidentiality",
      "Ability to work a flexible schedule, including long hours and weekends when necessary",
      "Experience working directly with high-level principals",
      "Capitol Hill experience preferred"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and three references to Democraticleaderresumes@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "Democraticleaderresumes@gmail.com",
    "equal_opportunity": "The Office is an Equal Opportunity Employer and as such is committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-061-23",
    "position_title": "Subcommittee on Disability Assistance and Memorial Affairs Professional Staff Member",
    "office": "U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "REPORTS TO: Republican Staff Director, Subcommittee on Disability Assistance and Memorial Affairs",
    "responsibilities": [
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Conduct oversight of Subcommittee issue areas, to include Department implementation of laws, regulations, and programs",
      "Monitor legislative needs and developments within committees and on the House floor within specific issue areas of responsibility",
      "Under the guidance of Subcommittee Staff Director, provide advice on policy matters within issue areas and help Subcommittee Staff Director develop and implement strategic and policy goals",
      "Draft hearing, markup and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings",
      "Assist in the proposing and drafting of legislation for the Committee",
      "Meet with congressional staff and internal/external organizations on behalf of the Committee",
      "Perform other duties as assigned by Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "At least three years of congressional or Administration experience resulting in direct, working knowledge of the Committee/Subcommittee’s substantive jurisdiction required; five years strongly preferred",
      "Occasional travel may be required",
      "Excellent writing, editing, and proofreading skills (writing test may be administered prior to an offer being extended)",
      "Excellent oral communication skills",
      "Thorough knowledge of legislative process, and understanding of House Rules",
      "Demonstrate ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions",
      "Knowledge of current issues and events in which the Full Committee leadership is involved",
      "Ability to work long hours, under pressure, and cooperatively and courteously with others"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references, and three writing samples to VAR.Resumes@mail.house.gov with “DAMA Professional Staff Member” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-024-23",
    "position_title": "Scheduler",
    "office": "Freshman Democrat from Hawai'i",
    "location": "DC and the district",
    "posting_date": "2023-02-27",
    "description": "The Freshman Democrat from Hawai'i is seeking a Scheduler with strong\njudgment, communication skills, and attention to detail to build and oversee all\naspects of scheduling operations for the Member.\n\nThis position requires consistent and effective collaboration with all components\nof the Member's office. The Scheduler will work directly with the Chief of Staff,\nDistrict Chief, and other senior staff.",
    "responsibilities": [
      "Building the Member's daily and long-term schedule for DC and the district and managing this system",
      "Responding to all incoming scheduling requests",
      "Booking and coordinating travel back to Hawai'i and within Hawai'i",
      "Ensuring the Member, staff, and external stakeholders have key information about the schedule",
      "Compiling daily briefing materials for the Member and coordinating the collection of information from staff and other sources",
      "Supporting the team with special events and ad hoc projects",
      "Other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a cover letter, resume, and references to hawaii02jobs@gmail.com.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, sexual\norientation, or gender identity. Candidates from diverse backgrounds, especially\nwith ties to Hawai'i, are encouraged to apply. Being able to serve as a secondary\ndriver when needed is preferred, but not required."
  },
  {
    "id": "MEM-011-23",
    "position_title": "Communications Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": "Washington, DC",
    "posting_date": "2023-02-27",
    "description": "The Congressional Black Caucus (CBC) seeks a Communications Director to lead an active communications operation.\n\nThis position manages both the long-term strategic communications strategy and day-to-day press for the Caucus, ranging from drafting statements on news of the day, to responding to press inquiries and pitching stories, to managing the CBC’s social media accounts and website, to setting up press availability opportunities (i.e., press conferences, press calls, or pen/pads), to developing and executing a long-term communications plan.\n\nIn addition to managing the communications of the CBC, this position also serves as a resource to all CBC Member offices to provide any communications counsel they may need.",
    "responsibilities": [
      "Working closely with the Executive Director and Policy Director to raise the policy agenda and platform of the Caucus through strategic messaging, earned media, and public outreach"
    ],
    "qualifications": [
      "Substantial experience with and knowledge of Congressional affairs and the legislative process",
      "Experience with media pitching, booking television appearances/interviews, prepping a principal for print & television interviews/appearances",
      "Extensive relationships with DC and National print & television media",
      "Excellent oral and written communication skills",
      "Ability to work under pressure and meet quick deadlines",
      "Experience with communications including, social media, press releases, talking points, etc.",
      "Demonstrated experience working effectively with diverse coalitions",
      "Understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Detail-oriented and possess the ability to multitask, work well in a fast-paced setting, and act as a team player.",
      "A demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample/portfolio to Vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "Vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-611-22",
    "position_title": "Committee Clerk",
    "office": "Republican Staff of the House Judiciary Committee",
    "location": null,
    "posting_date": "2023-02-27",
    "description": "Clerks are responsible for the preparation of all committee activities, such as hearings and markups. Clerks ensure the committee is run efficiently by maintaining and organizing all committee records as well as assisting with the administrative functions of the committee.",
    "responsibilities": [
      "Preparation of all committee activities, such as hearings and markups.",
      "Maintaining and organizing all committee records.",
      "Assisting with the administrative functions of the committee."
    ],
    "qualifications": [
      "At least one year of Hill experience",
      "Working knowledge of how Congressional committees operate."
    ],
    "how_to_apply": "Candidates can email their resume to Kiley.Bidelman@mail.house.gov.",
    "salary_info": null,
    "contact": "Kiley.Bidelman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-582-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Orange County",
    "posting_date": "2023-02-27",
    "description": "The Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.\n\nUnder the supervision of the Chief of Staff and the District Director, the Field Representative briefs the Member in preparation for district meetings with constituents and acts as the representative for the Member by attending events and meetings. This includes public speaking and certificate presentations.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible scheduling, including nights and weekends",
      "Constituent service oriented; patient empathetic, and desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director, Office of Congresswoman\nSteel Stephanie.Hu@mail.house.gov",
    "salary_info": "Salary range is $49,000-$57,000. Salary commensurate with experience.",
    "contact": "Stephanie Hu, District Director, Office of Congresswoman Steel Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  }
]