[
  {
    "id": "MEM-213-15",
    "position_title": "Legislative Correspondent",
    "office": "Northern California Democrat",
    "location": null,
    "posting_date": "2015-03-08",
    "description": "Primary responsibilities include coordinating an active mail program with quick response time, researching legislative issues, and drafting responses to constituent inquires. Candidates should have excellent organizational and written skills and the ability to work well as part of a team. This is not an entry level job and previous Hill experience is preferred.",
    "responsibilities": [
      "Coordinating an active mail program with quick response time",
      "Researching legislative issues",
      "Drafting responses to constituent inquires"
    ],
    "qualifications": [
      "Excellent organizational and written skills",
      "Ability to work well as part of a team",
      "Previous Hill experience is preferred"
    ],
    "how_to_apply": "Please send a cover letter, resume, and two recent writing samples to CADemocratResumes@gmail.com.",
    "salary_info": null,
    "contact": "CADemocratResumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-210-15",
    "position_title": "Staff Assistant",
    "office": "Congressman Xavier Becerra",
    "location": "District Office",
    "posting_date": "2015-08-03",
    "description": "As the primary administrative staff member in the District Office, Staff Assistant duties include (but are not limited to): answer phones; handle mail and faxes; greet and direct visitors; maintain order and efficiency of front and back offices; order supplies; organize office files; coordinate vendor service needs; research the status of some legislation; draft some correspondence.\n\nWork on special projects as needed. In the absence of the District Scheduler, the Staff Assistant will serve as back-up and help facilitate any scheduling requests.\n\nCasework duties include (but are not limited to): Assist constituents with their individual cases pertaining to federal agencies. As the “front-line” caseworker, help constituents with non-federal questions to find appropriate resources.\n\nThis position may require work on weekends and holidays.",
    "responsibilities": [
      "Answer phones",
      "Handle mail and faxes",
      "Greet and direct visitors",
      "Maintain order and efficiency of front and back offices",
      "Order supplies",
      "Organize office files",
      "Coordinate vendor service needs",
      "Research the status of some legislation",
      "Draft some correspondence",
      "Work on special projects as needed",
      "Serve as back-up to the District Scheduler",
      "Facilitate any scheduling requests",
      "Assist constituents with their individual cases pertaining to federal agencies",
      "Help constituents with non-federal questions to find appropriate resources"
    ],
    "qualifications": [
      "Strong written, communication, analytical, and organization skills",
      "An ability to relate well with individuals of diverse backgrounds",
      "Impeccable customer service manners",
      "Bachelor’s degree required",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point",
      "Candidate must have an understanding of government agencies and structure (local, county, state and federal)",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines and balance multiple projects",
      "Attention to detail and accuracy is essential",
      "Candidate should demonstrate a positive attitude, commitment to excellence, upbeat demeanor and flexibility",
      "Bilingual skills a plus"
    ],
    "how_to_apply": "All interested individuals should email a cover letter and resume to Resume.California@mail.house.gov. No phone calls please.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "Resume.California@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-207-15",
    "position_title": "Legislative Assistant",
    "office": "Conservative Texan",
    "location": "Washington, DC",
    "posting_date": "2015-03-08",
    "description": "Legislative responsibilities will include, but are not limited to, Agriculture, Energy, Taxes, Judiciary, Environment, and Veterans issues, as well as, drafting memos and providing voting recommendations. Candidates must possess strong writing and organizational skills. Capitol Hill experience and Texas ties are strongly preferred.",
    "responsibilities": [
      "Agriculture",
      "Energy",
      "Taxes",
      "Judiciary",
      "Environment",
      "Veterans issues",
      "Drafting memos",
      "Providing voting recommendations"
    ],
    "qualifications": [
      "Strong writing skills",
      "Strong organizational skills",
      "Capitol Hill experience (strongly preferred)",
      "Texas ties (strongly preferred)"
    ],
    "how_to_apply": "All prospective applicants can email cover letter, resume, and writing sample to TXGOPJob@gmail.com.",
    "salary_info": null,
    "contact": "TXGOPJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-197-15",
    "position_title": "Executive Assistant/Office Manager",
    "office": "Rep. Keith Ellison (MN-05)",
    "location": null,
    "posting_date": "2015-08-03",
    "description": "The Executive Assistant/Office Manager will manage and prepare the Member’s schedule, respond to all scheduling requests, arrange the Member’s travel, and provide and assist with local travel. The Executive Assistant/Office Manager will order and maintain office supplies, will maintain office personnel files, and will work closely with the staff assistant and interns. This position requires candidates with proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member and his Chief of Staff. Strong written and oral communication skills, superior organizational skills, attention to detail, ability to work in an extremely fast paced office, and flexibility to work late hours on short notice are necessary for the position. Owning or having consistent access to a car is required. This is not an entry level position. Minnesota ties a plus.",
    "responsibilities": [
      "Manage and prepare the Member’s schedule",
      "Respond to all scheduling requests",
      "Arrange the Member’s travel",
      "Provide and assist with local travel",
      "Order and maintain office supplies",
      "Maintain office personnel files",
      "Work closely with the staff assistant and interns"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member and his Chief of Staff",
      "Strong written and oral communication skills",
      "Superior organizational skills",
      "Attention to detail",
      "Ability to work in an extremely fast paced office",
      "Flexibility to work late hours on short notice",
      "Owning or having consistent access to a car is required",
      "Minnesota ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and writing sample to mn05position@mail.house.gov. Please include references.",
    "salary_info": null,
    "contact": "mn05position@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-192-15",
    "position_title": "Staff Assistant",
    "office": "Republican Committee in the House of Representatives",
    "location": null,
    "posting_date": "2015-08-03",
    "description": "Republican Committee in the House of Representatives seeks Staff Assistant with strong administrative skills and interest in workforce policy. Must be well-organized, detail-oriented, and a team player. Responsibilities include office administration, scheduling, legislative tracking, and other administrative projects as assigned. Excellent proof reading, writing, and computer skills required.",
    "responsibilities": [
      "office administration",
      "scheduling",
      "legislative tracking",
      "other administrative projects as assigned"
    ],
    "qualifications": [
      "Must be well-organized, detail-oriented, and a team player.",
      "Excellent proof reading, writing, and computer skills required."
    ],
    "how_to_apply": "Please send resumes to edandlresumes@mail.house.gov.",
    "salary_info": null,
    "contact": "edandlresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-191-15",
    "position_title": "Professional Staff Member",
    "office": "Republican Committee in the House of Representatives",
    "location": null,
    "posting_date": "2015-08-03",
    "description": "Republican Committee in the House of Representatives seeks Professional Staff Member with background in workplace and employment law, with particular emphasis on traditional labor law, including the National Labor Relations Act. Law degree and congressional experience desired. Good writing and research skills necessary.",
    "responsibilities": [],
    "qualifications": [
      "Background in workplace and employment law",
      "Particular emphasis on traditional labor law, including the National Labor Relations Act",
      "Law degree and congressional experience desired",
      "Good writing and research skills necessary"
    ],
    "how_to_apply": "Please send resumes to edandlresumes@mail.house.gov.",
    "salary_info": null,
    "contact": "edandlresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-188-15",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2015-08-03",
    "description": "Duties include:\nanswering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov. NO PHONE CALLS PLEASE.",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-172-15",
    "position_title": "Communications Director",
    "office": "Active Democrat House Members",
    "location": "D.C. and the district",
    "posting_date": "2015-03-08",
    "description": "Active Democrat House Members seeks experienced, media savvy Communications Director to run aggressive press operation in fast-paced office. Duties include: managing day-to-day press operations in D.C. and the district, developing communication strategy, drafting press releases, op-eds, talking points and other content, overseeing and planning media events, preparing member, developing relationships with local and national reporters, and working in conjunction with outreach director and district staff. Ideal candidate will have on-the-record experience and excellent writing skills. Hill or other political experience/California ties a plus.",
    "responsibilities": [
      "managing day-to-day press operations in D.C. and the district",
      "developing communication strategy",
      "drafting press releases, op-eds, talking points and other content",
      "overseeing and planning media events",
      "preparing member",
      "developing relationships with local and national reporters",
      "working in conjunction with outreach director and district staff"
    ],
    "qualifications": [
      "on-the-record experience",
      "excellent writing skills",
      "Hill or other political experience/California ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and two writing samples to jo.th@mail.house.gov. Please, no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "jo.th@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-165-15",
    "position_title": "Field Deputy",
    "office": "Congressman Xavier Becerra",
    "location": "District office",
    "posting_date": "2015-08-03",
    "description": "The Field Deputy serves as the congressman’s liaison with the community, local organizations and government agencies; staff and/or represent the congressman at events; advise the congressman about local issues; help organize community based meetings and events; implement proactive constituent outreach program; prepare Member for speeches and meetings; draft correspondence. This position requires work hours beyond the normal 8-hour work day and will include work on weekends and holidays.",
    "responsibilities": [
      "Serves as the congressman’s liaison with the community, local organizations and government agencies",
      "Staff and/or represent the congressman at events",
      "Advise the congressman about local issues",
      "Help organize community based meetings and events",
      "Implement proactive constituent outreach program",
      "Prepare Member for speeches and meetings",
      "Draft correspondence"
    ],
    "qualifications": [
      "Strong written, communication, analytical, and organization skills",
      "An ability to relate well with individuals of diverse backgrounds",
      "Impeccable customer service manners",
      "Superior public speaking skills",
      "Minimum two (2) years of experience working directly with the community at large.",
      "Knowledge of the Asian Pacific Islander communities a plus.",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point.",
      "Bachelor’s degree required.",
      "Candidate must have a thorough understanding of government agencies and structure (local, county, state and federal).",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines, balance multiple projects simultaneously and work under pressure.",
      "Attention to detail and accuracy is essential.",
      "Candidate should demonstrate a positive attitude, commitment to excellence, upbeat demeanor and flexibility.",
      "Candidate should expect weekend, some holidays, and after-hours assignments.",
      "Bilingual skills a plus."
    ],
    "how_to_apply": "All interested individuals should email a cover letter, resume and salary history to Resume.California@mail.house.gov. No phone calls please.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "Resume.California@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-153-15",
    "position_title": "Legislative Director",
    "office": "Established Member of Congress from the southeastern US",
    "location": "Washington, DC",
    "posting_date": "2015-08-03",
    "description": "LD will be responsible for driving member legislative initiatives, briefing the member on all policy matters, meeting with relevant public interest groups and constituents, providing real time vote recommendations, and assisting the Chief of Staff on policy matters.\n\nPosition requires a comprehensive knowledge of House procedures as well as a working knowledge of all current issues debated in the House. Teamoriented skill, outgoing personality, and attention to detail are requirements and staff members with ties to the southeast will be given special consideration.",
    "responsibilities": [
      "Driving member legislative initiatives",
      "Briefing the member on all policy matters",
      "Meeting with relevant public interest groups and constituents",
      "Providing real time vote recommendations",
      "Assisting the Chief of Staff on policy matters"
    ],
    "qualifications": [
      "Current/previous Legislative Directors or Senior Legislative Assistants with experience",
      "Comprehensive knowledge of House procedures",
      "Working knowledge of all current issues debated in the House",
      "Team-oriented skill",
      "Outgoing personality",
      "Attention to detail",
      "Ties to the southeast (special consideration)"
    ],
    "how_to_apply": "Please send a cover letter, resume, and salary requirements to USHouseStaffJob@gmail.com.",
    "salary_info": null,
    "contact": "USHouseStaffJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-148-15",
    "position_title": "Legislative Assistant",
    "office": "Office of Representative Justin Amash",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-03",
    "description": "The Office of Representative Justin Amash is seeking a bright, creative, and hard-working legislative assistant to join our Washington, D.C.-based policy team.\n\nThe legislative assistant will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The legislative assistant will be expected to handle a diverse portfolio of policy issues, which can be tailored somewhat to the staffer’s expertise and interests.\n\nThe successful candidate will demonstrate a strong commitment to individual liberty, economic freedom, and the defense of the Constitution. He or she also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. Candidates who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "B.A. or equivalent",
      "Background in economics and some policy experience preferred",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume and cover letter to mi03.apply@gmail.com.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-146-15",
    "position_title": "District Office Field Representative/Caseworker",
    "office": "Congressman",
    "location": "District Office",
    "posting_date": "2015-08-03",
    "description": "The District Office Field Representative/Caseworker monitors and updates the Congressman and District Director on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents.",
    "responsibilities": [
      "Acts as the representative for the Congressman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Congressman and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Handles casework assignments;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Congressman;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Scheduler;",
      "Monitors scheduled district meetings for the Congressman with constituents;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Full-time experience preferred; strong academic credentials required; extensive community relationships desired.",
      "Strong oral and written communication skills;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Congressman is involved;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, procedures, and computer applications."
    ],
    "how_to_apply": "E-mail a resume and cover letter to CA02.Requests@mail.house.gov with the subject line “CA02 Field Representative/Caseworker.”",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-143-15",
    "position_title": "Legislative Assistant, or Senior Legislative Assistant",
    "office": "Senior California Democrat",
    "location": null,
    "posting_date": "2015-03-08",
    "description": "Senior California Democrat seeks Legislative Assistant, or Senior Legislative Assistant depending on qualifications, to handle work on the Financial Services Committee. Candidates should have substantial experience with financial services issues and substantial Congressional experience. The successful applicant will possess strong writing and oral communication skills, work well with others, be comfortable in a fast-paced environment, and understand the legislative process.",
    "responsibilities": [],
    "qualifications": [
      "Substantial experience with financial services issues",
      "Substantial Congressional experience",
      "Strong writing and oral communication skills",
      "Ability to work well with others",
      "Comfortable in a fast-paced environment",
      "Understand the legislative process"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter, resume, and three writing samples to HouseFinancialServicesLA@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "HouseFinancialServicesLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-141-15",
    "position_title": "Legislative Assistant",
    "office": "Republican Member",
    "location": null,
    "posting_date": "2015-03-08",
    "description": "Legislative duties will include briefing the Member on floor votes and other pending legislation. Preference will be given to those with expertise on issues involving healthcare, education and veterans' affairs. Successful candidates must demonstrate exceptional writing ability, attention to detail, and organizational skills. Hill experience and familiarity with IQ are a plus.",
    "responsibilities": [
      "Briefing the Member on floor votes",
      "Briefing the Member on other pending legislation"
    ],
    "qualifications": [
      "Strong Tennessee ties",
      "Expertise on issues involving healthcare, education and veterans' affairs",
      "Exceptional writing ability",
      "Attention to detail",
      "Organizational skills",
      "Hill experience (plus)",
      "Familiarity with IQ (plus)"
    ],
    "how_to_apply": "Send resume and cover letter to TNHousejob@gmail.com.",
    "salary_info": null,
    "contact": "TNHousejob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-140-15",
    "position_title": "Field Representative/Caseworker",
    "office": "Office of Congressman Juan Vargas",
    "location": "District Office",
    "posting_date": "2015-08-03",
    "description": "The Office of Congressman Juan Vargas is seeking a high energy, highlyorganized, and detail oriented Field Representative/Caseworker for his\nDistrict Office.",
    "responsibilities": [
      "Serve as an official representative for the Member throughout communities in the District.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Director on district and local issues of importance.",
      "Staff and provide logistical support for scheduled district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director and Chief of Staff.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached."
    ],
    "qualifications": [
      "A candidate with a background in and/or understanding of military/veteran issues.",
      "Veterans, reservists, women, and minorities are strongly encouraged to apply.",
      "Ability to work non-traditional hours, including nights and weekends, if needed.",
      "Excellent written (English and Spanish) and interpersonal communication skills.",
      "Ability to work with staff at all levels, work well under pressure and be detail oriented.",
      "Possess an understanding of the federal legislative process.",
      "Ability to quickly learn about key issues and events in the district for which the Member is involved.",
      "A qualified applicant must be a U.S. Citizen, possess a valid California driver’s license with the ability to travel as needed."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to CAJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-111-15",
    "position_title": "Scheduler/Office Manager",
    "office": "Senior Democratic Congresswoman",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-03",
    "description": "Responsibilities include managing office calendars and visitor access to Member and staff in front office, organizing and tracking invitations, speaking engagements, travel reservations and other requests for the Member, coordinating with district staff, and maintaining administrative demands. The Scheduler/Office Manager will work closely with other staff members, particularly senior staffers, to ensure efficient and seamless office operations. Ideal candidates are flexible, responsive, collaborative, work well under pressure and on short deadlines, and are able to balance competing demands. Candidates must be available to assist the Member outside of regular business hours. Applicants should also have a positive attitude, excellent organizational skills, strong written and verbal communication and interpersonal skills, political instincts and an ability to thrive in a fast-paced environment. This is not an entry-level position. Previous Capitol Hill operational and/or scheduling experience is required. Ohio ties preferred. No phone calls, emails or drop-bys.",
    "responsibilities": [
      "Managing office calendars and visitor access to Member and staff in front office",
      "Organizing and tracking invitations, speaking engagements, travel reservations and other requests for the Member",
      "Coordinating with district staff",
      "Maintaining administrative demands",
      "Work closely with other staff members, particularly senior staffers, to ensure efficient and seamless office operations"
    ],
    "qualifications": [
      "Flexible",
      "Responsive",
      "Collaborative",
      "Work well under pressure and on short deadlines",
      "Able to balance competing demands",
      "Available to assist the Member outside of regular business hours",
      "Positive attitude",
      "Excellent organizational skills",
      "Strong written and verbal communication and interpersonal skills",
      "Political instincts",
      "Ability to thrive in a fast-paced environment",
      "Previous Capitol Hill operational and/or scheduling experience is required",
      "Ohio ties preferred"
    ],
    "how_to_apply": "Please submit cover letter, resume, and at least two references to Midwestern.Resume@mail.house.gov. No phone calls, emails or drop-bys.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  }
]