[
  {
    "id": "MEM-305-22",
    "position_title": "Assistant Systems Administrator",
    "office": "Office of the Legislative Counsel",
    "location": null,
    "posting_date": "2022-06-27",
    "description": "The Assistant Systems Administrator works primarily with the Systems Administrator and the Senior Systems Analyst of the information technology (IT) team within the Office. Together, the IT team supports the mission of the Office through the development, implementation, and maintenance of IT systems necessary to meet a wide variety of operational requirements.\n\nThis position does not include supervisory duties.",
    "responsibilities": [
      "Providing first-, second-, and third-tier support to users experiencing software and hardware issues.",
      "Imaging, distributing, setting up, and supporting Microsoft systems for users, including related troubleshooting.",
      "Creating new users, system accounts, groups, and other security principals in Active Directory.",
      "Reading, writing, interpreting, and modifying batch files.",
      "Installing and positioning IT equipment, including the moving and lifting of such equipment.",
      "Communicating information on the status of systems to IT team members, users, and management.",
      "Supporting administrative processes to ensure the IT team’s ability to support users, maintain inventory, track the status of systems, and deploy software.",
      "Maintaining basic to intermediate troubleshooting and operational knowledge with respect to all the software implemented within the Office.",
      "Resolving issues regarding network and internet security.",
      "Integrating Office systems and operations with the systems and operations of other House organizations.",
      "Working, as directed, with House Information Resources server owners on the management, design, development, building, and maintenance of servers (including VMware and Windows servers), server applications, and systems software.",
      "Communicating with contractors and other external entities who interact with the Office.",
      "Escalating problems that merit additional support through the proper channels.",
      "Additional tasks as assigned."
    ],
    "qualifications": [
      "Demonstrated technical skills and the ability to develop solutions to complex technical problems.",
      "Experience, including basic to intermediate troubleshooting and operational knowledge, with respect to the following: DNS|DHCP|TCP/IP, Windows Server 2016/2019, Windows 10, Microsoft Office 365, and internet and communication protocols.",
      "Experience reading, writing, interpreting, and modifying batch files.",
      "An understanding of PowerShell.",
      "An understanding of Hyper-V.",
      "A willingness to pursue training, as necessary, to acquire and maximize skills.",
      "Excellent written and oral communication skills, including the ability to effectively communicate IT concepts to individuals with varying levels of experience and knowledge.",
      "Strong attention to detail.",
      "Ability to self-start, multitask, and effectively prioritize under tight deadlines.",
      "Ability to work both independently and cooperatively.",
      "CompTIA A+",
      "CompTIA Network+",
      "CompTIA ITF+",
      "Microsoft 365 Certified: Fundamentals",
      "MCSE or equivalent"
    ],
    "how_to_apply": "Interested applicants should email a cover letter, a resume, applicable transcripts and certifications, and the names and telephone numbers of at least 3 references to legcoun@mail.house.gov with “Assistant Systems Administrator job opportunity” in the subject line. No phone calls, please.",
    "salary_info": null,
    "contact": "legcoun@mail.house.gov",
    "equal_opportunity": "The Office is an Equal Opportunity Employer. Employment with the Office is at-will."
  },
  {
    "id": "MEM-303-22",
    "position_title": "National Security/Military Legislative Assistant",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "DC",
    "posting_date": "2022-06-27",
    "description": "Congressman Andy Kim (NJ-03) seeks a hard-working, strategically minded\nNational Security/Military Legislative Assistant to join his DC policy team. This\nis not an entry-level position. Given the Congressman’s previous career work in\nnational security and his positions on the House Armed Services and Foreign\nAffairs Committees, we are ideally looking for someone with previous policy\nexperience handling national security, defense, foreign affairs and/or international\ndevelopment issues that can build upon this office’s expertise and effectively\ndrive policy on the Hill.\n\nCandidates should have experience in formulating and advancing legislation and\na demonstrated ability to brief a Member of Congress on complex policy issues\nboth orally and in writing. Successful applicants will work quickly under\npressure, have good working knowledge of House legislative processes and\nprocedures, excellent organization and communication skills, and work well with\nothers. This position reports to the Legislative Director, manages 1-2 fellows, and\nworks closely with the rest of the Congressman’s legislative and communications\nteams.",
    "responsibilities": [
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise but will likely include: defense, national security, foreign affairs and international development including the House Armed Services and Foreign Affairs Committees.",
      "Tracks legislation and other developments in assigned issue areas.",
      "Takes constituent and advocacy group meetings.",
      "Builds relationships with district and national stakeholders and advocacy organizations.",
      "Reviews legislation and makes recommendations for cosponsorships and letters for the Congressman to sign.",
      "Builds support for the Member’s legislation and develops/implements ideas for new legislation to advance the Congressman’s strategic priorities, with guidance from the Legislative Director.",
      "Develops and advances the Member's priorities in the National Defense Authorization Act (NDAA).",
      "Exercises discretion and independent judgment in the formulation and recommendation of policy positions for the Member.",
      "Reviews draft press releases and social media in assigned issue areas for technical accuracy.",
      "Identifies opportunities for the Member to engage with national and international organizations, think tanks, and leaders in the field of national security, including tracking major conferences, events, and potential speaking engagements."
    ],
    "qualifications": [
      "1-2 years of previous legislative experience on the Hill",
      "Knowledge of or ties to New Jersey a plus"
    ],
    "how_to_apply": "Email a cover letter, resume, a short writing sample, and 2-3 references to NJ03Resumes@mail.house.gov with the subject line, “National Security/Military Legislative Assistant: [Your Full Name]” Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-300-22",
    "position_title": "Scheduler",
    "office": "Congressman Mike Garcia (CA-25)",
    "location": "DC and the District",
    "posting_date": "2022-06-27",
    "description": "Main responsibilities include maintaining the Member's daily and long-term schedules for both DC and the District; organizing and evaluating all incoming meeting requests and invitations; keeping the Member on schedule throughout the day; working with legislative and communications staff to ensure the Member is prepared for events/meetings; coordinating travel arrangements; processing and managing expenses and reimbursements for the Member; and communicating with constituents by phone and email to address requests, concerns, and questions.\n\nAdditional responsibilities include other administrative tasks.",
    "responsibilities": [
      "Maintaining the Member's daily and long-term schedules for both DC and the District",
      "Organizing and evaluating all incoming meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Coordinating travel arrangements",
      "Processing and managing expenses and reimbursements for the Member",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented and able to multi-task",
      "Resourceful",
      "Team-oriented",
      "Have a positive attitude",
      "Availability outside of regular business hours including some weekend availability as needed",
      "Previous scheduling experience (at least one year in a similar position)"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume via email to Charles.navarro@mail.house.gov with “Scheduler” in the subject line.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "Charles.navarro@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-298-22",
    "position_title": "Press Assistant/Staff Assistant",
    "office": "Congresswoman Suzan DelBene (D-WA)",
    "location": "Washington, DC",
    "posting_date": "2022-06-27",
    "description": "The office of Congresswoman Suzan DelBene (D-WA) seeks a dynamic press assistant/staff assistant with strong digital media skills.\n\nPress assistant tasks include sending daily clips, developing social media content, drafting press materials, and assisting in other aspects of the team’s fast-paced media operation. Strong writing skills with expertise and passion for digital media are required. Staff assistant duties include maintaining the front office, overseeing tours and flag requests, and ensuring day-to-day operations run smoothly. Hill experience and Washington state ties are a plus. If you have salary requirements, please include them in your application.",
    "responsibilities": [
      "Sending daily clips",
      "Developing social media content",
      "Drafting press materials",
      "Assisting in other aspects of the team’s fast-paced media operation",
      "Maintaining the front office",
      "Overseeing tours and flag requests",
      "Ensuring day-to-day operations run smoothly"
    ],
    "qualifications": [
      "Strong writing skills with expertise and passion for digital media are required",
      "Hill experience and Washington state ties are a plus"
    ],
    "how_to_apply": "To apply, please send your cover letter, resume, and two 1-2 page writing samples or a digital portfolio to Washington.Resumes@mail.house.gov and put “Press Assistant” in the subject line.",
    "salary_info": "If you have salary requirements, please include them in your application.",
    "contact": "Washington.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Diverse candidates are strongly encouraged to apply. Please mention any Pacific Northwest ties in your cover letter."
  },
  {
    "id": "MEM-295-22",
    "position_title": "Legislative Assistant",
    "office": "Office of Congresswoman Yvette Clarke (NY-09)",
    "location": "Capitol Hill",
    "posting_date": "2022-06-27",
    "description": "The office of Congresswoman Yvette Clarke (NY-09) seeks a high motivated Legislative Assistant to focus on a portfolio of environment, energy and climate change.",
    "responsibilities": [
      "Oversees the Congresswoman’s E&C committee work, as assigned;",
      "Tracks legislation and other developments in assigned issue areas, briefs the Member for floor and committee work, coordinates with Communications staff to draft floor speeches for the Member and plans and coordinates co-sponsorships and support of other legislation related to assigned issue areas;",
      "Formulates legislative initiatives for assigned issue areas including planning, coordinating and scheduling introduction of legislation, gathering support for a bill or amendment; working with committees on legislation and coordinating legislative support for bill passage;",
      "Responsible for assigned caucuses, including attending meetings, compiling information and briefing the Member on pertinent information;",
      "Works with Scheduler, Legislative Director, District Director, and Chief of Staff to plan district events related to assigned issue areas;",
      "Meets with constituents and interest groups related to assigned issue areas and completes meeting notes for each meeting.",
      "Provides information on and generates ideas for press, mass mailings, and newsletters",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Candidates should have at least two years of Capitol Hill experience, and excellent writing and communication skills.",
      "New York City ties are encouraged."
    ],
    "how_to_apply": "Qualified candidates should email their resume and cover letter with the subject line “Legislative Assistant” to:",
    "salary_info": "Minimum salary of $55,000/ year. Increased salary commensurate with experience.",
    "contact": "ny09resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-291-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2022-06-27",
    "description": "Representative Nanette Diaz Barragán (CA-44) seeks an experienced\nCommunications Director to lead a fast-paced and highly engaged press\noperation. Applicants must be creative, dynamic, proactive, and energetic.\nThe Communications Director will serve as the spokesperson and primary\ncommunications advisor to the Member. They will be responsible for developing\nand executing an aggressive strategic communications plan, including social\nmedia, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director will oversee day-to-day press operations,\nincluding coordinating and managing the press team; responding to media\ninquiries; booking the Member for interviews; pitching news opportunities to\nmedia outlets; planning press conferences and in-district events; managing the\nMember’s social media accounts and official website; editing/drafting speeches,\ntalking points, floor statements, press releases, op-eds, and e-newsletters; and\ncreating and distributing e-newsletters and franked mailings.\nThey are also responsible for working with the Member, Chief of Staff,\nLegislative Director, and District Director to develop and coordinate core\nmessaging. The Communications Director is responsible for maintaining the\nCongresswoman’s voice across all communications materials, with an emphasis\non clarity, relatability, authenticity, and connecting the Congresswoman’s values\nand advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related\nexperience either on or off Capitol Hill. They must be highly organized,\nproficient in multi-tasking, have strong political judgment and instincts, and\npossess superior writing, editing, and proofreading skills.",
    "responsibilities": [
      "Coordinating and managing the press team",
      "Responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member’s social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters and franked mailings",
      "Working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging",
      "Maintaining the Congresswoman’s voice across all communications materials"
    ],
    "qualifications": [
      "NOT an entry level position",
      "Previous press-related experience either on or off Capitol Hill",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political judgment and instincts",
      "Superior writing, editing, and proofreading skills",
      "Los Angeles Metro|Southern California ties are a plus",
      "Fluency in Spanish is a plus",
      "Experience with video editing and graphic design are a plus",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus",
      "Willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude"
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-289-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Lois Frankel (FL-21)",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-27",
    "description": "Congresswoman Lois Frankel (FL-21) is hiring a Legislative Assistant to support her work as Co-Chair of the Democratic Women’s Caucus (DWC), and cover a range of issues on the Appropriations Committee, including the Energy & Water Subcommittee, transportation, housing, judiciary, and other areas as assigned based on need and expertise.",
    "responsibilities": [],
    "qualifications": [
      "Applicant must be comfortable working in a fast-paced and team-oriented environment.",
      "Excellent writing skills, ability to build and maintain relationships, and attention to detail are required.",
      "This is not an entry-level position.",
      "Previous experience with the Hill and the Appropriations process is strongly preferred."
    ],
    "how_to_apply": "Please email a cover letter and resume with the subject line “Legislative Assistant” to FLJobOpening@mail.house.gov. Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary will start at $65,000, depending on experience, and includes health insurance along with other competitive benefits.",
    "contact": "FLJobOpening@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ people, and members of other minority or marginalized groups are strongly encouraged to apply. We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status."
  },
  {
    "id": "MEM-284-22",
    "position_title": "Scheduler",
    "office": "Republican House Member",
    "location": "Capitol Hill",
    "posting_date": "2022-06-27",
    "description": "A successful candidate will demonstrate a keen attention to detail and adapt well.\n\nPrimary responsibilities will include intaking and organizing all meeting requests, updating the Member’s calendar, and managing quick-to-evolve travel arrangements. Qualified candidates must have relevant scheduling or front-office experience, preferably on Capitol Hill.",
    "responsibilities": [
      "Intaking and organizing all meeting requests",
      "Updating the Member’s calendar",
      "Managing quick-to-evolve travel arrangements"
    ],
    "qualifications": [
      "Relevant scheduling or front-office experience, preferably on Capitol Hill"
    ],
    "how_to_apply": "Interested candidates should send their resume to: housegopscheduler@gmail.com.",
    "salary_info": null,
    "contact": "housegopscheduler@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-283-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Doris Matsui (D-CA-06)",
    "location": null,
    "posting_date": "2022-06-27",
    "description": "This position will handle the Congresswoman’s Energy and Commerce Energy\nSubcommittee work and her role as co-chair of the House Sustainable Energy and\nEnvironment Coalition (SEEC) and co-chair of the SEEC Nature and Oceans\nTask Force. The portfolio will be focused on natural climate solutions, clean\nenergy, clean transportation, environmental justice, and energy equity policy; it\nwill also likely include women’s issues, immigration work, and potentially a few\nother issues.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience is strongly preferred."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and references in a single PDF\nto seniordemresumes@gmail.com. Please use “Energy/Enviro LA” as the\nsubject.",
    "salary_info": null,
    "contact": "seniordemresumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of\nrace, color, religion, sex, sexual orientation, gender identity and expression,\nnational origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-281-22",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Sara Jacobs (CA-53)",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-27",
    "description": "The Office of Congresswoman Sara Jacobs (CA-53) is looking for an ambitious and detail- oriented Communications Director based in Washington, D.C. The Communications Director will be responsible for developing and implementing media, communications, and public relations strategies on behalf of Congresswoman Jacobs and her office. The ideal candidate will be a strong writer with demonstrated political instincts, solid relationships with the Capitol Hill press corps, an interest in non-traditional methods of communication, and an aversion to conventional wisdom.\nCalifornia ties are helpful; good judgment, common sense, and a sense of humor are a must. The position reports to the Congresswoman and Chief of Staff.",
    "responsibilities": [
      "Crafting the office’s communications strategy",
      "Acting as the formal spokesperson and media liaison for the Congresswoman",
      "Writing and/or editing talking points, op-eds, press statements, press releases, social media, and weekly newsletters on behalf of the Congresswoman",
      "Working with the Capitol Hill press corps and non-political outlets to book media appearances and pitch stories",
      "Overseeing the office’s mass communications/franking program, and working with the Legislative Correspondent on the office’s mail program",
      "Overseeing the work of the Communications Aide in the District Office and the Digital Assistant in the Washington, D.C. office",
      "Staying up to date on current events and legislation relevant to the Congresswoman, her priorities, and her district",
      "Working a flexible schedule including long hours, nights, and weekends"
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send a cover letter, writing sample and/or portfolio, and resume with “Jacobs - Communications Director” in the subject line to SaraJacobs.Resumes@mail.house.gov. Applications will be considered on a rolling basis, with priority given to earlier applicants.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Jacobs is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-278-22",
    "position_title": "Digital/Press Assistant",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-27",
    "description": "The office of Congressman Dan Kildee is seeking an organized and creative communications professional to join the Washington, D.C. team.\n\nThe digital/press assistant will assist the press secretary in all aspects of the office’s robust communications operation for a Member of Democratic leadership.\n\nQualified candidates will have one to two years of political, campaign or advocacy communications experience. Successful candidates will be collaborative team players who enjoy taking initiative, solving problems and thinking creatively. Michigan ties are a plus.",
    "responsibilities": [
      "Maintain the Member’s social media accounts",
      "Develop, plan, and post social media content",
      "Create graphics, film and edit photos and videos, including clipping, captioning and adding branding",
      "Compile daily press clips",
      "Stay informed about relevant legislative issues and current events in the district",
      "Manage Member’s website",
      "Maintain press lists, robust photo archive and analytics trackers",
      "Assist with logistics for town halls, press conferences, etc.",
      "Write e-newsletters, press releases and media advisories",
      "Support franked mail and digital communications campaigns",
      "Work flexible schedule, including long hours, nights and weekends as necessary, and perform other duties as assigned"
    ],
    "qualifications": [
      "Strong writing, editing, and proofreading skills",
      "Experience using Adobe Suite, Canva, Wavve and Kapwing or equivalent digital products to create graphics, videos, and other digital content",
      "Understanding of print, broadcast, and digital media",
      "Experience developing social media content and managing platforms for clients or cause",
      "Proficiency in constituent management platforms, such as IQ, preferred",
      "Strong organizational skills, and ability to manage multiple tasks at once",
      "Ability to work cooperatively and courteously with others",
      "Command of AP style",
      "Thoroughness and careful attention to detail",
      "Ability to work well under pressure, manage multiple deadlines and accept performance-based criticism and direction"
    ],
    "how_to_apply": "Applicants should submit a resume, cover letter, one writing sample, one sample social post and one digital/creative sample to Michigan05jobs@gmail.com with the subject line “Digital/Press Assistant.” Digital portfolios or websites also accepted for creative samples.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": "Congressman Kildee’s office is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions are made without regard to race, sex, religion or belief, sexual orientation, gender identity, family or parental status, or any other status protected by law."
  },
  {
    "id": "MEM-265-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member",
    "location": null,
    "posting_date": "2022-06-27",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized, and professional individual to serve in the role of Staff Assistant.\n\nThe successful applicant will be personable, organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.\n\nAdditional daily tasks include answering phones, processing mail, assisting with constituent requests for information, coordinating tours, and other administrative duties supporting the Member and staff as needed.",
    "responsibilities": [
      "Answering phones",
      "Processing mail",
      "Assisting with constituent requests for information",
      "Coordinating tours",
      "Other administrative duties supporting the Member and staff as needed"
    ],
    "qualifications": [
      "Personable",
      "Organized",
      "Excellent communication and time-management skills",
      "Ability to exercise sound, independent judgment",
      "Ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to staffassistant2022@yahoo.com. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "staffassistant2022@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-231-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office of her very active and visible constituent services staff",
    "posting_date": "2022-06-27",
    "description": "Constituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.\n\nThe ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Helping with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Ability to work independently",
      "Ability to think outside the box about various constituent issues and community events",
      "Prior community or casework experience is helpful",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Possession of a bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-208-22",
    "position_title": "Communications Director",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-06-27",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks an experienced Communications Director based in the DC office to develop and execute the Congressman’s communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.\nThe Communications Director will serve as the spokesperson and primary communications advisor to Congressman Horsford and will supervise the work of junior communications staff. They will be responsible for executing an aggressive communications plan that generates positive local and national media coverage, reaches diverse communities, and expands the Congressman’s reach to new audiences.",
    "responsibilities": [
      "Working with Congressman Horsford, the Chief of Staff, the Deputy Chief of Staff, and the District Director to develop strategic messaging priorities.",
      "Managing all day-to-day external communications from the office, including press releases, remarks, floor speeches, interview memos, newsletters, op-eds, and social media.",
      "Proactively identifying opportunities to expand Congressman Horsford’s local and national media profile and working closely with the Congressional Black Caucus, the House Labor Caucus, and other affiliated caucuses on shared priorities.",
      "Pitching stories to local and national press and planning press conferences, press calls, and other press events.",
      "Developing a strategic plan and budget for all communications programs.",
      "Designing and implementing a creative digital communications program, including both paid advertising and organic social media. The Communications Director will also be responsible for keeping the Congressman’s website up-to-date.",
      "Overseeing franked communications and a robust 499 program."
    ],
    "qualifications": [
      "This is not an entry-level position, and candidates must have previous press experience on or off Capitol Hill.",
      "Strong oral and written communications skills are required.",
      "Prior experience managing franked communications is a plus.",
      "The ideal candidate must be collaborative, creative, energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours in a fastpaced and demanding setting.",
      "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus and Nevada ties a plus."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Communications Director” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-149-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-06-27",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks",
      "Serves as intern coordinator by recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-06-27",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media Secretary based in the DC office to work closely with the Communications Director, based in the district office to develop and execute the Congressman's communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital, technical, and social media trends. Able to express the Congressman's voice creatively and promote social media presence, ensuring high web traffic and constituent engagement.\n\nThis position serves as a part of the Communications team and reports directly to the Director of Communications based in the district, however, this person will be the main point of contact in the D.C. office.\n\nThe candidate will report to the Communications Director and work closely with legislative and district staff. The ideal candidate will have experience in or interest in learning about aspects of the office's traditional press operations, including writing press releases, drafting talking points and speeches, forming relationships with members of the media, and pitching stories.\n\nThis is an ideal position for someone with 1-2 years of communications or digital experience. Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman's social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman's website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman's media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada's Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford's digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "Applicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus.",
      "Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply."
  }
]