[
  {
    "id": "MEM-183-14",
    "position_title": "Communications Director",
    "office": "Democratic member",
    "location": null,
    "posting_date": "2014-05-05",
    "description": "Democratic member seeks highly proactive, experienced Communications Director to develop and implement an aggressive media plan in a fast-paced, high-energy environment. Potential candidate must have proven track record with local and national media, possess ability to manage staff and entire media portfolio. Significant speech writing is required. Outstanding writing skills are required including: press statements, social media, op-eds, floor remarks, and keynote speeches. Understanding of key policy areas, including health care is desired.",
    "responsibilities": [],
    "qualifications": [
      "3-5 years of previous experience (NOT ENTRY LEVEL POSITION)"
    ],
    "how_to_apply": "Qualified candidates should submit an email to resumes4@mail.house.gov (with subject line: Communications Director) and attach a resume and cover letter.",
    "salary_info": null,
    "contact": "resumes4@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-182-14",
    "position_title": "Communications Director",
    "office": "California member",
    "location": null,
    "posting_date": "2014-05-05",
    "description": "Senior, progressive California member seeks highly proactive, experienced Communications Director to develop and implement a strategic media plan in a fast-paced and results-driven environment. Potential candidate must have proven track record with national media and ethnic press, possess ability to manage robust digital media portfolio, and utilize aggressive pitching strategies. Outstanding writing skills are required for varying mediums including: press statements, social media, op-eds, floor remarks, and keynote speeches. Understanding of key policy areas, including poverty, foreign affairs, and HIV/AIDS is desired. This is NOT an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit resume, cover letter, and two writing samples (press release and or op-ed) to lee.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "Minority candidates are strongly encouraged to apply."
  }
]