[
  {
    "id": "MEM-212-16",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member",
    "location": "Capitol Hill",
    "posting_date": "2016-07-18",
    "description": "Senior Democratic Member seeks motivated, detail-oriented, and energetic individual with excellent oral and written communication skills to serve as a staff assistant. Candidates should demonstrate strong interpersonal skills, be comfortable with managing multiple tasks, and have a strong work ethic.",
    "responsibilities": [
      "Managing the front office",
      "Answering and screening telephone calls",
      "Greeting visitors",
      "Coordinating tour requests for visiting constituents",
      "Managing flag requests",
      "Supervising and coordinating the intern program",
      "Assisting staff"
    ],
    "qualifications": [
      "Capitol Hill experience preferred."
    ],
    "how_to_apply": "Email cover letter and resume to job_09@live.com.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-209-16",
    "position_title": "Communications Director",
    "office": "New England Democrat",
    "location": null,
    "posting_date": "2016-07-18",
    "description": "Communications Director is responsible for managing all aspects of very active, fast-paced press operation. Duties include but are not limited to: crafting overall message strategy; planning and executing local and national press events; drafting and distributing press releases, advisories, and statements; engaging in outreach to and maintaining relationships with local and national media; managing social media pages; preparing speeches and written remarks; drafting internal communications documents for Member and staff.",
    "responsibilities": [
      "Crafting overall message strategy",
      "Planning and executing local and national press events",
      "Drafting and distributing press releases, advisories, and statements",
      "Engaging in outreach to and maintaining relationships with local and national media",
      "Managing social media pages",
      "Preparing speeches and written remarks",
      "Drafting internal communications documents for Member and staff"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Keen attention to detail",
      "Strong organizational skills",
      "Ability to perform well under pressure",
      "Comfort working in team environment",
      "This is not an entry-level position"
    ],
    "how_to_apply": "Interested applicants should submit cover letter, resume, and two writing samples to hill.jobs@mail.house.gov. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-203-16",
    "position_title": "Legislative Correspondent",
    "office": "Southern Republican",
    "location": "Washington, D.C.",
    "posting_date": "2016-07-18",
    "description": "Primary responsibilities include managing constituent correspondence, conducting research, and providing support to the legislative staff when necessary. Applicants must be hardworking, detail oriented, and possess strong writing skills. This position also allows for the opportunity to experience the press side of a congressional office if interested.",
    "responsibilities": [
      "Managing constituent correspondence",
      "Conducting research",
      "Providing support to the legislative staff when necessary"
    ],
    "qualifications": [
      "Hardworking",
      "Detail oriented",
      "Strong writing skills",
      "Experience with the Intranet Quorum database (preferred but not required)",
      "Ties to Tennessee (preferred but not required)"
    ],
    "how_to_apply": "Qualified candidates should send their resume to TN08.HouseJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "TN08.HouseJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-199-16",
    "position_title": "Communications & Outreach Coordinator",
    "office": "U.S. Rep. Ann McLane Kuster",
    "location": "Concord, New Hampshire",
    "posting_date": "2016-07-18",
    "description": "Communications:\n\nIssue Area Outreach:\n\nGeneral:",
    "responsibilities": [
      "Work with Communications team to draft and disseminate press releases, media advisories, statements, and other communications material.",
      "Help plan local press events and assist Communications Director in pitching stories to the media as needed.",
      "Manage Facebook, Twitter, and other social media pages.",
      "Work with Communications Director and other staff to develop and implement office messaging strategy.",
      "Develop and maintain relationships with leaders and stakeholders in assigned issue areas.",
      "Attend and hold meetings as necessary with issue area leaders and stakeholders; engage with the public on projects within these areas.",
      "Monitor ongoing projects and legislative actions connected to assigned issue areas.",
      "Develop and coordinate public events, business visits and private meetings in connection with assigned issue areas.",
      "Answer phones and walk-in cases as necessary.",
      "Draft letters, memos and reports on meetings, events and projects.",
      "Attend occasional night or weekend events as necessary."
    ],
    "qualifications": [
      "Strong writing skills",
      "Strict attention-to-detail",
      "Ability to “think on your toes” and work in a constantly shifting, fast-paced work environment",
      "Prior political or press experience strongly preferred."
    ],
    "how_to_apply": "If interested, please submit resume, cover letter, and two writing samples to NH02.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NH02.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-194-16",
    "position_title": "Legislative Assistant",
    "office": "U.S. Member of Congress in New York",
    "location": "D.C. Office",
    "posting_date": "2016-07-18",
    "description": "Individuals will handle a portfolio of legislative issues including small business, economic development, housing, environment, immigration, and foreign affairs – including the Middle East and Caribbean. This individual is responsible for drafting legislation and amendments, tracking legislative, developing legislative initiatives, writing speeches and floor statements, staffing the Member in Committee, and representing the Member in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking legislative",
      "Developing legislative initiatives",
      "Writing speeches and floor statements",
      "Staffing the Member in Committee",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Ability to work well under pressure in a fast-paced environment",
      "Strong team player",
      "At least two years of legislative experience on Capitol Hill",
      "Ties to New York are a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and brief writing sample to ResumeNY@mail.house.gov. Please be sure to put LEGISLATIVE ASSISTANT in the subject line.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": "An Equal Opportunity Employer."
  },
  {
    "id": "MEM-189-16",
    "position_title": "Press Office Staff",
    "office": "Rules Committee Ranking Member Louise Slaughter (NY-25)",
    "location": "Capitol Hill",
    "posting_date": "2016-07-18",
    "description": "The press office of Rules Committee Ranking Member Louise Slaughter (NY-25) is looking for talented candidates with a passion for public policy messaging, strong writing and communications skills, and the ability to work collaboratively.",
    "responsibilities": [],
    "qualifications": [
      "Has Capitol Hill and campaign experience",
      "Writes beautiful speeches with historical references",
      "Is an expert social media manager with attention to detail",
      "Enjoys making info graphics during lunch breaks",
      "Does not offend easily during the editing process",
      "Likes staying up late and waking up early",
      "Loves Rochester, NY and the Rules Committee"
    ],
    "how_to_apply": "Applicants should submit a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-184-16",
    "position_title": "Legislative Assistant",
    "office": "House Foreign Affairs Committee",
    "location": "Capitol Hill",
    "posting_date": "2016-07-18",
    "description": "A Senior Member of the House Foreign Affairs Committee is seeking a skilled and experienced Legislative Assistant to handle foreign policy and related issues.",
    "responsibilities": [],
    "qualifications": [
      "Relevant Capitol Hill experience",
      "Excellent communications skills",
      "A background in foreign policy and/or an advanced degree"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to ForeignAffairsLA@gmail.com.",
    "salary_info": null,
    "contact": "ForeignAffairsLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-183-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "California Republican",
    "location": "Washington, DC",
    "posting_date": "2016-07-18",
    "description": "Duties include management of constituent correspondence program, flag requests, tour coordinating, and general administrative duties.",
    "responsibilities": [
      "Management of constituent correspondence program",
      "Flag requests",
      "Tour coordinating",
      "General administrative duties"
    ],
    "qualifications": [
      "Excellent writing and research ability",
      "Self-starters",
      "Energetic",
      "Strong organizational and time management skills"
    ],
    "how_to_apply": "Please send resume, cover letter, and short writing sample to CARepublicanjobs@gmail.com.",
    "salary_info": null,
    "contact": "CARepublicanjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-182-16",
    "position_title": "Scheduler",
    "office": "Senior House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2016-07-18",
    "description": "Senior House Democrat seeks experienced individual to handle all facets of the member's Washington, D.C. schedule as well as staffing the reception area. Scheduler responsibilities include managing heavy volume of meeting, speaking and traveling requests, provide transportation (which can include late evenings), manage personal correspondence, greeting visitors and answering phones.",
    "responsibilities": [
      "Managing heavy volume of meeting, speaking and traveling requests",
      "Provide transportation (which can include late evenings)",
      "Manage personal correspondence",
      "Greeting visitors",
      "Answering phones"
    ],
    "qualifications": [
      "Detail oriented",
      "Able to work in a fast-paced environment",
      "Excellent oral and written communication skills",
      "Spanish fluency a plus"
    ],
    "how_to_apply": "Please send cover letter and resume to:",
    "salary_info": "Salary commensurate with experience.",
    "contact": "one_vacancy@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-179-16",
    "position_title": "Communications Director",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2016-07-18",
    "description": "The office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and hard-working communications director to join our Washington, DC-based team.\n\nThe communications director will be responsible for coordinating with the legislative team and member to develop and implement all communications activities for the office, including acting as the member's spokesperson and drafting op-eds, speeches, press releases, and newsletters.\n\nThe successful applicant will be an excellent writer and editor, clear thinker, and persuasive advocate for individual liberty, economic freedom, and the Constitution. He or she must demonstrate a breadth of policy knowledge, familiarity with the legislative process, and the ability to exercise sound, independent judgment. Individuals who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Coordinating with the legislative team and member to develop and implement all communications activities for the office",
      "Acting as the member's spokesperson",
      "Drafting op-eds, speeches, press releases, and newsletters"
    ],
    "qualifications": [
      "Libertarian (classical liberal and constitutional conservative)",
      "BA or equivalent",
      "At least two years of professional experience",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to mi03.apply@gmail.com. Please include \"communications director applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  }
]