[
  {
    "id": "MEM-022-17",
    "position_title": "Press Secretary/DC Scheduler",
    "office": "Texas Democrat",
    "location": "DC",
    "posting_date": "2017-01-30",
    "description": "Texas Democrat seeks Press Secretary/DC Scheduler who is detail-oriented with advanced writing skills to manage and coordinate all communications activities, including media contacts. Responsibilities to include writing press releases and op-eds, responding to press inquiries, newsletter production, and maintaining Member website and social media accounts. Ability to quickly grasp issues and take proactive approach to media relations required. This position also includes managing the Member's DC schedule. Texas ties and Spanish proficiency a plus. Previous Hill press experience preferred.",
    "responsibilities": [
      "Writing press releases and op-eds",
      "Responding to press inquiries",
      "Newsletter production",
      "Maintaining Member website and social media accounts",
      "Managing the Member's DC schedule"
    ],
    "qualifications": [
      "Detail-oriented with advanced writing skills",
      "Ability to quickly grasp issues",
      "Proactive approach to media relations required",
      "Texas ties and Spanish proficiency a plus",
      "Previous Hill press experience preferred"
    ],
    "how_to_apply": "To apply, please email resume with cover letter to txjobopening@mail.house.gov.",
    "salary_info": null,
    "contact": "txjobopening@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-17",
    "position_title": "Staff Director",
    "office": "House Veterans Affairs’ Committee Minority staff",
    "location": null,
    "posting_date": "2017-01-30",
    "description": "The House Veterans Affairs’ Committee Minority staff seeks a Staff Director with a minimum of 5 years of managerial experience in a professional office setting and solid expertise in veterans’ policy. The ideal candidate would have proven experience in establishing and managing relationships with the veterans service organization community, Members of the House Veterans’ Affairs Committee and other Members of Congress, as well as the Department of Veterans Affairs. An excellent collaborative leader and inspired self-starter, the ideal candidate will have a proficient and relevant understanding of the dynamics of both the Republican and Democratic Caucuses, as well as the Executive Branch. Veteran status is a plus.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 5 years of managerial experience in a professional office setting",
      "Solid expertise in veterans’ policy",
      "Proven experience in establishing and managing relationships with the veterans service organization community, Members of the House Veterans’ Affairs Committee and other Members of Congress, as well as the Department of Veterans Affairs",
      "Proficient and relevant understanding of the dynamics of both the Republican and Democratic Caucuses, as well as the Executive Branch",
      "Veteran status is a plus"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume and two writing samples to Walz.Resumes@mail.house.gov no later than January 31, 2017.",
    "salary_info": null,
    "contact": "Walz.Resumes@mail.house.gov",
    "equal_opportunity": "The House Veterans’ Affairs Committee Minority staff is an equal opportunity employer."
  },
  {
    "id": "MEM-019-17",
    "position_title": "Director of Scheduling and Special Assistant",
    "office": "Senior Florida Democrat",
    "location": "Washington, DC",
    "posting_date": "2017-01-30",
    "description": "Responsibilities include preparing and managing the Member’s weekly schedule, ensuring the Member remains on schedule throughout the day and attending to the Member’s daily administrative needs. Providing strategic guidance for short and long term scheduling and planning of the Member’s activities, working with the Member and senior staff on special projects and assignments. This position will work closely with the Chief of Staff, Deputy Chief of Staff and District Director to ensure efficient and seamless office planning and operations.",
    "responsibilities": [
      "Preparing and managing the Member’s weekly schedule",
      "Ensuring the Member remains on schedule throughout the day",
      "Attending to the Member’s daily administrative needs",
      "Providing strategic guidance for short and long term scheduling and planning of the Member’s activities",
      "Working with the Member and senior staff on special projects and assignments",
      "Working closely with the Chief of Staff, Deputy Chief of Staff and District Director to ensure efficient and seamless office planning and operations"
    ],
    "qualifications": [
      "High energy",
      "A very positive attitude",
      "Strong organizational skills",
      "Orientation to detail",
      "Strong verbal and written communication skills",
      "Strong interpersonal skills",
      "Savvy political instincts",
      "Poise and ability to thrive in a fast-paced environment",
      "The ability to multi-task",
      "Mastery of Word, Excel, and Outlook are essential",
      "Previous Congressional Scheduling, Executive Assistant and operational experience is required",
      "This is NOT an entry level position"
    ],
    "how_to_apply": "Interested qualified candidates should submit a cover letter, resume, a list of three work references, to FL23resume@mail.house.gov with “Scheduler” in the subject line. No phone calls, faxes or drop-ins please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "FL23resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-013-17",
    "position_title": "Communications Director",
    "office": "Rep. Jerry McNerney, CA-09",
    "location": "Washington, D.C.",
    "posting_date": "2017-01-30",
    "description": "California Democrat (Rep. Jerry McNerney, CA-09) seeks experienced communications director to develop and execute aggressive, proactive long-term media and outreach strategy.\n\nThe Communications Director is also responsible for maintaining relationships with different vendors for the purpose of constituent outreach and communications services.\n\nCandidate must be comfortable working closely with the Member and staff, and possibly overseeing staff or interns.\n\nIdeal candidate would be politically astute and have a good sense of humor and positive attitude. Desired qualities include the ability to respond to challenging situations quickly and strategically.\n\nThis position is based in the Congressman's Washington, D.C. office and requires non-traditional hours and occasional travel to the District.\n\nCalifornia ties, Hill experience, and Spanish literacy are a plus.",
    "responsibilities": [
      "Serving as chief spokesperson",
      "Successfully pitching stories and press events to both national and local media outlets",
      "Responding to media inquiries",
      "Effectively messaging policy and other priorities",
      "Maintaining an active web presence and social media profile",
      "Writing press releases, op-eds, speeches, talking points, and franked mail"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Strong editing and proofreading abilities",
      "Working collaboratively with an active legislative team and District staff in a demanding, fast-paced, deadline-driven environment",
      "The desire and ability to develop relationships with California and national reporters.",
      "Requires outreach to print, TV, and radio outlets.",
      "Politically astute and have a good sense of humor and positive attitude.",
      "Ability to respond to challenging situations quickly and strategically.",
      "California ties, Hill experience, and Spanish literacy are a plus."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume and two writing samples to: McNerneyResumes@mail.house.gov. No calls or drop ins, please.",
    "salary_info": null,
    "contact": "McNerneyResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-010-17",
    "position_title": "Staff Assistant",
    "office": "Senior Florida Democrat",
    "location": "Washington, DC",
    "posting_date": "2017-01-30",
    "description": "Senior Florida Democrat is seeking a highly motivated, detail-oriented, and energetic individual with excellent organizational, oral and written communications skills for a staff assistant position in the Washington, DC office.\n\nDaily tasks include answering calls, conducting and organizing tours, processing constituent requests, greeting visitors, assisting with the coordination of the intern program, and aiding the office in various administrative duties including transporting the Member to meetings and events as needed. Additionally, the individual will be working with Director of Scheduling and Chief of Staff on special assignments and projects.\n\nExcellent writing, verbal and strong organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment.\n. Individuals must have impeccable driving skills, a good driving record and a vehicle. Candidates should be team-oriented, have a sense of humor, and be able to work in a fast-paced environment. South Florida ties are a MUST.",
    "responsibilities": [
      "Answering calls",
      "Conducting and organizing tours",
      "Processing constituent requests",
      "Greeting visitors",
      "Assisting with the coordination of the intern program",
      "Aiding the office in various administrative duties including transporting the Member to meetings and events as needed",
      "Working with Director of Scheduling and Chief of Staff on special assignments and projects"
    ],
    "qualifications": [
      "Excellent writing, verbal and strong organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast-paced environment",
      "Impeccable driving skills",
      "Good driving record",
      "Vehicle",
      "Team-oriented",
      "Sense of humor",
      "South Florida ties are a MUST"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, a list of three work references, to FL23resumes@mail.house.gov with “Staff Assistant” in the subject line. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "FL23resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or expression, or sexual orientation."
  },
  {
    "id": "MEM-006-17",
    "position_title": "Legislative Assistant",
    "office": "Congressman Delaney (MD-06)",
    "location": null,
    "posting_date": "2017-01-30",
    "description": "Congressman Delaney (MD-06) seeks a Legislative Assistant to cover the\nFinancial Services Committee and other issues as assigned. This job will\nentail significant legislative research and working with the Congressman to\ndraft bills and amendments, as well as building coalitions in support of the\nCongressman’s legislative agenda. Candidates must be smart, hard-working,\nand good team players. Significant experience with financial services policy\nrequired. This is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [
      "Smart",
      "Hard-working",
      "Good team players",
      "Significant experience with financial services policy required",
      "Not an entry-level position"
    ],
    "how_to_apply": "To apply, please send resume and cover letter to MDLAjob@mail.house.gov",
    "salary_info": null,
    "contact": "MDLAjob@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-352-16",
    "position_title": "Investigative Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2017-01-30",
    "description": "The Committee on Oversight and Government Reform is the primary investigative committee of the U.S. House of Representatives. Rep. Elijah E. Cummings, the Ranking Member, is seeking an Investigative Counsel to join the Democratic staff to participate in all matters under the Committee’s jurisdiction, including investigations, hearings, depositions, transcribed interviews, and briefings.",
    "responsibilities": [],
    "qualifications": [
      "Attorney with 2-5 years of investigative or litigation experience",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Investigative Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  }
]