[
  {
    "id": "MEM-168-24",
    "position_title": "Legislative Staffer",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "D.C.",
    "posting_date": "2024-04-15",
    "description": "Congressman Glenn Ivey (MD-04) seeks an experienced legislative staffer for the Member’s D.C. office who has a background in matters before the House Homeland Security, Judiciary, and Appropriations Committees. Candidates with a J.D. or another advanced degree are strongly encouraged to apply, and experience working as a legislative assistant, legislative aide, or similar permanent staffer for a minimum of two years is required.\n\nThe ideal candidate is a well-informed student of politics and government who possesses a working knowledge of current events and a diverse array of issues. We seek a strong writer with a track record of successfully developing and implementing legislative strategy, preparing, and staffing the principal for committee hearings and markups, and managing a broad policy portfolio. Ideally, the candidate would also have a successful track record of project management related to a Member’s legislative and in-district priorities.",
    "responsibilities": [
      "Preparing the Member for committee hearings, markups, briefings, stakeholder meetings, and other engagements",
      "Developing and drafting bills, amendments, letters, policy statements, talking points, floor speeches, op-eds, memos, and reports",
      "Planning and organizing briefings and other events",
      "Managing relationships with local, state, and national stakeholders and institutions",
      "Tracking legislation relevant to the Member’s District or policy priorities",
      "Preparing vote recommendations",
      "Building coalitions of diverse, bipartisan stakeholders to advance legislative priorities",
      "Assisting organizations and constituents in the District with regard to federal matters"
    ],
    "qualifications": [
      "Experience working as a legislative assistant, legislative aide, or similar permanent staffer for a minimum of two years is required.",
      "Candidates with a J.D. or another advanced degree are strongly encouraged to apply.",
      "A well-informed student of politics and government who possesses a working knowledge of current events and a diverse array of issues.",
      "A strong writer with a track record of successfully developing and implementing legislative strategy, preparing, and staffing the principal for committee hearings and markups, and managing a broad policy portfolio.",
      "A successful track record of project management related to a Member’s legislative and in-district priorities."
    ],
    "how_to_apply": "Please submit a cover letter; a resume, including two to three references; and a writing sample to md04resumes@gmail.com with the subject line: “Full Name – Legislative Assistant” We will accept applications until the position is filled.",
    "salary_info": "The successful candidate’s title, including the possibility of senior legislative assistant / counsel, and pay will be commensurate with work experience.",
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an equal-opportunity employer that does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-166-24",
    "position_title": "Scheduler/Operations Manager",
    "office": "Rep. Joe Courtney (D-CT-2)",
    "location": "Washington",
    "posting_date": "2024-04-15",
    "description": "Rep. Joe Courtney (D-CT-2) is seeking a Scheduler/Operations Manager in a team-oriented office. Applicants must have exceptional organizational skills, attention to detail, and an ability to manage competing demands and deadlines.\n\nThis is not an entry-level position. Previous scheduling experience required and 1-3 years of prior work experience desired. The ideal candidate for this position is detail-oriented and proactive, possesses strong communication skills, a selfstarter, has good managerial instincts, and can thrive in a collaborative environment. Valid driver’s license and access to a vehicle preferred; Connecticut/New England ties, prior Capitol Hill experience, and good sense of humor are all plusses. Salary and title commensurate with experience.",
    "responsibilities": [
      "Managing all aspects of the member’s daily and long-term schedule in Washington, including intaking, evaluating, and scheduling meeting requests, updating and ensuring accuracy of member’s calendar, and coordinating travel arrangements and day-to-day logistics.",
      "Working with legislative and press staff to ensure member is prepared for engagements.",
      "Managing member personal correspondence and records.",
      "Interfacing with government agencies, Congressional offices, and outside organizations on behalf of the Member",
      "Working with staff to coordinate staff-level meetings and manage office meeting space.",
      "Coordinating office internship program"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Attention to detail",
      "Ability to manage competing demands and deadlines",
      "Previous scheduling experience required",
      "1-3 years of prior work experience desired",
      "Detail-oriented and proactive",
      "Strong communication skills",
      "Self-starter",
      "Good managerial instincts",
      "Ability to thrive in a collaborative environment",
      "Valid driver’s license and access to a vehicle preferred",
      "Connecticut/New England ties, prior Capitol Hill experience, and good sense of humor are all plusses"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and writing sample to CT02JOB@mail.house.gov with the subject line “Scheduler Application”",
    "salary_info": "Salary and title commensurate with experience.",
    "contact": "CT02JOB@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Candidates with diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-165-24",
    "position_title": "Digital Director",
    "office": "The office of Rep. Jimmy Gomez (CA-34)",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "The office of Rep. Jimmy Gomez (CA-34), a member of the\nWays and Means Committee, seeks a driven individual with experience in digital\nand social media, video editing, content creation and impeccable copyediting\nskills to join a fast-paced team as the Digital Director.\n\nCandidates must possess strong writing, editing and time management abilities,\nand must be able to draft daily social media posts and create a long-term digital\ncontent plan. The Digital Director will manage multiple social media accounts for\nthe member, and will be key in working with the member and under the\nCommunications Director to create timely, relevant, well-produced content.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Manage multiple social media accounts for the member",
      "Working with the member and under the Communications Director to create timely, relevant, well-produced content"
    ],
    "qualifications": [
      "Experience in digital and social media",
      "Experience in video editing",
      "Experience in content creation",
      "Impeccable copyediting skills",
      "Strong writing abilities",
      "Strong editing abilities",
      "Strong time management abilities",
      "Ability to draft daily social media posts",
      "Ability to create a long-term digital content plan"
    ],
    "how_to_apply": "Prospective candidates should e-mail a cover\nletter, resume and two writing/digital samples in PDF format\nto Gomez.Jobs@mail.house.gov with the subject line “LASTNAME_Digital.”\nNo calls or drop-ins please.",
    "salary_info": "Salary range is $55,000-65,000 annually, commensurate with experience.",
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status or\nparental status."
  },
  {
    "id": "MEM-163-24",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Representative Jason Crow (CO-06)",
    "location": "Washington, DC",
    "posting_date": "2024-04-15",
    "description": "Responsibilities include greeting visitors, answering phones, sorting and tracking incoming correspondence, drafting constituent correspondence, managing the intern program, and driving the Congressman, among other duties as assigned.\n\nIdeal candidates will be strong writers with excellent organization and time management skills. Colorado ties are a plus but not required.",
    "responsibilities": [
      "greeting visitors",
      "answering phones",
      "sorting and tracking incoming correspondence",
      "drafting constituent correspondence",
      "managing the intern program",
      "driving the Congressman",
      "other duties as assigned"
    ],
    "qualifications": [
      "strong writers",
      "excellent organization skills",
      "time management skills",
      "Colorado ties are a plus but not required"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit their resume and cover letter to co06.resumes@mail.house.gov. No phone calls or drop-ins please.",
    "salary_info": "$55,000 per year",
    "contact": "co06.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-162-24",
    "position_title": "Digital Manager/Press Secretary",
    "office": "Congressman Jamie Raskin (MD-08)",
    "location": "Washington, DC",
    "posting_date": "2024-04-15",
    "description": "The Digital Manager/Press Secretary will support digital and traditional communications in a fast-paced and high-visibility congressional office. The individual will be responsible for drafting press releases, quotes and statements, creating digital content (including written copy, graphics and video), helping manage the Congressman’s official social media accounts, fielding press requests and inquiries, and executing other duties as assigned.\n\nThe Digital Manager/Press Secretary will work closely with the Communications Director, who will be the direct supervisor, as well as the Chief of Staff, the District Chief, the Legislative Director, and other legislative and district staff in creating, coordinating and executing digital and written content strategy promoting the Congressman’s legislative and district priorities.\n\nThe Digital Manager/Press Secretary must be an excellent writer with exceptional communications skills. The successful candidate is a motivated self-starter and team player who demonstrates intellectual engagement, creative thinking, hard work, scrupulous attention to detail, effective time management and a professional and discreet approach. Relevant skills include: video editing (Adobe Premiere Pro and Adobe Creative Suite experience preferred), graphic design and social media management (i.e. experience and familiarity with major platforms).",
    "responsibilities": [
      "Drafting press releases, quotes and statements",
      "Creating digital content (including written copy, graphics and video)",
      "Helping manage the Congressman’s official social media accounts",
      "Fielding press requests and inquiries",
      "Executing other duties as assigned",
      "Creating, coordinating and executing digital and written content strategy promoting the Congressman’s legislative and district priorities."
    ],
    "qualifications": [
      "Excellent writer with exceptional communications skills",
      "Motivated self-starter and team player who demonstrates intellectual engagement, creative thinking, hard work, scrupulous attention to detail, effective time management and a professional and discreet approach",
      "Video editing (Adobe Premiere Pro and Adobe Creative Suite experience preferred)",
      "Graphic design",
      "Social media management (i.e. experience and familiarity with major platforms)",
      "1-3 years prior experience in political communications is required.",
      "Ties to Maryland’s Eighth District",
      "Spanish fluency and facility with other languages are a plus."
    ],
    "how_to_apply": "To apply, please email MD08.Resumes@mail.house.gov by April 23, 2024 with “Digital Manager/Press Secretary: Last Name” in the subject line and the following application materials attached as one combined PDF:\n·Résumé\n·Cover letter\n·Two writing samples\n·One piece of original digital media content (graphic design or video—if video, please link to a Google Drive file)\n·Three references–for each reference, please include name, current title, phone number, email address and your relationship to the reference",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-161-24",
    "position_title": "Subcommittee Counsel",
    "office": "House Judiciary Committee’s Subcommittee on Administrative State, Regulatory Reform, and Antitrust",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "The Democratic Staff on the House Judiciary Committee’s Subcommittee on Administrative State, Regulatory Reform, and Antitrust, seeks a dedicated and hard-working lawyer with a minimum of 5 years of professional legal experience to serve as a subcommittee counsel.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee’s jurisdiction",
      "Drafting legislation",
      "Preparing hearings",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to Democratic House offices on matters of constitutional and civil rights law",
      "Handling assignments in a range of issue areas, including administrative law, bankruptcy law, and antitrust and competition matters."
    ],
    "qualifications": [
      "Must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and the ability to work on novel and complex matters under time and other pressures.",
      "Must also be able to work collaboratively with a broad range of personalities.",
      "Sound political judgment, prior legislative or policy experience, a substantive background in civil rights or constitutional law, and a demonstrated commitment to public service are strongly preferred.",
      "A sense of humor is a plus."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Antitrust Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee strongly encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-159-24",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2024-04-15",
    "description": "The Committee's investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is desirable: government ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "$136,780 and $145,604",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-158-24",
    "position_title": "Press Secretary/Communications Director",
    "office": "Congressman Tom Suozzi",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-15",
    "description": "Congressman Tom Suozzi seeks a Press Secretary or Communications Director to serve in his Washington, D.C. office. Successful candidates will have very strong writing skills, a close eye to detail, fluency with social media platforms and digital tools, and experience working with national and local press.",
    "responsibilities": [
      "writing press releases, statements and media advisories",
      "creating and managing social media content, including graphics and videos",
      "drafting talking points and op-eds",
      "creating franked communications, including e-newsletters, mailers and telephone townhalls"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and relevant portfolio to NY03.jobs@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "NY03.jobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-157-24",
    "position_title": "Legal Research Analyst (full-time)",
    "office": "Joint Committee on Taxation, United States Congress",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "The Joint Committee on Taxation seeks a highly motivated professional to join its nonpartisan staff as a Legal Research Analyst to assist in the organization and management of its print and electronic library collections and to support legal and legislative research. The Legal Research Analyst will work closely with (under the direct supervision of) the Joint Committee’s Legal Research and Reference:\nLibrarian and with committee attorneys, economists, accountants, and administrative staff on projects involving a wide range of tax subject areas, including individual, business, international, tax-exempt organization, benefits, and pension taxation.",
    "responsibilities": [
      "Conduct, organize, and curate legal, legislative, and historical research on tax, economic, and financial policy matters.",
      "Manage a comprehensive collection of compiled legislative histories on taxation.",
      "Inventory and catalog Joint Committee library resources, including treaties, periodicals, and congressional documents.",
      "Monitor, summarize, and report on current legislation, congressional hearings, court cases, and seminars from a wide variety of sources.",
      "Negotiate with vendors to secure subscriptions to print and electronic resources, while maintaining the overall library budget, in collaboration with the Administrative Director.",
      "Post, describe, and maintain both current and historical publications on the Joint Committee’s website, in collaboration with the Computer Team.",
      "Archive work product – both print and digital – in accordance with established guidelines and policies."
    ],
    "qualifications": [
      "Willingness to collaborate with professional and administrative staff, both within the Joint Committee and with other information institutions, such as the Libraries of the House and the Senate, the Office of the Historian and the Clerk of the House's Office of Art and Archives, Congressional Research Service, Library of Congress, and the Law Library of Congress.",
      "Attention to detail and strong organizational skills.",
      "Sense of curiosity and resourcefulness when conducting research across multiple subscriptions and platforms.",
      "Ability to manage and reprioritize simultaneous projects and deadlines.",
      "Ability to anticipate and proactively compile resources and conduct research.",
      "An interest in both research and administrative responsibilities.",
      "A bachelor’s degree in political science, information studies, legal studies, economics or related fields and an interest and understanding of the American legislative process – including prior congressional\nexperience – sufficient to understand complex policy issues. Strong writing, communication, and research skills, including knowledge of specialized legal and legislative databases, and research experience are required. A Master of Library and Information Science (MLIS) degree is preferred, however not required."
    ],
    "how_to_apply": "Please submit a cover letter and resume to Katie Mikulka by email at JCTCareers@jct.gov. Please include “Legal Research Analyst” in the subject line.",
    "salary_info": "Salary is commensurate with skills and experience.",
    "contact": "Katie Mikulka, JCTCareers@jct.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-156-24",
    "position_title": "Counsel",
    "office": "Committee on House Administration Republican Office",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "This position performs a key role in the development and execution of the Committee on House Administration Republican Office’s strategy, especially with respect to elections issues, as well as ensuring that the committee’s legislative and oversight activities are operated in conformance with applicable statutes, House Rules, and Committee Rules.\n\nThe incumbent is also responsible for handling additional responsibilities and special projects as assigned. Major duties include: in coordination with the General Counsel, assists in the development and execution of the Committee’s oversight & legislative agenda; serves on elections coalitions development in the election integrity and voter confidence arenas, with a particular focus on grassroots organizations and other elections stakeholders; prepares for committee markups, hearings, and business meetings in cooperation with the Committee Clerk and relevant committee attorneys and staff; conducts thorough and accurate legislative research and drafts reports and memoranda; and more.",
    "responsibilities": [
      "In coordination with the General Counsel, assists in the development and execution of the Committee’s oversight & legislative agenda",
      "Serves on elections coalitions development in the election integrity and voter confidence arenas, with a particular focus on grassroots organizations and other elections stakeholders",
      "Prepares for committee markups, hearings, and business meetings in cooperation with the Committee Clerk and relevant committee attorneys and staff",
      "Conducts thorough and accurate legislative research and drafts reports and memoranda"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume and writing sample to thomas.lane@mail.house.gov",
    "salary_info": null,
    "contact": "thomas.lane@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-155-24",
    "position_title": "DIGITAL DIRECTOR OR PRESS SECRETARY",
    "office": "Rep. Tokuda (HI-02)",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-15",
    "description": "Rep. Tokuda (HI-02) seeks an energetic person to join her communications team in her Washington, D.C. office. This individual will work closely with the Communications Director who works in Honolulu. Candidates must have experience in digital media and video editing and will be responsible for managing multiple digital media accounts. This position will also assist with press releases and inquiries, speeches, and mass communications.\n",
    "responsibilities": [],
    "qualifications": [
      "Strong writing and editing skills with attention to detail",
      "Creative graphic production",
      "Ability to multi-task and work quickly under pressure",
      "Patience, flexibility, and a sense of humor"
    ],
    "how_to_apply": "Interested parties should email a cover letter, resume, writing sample, sample social media posts, and two references to Hawaii02jobs@gmail.com",
    "salary_info": null,
    "contact": "Hawaii02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-154-24",
    "position_title": "Press Secretary/Communications Director",
    "office": "Congressman John Sarbanes",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-15",
    "description": "Congressman John Sarbanes seeks a Press Secretary or Communications Director to serve in his Washington, D.C. office. Successful candidates will have very strong writing skills, a close eye to detail, fluency with social media platforms and digital tools, and experience working with national and local press.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Creating and managing social media content, including graphics and videos",
      "Drafting talking points and op-eds",
      "Creating franked communications, including e-newsletters, mailers and telephone townhalls"
    ],
    "qualifications": [
      "very strong writing skills",
      "a close eye to detail",
      "fluency with social media platforms and digital tools",
      "experience working with national and local press"
    ],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and writing portfolio to employment@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-152-24",
    "position_title": "Legislative Assistant",
    "office": "Rep. Joe Courtney (D-CT-02)",
    "location": "Washington, DC",
    "posting_date": "2024-04-15",
    "description": "Rep. Joe Courtney (D-CT-02) seeks qualified candidates for a Legislative Assistant position to join his Washington, DC office team.",
    "responsibilities": [
      "Develop, plan, and execute legislative initiatives within assigned issue areas",
      "Monitor developments in legislation on the floor and within certain House Committees",
      "Staff the member at Committee events as appropriate within assigned policy portfolio",
      "Meet with constituents on behalf of the member",
      "Prepare briefing notes and talking points for the Member",
      "Collaborate with District staff to advocate for federal projects and initiatives at the local level"
    ],
    "qualifications": [
      "Approximately 3 years of legislative experience working on Capitol Hill",
      "Thorough knowledge of the legislative process",
      "Excellent oral and written communication skills",
      "Strong project management and prioritization skills",
      "The ability to quickly synthesize information and make sound decisions",
      "The ability to exercise independent judgement in the formulation and recommendation of policy positions for the Member",
      "Policy portfolio will be based on office needs but will include domestic policy issues.",
      "Ties to Connecticut or New England are a plus."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and writing sample to CT02JOB@mail.house.gov",
    "salary_info": null,
    "contact": "CT02JOB@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Candidates with diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-151-24",
    "position_title": "Legislative Assistant",
    "office": "Senior House Democrat's personal office",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-15",
    "description": "Senior House Democrat seeks a Legislative Assistant for the Member's personal office to staff a portfolio of domestic legislative issues. Portfolio is flexible depending upon the candidate's background and interests.\n\nA successful candidate will be a self-starter that works well in a fast-paced environment, possess excellent oral and written communication skills, and have a proven ability to work effectively with a collaborative legislative team.",
    "responsibilities": [
      "drafting and introducing legislation, and drafting oversight letters",
      "monitoring pending legislation and current events",
      "staffing the Member at events and meetings",
      "preparing briefing materials and talking points for the Member",
      "reviewing requests to cosign letters and cosponsor legislation, and making recommendations to the Member",
      "representing the Member in meetings and briefings",
      "collaborating with constituent organizations",
      "other tasks and assignments as needed"
    ],
    "qualifications": [
      "at least 1-2 years legislative experience in a congressional office or similar experience off the Hill"
    ],
    "how_to_apply": "Applicants should send a resume, cover letter, and two writing samples to housedemlajob@gmail.com",
    "salary_info": "Salary commensurate with experience",
    "contact": "housedemlajob@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all backgrounds to apply."
  },
  {
    "id": "MEM-150-24",
    "position_title": "Staff Director, Subcommittee on Health",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "Core Responsibilities:\nServe as the principal advisor to the full Committee Chairman, subcommittee Chairman, and Republican Members for issues under the jurisdiction of the Subcommittee.\nProvide in-depth policy analysis and political strategy for issues that fall under the jurisdiction of the Subcommittee.\nLead and supervise the implementation of the Subcommittee’s legislative initiatives including the formulation, drafting, introduction, passage, negotiation, and enactment of all legislation under the jurisdiction of the Subcommittee.\nSupervise the Subcommittee staff in the organization of, and preparation for, hearings, to include determination of the agenda, briefing of witnesses and Members, and drafting remarks and questions for the Chairman.\nConduct informational and oversight meetings with Administration officials, VA and other agencies, Veteran Service Organizations, non-profit organizations, industry experts, and veterans on all issues under the jurisdiction of the Subcommittee.\nPlan and supervise implementation of the Subcommittee’s oversight agenda of issues within its jurisdiction, including sending requests for information, writing oversight letters, conducting oversight visits, reviewing document productions, cultivating sources of information, determining the veracity of information received, and other oversight measures, as needed.\nBuild relationships with internal and external partners, including Veteran Service Organizations, member offices, industry, and contacts within the Department of Veterans Affairs and other government agencies to promote and enact the legislative and oversight agenda of the Subcommittee, and that of the full Committee Chairman.\nRepresent and discuss the full Committee or Subcommittee Chairman’s views at various conferences and speaking events.\nResponsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; as needed.",
    "responsibilities": [
      "Serve as the principal advisor to the full Committee Chairman, subcommittee Chairman, and Republican Members for issues under the jurisdiction of the Subcommittee.",
      "Provide in-depth policy analysis and political strategy for issues that fall under the jurisdiction of the Subcommittee.",
      "Lead and supervise the implementation of the Subcommittee’s legislative initiatives including the formulation, drafting, introduction, passage, negotiation, and enactment of all legislation under the jurisdiction of the Subcommittee.",
      "Supervise the Subcommittee staff in the organization of, and preparation for, hearings, to include determination of the agenda, briefing of witnesses and Members, and drafting remarks and questions for the Chairman.",
      "Conduct informational and oversight meetings with Administration officials, VA and other agencies, Veteran Service Organizations, non-profit organizations, industry experts, and veterans on all issues under the jurisdiction of the Subcommittee.",
      "Plan and supervise implementation of the Subcommittee’s oversight agenda of issues within its jurisdiction, including sending requests for information, writing oversight letters, conducting oversight visits, reviewing document productions, cultivating sources of information, determining the veracity of information received, and other oversight measures, as needed.",
      "Build relationships with internal and external partners, including Veteran Service Organizations, member offices, industry, and contacts within the Department of Veterans Affairs and other government agencies to promote and enact the legislative and oversight agenda of the Subcommittee, and that of the full Committee Chairman.",
      "Represent and discuss the full Committee or Subcommittee Chairman’s views at various conferences and speaking events.",
      "Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "At least five to seven years of relevant policy or legislative experience. Experience on Capitol Hill desired but other experience will be considered."
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references to VAR.Resumes@mail.house.gov with “HEALTH Staff Director” in the subject line. In your cover letter please indicate what you believe are the three most pressing challenges facing the Veterans Health Administration. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-147-24",
    "position_title": "Press Secretary and Speechwriter",
    "office": "House Select Subcommittee on the Coronavirus Pandemic",
    "location": "Capitol Hill",
    "posting_date": "2024-04-15",
    "description": "Rep. Raul Ruiz, M.D., the Ranking Member of the House Select Subcommittee on the Coronavirus Pandemic, is seeking a Press Secretary and Speechwriter to join the Democratic staff of the Select Subcommittee.\n\nThe Select Subcommittee on the Coronavirus Pandemic is authorized to investigate a broad range of matters pertaining to the coronavirus pandemic under H. Res. 5. The Select Subcommittee was established within the Committee on Oversight and Accountability, which is the primary investigative committee of the United States House of Representatives, with jurisdiction to investigate “any matter” at “any time” under House Rule X.",
    "responsibilities": [
      "Pitching and working directly with reporters, including in an on-the-record capacity",
      "Preparing remarks for delivery by the Ranking Member and other Select Subcommittee Democratic Members for hearings and press events",
      "Writing press releases, quotes, talking points, op-eds, and additional communications materials",
      "Staffing the Ranking Member for interviews and public appearances"
    ],
    "qualifications": [
      "2-3 years of relevant communications experience",
      "Capitol Hill experience is a plus, but not required",
      "Proactive and resourceful, with an enthusiasm for writing and strong attention to detail, particularly under tight deadlines"
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and short writing sample (2-3 pages) as PDFs to SSCPJobs@mail.house.gov, with “Press Secretary and Speechwriter” in the email subject line.",
    "salary_info": "$90,000-$95,000",
    "contact": "SSCPJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, LGBTQI+ people, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-146-24",
    "position_title": "Community Liaison, Harlem",
    "office": "OFFICE OF REP. ADRIANO ESPAILLAT",
    "location": "Harlem",
    "posting_date": "2024-04-15",
    "description": "The Harlem Community Liaison for the Office of Congressman Adriano Espaillat\nserves as the Member's community representative for issues and programs within\ntheir assigned portfolio, including monitoring and updating the Member and\nDistrict Director on important local issues, emerging trends, and critical\ndevelopments. This position acts as a liaison to the federal, state, and local\ngovernments, as well as agencies on behalf of the Member.\n\nThe Harlem Community Liaison works with constituent services and will report\ndirectly to the Harlem Office Director while working with the broader team to\nensure effective communication with agencies and constituents on behalf of the\nMember.",
    "responsibilities": [
      "Coordinates with the Harlem Director and Member to ensure outreach efforts align with the Member’s strategic vision, goals, and priorities.",
      "Collaborates with the Harlem Director and D.C. staff to ensure district priorities are aligned and inform the Member’s legislative strategy.",
      "Assesses casework trends and identifies issues requiring legislative action and/or additional Congressional oversight.",
      "Informs the Harlem Director and Member of important developments and current events impacting the district.",
      "Builds and maintains positive relationships with constituents, key community leaders, and other stakeholders.",
      "Acts as a liaison to local, state, and federal officials and stakeholders to form effective relationships for the Member.",
      "Attends events to serve as a representative for the Member, as determined by the Harlem Director and Chief of Staff.",
      "Handles various community issues in accordance with office policies and procedures.",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner.",
      "Understands differing perspectives and opinions to navigate conflicts and develop solutions effectively.",
      "Required to staff the Member and/or attend community events, including on occasional weekends."
    ],
    "qualifications": [
      "Adaptability",
      "Attention to Detail",
      "Constituent /Stakeholder Service",
      "Initiative",
      "Planning and Coordination",
      "Research and Analysis",
      "Interpersonal Skills",
      "Teamwork",
      "Verbal Communication",
      "Written Communication",
      "Coalition Building",
      "Bachelor's degree or equivalent combination of education and experience",
      "Experience developing a community relations strategy for an elected official",
      "Familiarity with the Member's district and/or New York state"
    ],
    "how_to_apply": "Please submit your resume to espaillat_jobs@mail.house.gov with the subject line “Community Liaison, Harlem”.",
    "salary_info": "The salary for this position is $65,000 per year, depending on experience.",
    "contact": "espaillat_jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-145-24",
    "position_title": "Legislative Aide and Special Assistant",
    "office": "Representative Peltola",
    "location": "DC Office",
    "posting_date": "2024-04-15",
    "description": "Responsibilities include covering a limited number of issue areas for which they are expected to maintain a level of expertise and keep the Member up to date on constituent issues or policies that pertain to those subject areas, as well as scheduling meetings and arranging travel for the Chief of Staff, accompanying the Chief of Staff on their travels, preparing memos, and managing their schedule. Maintaining the Chief of Staff's email inbox and assisting the Legislative Assistants as needed are also a crucial part of the role.",
    "responsibilities": [
      "Covering a limited number of issue areas",
      "Maintaining a level of expertise",
      "Keeping the Member up to date on constituent issues or policies",
      "Scheduling meetings",
      "Arranging travel for the Chief of Staff",
      "Accompanying the Chief of Staff on their travels",
      "Preparing memos",
      "Managing the Chief of Staff's schedule",
      "Maintaining the Chief of Staff's email inbox",
      "Assisting the Legislative Assistants as needed"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a resume to akresumes@mail.house.gov",
    "salary_info": null,
    "contact": "akresumes@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer in accordance with the requirements of House Rules, regulations and applicable federal laws. The Office does not discriminate on the basis of an individual’s race, color, religion, sex, national origin, age, disability, genetic information, uniformed service, sexual orientation, gender identity or any other factors prohibited by applicable federal law."
  },
  {
    "id": "MEM-144-24",
    "position_title": "Press Assistant/Digital Director",
    "office": "Texas GOP Member of Congress",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "Texas GOP Member of Congress seeks a Press Assistant/Digital Director who is eager to join a robust communications operation. This is not an entry-level position-- at least six months to one year of relevant communications experience is required.",
    "responsibilities": [
      "Develop and assist with press releases, talking points, op-eds, and other materials as assigned.",
      "Assist with maintaining the office’s website and social media accounts.",
      "Create and edit videos and other digital material.",
      "Monitor the Member's presence and interactions on social media.",
      "Take photos/video at events and meeting.",
      "Compile daily press clips.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Excellent writing ability and attention to detail.",
      "Experience with creating graphics and social media branding."
    ],
    "how_to_apply": "To apply, please send resumes to housegopemployment@gmail.com with position noted in subject line.",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-141-24",
    "position_title": "Community Liaison – Island County",
    "office": "U.S. Rep. Rick Larsen",
    "location": "Everett Office",
    "posting_date": "2024-04-15",
    "description": "The Island County Community Liaison serves as Rep. Larsen’s representative to\nWhidbey and Camano islands.\n\nAs part of our district outreach team, the primary role of this position is to\ncoordinate issues involving the federal government with officials from federal,\nstate and local governments, as well as constituents, businesses, organized labor\nand other organizations. The Outreach Assistant – North Counties staffer is\nexpected to develop relationships with our district stakeholders to learn the\ndetails of projects and policy concerns and to respond to their interests in federal\npolicy development.\n\nIn addition to the geographic responsibility for communities in Island County,\nthis position also covers military and veterans affairs and engagement with the\nU.S. Coast Guard.\n\nThe Island County Community Liaison is based in Rep. Larsen’s Everett, WA\noffice and reports directly to the District Director. Together, the district staff\nworks in harmony with the staff in Washington, D.C., and all staff members\nreport to the Chief of Staff.",
    "responsibilities": [
      "Serve as an official representative for Rep. Larsen at meetings, forums and public events",
      "Build and maintain relationships with constituents, businesses, labor, non-profit organizations, federal agencies, local government, and other stakeholders in Island County",
      "Travel regularly throughout the district to monitor local issues, projects and activities",
      "Work with Washington D.C.-based staff on federal policy development and interpretation for local stakeholders",
      "Event planning, including Rep. Larsen’s district schedule"
    ],
    "qualifications": [
      "Strong understanding of Island County and experience with outreach activities working with government, cultural communities, the business community, organized labor and local stakeholder groups",
      "Ability to exercise discretion and independent thinking while working as part of a team on sensitive projects and issues",
      "Strong writing ability",
      "Flexibility to work nights and weekends",
      "Valid driver’s license and vehicle",
      "Comfort discussing issues with groups both small and large, including public speaking"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter\nto ryan.casey@mail.house.gov or:\nOffice of U.S. Rep. Rick Larsen\nC/O Ryan Casey\nDistrict Director\n2930 Wetmore Avenue, Ste. 9F\nEverett, WA 98201",
    "salary_info": "The annual salary for this position depends on relevant experience and ranges\nfrom $55,000 - $65,000.",
    "contact": "ryan.casey@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the\nbasis of race, sex, color, age, religion, national origin, sexual orientation, gender\nidentity, or disability. We are committed to building and maintaining an\norganization that reflects the needs and diverse community we serve."
  },
  {
    "id": "MEM-136-24",
    "position_title": "Military Legislative Assistant",
    "office": "House GOP Appropriator",
    "location": "Capitol Hill",
    "posting_date": "2024-04-15",
    "description": "Members serves on the Military Construction Subcommittee and has many military equities in-district. Portfolio would include national security, foreign affairs, defense and veterans issues.",
    "responsibilities": [],
    "qualifications": [
      "1-3 years of Capitol Hill experience"
    ],
    "how_to_apply": "Resumes can be sent to housegopemployment@gmail.com",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-135-24",
    "position_title": "PRESS SECRETARY",
    "office": "The Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-15",
    "description": "The Office of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. office. Candidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\n\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staff the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the office’s larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  },
  {
    "id": "MEM-133-24",
    "position_title": "Scheduler",
    "office": "Rep. Pence (IN-06)",
    "location": "Washington D.C",
    "posting_date": "2024-04-15",
    "description": "The Office of Rep. Pence (IN-06) is seeking a well-organized, personable\nScheduler in his Washington D.C office. This role is responsible for the\nCongressman’s schedule and travel plans, coordinating and responding to\nscheduling requests, and supervising the office’s Staff Assistant and interns to\nensure the office is managed effectively.\n\nFurther responsibilities include filing financial forms and overseeing routine\noffice expenses. This role also serves as the Office Emergency Coordinator. A\nstrong applicant would exhibit strong organizational and interpersonal skills, the\nability to plan effectively and adjust as needed, as well as an ability to work\ncollaboratively with other staff in the office.\n\nA candidate who is hired for this position will work under the current Director of\nOperations until his departure at the end of June, after which they will take over\nall of his former responsibilities.",
    "responsibilities": [
      "Responsible for the Congressman’s schedule and travel plans",
      "Coordinating and responding to scheduling requests",
      "Supervising the office’s Staff Assistant and interns",
      "Filing financial forms",
      "Overseeing routine office expenses",
      "Office Emergency Coordinator"
    ],
    "qualifications": [
      "Strong organizational and interpersonal skills",
      "The ability to plan effectively and adjust as needed",
      "An ability to work collaboratively with other staff in the office"
    ],
    "how_to_apply": "Please submit a resume and references to gopjobonthehill@gmail.com",
    "salary_info": null,
    "contact": "gopjobonthehill@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-131-24",
    "position_title": "Executive Director",
    "office": "For Country Caucus",
    "location": "Washington, DC",
    "posting_date": "2024-04-15",
    "description": "Established in 2019, the For Country Caucus of 30 veterans in the U.S. House is one of the most productive bipartisan caucuses in Congress, having helped pass more than 100 laws with a focus on national security, national service, and veterans affairs. The caucus works alongside a group of bipartisan senators and others to pass bicameral legislation for the nation. The For Country Caucus is seeking an Executive Director to help lead the caucus in its next chapter of growth.\n\nIf you are passionate about fighting polarization in Congress through principled veteran leadership and have the requisite skills and experience, we invite you to apply for this pivotal role in advancing the Caucus's goals and priorities.",
    "responsibilities": [
      "Lead the For Country Caucus staff, which includes a communications director.",
      "Work with the bipartisan For Country Caucus leadership to shape the caucus strategy.",
      "Manage and help develop relationships for the For Country Caucus with other stakeholders in Congress.",
      "Manage and help develop relationships for the For Country Caucus with external stakeholders that can assist with advancing bipartisan legislation, including veteran service organizations.",
      "Plan and execute For Country Caucus bi-monthly meetings for Members of Congress and staff.",
      "Help identify and coordinate high-profile guest speakers.",
      "Plan and execute For Country Caucus semi-annual service events and bipartisan Congressional Delegations.",
      "Manage the For Country Caucus budget.",
      "Advance For Country Caucus legislative priorities, to include shaping and executing internal and external communications.",
      "Represent the For Country Caucus in meetings with House leadership, Committee staff, Senate staff, and external organizations and stakeholders."
    ],
    "qualifications": [
      "At least four years of work experience in policy, communications, or government affairs.",
      "Dedication to promoting bipartisan respect, civility, and government cooperation.",
      "Entrepreneurial spirit and a demonstrated ability to work independently.",
      "Strong understanding of the House legislative process and the National Defense Authorization Act.",
      "Comfort working in a fast-paced, dynamic environment within a collaborative team setting",
      "Excellent organizational, written, and verbal communication skills.",
      "Exceptional judgment."
    ],
    "how_to_apply": "Please submit your resume and a cover letter detailing your relevant experience and interest in the position to ForCountryCaucus@mail.house.gov",
    "salary_info": "$90,000-110,000",
    "contact": "ForCountryCaucus@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-126-24",
    "position_title": "District Representative/Constituent Caseworker",
    "office": "Office of Congresswoman Hillary Scholten",
    "location": "District",
    "posting_date": "2024-04-15",
    "description": "The Office of Congresswoman Hillary Scholten is seeking a highly organized and motivated District Representative/Constituent Caseworker to serve as a link between the Congresswoman’s office and her constituents.\n\nDistrict Representative responsibilities include helping constituents to resolve issues with federal agencies, meeting with constituents, and serving as a liaison to locate, state, and federal officials or groups to form effective relationships for the Congresswoman.",
    "responsibilities": [
      "Manage a high volume of incoming constituent correspondence via phone, email, and mail.",
      "Conduct research to fully understand constituent inquiries and resolve cases in a timely manner.",
      "Liaise with federal agencies to inquire about the status of cases and resolve bureaucratic issues.",
      "Maintain detailed records and case files using a database.",
      "Attend community outreach events and build relationships with local stakeholders."
    ],
    "qualifications": [
      "1-2 years of customer service, administrative, or office experience.",
      "Strong verbal and written communication skills.",
      "Excellent organizational abilities and attention to detail.",
      "Ability to prioritize, multi-task and meet deadlines.",
      "Proficiency with Microsoft Office Suite and database management.",
      "Knowledge of federal agencies and programs a plus.",
      "Commitment to providing exceptional constituent service."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume and three (3) references to District Director Khristian Silvis at Khristian.Silvis@mail.house.gov.",
    "salary_info": "$50,000 to $60,000 - Commensurate on experience",
    "contact": "Khristian.Silvis@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-125-24",
    "position_title": "District Staff Assistant",
    "office": "Office of Congresswoman Katherine M. Clark (MA-5)",
    "location": "District Office",
    "posting_date": "2024-04-15",
    "description": "The Staff Assistant greets visitors, answers the telephone, processes mail, assists with constituent casework, drafts correspondence, and performs other administrative duties as needed. The Staff Assistant is also responsible for overseeing a robust internship program, including recruiting, interviewing, hiring, and supervising interns.\n\nThis role requires impeccable judgment and the ability to prioritize myriad tasks. The ideal candidate should be personable, organized, and detail-oriented.\n\nApplicants must possess excellent verbal and written communication skills and the ability to work cooperatively with others.\n\nOffice staff are currently working in person, remotely, or in a hybrid model depending on the needs and safety of the office.",
    "responsibilities": [
      "Manages the office intern program, ensuring smooth front office operational duties",
      "Works with constituent services representatives to ensure efficient casework intake using the office’s internal database",
      "Assists persons who have appointments with the Member or other staff Members and works closely with the District Director to ensure that the Members’ appointments are on time",
      "Maintains literature regarding the District and DC offices for distribution to visitors",
      "Coordinates the filing and indexing of all correspondence",
      "Maintains office inventory and signs for deliveries",
      "Provides orientation and training for new staff",
      "Supervises the reception desk, mail operations, and administrative files",
      "Assumes responsibility for overall office appearance and layout",
      "Maintains the office answering machine or voice mail",
      "Screens and refers cases, when appropriate, to other offices",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework or opinions",
      "Facilitates annual student engagement initiatives on behalf of the office",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "Impeccable judgment",
      "Ability to prioritize myriad tasks",
      "Personable",
      "Organized",
      "Detail-oriented",
      "Excellent verbal and written communication skills",
      "Ability to work cooperatively with others"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, & 2 writing samples to Jobs.MA05@mail.house.gov. All materials will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "Jobs.MA05@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Diverse candidates, women, and LGBTQ+ persons are strongly encouraged to apply."
  },
  {
    "id": "MEM-546-23",
    "position_title": "Member Services Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": null,
    "posting_date": "2024-04-15",
    "description": "The Congressional Black Caucus (CBC) seeks a Member Services Director who\nis exceptionally motivated, dynamic, strategic, and detail-oriented to engage with\nCBC Member offices and outside partners to advance a robust member services\nportfolio.\n\nThe Member Services Director will be expected to proactively build strong\nrelationships across CBC Member offices and develop strategic opportunities for\nMember engagement advancing shared priorities. The individual will also be\nexpected to coordinate with CBC staff to field and respond to inquiries and\nrequests for support from Member offices and respond to and share external\nopportunities for Member engagement as they arise.\n\nThe Member Services Director is also responsible for assisting in overseeing all\naspects of caucus operations, logistics, designated administrative responsibilities\nand to support caucus leadership.",
    "responsibilities": [
      "Conducting regular outreach to Member offices to build relationships with staff,\nshare opportunities for Member or staff participation in events, messaging, and\nother efforts, and identify new ideas for collaboration with Member offices",
      "Sharing resources with Member offices and working with CBC, congressional,\nand external staff to develop high-quality materials for Member office use",
      "Drafting regular newsletters for Member offices with relevant updates and\nopportunities, as well as for external audiences to uplift Member engagement on\nCBC issues",
      "Developing a network of external partners working on issues relevant to the\nCBC and Member offices",
      "Maintaining staff contact information and distribution lists",
      "Provides orientation and training for new staff;",
      "Assists departing employees with necessary administrative procedures (i.e.,\nreturning keys, House I.D. cards, and other office property; obtaining forwarding\naddresses, work files, and records);",
      "Supervises the mail operations and the administrative files and personnel\nrecords;",
      "Assists staff in scheduling House or Capitol rooms for outside group functions;",
      "Organize and facilitate meetings and other strategic convenings to support institutional change, policies, and programmatic work;",
      "Oversees operations for CBC including organizing weekly meetings and events",
      "Provides logistical support for all programming",
      "Works with the CBC personal office staffs and coordinates with the CBC\nSchedulers to implement the Caucus’ priorities",
      "Builds and maintains databases of internal and external stakeholders"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and\nfamiliarity working with the African American community.",
      "Outstanding writing\nand communication skills, sound political judgment, and the ability to work\nclosely and collaboratively with multiple Member offices and key stakeholders\nare essential.",
      "Top candidates should also be detail-oriented and possess the ability\nto multi-task, work well in a fast-paced setting, and act as a team player.",
      "Candidates should have a demonstrated understanding of House and Senate\nlegislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume to vincent.evans@mail.house.gov.\nNo walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), the Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-04-15",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  }
]