[
  {
    "id": "MEM-094-21",
    "position_title": "Director of Labor Oversight",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Director of Labor Oversight to manage oversight and investigations on the Labor team.\n\nResponsibilities include organizing oversight hearings, writing investigative reports and executing a complementary legislative and oversight strategy with positive results. Qualified applicants must have a J.D. and relevant policy experience with at least 3-5 years of experience conducting investigations.\n\nExperience in labor policy is not a requirement, however preferred. In addition, the applicant must have exceptional writing skills, strong attention to detail, ability to juggle multiple projects, and have direct management experience.",
    "responsibilities": [
      "Organizing oversight hearings",
      "Writing investigative reports",
      "Executing a complementary legislative and oversight strategy with positive results"
    ],
    "qualifications": [
      "J.D.",
      "Relevant policy experience with at least 3-5 years of experience conducting investigations",
      "Exceptional writing skills",
      "Strong attention to detail",
      "Ability to juggle multiple projects",
      "Direct management experience"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, a writing sample (5-10 pages), a writing sample describing an investigation the applicant would like to pursue, and 3 professional references. The second writing sample must include a hyperlink to a current news item from any source (newspapers, blogs, or other websites) and two paragraphs detailing why the Committee should investigate the issue presented and the steps the applicant would take to begin an investigation.",
    "salary_info": "The salary range is $95K - $115K, commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-093-21",
    "position_title": "Press Assistant",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nproactive, hard-working individual to serve as Press Assistant.\nCandidates must have exceptional writing skills, strong attention to detail, and the\nability to work effectively in a team environment. Responsibilities include but are\nnot limited to: drafting press releases and remarks, coordinating press activities\nwith Committee offices, managing the Committee website, compiling and\ndistributing press clips, tracking press and social media analytics, and supporting\na wide range of other communications work.\nThe ideal candidate will have 1-2 years of relevant communications experience.",
    "responsibilities": [
      "drafting press releases and remarks",
      "coordinating press activities with Committee offices",
      "managing the Committee website",
      "compiling and distributing press clips",
      "tracking press and social media analytics",
      "supporting a wide range of other communications work"
    ],
    "qualifications": [
      "exceptional writing skills",
      "strong attention to detail",
      "ability to work effectively in a team environment",
      "1-2 years of relevant communications experience"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, brief work samples, and\n3 professional references to E&L.Jobs@mail.house.gov with \"Press Assistant\" in\nthe subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, national origin, age, disability, gender identity, or sexual\norientation. Candidates of diverse backgrounds are strongly encouraged to\napply."
  },
  {
    "id": "MEM-090-21",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Linda T. Sánchez",
    "location": "Washington, D.C.",
    "posting_date": "2021-03-29",
    "description": "Congresswoman Linda T. Sánchez, a Senior Member of the Committee on Ways and Means, seeks a Legislative Assistant to handle the Congresswoman’s work on the Social Security Subcommittee, as well as a diverse portfolio including Defense, Foreign Affairs, Housing, and other legislative issues. The Legislative Assistant will be responsible for developing legislative initiatives, meeting with constituents and interested groups on behalf of the Congresswoman, and staffing the Congresswoman for committee hearings and markups.\n\nQualified candidates should have at least 3 years of Hill experience and possess a strong understanding of the issues listed. Applicants must demonstrate an ability to work well with a team in a small, fast-paced environment, while maintaining a sense of humor. The Congresswoman strongly values diversity and encourages candidates of all backgrounds to apply.",
    "responsibilities": [
      "Developing legislative initiatives",
      "Meeting with constituents and interested groups on behalf of the Congresswoman",
      "Staffing the Congresswoman for committee hearings and markups"
    ],
    "qualifications": [
      "At least 3 years of Hill experience",
      "A strong understanding of the issues listed",
      "Ability to work well with a team in a small, fast-paced environment",
      "Ability to maintain a sense of humor"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and writing sample to CAdemofficejob@gmail.com.",
    "salary_info": null,
    "contact": "CAdemofficejob@gmail.com",
    "equal_opportunity": "The Congresswoman strongly values diversity and encourages candidates of all backgrounds to apply."
  },
  {
    "id": "MEM-087-21",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2021-03-29",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible legislative office staff. The candidate must have strong interpersonal skills, be comfortable with managing multiple tasks and able to work well under pressure.\n\nThe staff assistant is responsible for front office duties, including answering and screening telephone calls, mail distribution, room reservations, and responding to constituent requests for flags, tours, and other information. The staff assistant also serves as intern coordinator by recruiting training, scheduling and assigning duties.",
    "responsibilities": [
      "Front office duties, including answering and screening telephone calls, mail distribution, room reservations",
      "Responding to constituent requests for flags, tours, and other information",
      "Serve as intern coordinator by recruiting training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge of the District of Columbia",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-085-21",
    "position_title": "Communications Director",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-03-29",
    "description": "The Office of Congressman Kweisi Mfume seeks a Communications Director for its Washington, DC office. The ideal candidate is highly-organized, passionate, friendly, and has noteworthy experience.",
    "responsibilities": [
      "managing and coordinating the messaging and communications activities, including media contacts, for the Member and the office.",
      "Traditional and digital communications are managed by the Communications Director including press statements, press releases, mass emails, social media posts, and website updates."
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a resume and cover letter to MD07employment@mail.house.gov. Applications will be considered on a rolling basis, but no application will be considered later than April 16, 2021. No phone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Due to COVID19, work is often from home."
  },
  {
    "id": "MEM-084-21",
    "position_title": "Legislative Assistant",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-03-29",
    "description": "The Office of Congressman Kweisi Mfume seeks a Legislative Assistant for its\nWashington, DC office. The ideal candidate is highly-organized, passionate,\nfriendly, and has noteworthy experience.",
    "responsibilities": [
      "Developing and planning legislative initiatives",
      "Monitoring legislative developments within Committees and on the House floor",
      "Tracking legislation, executive action, administrative action, and other\ngovernmental developments",
      "Drafting constituent correspondence for the\nMember",
      "Preparing for committee meetings and hearings",
      "Answering constituent letters",
      "Helping constituents with federal matters"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a resume and cover letter\nto MD07employment@mail.house.gov. Applications will be considered on a\rolling basis, but no application will be considered later than April 16, 2021. No\nphone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-081-21",
    "position_title": "SUBCOMMITTEE STAFF DIRECTOR",
    "office": "Rep. Karen Bass",
    "location": "Washington, D.C.",
    "posting_date": "2021-03-29",
    "description": "The office of Rep. Karen Bass seeks a Staff Director with demonstrated leadership skills for the House Foreign Affairs Subcommittee on Africa, Global Health, and Global Human Rights.\n\nThe Staff Director will support the Chairwoman and lead a small team to support the policy direction of the Africa Subcommittee by implementing the legislative and oversight agenda. Responsibilities include drafting legislation, developing policy and communications objectives; managing implementation of Subcommittee hearings and briefings; drafting official letters, memoranda, and investigative reports; helping publicize activities and investigative findings; organizing and acting as lead staff on Congressional Delegations abroad; managing, mentoring, and directing Subcommittee staff; serving as primary support for Subcommittee Members and staff; and coordinating with the House Foreign Affairs Committee staff.\n\nThis is not an entry-level position. The candidate will be able utilize a broad array of legislative, oversight, and regulatory tools to enact the foreign policy related goals focused on Africa. Applicants should possess a clear background in foreign policy, with a specific expertise on the continent of Africa; a strong network of ties in the foreign affairs policy community; strong leadership skills and verifiable experience managing a team; robust verbal and written communication skills; and the ability to manage multiple projects at one time in a fast-paced environment. Ideal candidates will have a deep understanding of the Hill and a proven track record of achieving policy goals.",
    "responsibilities": [
      "Drafting legislation",
      "Developing policy and communications objectives",
      "Managing implementation of Subcommittee hearings and briefings",
      "Drafting official letters, memoranda, and investigative reports",
      "Helping publicize activities and investigative findings",
      "Organizing and acting as lead staff on Congressional Delegations abroad",
      "Managing, mentoring, and directing Subcommittee staff",
      "Serving as primary support for Subcommittee Members and staff",
      "Coordinating with the House Foreign Affairs Committee staff"
    ],
    "qualifications": [
      "Clear background in foreign policy, with a specific expertise on the continent of Africa",
      "Strong network of ties in the foreign affairs policy community",
      "Strong leadership skills and verifiable experience managing a team",
      "Robust verbal and written communication skills",
      "Ability to manage multiple projects at one time in a fast-paced environment",
      "Deep understanding of the Hill and a proven track record of achieving policy goals"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to CA37.HR@mail.house.gov. Please include “Subcommittee Staff Director” in the subject line.",
    "salary_info": null,
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, disability, military status, age, marital status, or parental status. and candidates of color are strongly encouraged to apply. Please no calls or drop-ins."
  },
  {
    "id": "MEM-078-21",
    "position_title": "Scheduler",
    "office": "Western Republican Member",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "Western Republican Member has opportunity for a motivated, well organized, and talented scheduler.\nQualified candidates will have experience managing a fast-paced schedule for a Member of Congress, processing all incoming schedule requests and arranging travel. The scheduler will work closely with Member, Chief of Staff, and District Director in advancing priorities of the office. This position requires attention to detail, problem solving skills, good judgment and the ability to work as part of a team.",
    "responsibilities": [],
    "qualifications": [
      "Prior relevant experience required",
      "Position requires reasonable flexibility and availability beyond normal office hours."
    ],
    "how_to_apply": "Please email cover letter and resume to uscongressjobs@gmail.com",
    "salary_info": "salary commensurate with experience",
    "contact": "uscongressjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-077-21",
    "position_title": "Legislative Director",
    "office": "Congressman Mondaire Jones (D-NY)",
    "location": "Washington, D.C.",
    "posting_date": "2021-03-29",
    "description": "The Legislative Director will be responsible for advancing the Congressman's legislative priorities and supporting his work on the Judiciary and Education and Labor Committees. Rep. Jones serves as Freshman Representative to Leadership, co-chair of the Equality Caucus, Deputy Whip of the Congressional Progressive Caucus, and Vice Chair of the Subcommittee on Courts, Intellectual Property, and the Internet.\n\nThe ideal candidate will have substantial experience working on a variety of issues, including education, health, employment, labor, transportation, appropriations, housing, and other issues that impact majority-minority communities. Strong academic credentials, committee experience, and proven leadership skills are required. In addition, the candidate should possess strong oral and written communication skills, the ability to work well under pressure, extensive knowledge of the legislative process, and be available to work long hours.\n\nThis is not an entry-level position; only candidates with previous House-side Hill experience and extensive legislative acumen will be considered and contacted. JD and previous experience serving as a Legislative Director or senior policy staff are strongly preferred.",
    "responsibilities": [
      "Advancing the Congressman's legislative priorities",
      "Supporting his work on the Judiciary and Education and Labor Committees"
    ],
    "qualifications": [
      "Substantial experience working on a variety of issues, including education, health, employment, labor, transportation, appropriations, housing, and other issues that impact majority-minority communities.",
      "Strong academic credentials",
      "Committee experience",
      "Proven leadership skills",
      "Strong oral and written communication skills",
      "Ability to work well under pressure",
      "Extensive knowledge of the legislative process",
      "Available to work long hours",
      "Previous House-side Hill experience",
      "Extensive legislative acumen"
    ],
    "how_to_apply": "You can find the application via the following link: https://airtable.com/shriBI8YHiyDXXfR0\n\nDue to the volume of applications we receive, we will only contact you if we decide to move forward with your application. Please no calls, direct emails, or walk-ins.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": "Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with ties to New York (and NY-17 in particular)."
  },
  {
    "id": "MEM-076-21",
    "position_title": "Economist",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, D.C.",
    "posting_date": "2021-03-29",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an\nEconomist to provide expert advice on labor economics, and support policy\nmaking initiatives in health, education and human services.\n\nThe Economist must be able to successfully communicate data and findings in an\naccessible manner to a non-technical audience and demonstrate a commitment to\nsocial justice and expanding economic opportunity. Responsibilities include\nassisting labor, health and education policy staff to draft legislation; prepare\nmaterials for hearings, markups and floor activity; and draft memos.\nThe Economist is also expected to conduct research, track and report on labor\nmarket and macroeconomic developments; coordinate appropriations and budget\nrelated matters; evaluate regulatory proposals; track other committees’ activities\nthat intersect with the Ed and Labor Committee; provide cost/budget\njustifications for policy priorities; and, coordinate with oversight and\ncommunications teams in support of the Committee’s agenda.",
    "responsibilities": [
      "Assist labor, health and education policy staff to draft legislation",
      "Prepare materials for hearings, markups and floor activity",
      "Draft memos",
      "Conduct research, track and report on labor market and macroeconomic developments",
      "Coordinate appropriations and budget related matters",
      "Evaluate regulatory proposals",
      "Track other committees’ activities that intersect with the Ed and Labor Committee",
      "Provide cost/budget justifications for policy priorities",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "At a minimum a Bachelor’s degree in Economics, quantitative aptitude, analytical mindset, and good problem-solving skills.",
      "At least 5 years of experience as a professional economist",
      "Possess strong writing, communication, and organizational skills.",
      "Demonstrate the ability to successfully manage multiple projects under deadlines",
      "Display a collaborative disposition."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Economist\" in the subject line.",
    "salary_info": "$70K to $95K, commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are strongly encouraged\nto apply."
  },
  {
    "id": "MEM-075-21",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Professional Staff member to provide expert advice, advance legislation and provide oversight on workplace safety and health, and to support policy making where workplace safety issues cross cut with the Committee’s initiatives in health, education and human services.\n\nThe Candidate will draft legislation, organize and prepare materials for hearings, markups and floor activity; draft memos; research, track and report on workplace safety and health developments; engage with other committees and the full array of stakeholders; evaluate regulatory and legislative proposals from relevant agencies, including OSHA, MSHA, NIOSH, and the Department of Labor’s Office of Workers’ Compensation Programs; and coordinate with oversight and communications teams in support of the Committee’s agenda.\n\nApplicants should have a degree in a relevant discipline or at least 3 years of experience in Congress, a regulatory agency, union or other organization working on health and safety issues. Key to this position is the ability to anticipate emerging issues, support build support for initiatives, and successfully communicate safety and health information in an accessible manner to a nontechnical audience. The successful applicant should have an analytical mindset and good problem-solving skills.\n\nThis position is writing intensive and requires the candidate to have exceptional writing, communication, and organizational skills. Must demonstrate the ability to successfully manage multiple projects under tight deadlines; display a collaborative disposition; and a commitment to social justice and expanding economic opportunity.",
    "responsibilities": [
      "Draft legislation",
      "Organize and prepare materials for hearings, markups and floor activity",
      "Draft memos",
      "Research, track and report on workplace safety and health developments",
      "Engage with other committees and the full array of stakeholders",
      "Evaluate regulatory and legislative proposals from relevant agencies, including OSHA, MSHA, NIOSH, and the Department of Labor’s Office of Workers’ Compensation Programs",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "A degree in a relevant discipline or at least 3 years of experience in Congress, a regulatory agency, union or other organization working on health and safety issues.",
      "Ability to anticipate emerging issues, support build support for initiatives, and successfully communicate safety and health information in an accessible manner to a nontechnical audience.",
      "Analytical mindset and good problem-solving skills.",
      "Exceptional writing, communication, and organizational skills.",
      "Ability to successfully manage multiple projects under tight deadlines",
      "Collaborative disposition",
      "Commitment to social justice and expanding economic opportunity."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Workplace Safety\" in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-074-21",
    "position_title": "Legislative Counsel",
    "office": "House Ways and Means Committee",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "Progressive California Democrat and member of the House Ways and Means\nCommittee seeks a Legislative Counsel to handle an active immigration and\njudiciary portfolio. This position also leads the member’s work on the Ways and\nMeans Worker & Family Support Subcommittee in addition to handling child\nwelfare, poverty, labor, civil rights, and social security issues.",
    "responsibilities": [
      "preparing and staffing the Member in committee\nhearings and markups",
      "developing and advancing legislation and other policy\npriorities of the Member",
      "researching and advising the Member on policy issues\nand vote recommendations",
      "drafting talking points and speeches",
      "representing\nthe Member in meetings and events"
    ],
    "qualifications": [
      "independent worker and a self-starter",
      "capacity to produce high-quality work in a fast-paced environment",
      "strong communication and writing skills",
      "background in immigration policy preferred",
      "able to synthesize complex\ntechnical information under tight deadlines",
      "able to work well with a\nvariety of competing interest groups",
      "positive attitude, a good\nsense of humor",
      "thrive in a team environment",
      "J.D. preferred but not required",
      "Not an entry level position"
    ],
    "how_to_apply": "Please e-mail\nyour resume, cover letter, and a short writing sample to ca27jobs@gmail.com.",
    "salary_info": null,
    "contact": "ca27jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, LGBTQ+\nindividuals, people with disabilities, and members of other underrepresented\ncommunities are strongly encouraged to apply."
  },
  {
    "id": "MEM-073-21",
    "position_title": "General Counsel",
    "office": "The House Committee on Small Business",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "The House Committee on Small Business seeks a General Counsel to advise the Chairwoman, Members, and staff on the rules and procedures of the Committee and assist senior staff in overseeing the legislative activities of the Committee.\n\nCandidates should possess excellent writing and organizational skills, be detail-oriented, and demonstrate an ability to work well under pressure and short deadlines.\n\nAn ideal candidate will have prior Hill experience and/or and a strong understanding of the House Rules. This is not an entry level position. The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply.",
    "responsibilities": [
      "Preparing for hearings, markups, and floor activity",
      "Tracking legislation",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Excellent writing and organizational skills",
      "Detail-oriented",
      "Ability to work well under pressure and short deadlines",
      "Prior Hill experience and/or and a strong understanding of the House Rules"
    ],
    "how_to_apply": "Interested applicants should submit a resume, cover letter and writing sample to: hsbcdems@gmail.com with the subject line General Counsel.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-071-21",
    "position_title": "Communications Director",
    "office": "House Select Subcommittee on the Coronavirus Crisis",
    "location": null,
    "posting_date": "2021-03-29",
    "description": "The House Select Subcommittee on the Coronavirus Crisis majority staff seeks a Communications Director. The ideal candidate will be a communications professional with several years of congressional experience.",
    "responsibilities": [
      "Developing and implementing the Select Subcommittee’s communications strategy across digital and traditional media",
      "Drafting press releases and other materials",
      "Responding to media inquiries",
      "Coordinating interviews and press events",
      "Preparing the Chairman for these events"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-070-21",
    "position_title": "DISTRICT OFFICE CASEWORKER",
    "office": "Congressional Office",
    "location": "District Office",
    "posting_date": "2021-03-29",
    "description": "The District Office Caseworker acts a constituent liaison for the Member. This\nposition also monitors and updates the Member and District Director on district\nand local issues. This position acts as a liaison to federal, district, and local\nagencies for the Member and constituents and answers casework correspondence\nand verbal communications with constituents.",
    "responsibilities": [
      "Handles casework assignments;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Acts as the representative for the Member within his or her area of responsibility\nincluding answering casework correspondence, meeting with constituents, verbal\ncommunications with constituents, and serving as a liaison with federal, district,\nand local agencies;",
      "Informs the Member and the District Director of all happenings in his or her\nassigned issue areas by screening district media sources and interacting with\nconstituents;",
      "Acts as a liaison to local, state, and federal officials and other persons or groups\nto form effective relationships for the Member;",
      "Acts as a liaison to and notifies the appropriate media when the Member will be\nin the liaison’s area and works with the Member's Communications Director and\nScheduler to ensure appropriate media participation;",
      "Assesses casework for problems requiring legislative action and makes\nrecommendations to the District Director, Legislative Director, and Chief of\nStaff.",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Trains and supervises Staff Assistants, including interns, to handle office\nmatters such as logging incoming and outgoing correspondence, handling\nvisitors, telephone calls, and computer operations;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to\ncasework;",
      "Prepares periodic reports for the District Director on pending cases and district\nactivities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure\nthat their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of\nimportance to the office;",
      "Accepts performance-based criticism and direction;",
      "Meets attendance requirements as established by the office;",
      "Works under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights, and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "At least 5 years of experience; strong academic credentials. Alternatively, 10\nyears of related experience or training in legislation or equivalent similar\nexperience.",
      "Strong oral and written communication skills;",
      "Thorough knowledge of local, state, and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is\ninvolved;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful,\npleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful,\npleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of\ncasework responsibilities;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing.",
      "Work is mainly performed in an office environment. Noise levels are usually\nmoderate.",
      "Ability to work in a small workstation without an expectation of privacy."
    ],
    "how_to_apply": "All applicants should submit a Resume and Cover letter\nto MD07Resumes@mail.house.gov",
    "salary_info": null,
    "contact": "MD07Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-068-21",
    "position_title": "Staff Assistant /District Field Representative",
    "office": "Congressman Frank Pallone, Jr.",
    "location": "New Jersey",
    "posting_date": "2021-03-29",
    "description": "The district office of Congressman Frank Pallone, Jr. seeks a hard-working, organized individual to serve as a Staff Assistant & District Field Representative.\n\nThis position primarily entails constituent casework and community outreach.\n\nOther responsibilities include meeting with local community officials, representing the Congressman at community and governmental events, special projects, as well as general office work. Candidates should possess excellent verbal and written communication skills, and must enjoy working with the public. Prior experience in government, the non-profit sector, community and grassroots organizing is preferred.",
    "responsibilities": [
      "Constituent casework",
      "Community outreach",
      "Meeting with local community officials",
      "Representing the Congressman at community and governmental events",
      "Special projects",
      "General office work"
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Enjoy working with the public",
      "Prior experience in government, the non-profit sector, community and grassroots organizing is preferred"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, writing sample, and references by email to NJ06.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-062-21",
    "position_title": "Legislative Assistant",
    "office": "House Judiciary Committee",
    "location": "Washington, DC",
    "posting_date": "2021-03-29",
    "description": "Rep. Jerrold Nadler, Chairman of the House Judiciary Committee and the most\nsenior Jewish Member in Congress, seeks a Legislative Assistant to handle\nIsrael/Middle East and issues of importance to the American Jewish community,\nforeign affairs, defense, financial services, and other issues in the Chairman’s\nWashington, DC office.",
    "responsibilities": [
      "Staffing and preparing the Chairman for meetings and events with Members, outside organizations, and other stakeholders",
      "Serving as a resource to other offices on Israel/Middle East and other issues",
      "Writing statements and briefing materials",
      "Drafting legislation where appropriate",
      "Meeting with stakeholders both with and without the Chairman"
    ],
    "qualifications": [
      "A deep understanding of issues relating to Israel and the relevant stakeholders in this area is required.",
      "Strong writing skills, sound political judgment, and the ability to work closely and collaboratively with others is essential.",
      "Chairman Nadler is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
    ],
    "how_to_apply": "To apply send a resume and cover letter to NY10.DCJOB@mail.house.gov",
    "salary_info": null,
    "contact": "NY10.DCJOB@mail.house.gov",
    "equal_opportunity": "Chairman Nadler’s office does not discriminate on the basis of race, color,\nreligion, sex (including marital or parental status, sexual orientation, and gender\nidentity), disability, age, or national origin."
  }
]