[
  {
    "id": "MEM-022-21",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space, and Technology",
    "location": "Capitol Hill",
    "posting_date": "2021-01-25",
    "description": "Chairwoman of the House Committee on Science, Space, and Technology seeks to fill Professional Staff Member position on the Committee. Duties include oversight of the Department of Energy (DOE) and other agencies within the Committee’s jurisdiction, outreach to stakeholder groups, researching and drafting legislation, staffing hearings, and preparing memoranda, statements, and speeches for Majority Members.\n\nApplicants should have experience in at least one or both of the following subject matter areas: 1) science and energy research and technology development activities carried out by DOE, 2) energy and related environmental policy. All applicants should possess strong writing, organizational, and communication skills; the capacity to articulate technical and policy issues clearly and concisely; and the ability to meet tight deadlines. The ideal candidate will have significant Capitol Hill or relevant government or industry experience. An advanced degree or technical background is a plus, but not required.",
    "responsibilities": [
      "Oversight of the Department of Energy (DOE) and other agencies within the Committee’s jurisdiction",
      "Outreach to stakeholder groups",
      "Researching and drafting legislation",
      "Staffing hearings",
      "Preparing memoranda, statements, and speeches for Majority Members"
    ],
    "qualifications": [
      "Experience in at least one or both of the following subject matter areas: 1) science and energy research and technology development activities carried out by DOE, 2) energy and related environmental policy",
      "Strong writing, organizational, and communication skills",
      "Capacity to articulate technical and policy issues clearly and concisely",
      "Ability to meet tight deadlines",
      "Significant Capitol Hill or relevant government or industry experience (ideal)",
      "Advanced degree or technical background is a plus, but not required"
    ],
    "how_to_apply": "Please send a cover letter and resume to SciResumes@mail.house.gov. This not an entry-level position.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression. In addition, we are committed to and benefit from a diverse staff and candidates of all backgrounds."
  },
  {
    "id": "MEM-021-21",
    "position_title": "Counsel",
    "office": "Committee on Energy and Commerce Majority",
    "location": null,
    "posting_date": "2021-01-25",
    "description": "The Committee on Energy and Commerce Majority is seeking a diligent, energetic and creative person to serve as Counsel focusing on energy issues within the Committee’s jurisdiction.",
    "responsibilities": [
      "Providing legal analyses",
      "Drafting legislation",
      "Preparing hearings",
      "Staffing markups",
      "Writing memos and statements",
      "Coordinating with stakeholders and member offices"
    ],
    "qualifications": [
      "Must have a law degree",
      "Demonstrate in-depth understanding of energy policy issues",
      "Possess some public policy experience",
      "Knowledge of issues within the jurisdiction of the Federal Energy Regulatory Commission and the Department of Energy is particularly helpful",
      "Strong writing skills are essential"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and short writing sample to ecdenergyjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdenergyjobs@mail.house.gov",
    "equal_opportunity": "The Committee is an equal opportunity employer and strongly encourages minorities, women, veterans and LGBTQ candidates to apply."
  },
  {
    "id": "MEM-018-21",
    "position_title": "Policy Advisor",
    "office": "Democratic Leadership office",
    "location": null,
    "posting_date": "2021-01-25",
    "description": "Democratic Leadership office seeks Policy Advisor to handle a robust and diverse policy portfolio. Responsibilities include monitoring committee and floor activities, writing policy memos, letters and talking points, creating and advancing policy initiatives, planning and organizing policy briefings and events and other assigned tasks to support the Democratic Caucus. The Policy Advisor will report directly to the Policy and Outreach Director.\nQualified candidates must be proactive, diligent organizers, possess excellent research, oral and writing skills and have an understanding of the legislative process. They should also be able to work collaboratively with other departments and manage multiple tasks in a fast-paced environment. This not an entry-level position.",
    "responsibilities": [
      "Monitoring committee and floor activities",
      "Writing policy memos, letters and talking points",
      "Creating and advancing policy initiatives",
      "Planning and organizing policy briefings and events",
      "Other assigned tasks to support the Democratic Caucus"
    ],
    "qualifications": [
      "Proactive, diligent organizers",
      "Excellent research, oral and writing skills",
      "Understanding of the legislative process",
      "Able to work collaboratively with other departments",
      "Manage multiple tasks in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please send PDFs of resume, cover letter, two short writing samples and three professional references to DemCaucus.Jobs@mail.house.gov with name and “Policy Advisor 2021” in the subject line.",
    "salary_info": null,
    "contact": "DemCaucus.Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to a diverse and inclusive workforce and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity or disability. Women and minority applicants are encouraged to apply."
  },
  {
    "id": "MEM-012-21",
    "position_title": "Executive Director",
    "office": "Democratic Women’s Caucus (DWC)",
    "location": "Capitol Hill",
    "posting_date": "2021-01-25",
    "description": "The Democratic Women’s Caucus (DWC) seeks an energetic and highly talented individual to serve as DWC’s first Executive Director.\n\nWith the incoming Biden-Harris Administration and a historic number of Democratic women in Congress, we have both great opportunity and great responsibility to elevate our voices and advance our priorities – from reproductive health and child care to pay equity and paid family and medical leave.\n\nTo more effectively advance our policy goals in the 117th Congress, we are seeking an Executive Director to serve as a liaison to all members, help deliver a unified message, and advance our agenda for women and families.",
    "responsibilities": [
      "Coordinating efforts of DWC leadership and all Caucus members to ensure a unified effort",
      "Supervising a yet-to-be-hired Communications Director and any interns, fellows, or other staff that might be retained by the Caucus",
      "Developing and managing legislative priorities, memos, newsletters, press releases, and any other materials for Caucus members, the press, and the public",
      "Pursuing an engagement strategy with the new Administration to ensure DWC is effectively advocating for priority agenda items with the Executive branch",
      "Developing and maintaining relationships with external partners on behalf of the Caucus",
      "Organizing and facilitating DWC briefings, dinners, hearings, and any other events that can advance caucus priorities and reach",
      "Overseeing the development and maintenance of a Caucus website, social media presence, and other mechanisms to engage and work with a diverse group of DWC stakeholders."
    ],
    "qualifications": [
      "Must have a strong policy background and substantial coalition building experience with multiple stakeholder groups across Capitol Hill and the advocacy community.",
      "Candidates must demonstrate an ability to work under pressure and meet deadlines in an unpredictable work environment.",
      "Strong organizational and time management skills, and excellent written and verbal communication skills."
    ],
    "how_to_apply": "Please submit a resume and cover letter to DWCJobs@mail.house.gov.",
    "salary_info": "Competitive salary and benefits, commensurate with experience.",
    "contact": "DWCJobs@mail.house.gov",
    "equal_opportunity": "This Caucus is an equal opportunity employer that does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage all qualified candidates to apply."
  },
  {
    "id": "MEM-011-21",
    "position_title": "Legislative Director",
    "office": "Congressman Dwight Evans (PA-03)",
    "location": "Washington, D.C.",
    "posting_date": "2021-01-25",
    "description": "Responsibilities include managing and implementing the member's legislative priorities and his work on the Ways and Means and Small Business Committees.\nThe Legislative Director will supervise a talented legislative staff, proactively promote the office legislative and policy agenda, manage a personal legislative issue portfolio and perform other duties as assigned.\nCandidates must possess very strong communication, writing and analytical skills as well as a demonstrated ability to manage and mentor staff. The candidate must also demonstrate experience in strategic planning and have experience formulating plans for advancing legislation. The ideal candidate will be highly motivated, detail oriented, creative, resourceful and passionate about public service. The candidate must have prior Hill experience beyond internships.\nThe candidate should also demonstrate excellent writing, verbal and organizational skills. Ties to Philadelphia are a plus as well as familiarity with health care, housing and small business federal policy.",
    "responsibilities": [
      "Managing and implementing the member's legislative priorities",
      "Work on the Ways and Means and Small Business Committees.",
      "Supervise a talented legislative staff",
      "Proactively promote the office legislative and policy agenda",
      "Manage a personal legislative issue portfolio",
      "Perform other duties as assigned"
    ],
    "qualifications": [
      "Very strong communication, writing and analytical skills",
      "Demonstrated ability to manage and mentor staff",
      "Experience in strategic planning",
      "Experience formulating plans for advancing legislation",
      "Highly motivated, detail oriented, creative, resourceful and passionate about public service",
      "Prior Hill experience beyond internships",
      "Excellent writing, verbal and organizational skills",
      "Ties to Philadelphia are a plus",
      "Familiarity with health care, housing and small business federal policy"
    ],
    "how_to_apply": "Qualified applicants should email a resume, cover letter and two writing samples to PA03.Resumes@mail.house.gov with “Legislative Director” in the subject line.",
    "salary_info": null,
    "contact": "PA03.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-010-21",
    "position_title": "Staff Assistant",
    "office": "House Committee on Energy and Commerce Democratic Staff (majority)",
    "location": null,
    "posting_date": "2021-01-25",
    "description": "The House Committee on Energy and Commerce Democratic Staff (majority) seeks an enthusiastic, motivated, and highly organized staff assistant for fastpaced committee office.",
    "responsibilities": [
      "Tasks associated with a front office such as receptionist duties",
      "Answering phones",
      "Greeting visitors",
      "Ensuring that office and meeting rooms are kept in order",
      "Supporting staff in preparations for committee events such as hearings, markups, meetings, and events",
      "Delivering documents and obtaining signatures on letters",
      "Training and supervising interns",
      "Handling and sorting incoming mail",
      "Maintaining both digital and paper records and files",
      "Maintaining office supplies and mastering basic equipment operations",
      "Assisting other staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "Must possess excellent written and oral communication skills, attention to detail, professionalism, exceptional time management skills, and an ability to work collaboratively.",
      "Hill experience preferred but not required."
    ],
    "how_to_apply": "Please submit a cover letter, resume, and a short writing sample to ecdjobs@mail.house.gov",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age."
  },
  {
    "id": "MEM-008-21",
    "position_title": "Legislative Assistant",
    "office": "Midwestern Republican office",
    "location": null,
    "posting_date": "2021-01-25",
    "description": "Responsibilities will include drafting and advancing legislation; preparing talking points, vote recommendations, and other legislative materials; monitoring and analyzing legislative developments, committee proceedings; and representing the Member in meetings with constituents and stakeholders.\n\nPortfolio of issues will include Agriculture, Trade, Labor & Pensions, Energy & Environment, and others as needed. Successful candidates must be proactive, possess exceptional organizational skills and attention to detail, and be interested in working in a fast-paced office environment. Candidates should have at least one year of agriculture policy experience.",
    "responsibilities": [
      "Drafting and advancing legislation",
      "Preparing talking points, vote recommendations, and other legislative materials",
      "Monitoring and analyzing legislative developments, committee proceedings",
      "Representing the Member in meetings with constituents and stakeholders"
    ],
    "qualifications": [
      "Proactive",
      "Exceptional organizational skills and attention to detail",
      "Interested in working in a fast-paced office environment",
      "At least one year of agriculture policy experience"
    ],
    "how_to_apply": "Interested applicants should email a resume and cover letter with Legislative Assistant in the subject line to RepJobResume@gmail.com. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "RepJobResume@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-003-21",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Freshman Iowa conservative",
    "location": "Capitol Hill",
    "posting_date": "2021-01-25",
    "description": "Freshman Iowa conservative seeks seasoned Legislative Assistant with 2-3 years minimum Capitol Hill experience. Issue portfolio dependent on applicant, but broad range available, including: financial services, transportation and infrastructure, agriculture, energy/environment, small business, commerce, trade. Position requires strong writing skills, attention to detail, a foundational understanding of House procedure, and a dedication to the Constitution. Iowa ties a plus.",
    "responsibilities": [
      "Making vote recommendations",
      "Staffing meetings",
      "Writing policy memos",
      "Drafting legislation under the guidance of the Legislative Director"
    ],
    "qualifications": [
      "Strong writing skills",
      "Attention to detail",
      "A foundational understanding of House procedure",
      "A dedication to the Constitution",
      "2-3 years minimum Capitol Hill experience",
      "Iowa ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and list of references to iowa01jobs@gmail.com with “LA – APPLICANT’S LAST NAME” in the subject line.",
    "salary_info": null,
    "contact": "iowa01jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-001-21",
    "position_title": "Counsel or Professional Staff",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": null,
    "posting_date": "2021-01-25",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation's response to the coronavirus crisis is efficient, effective, and equitable.\nChairman James E. Clyburn seeks to fill a Counsel or Professional Staff position on the Democratic staff. The ideal candidate will be an attorney or policy professional with several years of investigative or litigation experience.",
    "responsibilities": [
      "Leading investigations",
      "Conducting depositions and transcribed interviews",
      "Preparing for hearings",
      "Drafting reports"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Be self-motivated",
      "Possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Counsel / Professional Staff” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-337-20",
    "position_title": "Constituent Services Representative",
    "office": "Office of Congressman Rob Wittman (VA-01)",
    "location": "Stafford District Office, Stafford Region",
    "posting_date": "2021-01-25",
    "description": "This position serves as a constituent services representative for the Member within the Stafford region to constituent groups and associations and acts on behalf of Rep. Wittman’s constituents. Acts as a liaison with federal, state, and/or local agencies for the Member and constituent groups, answers casework correspondence, communicates and meets with constituents, executes district outreach plan.",
    "responsibilities": [
      "Meets with elected officials and representatives, local groups, and constituents on behalf of the Member;",
      "Travels throughout the assigned localities to keep abreast of local concerns holding regular open office hours in selected localities and sends out press releases announcing the scheduled visits;",
      "Proactively seeks opportunities to develop community outreach relationships on behalf of the Member;",
      "Works closely with the communications department to implement planned outreach events and to suggest new ideas for such events;",
      "Staffs the Member at events in the Stafford Region;",
      "Represents or speaks on behalf of the Member at events the Member is unable to attend;",
      "Refers scheduling items to scheduler in Washington through office scheduling process; suggests scheduling opportunities and advises on scheduling items in geographic areas of responsibility;",
      "Stays abreast of local news and issues and communicates those issues to the Congressman, Chief of Staff, and key staff in Washington;",
      "Monitors and updates the Member, Chief of Staff, and District Director on district and local issues;",
      "Works with communications shop to identify and build contact lists of key constituents and organizations in district;",
      "Responds to casework inquiries from constituents; Monitors casework for problems requiring legislative action or communications messaging trends;",
      "Supervises interns with regard to legislative issues and constituent responses;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "A bachelor’s degree or higher education level is preferred, including strong academic credentials. Some period of related experience or training in legislation or equivalent is beneficial.",
      "Ability to perform the essential job functions above;",
      "Ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Joe.Schumacher@mail.house.gov with “Stafford Constituent Services Representative” in the subject line.",
    "salary_info": null,
    "contact": "Joe.Schumacher@mail.house.gov",
    "equal_opportunity": null
  }
]