[
  {
    "id": "MEM-284-16",
    "position_title": "Staff Assistant",
    "office": "Iowa Democrat",
    "location": null,
    "posting_date": "2016-09-12",
    "description": "Iowa Democrat seeks an organized, team-oriented Staff Assistant to manage\nthe front office, coordinate tour and flag requests, assist with constituent\ncorrespondence, and provide office support as needed. Candidates should\nhave excellent oral and written communication skills, a strong attention to\ndetail, and the ability to exercise independent judgment. Previous hill\nexperience is preferred. Iowa ties are strongly preferred, but not required.",
    "responsibilities": [
      "Manage the front office",
      "Coordinate tour and flag requests",
      "Assist with constituent correspondence",
      "Provide office support as needed"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Strong attention to detail",
      "Ability to exercise independent judgment",
      "Previous hill experience is preferred",
      "Iowa ties are strongly preferred, but not required"
    ],
    "how_to_apply": "Applicants should submit a resume and cover letter to democrat.midwestern@mail.house.gov with subject line “Staff Assistant App” no later than COB Friday, September 9th. Please, absolutely NO calls or walk-ins.",
    "salary_info": null,
    "contact": "democrat.midwestern@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-283-16",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington, DC",
    "posting_date": "2016-09-12",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks an experienced Legislative Assistant to work on Ways and Means Committee issues. Excellent written and oral communication skills required.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience and law degree with tax experience preferred."
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-274-16",
    "position_title": "Constituent Service Representative (CSR)",
    "office": "Congresswoman Katherine M. Clark",
    "location": "District Office",
    "posting_date": "2016-09-12",
    "description": "The District Office of Congresswoman Katherine M. Clark is currently\naccepting applicants for the position of Constituent Service Representative\n(CSR). The CSR monitors and updates the Member and District Director on\ndistrict and local issues as well as serves as a liaison to federal, district, and\nlocal agencies for the member and constituents.\n\nThis position is responsible for a wide range of outreach, relationship\nmanagement, event coordination, and correspondence. We’re looking for\nsomeone who has great judgment, keen political skills, is quick on their feet\nand ready to seize opportunities (or create them). The ideal candidate is fast\nbut highly detail oriented, and is a strong written and oral communicator.\n",
    "responsibilities": [
      "Acts as the representative for the Congresswoman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Congresswoman and the District Director of all happenings in his or her assigned geographic & issue areas by screening district media sources and interacting with constituents;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Manages at least 1 casework assignment area & assesses casework for problems requiring legislative action and makes recommendations to the District Director and/or Chief of Staff;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned geographic & issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "3-5 years relevant experience required; experience with the military & veteran’s issues or SSDI preferred.",
      "Exceptional written & oral communication, organizational and project management skills with an overall execution orientation; track record of effectively managing complex, multi-stakeholder projects;",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Congresswoman is involved;",
      "Strong political instincts, and a proactive entrepreneurial mindset;",
      "Grace under pressure; ability to delegate, communicate, and act decisively as well as adapt well to changing priorities;",
      "Availability & ability to work long, irregular hours including evenings and weekends;",
      "A professional style that includes flexibility, evenness, and sense of humor."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, & 2 writing samples to: Jobs.MA05@mail.house.gov.",
    "salary_info": null,
    "contact": "Jobs.MA05@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-271-16",
    "position_title": "Temporary Staff Assistant",
    "office": "Republican Office of the Committee on House Administration",
    "location": null,
    "posting_date": "2016-09-12",
    "description": "Working closely with Committee staff, the Temporary Staff Assistant will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Responsibilities include assisting with answering phones, aiding in the execution of daily events and meetings, filing and scanning committee documents, helping prepare for New Member Orientation, and assisting staff with various projects.",
    "responsibilities": [
      "Assisting with answering phones",
      "Aiding in the execution of daily events and meetings",
      "Filing and scanning committee documents",
      "Helping prepare for New Member Orientation",
      "Assisting staff with various projects"
    ],
    "qualifications": [
      "Excellent communications skills",
      "Detail oriented",
      "Working knowledge of graphics/video programs such as Adobe Creative Cloud",
      "Work well as part of a team"
    ],
    "how_to_apply": "Interested applicants should apply to CHAJobs@mail.house.gov no later than September 14, 2016.",
    "salary_info": null,
    "contact": "CHAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-270-16",
    "position_title": "Legislative Assistant",
    "office": "Member of Congress from North Carolina",
    "location": "D.C. Office",
    "posting_date": "2016-09-12",
    "description": "The legislative portfolio includes Education, Transportation,\nScience, Space, & Technology, Telecommunications, and Women’s Rights.\nThis individual is responsible for drafting legislation and amendments,\ntracking legislation, developing legislative initiatives, writing speeches and\nfloor statements, staffing the Member in Committee, and representing the\nMember in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking legislation",
      "Developing legislative initiatives",
      "Writing speeches and floor statements",
      "Staffing the Member in Committee",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Experience in education policy",
      "Excellent written and verbal communication skills",
      "Ability to work well under pressure in a fast- paced environment",
      "Strong team player",
      "At least two years of legislative experience on Capitol Hill",
      "Ties to North Carolina are a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and two brief writing samples along with three references to nchousejobs@gmail.com. Please be sure to put LEGISLATIVE\nASSISTANT in the subject line.",
    "salary_info": null,
    "contact": "nchousejobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-269-16",
    "position_title": "Staff Assistant/Caseworker",
    "office": "Congressman Joaquin Castro",
    "location": "San Antonio District Office",
    "posting_date": "2016-09-12",
    "description": "This entry-level position will provide coverage for the front desk and include responsibilities such as: Answer and screen telephone calls and visitors; Respond to constituent requests for flags, tours and other information; Maintain office supplies and equipment; Handle casework assignments, serving as a liaison with constituents, federal, district, and local agencies; Act as the representative for the Congressman within his or her area of responsibility; Staff Congressman at community events and meetings, as needed; Assist to train interns to handle office matters; Perform other duties as assigned.",
    "responsibilities": [
      "Answer and screen telephone calls and visitors",
      "Respond to constituent requests for flags, tours and other information",
      "Maintain office supplies and equipment",
      "Handle casework assignments, serving as a liaison with constituents, federal, district, and local agencies",
      "Act as the representative for the Congressman within his or her area of responsibility",
      "Staff Congressman at community events and meetings, as needed",
      "Assist to train interns to handle office matters",
      "Perform other duties as assigned"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Maintain a good working relationship with the Congressman, staff, and constituents",
      "Accept performance-based criticism and direction",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Work a flexible schedule including long hours, nights, and weekends",
      "Strong verbal and written communication skills, with Spanish skills preferred",
      "Thoroughness and careful attention to detail",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities",
      "Ability to use in-house data system, Intranet Quorum (IQ)",
      "Ability to use and troubleshoot photocopier, facsimile machine, telephone, and other office equipment",
      "Thorough knowledge of local, state and federal agencies and departments",
      "4-year degree preferred."
    ],
    "how_to_apply": "Please submit a cover letter with your resume and email to District Director, Toni Serna, at toni.serna@mail.house.gov.",
    "salary_info": null,
    "contact": "Toni Serna, District Director, toni.serna@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-268-16",
    "position_title": "Communications Director",
    "office": "Senior Democratic House member from CA",
    "location": null,
    "posting_date": "2016-09-12",
    "description": "Senior Democratic House member from CA seeks proactive, experienced communications director to develop and implement strategic media plan in a fast-paced and results-driven environment.",
    "responsibilities": [],
    "qualifications": [
      "Must have proven track-record, and ability to manage website and social media tools.",
      "Outstanding writing skills and strong pitching skills are required.",
      "Southern California ties are preferred but not necessary.",
      "This is not an entry level position."
    ],
    "how_to_apply": "Qualified candidates should submit resume, cover letter to commstafferCA2016@gmail.com.",
    "salary_info": null,
    "contact": "commstafferCA2016@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-267-16",
    "position_title": "Press Secretary",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington",
    "posting_date": "2016-09-12",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a press secretary for his Washington office. Spanish skills and Hill experience a plus.",
    "responsibilities": [],
    "qualifications": [
      "Spanish skills a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-256-16",
    "position_title": "District Scheduler/Office Manager",
    "office": "North Bay legislative office",
    "location": "California",
    "posting_date": "2016-09-12",
    "description": "Responsibilities include coordinating the legislator’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans; working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters. Also responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties. Opportunities for additional responsibilities commensurate with skills and abilities.",
    "responsibilities": [
      "Coordinating the legislator’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans",
      "Working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters",
      "Assisting the Capitol office and District Director on maintaining financial and expense records",
      "Assisting with various administrative duties"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Have experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov with the subject line “CA02 District Scheduler/Office Manager.”",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  }
]