[
  {
    "id": "MEM-611-22",
    "position_title": "Committee Clerk",
    "office": "Republican Staff of the House Judiciary Committee",
    "location": null,
    "posting_date": "2022-12-19",
    "description": "The Republican Staff of the House Judiciary Committee seeks a highly organized and detail-oriented Committee Clerk.\n\nClerks are responsible for the preparation of all committee activities, such as hearings and markups. Clerks ensure the committee is run efficiently by maintaining and organizing all committee records as well as assisting with the administrative functions of the committee. Qualified applicants will have at least one year of Hill experience as well as working knowledge of how Congressional committees operate.",
    "responsibilities": [
      "Preparation of all committee activities, such as hearings and markups.",
      "Maintaining and organizing all committee records",
      "Assisting with the administrative functions of the committee."
    ],
    "qualifications": [
      "At least one year of Hill experience",
      "Working knowledge of how Congressional committees operate."
    ],
    "how_to_apply": "Candidates can email their resume to Kiley.Bidelman@mail.house.gov.",
    "salary_info": null,
    "contact": "Kiley.Bidelman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-610-22",
    "position_title": "Staff Assistant",
    "office": "Republican Staff of the House Judiciary Committee",
    "location": null,
    "posting_date": "2022-12-19",
    "description": "The Republican Staff of the House Judiciary Committee seeks a Staff Assistant to perform administrative functions, research projects, and other special assignments.\nIdeal candidates will have previous Hill experience and be knowledgeable about or interested in the Judiciary Committee. The ideal candidate will possess strong research and writing skills, a demonstrated attention to detail, the ability to multitask in a fast-paced environment, work well on teams, and be willing to accomplish a variety of assignments quickly and effectively.",
    "responsibilities": [],
    "qualifications": [
      "Previous Hill experience",
      "Knowledgeable about or interested in the Judiciary Committee",
      "Strong research and writing skills",
      "Demonstrated attention to detail",
      "Ability to multitask in a fast-paced environment",
      "Ability to work well on teams",
      "Willingness to accomplish a variety of assignments quickly and effectively"
    ],
    "how_to_apply": "Candidates can email their resume to Kiley.Bidelman@mail.house.gov.",
    "salary_info": null,
    "contact": "Kiley.Bidelman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-609-22",
    "position_title": "Research Assistants",
    "office": "House Armed Services Committee (HASC)",
    "location": null,
    "posting_date": "2022-12-19",
    "description": "The House Armed Services Committee (HASC) is seeking to hire Research Assistants. These positions will support both the majority and minority staff. A successful applicant must have a positive attitude and a genuine desire to serve men and women in uniform. Applicants must possess strong communication, organizational, legislative research, and writing skills.",
    "responsibilities": [
      "The ability to work collaboratively with majority and minority staff and Department of Defense officials.",
      "Assist in committee legislative operations, including monitoring activity in assigned areas, substantive preparation for hearings, and assisting with markups.",
      "Assist with oversight and investigations.",
      "Conduct research, draft correspondence and memoranda, and perform similar duties as assigned.",
      "Perform administrative duties related to assigned work."
    ],
    "qualifications": [
      "Applicants must be eligible to obtain and hold a Top Secret security clearance and comply with all applicable House and Committee security policies."
    ],
    "how_to_apply": "Applicants should submit a cover letter and resume in a single pdf to HASCJobs@mail.house.gov. No phone calls please.",
    "salary_info": null,
    "contact": "HASCJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-608-22",
    "position_title": "Office Manager",
    "office": "House Armed Services Committee (HASC)",
    "location": null,
    "posting_date": "2022-12-19",
    "description": "The House Armed Services Committee (HASC) is seeking to hire an Office Manager. This position will support both the majority and minority staff.\nA successful applicant must have a positive attitude and a genuine desire to serve men and women in uniform. Applicants must possess strong communication, organizational, and managerial skills.",
    "responsibilities": [
      "The ability to work collaboratively with majority and minority staff and Department of Defense officials.",
      "Perform Office Emergency Coordinator duties.",
      "Manage room schedules and overseeing room setups.",
      "Filing reports and correspondence.",
      "Purchase and maintain inventories of office supplies.",
      "Manage staff assistants and carry out other administrative duties."
    ],
    "qualifications": [
      "Applicants must be eligible to obtain and hold a Top Secret security clearance and comply with all applicable House and Committee security policies."
    ],
    "how_to_apply": "Applicants should submit a cover letter and resume in a single pdf to HASCJobs@mail.house.gov. No phone calls please",
    "salary_info": null,
    "contact": "HASCJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-607-22",
    "position_title": "Outreach Representative",
    "office": "The Office of Congresswoman Kim Schrier",
    "location": "Issaquah, WA",
    "posting_date": "2022-12-19",
    "description": "The Office of Congresswoman Kim Schrier seeks an Outreach Representative\nto serve as a community liaison to the 8th Congressional District. This position\nwill be based in Issaquah, WA.\n\nThe position will be responsible for managing an outreach portfolio on several\nlegislative topics, updating the Congresswoman and District Director on district\nissues, coordinating meetings and events relating to the assigned areas, and acting\nas a public representative for the Congresswoman. Additional responsibilities\ninclude staffing the Congresswoman at local events, maintaining robust and\neffective communication with constituents, stakeholders, elected officials, and\nstaff in the district and Washington, D.C. offices.",
    "responsibilities": [
      "Managing an outreach portfolio on several legislative topics",
      "Updating the Congresswoman and District Director on district issues",
      "Coordinating meetings and events relating to the assigned areas",
      "Acting as a public representative for the Congresswoman",
      "Staffing the Congresswoman at local events",
      "Maintaining robust and effective communication with constituents, stakeholders, elected officials, and staff in the district and Washington, D.C. offices."
    ],
    "qualifications": [
      "Prior experience working for Congress or elected officials is preferred.",
      "Candidates should demonstrate a strong commitment to public service",
      "Ability to work as a part of a dynamic team",
      "Excellent oral and written communication skills",
      "Thoroughness and careful attention to detail",
      "Ability to exercise discretion and independent judgment",
      "Ability to work cooperatively and courteously with others in a fast-paced office",
      "Basic knowledge of federal agencies and the political process.",
      "Knowledge of the Eighth Congressional District is desired.",
      "A valid Washington State Driver’s License and access to a reliable vehicle is required, as this job will involve travel around the district (with reimbursable mileage).",
      "Proficiency in a second language is a plus."
    ],
    "how_to_apply": "To be considered, please submit a cover letter and resume with references\nto WA08Resumes@gmail.com with “Outreach Representative” in the subject\nline. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "WA08Resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and\nencourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-606-22",
    "position_title": "Field Representative",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Austin district office",
    "posting_date": "2022-12-19",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks an experienced, detail-oriented, creative individual with excellent writing and communication skills for a Field Representative position in his Austin district office.",
    "responsibilities": [],
    "qualifications": [
      "Bachelor’s degree, good interpersonal skills, and strong work ethic required",
      "Experience in field work or organizing strongly preferred",
      "Strong Austin ties a plus"
    ],
    "how_to_apply": "Please send cover letter, resume, writing sample, and three references by email to jocelyn.tau@mail.house.gov.\nNo calls or walk-ins please.",
    "salary_info": null,
    "contact": "jocelyn.tau@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-605-22",
    "position_title": "STAFF ASSISTANT",
    "office": "Rep. Jake Auchincloss",
    "location": "Washington, DC",
    "posting_date": "2022-12-19",
    "description": "The Staff Assistant will be expected to manage the intern program, manage the front desk during office hours, handle all tour requests, fulfill flag requests, support the district office with administrative office needs, and assist the DC office staff with work as assigned. Staff Assistants often provide the first impression of the office to constituents, guests, and other VIPs.\n\nThe ideal candidate should have excellent attention to detail, a strong work ethic and communication skills, process driven, an eagerness to learn and grow within the office, and a desire to be part of a highly-collaborative, high-achieving team.\n\nThe position is full time with federal benefits, including student loan repayment program (if eligible) and transit or parking benefits.",
    "responsibilities": [
      "Manages the intern program, including hiring, onboarding, and supervising all DC interns.",
      "Provides a welcoming environment and positive first impression of the office to constituents, visitors, and other VIPs",
      "Handles incoming calls with poise, professionalism, and promptness",
      "Captures input from constituents on policy matters for the Member office’s consideration and response",
      "Works closely with the Member’s Director of Operations to ensure appointments are on time",
      "Organizes and manages tasks for constituents to include flag requests, providing tours of the Capitol, and arranging visits to other national landmarks",
      "And other duties as assigned"
    ],
    "qualifications": [
      "Effective communication skills for verbal and written correspondence",
      "Effective teamwork skills and the ability to support the needs of multiple team members and leaders in the office required",
      "Professional demeanor and an upbeat disposition while interacting with visitors, staff members, and stakeholders in a fast-paced, highly dynamic environment required",
      "Time management skills including the ability to prioritize, and track work status required",
      "Attention to detail",
      "Willingness to learn"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, cover letter, writing sample, and references to AuchinclossJobs@mail.house.gov with the subject line “Staff Assistant- [applicant’s last name]”. Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, sexual orientation, or any other characteristic protected by applicable law. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-604-22",
    "position_title": "Communications Director",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C. and Seattle, WA",
    "posting_date": "2022-12-19",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced, creative, and highly motivated Communications Director to lead media and strategy efforts for her Washington, D.C. and Seattle, WA offices.\nAn ideal candidate will:\n\nPossess strong written and oral communications skills and the ability to multitask while thriving in a fast-paced setting under tight deadlines;\nHave experience working directly with local and national reporters, bookers, and other members of the media to proactively pitch stories and respond to inquiries;\nThink strategically and creatively while designing, implementing, and evaluating both short and long-term communications plans in addition to leading rapid response efforts;\nHave a proven track record of writing in the voice of a principal (op-eds, speeches, statements, messaging, talking points, digital content, etc.) and explaining policy issues in ways that people can easily understand;\nKnow how to operate directly with a principal and collaboratively across departments while demonstrating experience managing a team;\nUnderstand the digital media landscape and current digital trends, with experience overseeing a digital program;\nHave a strong record of advocating for progressive values;\nBe willing to staff the Congresswoman for press, and work weekends and irregular hours.",
    "responsibilities": [
      "Developing and executing the office’s communications strategy for Capitol Hill and WA-07, including national and local press, messaging, writing, events, and digital;",
      "Working directly with the Congresswoman to prepare and staff her for interviews, speeches, press conferences, public events, roundtables, and other opportunities;",
      "Building and sustaining strong relationships with local and national reporters (including Capitol Hill reporters, local reporters, and issue-specific reporters at national outlets), editors, columnists, producers, bookers, and advocacy groups;",
      "Proactively and strategically engaging in media outreach, including pitching reporters while also fielding and responding to press inquiries at the local and national levels;",
      "Serving as the spokesperson (on the record, on background, and off the record) for the Congresswoman;",
      "Drafting written materials including press statements, quotes, speeches, remarks, op-eds, press releases and advisories, and talking points;",
      "Designing creative plans to effectively roll out legislation, letters, and other policy initiatives that include press components, and events;",
      "Overseeing a robust, aggressive, engaging, and data-driven online communications program;",
      "Supervising and partnering with the Digital Director, who manages all digital and online content, to maintain strategic messaging across official channels while collaborating with Progressive Caucus staff;",
      "Working collaboratively with the District Office to ensure a consistently strong local/state media presence while collaborating with the legislative team on a daily basis;",
      "Participating in the senior team along with the Chief of Staff, Deputy Chief of Staff, District Director and Legislative Director."
    ],
    "qualifications": [
      "Applicants must have a proven track record of working with the press, and a minimum of two years of experience as a press secretary or communications director is required.",
      "Previous experience on campaigns (political, legislative, or issue-based) and on Capitol Hill is preferred.",
      "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply.",
      "State and/or district ties are a plus."
    ],
    "how_to_apply": "Qualified candidates should include the following in their application:\nResume\nCover letter\nThree writing samples including an op-ed or speech and a statement\nPlease send applications to jobs.pramila@mail.house.gov with “Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-603-22",
    "position_title": "Press Assistant/Digital Manager",
    "office": "Congresswoman Judy Chu (CA-27)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-19",
    "description": "The Press Assistant/Digital Manager will assist the Communications Director in all aspects of the office’s robust communications operation for an active member and CAPAC Chair. The Press Assistant/Digital Manager will be responsible for managing and creating content for member’s social media platforms and website; graphic design; video filming and editing; daily press clips; managing in-district media relations, drafting releases, newsletters, video scripts, talking points and advisories; and organizing and staffing press events.\n\nThe ideal candidate will be creative, take initiative, have a strong proficiency in crafting digital content, experience coordinating with media, and be a detailoriented team player able to solve problems and handle multiple tasks at once. Successful candidates can use Adobe Creative Suite programs like Photoshop, Premiere, and Illustrator; and understand graphic design, video production, and photography (including use of professional equipment).",
    "responsibilities": [
      "Managing and creating content for member’s social media platforms and website",
      "Graphic design",
      "Video filming and editing",
      "Daily press clips",
      "Managing in-district media relations",
      "Drafting releases, newsletters, video scripts, talking points and advisories",
      "Organizing and staffing press events"
    ],
    "qualifications": [
      "At least one to two years of political, campaign or advocacy communications experience.",
      "California ties are a plus.",
      "Experience coordinating with media",
      "Detail-oriented team player able to solve problems and handle multiple tasks at once.",
      "Proficiency in Adobe Creative Suite programs like Photoshop, Premiere, and Illustrator",
      "Understand graphic design, video production, and photography (including use of professional equipment)."
    ],
    "how_to_apply": "Interested applicants should e-mail 1) a resume, 2) a cover letter, 3) two brief writing samples, and 4) a digital portfolio in one PDF document to CA27jobs@gmail.com with the subject “Press Assistant/Digital Manager: LAST NAME.”",
    "salary_info": "$50,000-60,000, commensurate with experience.",
    "contact": "CA27jobs@gmail.com",
    "equal_opportunity": "The office prioritizes building a diverse team; women, people of color, LGBTQ+ people, Veterans, and members of other minority or marginalized groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-602-22",
    "position_title": "Communications Director",
    "office": "Senior Midwestern Appropriator",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-19",
    "description": "Senior Midwestern Appropriator seeks an experienced and motivated Communications Director for their fast-paced, collaborative, Washington, D.C. office. The Communications Director is responsible for leading the development of the Member’s message, working closely with local and national media, and devising creative avenues through which to convey the Member’s accomplishments and priorities.\n\nThis is not an entry-level position. Candidates should have at least two years of relevant communications experience and be well-versed in producing content for print, broadcast, and online media. Qualified candidates will have a strong understanding of the legislative process and congressional issues. Hill experience preferred but not required.",
    "responsibilities": [
      "Managing local and national media relationships, responding on the record to requests, and coordinating interviews",
      "Drafting and issuing press releases",
      "Monitoring the news and flagging relevant press and clips for the Member",
      "Crafting talking points, speeches, and background memos for events",
      "Overseeing social media platforms"
    ],
    "qualifications": [
      "Strong oral and written communications skills",
      "Creativity, good-judgement, and the ability to think quickly and work collaboratively",
      "Thorough attention to detail and an interest in thinking outside the box",
      "Understanding of local and national political issues"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and writing sample to midwestern.resume@mail.house.gov.",
    "salary_info": null,
    "contact": "midwestern.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-601-22",
    "position_title": "Scheduler/Director of Operations",
    "office": "Office of Congresswoman Stacey E. Plaskett",
    "location": "Washington, DC",
    "posting_date": "2022-12-19",
    "description": "The Office of Congresswoman Stacey E. Plaskett, member of the Agriculture Committee and Ways and Means Committee is seeking an experienced Scheduler/Director of Operations to join a fast paced and dynamic team in the Washington, DC office.\n\nCandidates must have at least 1 year scheduling experience for a Member of Congress exceptional organizational skills, attention to detail, and an ability to manage competing demands. Scheduler will be expected to manage conflicting requests, anticipate Member’s needs when balancing multiple tasks and exercise sound judgment when scheduling meetings, events, and travel. Effective and confident communication skills are required. Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred. Start date for successful candidate is within the December/early January timeframe.",
    "responsibilities": [
      "Maintaining and managing the Member’s daily and long-term DC, district, and national schedule.",
      "Responding to all incoming meeting and scheduling requests.",
      "Coordinating travel and booking flight and lodging reservations for Member and staff.",
      "Communicating key information and scheduling changes to the Member, staff, and effected stakeholders in a timely and efficient manner.",
      "Overseeing coordination with other Member offices, Committee staff, Leadership offices, the White House, and Executive Departments and federal agencies.",
      "Coordinating with the District Director and district staff on scheduling in-district events.",
      "Compiling the Congresswoman’s daily briefing materials and coordinating with legislative and press staff on materials needed for meetings and events.",
      "Coordinating with campaign and non-official staff on political scheduling requests and the Congressional Black Caucus Foundation (CBCF).",
      "Assisting the Chief of Staff, Legislative Correspondent, and Staff Assistant with office operations.",
      "Other duties, as assigned, including serving as a secondary driver on an as needed basis.",
      "Transportation not required but preferred to facilitate driving Member in DC.",
      "The position requires flexible hours and availability by phone as needed."
    ],
    "qualifications": [
      "Candidates must have at least 1 year scheduling experience for a Member of Congress exceptional organizational skills, attention to detail, and an ability to manage competing demands.",
      "Effective and confident communication skills are required.",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred."
    ],
    "how_to_apply": "Qualified candidates should submit their applications (resume, cover letter, references, and three writing samples) to VI.Resume@mail.house.gov with “Scheduler/Director of Operations” in the subject line.\n\nNo calls please. Individuals selected for an interview will be contacted.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "VI.Resume@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status."
  },
  {
    "id": "MEM-600-22",
    "position_title": "IMMIGRATION CASEWORKER (NEW YORK DISTRICT OFFICE)",
    "office": "Rep. Adriano Espaillat (NY-13)",
    "location": "New York City",
    "posting_date": "2022-12-19",
    "description": "Rep. Adriano Espaillat (NY-13) seeks an organized, knowledgeable, and passionate professional to join the District Office team. Successful candidates will be collaborative team players who enjoy taking initiative, solving problems, and thinking creatively. New York City ties are a plus. This is a Full-time position. This is not an entry-level position.",
    "responsibilities": [
      "Works closely with the Congressman, Chief of Staff and District Director to provide constituent services",
      "Serves as a representative on behalf of the Member to respond to local immigration updates",
      "Stays informed about relevant immigration issues in the district",
      "Provides constituent assistance, answer related casework correspondence, and provide regular updated communications with constituents",
      "Acts as a liaison to federal government entities and immigration agencies on behalf of constituents",
      "Evaluates casework for problems requiring legislative action and/or Congressional oversight, and advises accordingly"
    ],
    "qualifications": [
      "Local, state, or congressional work experience and prior immigration casework and/or immigration related services experience",
      "Bilingual and speak English and Spanish fluently",
      "NY-13 District, or NYC ties are a plus",
      "Thoroughness and careful attention to detail",
      "Prioritizes and manages multiple tasks under tight deadlines",
      "Ability to work well under pressure, manage multiple deadlines and accept performance-based criticism and direction"
    ],
    "how_to_apply": "Please submit your resume to espaillat_jobs@mail.house.gov with the subject line “Immigration Caseworker”.",
    "salary_info": "$60,000+ annually depending on experience plus bonus. Full package includes health insurance, dental, federal student loan payment (terms apply), and paid family leave.",
    "contact": "espaillat_jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-599-22",
    "position_title": "DIGITAL MEDIA MANAGER",
    "office": "Rep. Adriano Espaillat (NY-13)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-19",
    "description": "Rep. Adriano Espaillat (NY-13) seeks a Digital Media Manager based in his\nWashington, D.C. office. Responsibilities include: managing the Congressman’s\nsocial media pages, writing engaging social copy, and making creative digital\ncontent, including graphics and videos.\n\nAdditional responsibilities include maintaining the Congressman’s website,\ncompiling daily press clips, managing the Office’s constituent correspondence\nprogram, running virtual discussions and livestreams across social media\nplatforms, and supporting the Communications Director by drafting written\nmaterials (press releases, statements, e-Newsletters, etc.) as assigned.\n\nThe ideal candidate will also have experience making graphics and videos with\nAdobe Creative Suite or similar software, be proactive, detail-oriented and\npossess strong written and verbal communication skills.",
    "responsibilities": [
      "managing the Congressman’s social media pages",
      "writing engaging social copy",
      "making creative digital content, including graphics and videos",
      "maintaining the Congressman’s website",
      "compiling daily press clips",
      "managing the Office’s constituent correspondence program",
      "running virtual discussions and livestreams across social media platforms",
      "supporting the Communications Director by drafting written materials (press releases, statements, e-Newsletters, etc.) as assigned"
    ],
    "qualifications": [
      "experience making graphics and videos with Adobe Creative Suite or similar software",
      "be proactive",
      "detail-oriented",
      "possess strong written and verbal communication skills"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume,\nand a portfolio of writing and digital samples (including graphics)\nto Espaillat.Jobs@mail.house.gov with the subject line “Digital Media Manager”.",
    "salary_info": "$65,000+ annually based on experience plus\nbonus. Full package includes health insurance, dental, federal student loan\npayment (terms apply), and paid family leave.",
    "contact": "Espaillat.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. We value diversity, equity and inclusion, and strongly encourages\ncandidates to apply who have relevant lived experience and/or have been directly\nimpacted by the Congressman’s policy portfolio. Candidates with New York City\nties and Spanish fluency are highly encouraged to apply."
  },
  {
    "id": "MEM-598-22",
    "position_title": "SENIOR ADVISOR/ LEGAL COUNSEL",
    "office": "Rep. Adriano Espaillat (NY-13)",
    "location": "Washington, DC",
    "posting_date": "2022-12-19",
    "description": "Rep. Adriano Espaillat (NY-13) seeks an experienced Senior Advisor/ Legal Counsel to be the primary staff member handling foreign affairs and his work on the House Appropriations Committee Subcommittee on State, Foreign Operations, and Related Programs.\nAdditional responsibilities could include trade, energy, environment, judiciary, defense, armed services, homeland security, judiciary, agriculture, and LGBTQ issues. This position is based in our Washington, DC office and applicants should have previous experience on Capitol Hill, work well in a fast paced and teamoriented environment, be progressive, organized, creative, self-motivated, work well under pressure, and possess strong verbal and written communication, organizational, and time management skills. Spanish fluency is a plus, though not required.",
    "responsibilities": [
      "Support the Member during the legislative process, including drafting, editing and monitoring legislation, amendments, resolutions, memos and other written work",
      "Conduct policy and legal research, tracks bills, and identify and monitor specific issues based on portfolio",
      "Staff the Member at meetings based on portfolio",
      "Learn and stay up-to-date with ongoing policy matters related to legislative portfolio and issue areas",
      "Build relationships with federal, state, and local stakeholders",
      "Work with the district office team to ensure Congressman Espaillat’s legislative priorities are communicated effectively in the district"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and two writing samples (bill, e-dear colleague, policy memo, etc.) to Espaillat_Jobs@mail.house.gov with subject line “NY13 Legislative Assistant”.",
    "salary_info": "$75,000+ annually depending on experience plus bonus. Full package includes health insurance, dental, federal student loan payment (terms apply), and paid family leave.",
    "contact": "Espaillat_Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Women, people of color, and LGBTQ+ candidates are strongly encouraged to apply. Due to the volume of applications we receive, we will only contact you if we decide to move forward with your application. Please no calls, direct emails, or walk-ins."
  },
  {
    "id": "MEM-596-22",
    "position_title": "Director of Operations, Office Manager, and Intern Coordinator",
    "office": "Congressman Tom McClintock (CA-04)",
    "location": "Washington, DC",
    "posting_date": "2022-12-19",
    "description": "This individual will also serve as the Office Manager and Intern Coordinator.\nPosition duties include, but are not limited to: maintaining Member's Washington, DC calendar, managing all incoming meeting requests and invitations, coordinating travel and logistics, processing office invoices for vendor payment, maintaining stock of office supplies, overseeing the day-to-day operations of the office, processing/scheduling all incoming tour requests, managing the office's internship program, and other duties as required.",
    "responsibilities": [
      "Maintaining Member's Washington, DC calendar",
      "Managing all incoming meeting requests and invitations",
      "Coordinating travel and logistics",
      "Processing office invoices for vendor payment",
      "Maintaining stock of office supplies",
      "Overseeing the day-to-day operations of the office",
      "Processing/scheduling all incoming tour requests",
      "Managing the office's internship program",
      "Other duties as required"
    ],
    "qualifications": [
      "Well-organized",
      "Possess a keen attention to detail",
      "Work well in a fast-paced environment",
      "Strong interpersonal skills"
    ],
    "how_to_apply": "Please submit resume and cover letter to gopwesternjobs1776@gmail.com",
    "salary_info": "Commensurate with experience.",
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-595-22",
    "position_title": "Senior Legislative Assistant or Counsel – Financial Services",
    "office": "Senior Democratic House Member",
    "location": null,
    "posting_date": "2022-12-19",
    "description": "Senior Democratic House Member seeking to hire Legislative Assistant to manage and support the Member’s responsibilities for the House Financial Services Committee, which will likely include serving as the top Democrat on a subcommittee of the FSC.\n\nThe ideal candidate will have significant experience in financial services issues. Other areas of responsibility may include consumer protection, small business, tax, in addition to supporting the member’s assignment to the Committee on Financial Services. Experience with Wall Street regulation a major plus.\n\nResponsibilities include monitoring and drafting legislation, representing the Member in meetings/briefings, preparing materials for committee hearings and markups, maintaining relationships with advocacy groups, interfacing with government agencies, and other tasks and assignments as needed.\n\nThe successful candidate will possess excellent writing written and oral communication skills, a solid understanding of the legislative process, and a proven ability to work effectively in a fast-paced office. Law degree/bar membership a plus, but not required. This is a mid- to senior-level position in the office.",
    "responsibilities": [
      "Monitoring and drafting legislation",
      "Representing the Member in meetings/briefings",
      "Preparing materials for committee hearings and markups",
      "Maintaining relationships with advocacy groups",
      "Interfacing with government agencies",
      "Other tasks and assignments as needed"
    ],
    "qualifications": [
      "Excellent writing written and oral communication skills",
      "A solid understanding of the legislative process",
      "Proven ability to work effectively in a fast-paced office",
      "Law degree/bar membership a plus, but not required",
      "Significant experience in financial services issues",
      "Experience with Wall Street regulation a major plus"
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to congressjob2022@gmail.com",
    "salary_info": null,
    "contact": "congressjob2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-591-22",
    "position_title": "Staff Assistant",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "DC office",
    "posting_date": "2022-12-19",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks highly-motivated, detailoriented Staff Assistant with excellent written and oral communication skills for DC office.",
    "responsibilities": [
      "Driving the Member",
      "General reception duty",
      "Handling tour and flag requests",
      "Processing constituent correspondence",
      "Addressing constituent matters",
      "Assist in managing interns",
      "Assisting the Member and staff in all functions of the office"
    ],
    "qualifications": [
      "Daily access to an automobile preferred – with a valid driver’s license and good driving record.",
      "Previous Hill experience as an intern or staff assistant preferred but not necessary.",
      "Southern California ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Staff Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-590-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-19",
    "description": "Representative Nanette Diaz Barragán (CA-44) seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, and energetic.\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\nThe Communications Director will oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member’s social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters and franked mailings.\n\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging. The Communications Director is responsible for maintaining the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base.\nThis is NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill, and fluency in Spanish is preferred. They must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Develop and execute an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations, including coordinating and managing the press team.",
      "Respond to media inquiries.",
      "Book the Member for interviews.",
      "Pitch news opportunities to media outlets.",
      "Plan press conferences and in-district events.",
      "Manage the Member’s social media accounts and official website.",
      "Edit/draft speeches, talking points, floor statements, press releases, op-eds, and e-newsletters.",
      "Create and distribute e-newsletters and franked mailings.",
      "Work with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
      "Maintain the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base."
    ],
    "qualifications": [
      "Previous press-related experience either on or off Capitol Hill",
      "Fluency in Spanish is preferred",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political judgment and instincts",
      "Superior writing, editing, and proofreading skills",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus.",
      "Willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-587-22",
    "position_title": "Legislative Director",
    "office": "Office of Congressman Alma S. Adams, Ph.D.",
    "location": "DC",
    "posting_date": "2022-12-19",
    "description": "The LD will help drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio, and manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.\n\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects.",
    "responsibilities": [
      "Drive the proactive legislative agenda for the office.",
      "Develop and implement strategy to push policy priorities and legislative goals.",
      "Supervise and mentor the legislative staff.",
      "Advise on the Congresswoman’s legislative portfolio.",
      "Manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.",
      "Work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations.",
      "Help ensure coordination between DC and district offices on important legislative updates and district-based events and projects."
    ],
    "qualifications": [
      "Extensive Hill experience and knowledge of the legislative process are required.",
      "Crisp and thorough written and oral communications skills.",
      "Entrepreneurial and self-starting attitude.",
      "Strong attention to detail.",
      "Creativity.",
      "Team player.",
      "Supervisory experience and expertise on healthcare policy is strongly preferred."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to nc12.resume@mail.house.gov.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-586-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-19",
    "description": "Congresswoman Susie Lee (NV-03) seeks an experienced Legislative Assistant to join her Washington, D.C.-based legislative team. The Legislative Assistant will help implement the Member’s agenda within the Appropriations Committee and across authorizing committees, and manage a portfolio including but not limited to health care, transportation, and infrastructure issues.\n\nThis is not an entry-level position and sound policy judgement is required. Candidate should have a strong track record of translating policy priorities into successful legislative outcomes and developing proactive relationships with onand off-Hill stakeholders. Candidate will be expected to frequently brief and staff the Member and demonstrate strong verbal communication skills.\n\nCandidate should also be coachable, responsive to feedback, and enjoy working in a team-first, collaborative work environment. Candidate will work directly with the Congresswoman, Chief of Staff, Legislative Director, and intra- and inter-departmental peers to advance the Congresswoman’s authorizing and appropriations priorities. Nevada ties are a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply send in PDF format a resume, cover letter, writing sample of 1,000 words or fewer, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to nv03resumes@gmail.com with the following subject line: “Full Name – Legislative Assistant.”",
    "salary_info": null,
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-585-22",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Susie Lee (D-NV)",
    "location": "DC",
    "posting_date": "2022-12-19",
    "description": "Congresswoman Susie Lee (D-NV) seeks a highly organized, good-humored, hard-working Scheduler to develop, coordinate, and manage all aspects of the Member’s daily and long-term schedule and logistics in DC.\n\nThe DC Scheduler will report to the Chief of Staff and work closely with the Member, DC staff, and District staff, including a District-based scheduler responsible for in-district scheduling. The ideal candidate will have prior scheduling experience on the Hill, and salary is commensurate with experience. This is not an entry-level position.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Compiling the Congresswoman’s nightly briefing materials",
      "Providing operational support for the office, including but not limited to facilitating Member to Member and stakeholder outreach, coordinating internal and external events, and assisting with onboarding process for staff and interns."
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Communicate quickly and effectively both internally and externally",
      "Strong conflict-resolution skills",
      "Thrive in a fast-paced work environment",
      "The position requires the ability to multi-task, work well under pressure, and the flexibility to be responsive to urgent scheduling needs on nights and weekends."
    ],
    "how_to_apply": "Candidates should submit in PDF format a resume, cover letter, writing sample of 1,000 words or fewer, and three references (including name, title and organization, phone number, email, and relationship to the candidate) to nv03resumes@gmail.com with the following subject line: “Full Name – DC Scheduler.”",
    "salary_info": "salary is commensurate with experience",
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-583-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2022-12-19",
    "description": "The Office of Congressman Rob Wittman (VA-01) is seeking an experienced Legislative Assistant to manage his telecommunication, transportation, and Natural Resources Committee issue portfolio.\n\nThe ideal candidate is a current Legislative Assistant who has been a full-time LA for 2+ years, and has handled appropriations requests, staffed committee assignments, and has a proven legislative track record for their Member.\n\nExperience working with other Member offices, advocacy groups, industry associations, etc., with the goal of creating a successful coalition to pass a bill/amendment, is preferable. Given that this position works closely with district issues and district stakeholders, the person who fills this position must have a self-starter mentality and strong interpersonal skills. This position will be highly involved in the telecommunications policy area, including managing the Member’s responsibilities on the Rural Broadband Caucus and Rural Broadband Task Force.\n\nThe position will also be expected to work routinely with state and federal transportation stakeholders to address the unique transportation issues of the district, which require an independent approach to addressing the issues and curating solutions. The ideal candidate needs to be self-motivated and possess the ability to take proactive and creative initiative on assigned policy areas.",
    "responsibilities": [],
    "qualifications": [
      "Current Legislative Assistant who has been a full-time LA for 2+ years",
      "Experience handling appropriations requests",
      "Experience staffing committee assignments",
      "Proven legislative track record",
      "Experience working with other Member offices, advocacy groups, industry associations, etc.",
      "Self-starter mentality",
      "Strong interpersonal skills",
      "Self-motivated",
      "Ability to take proactive and creative initiative on assigned policy areas"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Carolyn.King@mail.house.gov with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-582-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Orange County",
    "posting_date": "2022-12-19",
    "description": "The Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.\n\nUnder the supervision of the Chief of Staff and the District Director, the Field Representative briefs the Member in preparation for district meetings with constituents and acts as the representative for the Member by attending events and meetings. This includes public speaking and certificate presentations.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible scheduling, including nights and weekends",
      "Constituent service oriented; patient empathetic, and desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director, Office of Congresswoman\nSteel Stephanie.Hu@mail.house.gov",
    "salary_info": "Salary range is $49,000-$57,000. Salary commensurate with experience.",
    "contact": "Stephanie Hu, District Director, Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-575-22",
    "position_title": "Senior Legislative Assistant",
    "office": "Congressman Mark DeSaulnier (D-CA)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-19",
    "description": "Congressman Mark DeSaulnier (D-CA), member of the Education and Labor Committee and Transportation and Infrastructure Committee, seeks a Senior Legislative Assistant to handle a diverse legislative portfolio including committee work.\n\nDuties include identifying and advancing policy proposals, committee hearing and mark-up preparation and staffing, building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff, briefing the Congressman and drafting legislative memos, policy background, and constituent correspondence. Title is negotiable based on candidate’s experience.\n\nIdeal candidate will be a strategic, detail-oriented thinker with experience formulating and advancing legislation. Successful applicants will have excellent organizational, research, writing, and communication skills, and have working knowledge of House processes and procedures.\n\nCandidates should possess the ability to concisely communicate and have strong time management skills and a willingness to work in a team environment.\n\nKnowledge of California a plus. This is not an entry level position -- prior legislative experience on Capitol Hill is preferred.",
    "responsibilities": [
      "Identifying and advancing policy proposals",
      "Committee hearing and mark-up preparation and staffing",
      "Building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff",
      "Briefing the Congressman",
      "Drafting legislative memos, policy background, and constituent correspondence"
    ],
    "qualifications": [
      "Strategic, detail-oriented thinker",
      "Experience formulating and advancing legislation",
      "Excellent organizational, research, writing, and communication skills",
      "Working knowledge of House processes and procedures",
      "Ability to concisely communicate",
      "Strong time management skills",
      "Willingness to work in a team environment",
      "Knowledge of California a plus",
      "Prior legislative experience on Capitol Hill is preferred"
    ],
    "how_to_apply": "Qualified candidates should send resume and cover letter to DeSaulnierResumes@gmail.com.",
    "salary_info": null,
    "contact": "DeSaulnierResumes@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity, marital status, parental status, or sexual orientation. Candidates from diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-572-22",
    "position_title": "Legislative Director",
    "office": "Congresswoman Susan Wild (D-PA)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-19",
    "description": "Congresswoman Susan Wild (D-PA) seeks a Legislative Director to oversee her\nlegislative team and a fast-paced policy agenda.\n\nThis is not an entry-level position and previous policy and Capitol Hill\nexperience is required. The person in this role will very likely have a legislative\nportfolio as well as be responsible for managing the legislative team and\npotentially other staff.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief\nof Staff;",
      "Manages a legislative team of 3-4 staff;",
      "Works closely with the communications team and helps influence the successful\nmessaging of legislative issues;",
      "Coordinates the preparation of legislative and policy memos and committee\nhearings;",
      "Handles a portfolio of legislative issues, which may be tailored to the\ncandidate’s expertise;",
      "Occasionally assists with the creation and execution of events in the District and\nin DC;",
      "Regularly monitors activity on the House Floor and the Member’s committees;",
      "Builds relationships with district and national stakeholders and advocacy\norganizations; and",
      "Takes constituent and advocacy group meetings regularly."
    ],
    "qualifications": [
      "Is a leader with strong inter-personal skills who thrives in a collaborative teamfirst environment;",
      "Works quickly under pressure and manages time efficiently;",
      "Is creative and has an entrepreneurial spirit;",
      "Possesses strong written and verbal communications skills;",
      "5+ years of congressional, policy, or political experience (Capitol Hill\nexperience required);",
      "Domestic policy experience – health care policy experience a plus;",
      "Existing relationships and experience working with federal agencies; and",
      "Knowledge of or ties to Pennsylvania a plus."
    ],
    "how_to_apply": "TO APPLY: Email a cover letter and resume to repwildjobs@gmail.com with the\nsubject line, “Legislative Director”.",
    "salary_info": null,
    "contact": "repwildjobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. Candidates from diverse backgrounds are strongly encouraged to\napply."
  },
  {
    "id": "MEM-566-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic member of the House Science, Space, and Technology Committee",
    "location": "DC",
    "posting_date": "2022-12-19",
    "description": "Senior Democratic member of the House Science, Space, and Technology Committee seeks a Legislative Assistant to handle the office’s SST committee portfolio.\n\nIdeal candidates will have previous congressional experience and a strong understanding of the legislative process. Excellent writing skills, attention to detail, and the ability to work efficiently in a fast-paced environment are required.\n\nThis is not an entry level-position. Additional legislative responsibilities will be assigned based on a candidate’s experience/interest and office needs. This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply.",
    "responsibilities": [
      "staffing and preparing the member for hearings, markups, and relevant briefings",
      "writing legislative memos, talking points and floor statements",
      "drafting legislation, agency letters, and supporting materials",
      "working with the committee staff and stakeholders to advance the member’s priorities",
      "representing the member in meetings and other engagements with constituents, stakeholders, and state/federal government agencies"
    ],
    "qualifications": [
      "previous congressional experience",
      "strong understanding of the legislative process",
      "excellent writing skills",
      "attention to detail",
      "ability to work efficiently in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and a writing sample in a single PDF document to ca07jobs@gmail.com with “SST Legislative Assistant - DC” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-560-22",
    "position_title": "Legislative Director",
    "office": "Congressman Raja Krishnamoorthi (D-IL)",
    "location": "Washington, DC",
    "posting_date": "2022-12-19",
    "description": "Congressman Raja Krishnamoorthi (D-IL), a member of the House Permanent Select Committee on Intelligence and the House Oversight Committee (Chairman of the Subcommittee on Economic and Consumer Policy and Member of the Coronavirus Subcommittee) seeks a hardworking Legislative Director to oversee his policy team and legislative agenda.\n\nThis is not an entry-level position and previous policy and Capitol Hill experience is required. The person in this role will also have a legislative portfolio of domestic policy issues, including workforce development, tax, finance, small business, and labor.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff",
      "Manages a legislative team of 4-5 staff",
      "Works closely with the communications team and helps influence the successful messaging of legislative issues",
      "Coordinates the preparation of legislative and policy memos, hearings, and Town Halls",
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise",
      "Occasionally assists with the creation and execution of events in the District and in DC",
      "Regularly monitors activity on the House Floor and the Member’s committees",
      "Builds relationships with district and national stakeholders and advocacy organizations",
      "Takes constituent and advocacy group meetings as necessary"
    ],
    "qualifications": [
      "Works quickly under pressure and manages time efficiently",
      "Is creative and has an entrepreneurial spirit",
      "Possesses strong written and verbal communications skills",
      "5+ years of congressional, policy, or political experience (Capitol Hill experience strongly preferred)",
      "Policy experience in domestic policy issues a plus",
      "Knowledge of or ties to Illinois a plus"
    ],
    "how_to_apply": "Email a cover letter and resume to il08careers@gmail.com with the subline, “Legislative Director: [Your Full Name]”",
    "salary_info": null,
    "contact": "il08careers@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-550-22",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-19",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus' policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members' staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus' policy priorities and strategic objectives",
      "Executing Caucus' policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC's work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-546-22",
    "position_title": "Scheduler",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-19",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced and well-organized Scheduler for the Representative’s Washington, D.C. office.",
    "responsibilities": [
      "Developing, coordinating, and managing all aspects of the Representative’s daily and long-term schedule in D.C. and in the district, as well as tracking, evaluating, and responding to all invitations and scheduling requests;",
      "Coordinating all travel for the Representative and her staff and other logistical support tasks as required;",
      "Working closely with and supporting the Chief of Staff, Deputy Chief of Staff/District Director, Legislative Director and Communications Director to ensure smooth daily schedules and operations."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values;",
      "A hard worker with excellent attention to detail;",
      "Adept at juggling complex schedules, competing priorities;",
      "Able to anticipate problems, seek solutions, and effectively communicate them to the Representative and her staff;",
      "Able to work long hours, including some nights and weekends;",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Scheduler” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  }
]