[
  {
    "id": "MEM-063-17",
    "position_title": "Legislative Assistant",
    "office": "Ways and Means Committee Republican",
    "location": null,
    "posting_date": "2017-02-27",
    "description": "Duties include, but are not limited to, drafting responses to constituent mail and calls for all issue areas; monitoring floor, committee, and regulatory activity; conducting meetings with constituents and stakeholders; developing legislation; and advising the Congressman and senior staff.",
    "responsibilities": [
      "Drafting responses to constituent mail and calls for all issue areas",
      "Monitoring floor, committee, and regulatory activity",
      "Conducting meetings with constituents and stakeholders",
      "Developing legislation",
      "Advising the Congressman and senior staff"
    ],
    "qualifications": [
      "Experience as a Legislative Correspondent",
      "Strong writing, organizational, and project management skills"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and writing sample to: gopjobopening@gmail.com.",
    "salary_info": null,
    "contact": "gopjobopening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-061-17",
    "position_title": "Legislative Assistant",
    "office": "Southern Conservative Congressman",
    "location": "Capitol Hill",
    "posting_date": "2017-02-27",
    "description": "Southern Conservative Congressman seeks a Legislative Assistant to handle a diverse portfolio of issues with a particular emphasis on Committee related topics of health care, education and labor issues. Prior legislative experience on Capitol Hill dealing with policy issues is required. Individuals will be expected to have excellent research, writing, and communication skills.",
    "responsibilities": [
      "Briefing the Congressman regarding bills on the floor and policy proposals",
      "Committee prep for hearings and markups",
      "Generating policy positions",
      "Taking meetings with constituents",
      "Helping with constituent correspondence program"
    ],
    "qualifications": [
      "Prior legislative experience on Capitol Hill dealing with policy issues is required.",
      "Excellent research, writing, and communication skills.",
      "Confident and well spoken",
      "Strong interpersonal skills",
      "Willingness to work in a team environment.",
      "Southern ties preferred."
    ],
    "how_to_apply": "Qualified candidates should send resume, cover letter, and writing samples to southerncongressmanjob@gmail.com.",
    "salary_info": null,
    "contact": "southerncongressmanjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-058-17",
    "position_title": "Scheduler",
    "office": "Midwestern Republican House member",
    "location": "Washington, D.C. and in District",
    "posting_date": "2017-02-27",
    "description": "Midwestern Republican House member seeks an energetic, highly-organized and detail-oriented Scheduler. Responsibilities focus primarily on managing the Member's schedule in Washington, D.C. and in District, but also include evaluating all meeting requests, and coordinating office travel arrangements and special events. The ideal candidate will be extremely detail oriented, proactive, motivated, and will possesses flexibility and the ability to thrive in a fast paced environment. Prior scheduling experience is preferred, and some driving will be required.",
    "responsibilities": [
      "Managing the Member's schedule in Washington, D.C. and in District",
      "Evaluating all meeting requests",
      "Coordinating office travel arrangements and special events"
    ],
    "qualifications": [
      "Extremely detail oriented",
      "Proactive",
      "Motivated",
      "Flexibility and the ability to thrive in a fast paced environment",
      "Prior scheduling experience is preferred",
      "Some driving will be required"
    ],
    "how_to_apply": "Please email your resume to midwestmember@mail.house.gov to apply.",
    "salary_info": null,
    "contact": "midwestmember@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-053-17",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Michelle Lujan Grisham",
    "location": "Washington, DC",
    "posting_date": "2017-02-27",
    "description": "Congresswoman Michelle Lujan Grisham is seeking applicants for a motivated, hard-working, and detail-oriented Legislative Assistant. Portfolio includes defense, veterans, foreign affairs, homeland security, education, transportation, and science and technology. A positive attitude, sense of humor, and excellent written and oral communication skills are essential. Significant congressional or public policy experience is required. New Mexico ties are a plus and the office encourages candidates of diverse backgrounds to apply.",
    "responsibilities": [
      "Portfolio includes defense",
      "veterans",
      "foreign affairs",
      "homeland security",
      "education",
      "transportation",
      "science and technology"
    ],
    "qualifications": [
      "A positive attitude, sense of humor, and excellent written and oral communication skills are essential.",
      "Significant congressional or public policy experience is required.",
      "New Mexico ties are a plus and the office encourages candidates of diverse backgrounds to apply."
    ],
    "how_to_apply": "To apply, applicants should submit one document which includes only their resume and cover letter to NM01.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-043-17",
    "position_title": "Staff Assistant",
    "office": "Energy and Commerce Committee Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2017-02-27",
    "description": "The Energy and Commerce Committee Democratic Staff seeks an enthusiastic, motivated, and highly-organized Staff Assistant for fast-paced committee office. Responsibilities include front office reception; preparation for committee hearings, markups, meetings and events; training and supervising interns; maintaining files, office supplies and equipment; assisting staff with research, work product, web content, special projects, and other duties as assigned.",
    "responsibilities": [
      "Front office reception",
      "Preparation for committee hearings, markups, meetings and events",
      "Training and supervising interns",
      "Maintaining files, office supplies and equipment",
      "Assisting staff with research, work product, web content, special projects",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Strong organizational skills",
      "Hill experience preferred"
    ],
    "how_to_apply": "Please submit a cover letter, resume and a short writing sample to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, sexual orientation, or gender identity. The office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-029-17",
    "position_title": "Press Assistant/Speechwriter",
    "office": "House Democratic Caucus Vice Chair Linda T. Sánchez (CA-38)",
    "location": "Washington DC",
    "posting_date": "2017-02-27",
    "description": "Responsibilities include drafting talking points, press releases and advisories; managing social media accounts; coordinating press events, and other tasks as assigned. Candidates for this position must have Spanish fluency and possess strong bilingual writing and speaking skills. Prior press experience; Hill or campaign experience and familiarity with social media and digital-based content is strongly preferred.",
    "responsibilities": [
      "Drafting talking points, press releases and advisories",
      "Managing social media accounts",
      "Coordinating press events",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Spanish fluency",
      "Strong bilingual writing and speaking skills",
      "Prior press experience (preferred)",
      "Hill or campaign experience (preferred)",
      "Familiarity with social media and digital-based content (preferred)"
    ],
    "how_to_apply": "Interested candidates must submit resume, cover letter, up to 3 writing samples in English and Spanish, and 2 examples of social media or digital media work products to CADemOfficeJob@gmail.com.",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-028-17",
    "position_title": "Staff Assistant/Driver",
    "office": "House Democratic Caucus Vice Chair Linda T. Sanchez (CA-38)",
    "location": "Washington, DC",
    "posting_date": "2017-02-27",
    "description": "Responsibilities include front office duties, conducting Capitol tours, greeting office visitors, and driving the Member within Washington DC. Qualified applicants must be personable, dependable, and able to juggle multiple tasks with competing priorities. California ties and Spanish language proficiency preferred.",
    "responsibilities": [
      "Front office duties",
      "Conducting Capitol tours",
      "Greeting office visitors",
      "Driving the Member within Washington DC"
    ],
    "qualifications": [
      "Personable",
      "Dependable",
      "Able to juggle multiple tasks with competing priorities",
      "California ties and Spanish language proficiency preferred"
    ],
    "how_to_apply": "To apply, please submit resume, cover letter, and a short writing sample to CADemOfficeJob@gmail.com.",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-352-16",
    "position_title": "Investigative Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": "U.S. House of Representatives",
    "posting_date": "2017-02-27",
    "description": "The Committee on Oversight and Government Reform is the primary investigative committee of the U.S. House of Representatives. Rep. Elijah E. Cummings, the Ranking Member, is seeking an Investigative Counsel to join the Democratic staff to participate in all matters under the Committee's jurisdiction, including investigations, hearings, depositions, transcribed interviews, and briefings. The ideal candidate will be an attorney with 2-5 years of investigative or litigation experience. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills. Candidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Attorney with 2-5 years of investigative or litigation experience.",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Investigative Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  }
]