[
  {
    "id": "MEM-389-14",
    "position_title": "Executive Assistant",
    "office": "Republican Committee",
    "location": "Capitol Hill",
    "posting_date": "2014-12-01",
    "description": "Republican Committee seeks Executive Assistant for full committee Chief of Staff. Executive Assistant will work closely with Chief of Staff, assisting with projects, managing daily schedule, and various other tasks as needed. Ideal candidate will be incredibly well organized, be able to anticipate issues and needs, and have the initiative to identify problems and come up with solutions to address them. A positive attitude is essential. Capitol Hill experience is a plus but new graduates are encouraged to apply.",
    "responsibilities": [
      "Assisting with projects",
      "Managing daily schedule",
      "Various other tasks as needed"
    ],
    "qualifications": [
      "Incredibly well organized",
      "Be able to anticipate issues and needs",
      "Have the initiative to identify problems and come up with solutions to address them",
      "Positive attitude is essential",
      "Capitol Hill experience is a plus"
    ],
    "how_to_apply": "Interested applicants should send resume and cover letter to GOPcommittee@gmail.com.",
    "salary_info": null,
    "contact": "GOPcommittee@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-378-14",
    "position_title": "Communications Director",
    "office": "Senior Republican",
    "location": "Washington, D.C.",
    "posting_date": "2014-12-01",
    "description": "Senior Republican seeks to interview candidates for the position of Communications Director for a fast-paced office. The successful candidate will have excellent written and verbal skills as well as the proven ability to manage multiple communications projects. She/he will be responsible for developing, managing and coordinating all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website including design, implementing social media strategy including Facebook, Twitter, etc., maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include early daily news clips, briefing the Member for radio interviews, writing and implementing PSA's from the Member, interacting with the press as the Member's principal spokesperson and coordinating the Member's overall press relations.",
    "responsibilities": [
      "Developing, managing and coordinating all communications activities",
      "Writing press releases, op-eds, mail pieces, talking points",
      "Organizing press events",
      "Maintaining the official website including design",
      "Implementing social media strategy including Facebook, Twitter, etc.",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Providing early daily news clips",
      "Briefing the Member for radio interviews",
      "Writing and implementing PSA's from the Member",
      "Interacting with the press as the Member’s principal spokesperson",
      "Coordinating the Member’s overall press relations"
    ],
    "qualifications": [
      "Hill experience",
      "Familiarity with New Jersey",
      "Must be able to work extended hours",
      "Must be able to work under time pressure",
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects"
    ],
    "how_to_apply": "Please email a resume, cover letter, and two writing samples to pressopportunity2014@gmail.com.",
    "salary_info": null,
    "contact": "pressopportunity2014@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-369-14",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Office of Representative Donna F. Edwards",
    "location": "Washington, DC",
    "posting_date": "2014-12-01",
    "description": "The Office of Representative Donna F. Edwards is seeking a Scheduler/Executive Assistant to maintain the Member's official schedule, travel plans, and related records.",
    "responsibilities": [
      "prepares the daily schedule for the Member, and distributes copies to the Washington, DC, and district offices;",
      "prepares detailed itineraries for the Member, including important numbers, location and contact names;",
      "prepares monthly projected schedules for the Member;",
      "briefs the Member on all scheduling activities of the Washington, DC, and district offices and makes recommendations on proposed future meetings;",
      "schedules all staff meetings and briefings;",
      "coordinates scheduling of press, interviews, radio and T.V. time with the Press Secretary; and",
      "coordinates photo opportunities with constituents.",
      "makes reservations for the Member's air travel, ground transportation, and lodging; and",
      "reviews the Member's invitations;",
      "responds to all invitations, either by written correspondence or by personal telephone call;",
      "maintains files of invitations that have been declined, accepted, or that are tentative/pending; and",
      "ensures that the Member is provided with briefing materials for each event.",
      "maintains the Member's files, including notes, correspondence, and all information relating to travel;",
      "organizes documentation and materials for the Member's annual financial disclosure report;",
      "acts as a liaison for constituents and other visitors that drop by to see the Member;",
      "acts as a liaison between the Member and other Members, committee staff, White House, and government offices and agencies to arrange for the Member's attendance at meetings or to coordinate travel plans; and",
      "performs other duties as assigned."
    ],
    "qualifications": [
      "at least 2 years of office experience;",
      "strong telephone skills;",
      "strong oral and written communication skills;",
      "ability to exercise discretion and independent judgment with respect to prioritization of and recommendations on Member appointments;",
      "proficiency in word processing;",
      "strong organizational and filing skills;",
      "thoroughness and careful attention to detail;",
      "experience making travel reservations and arrangements;",
      "ability to work cooperatively and courteously with others;",
      "temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner; and",
      "availability to work long hours and at night."
    ],
    "how_to_apply": "Please email resume to ResumeService@mail.house.gov with",
    "salary_info": null,
    "contact": "ResumeService@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-369-14",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "U.S. Congressman",
    "location": "Washington, D.C.",
    "posting_date": "2014-12-01",
    "description": "U.S. Congressman seeks a Legislative Assistant to handle a portfolio that includes energy, environment, agriculture, and animal welfare. Responsibilities include researching legislative issues, drafting legislation, meeting with constituents and stakeholders, and advising the Congressman on policy matters. The ideal candidate will have a strong understanding of the legislative process, excellent research and writing skills, and the ability to work independently. Previous experience on Capitol Hill is preferred, but not required.",
    "responsibilities": [
      "Researching legislative issues",
      "Drafting legislation",
      "Meeting with constituents and stakeholders",
      "Advising the Congressman on policy matters"
    ],
    "qualifications": [
      "Strong understanding of the legislative process",
      "Excellent research and writing skills",
      "Ability to work independently",
      "Previous experience on Capitol Hill is preferred, but not required"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and brief writing sample to Rep.Vacancy@mail.house.gov. Please include MEM-369-14 in the subject line.",
    "salary_info": null,
    "contact": "Rep.Vacancy@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-368-14",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space and Technology Majority",
    "location": "Capitol Hill",
    "posting_date": "2014-12-01",
    "description": "The House Committee on Science, Space and Technology Majority is seeking an experienced and proactive Professional Staff Member for its Research and Technology Subcommittee. Applicants should have relevant experience on Capitol Hill (preferably managing a Committee portfolio for a Member), in federal or state government, or the science and technology field. Qualified candidates should possess in-depth knowledge of federally-supported academic research and federal programs to support commercialization of new technology issues. The ideal candidate will have a graduate degree and experience in science and tech policy.",
    "responsibilities": [],
    "qualifications": [
      "Relevant experience on Capitol Hill (preferably managing a Committee portfolio for a Member), in federal or state government, or the science and technology field.",
      "In-depth knowledge of federally-supported academic research and federal programs to support commercialization of new technology issues.",
      "Graduate degree and experience in science and tech policy (ideal)."
    ],
    "how_to_apply": "Interested applicants should send a cover letter and resume to: HouseScienceOpenings@gmail.com.",
    "salary_info": null,
    "contact": "HouseScienceOpenings@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-366-14",
    "position_title": "Legislative Director",
    "office": "Congressman Raúl Labrador (ID-01)",
    "location": null,
    "posting_date": "2014-12-01",
    "description": "Congressman Raúl Labrador (ID-01) is looking for a Legislative Director to lead a legislative team in implementing and advancing the Congressman’s policy and strategic agenda. The successful applicant will have several years of legislative experience and will be responsible for monitoring floor activity, managing the legislative staff and maintaining strong relationships in the state.\n\nThe ideal candidate will have outstanding writing and communication skills and work well under pressure. Western states or Idaho ties are preferred but not required. Policy expertise in defense, healthcare and/or personal liberty/social issues are a plus.",
    "responsibilities": [
      "monitoring floor activity",
      "managing the legislative staff",
      "maintaining strong relationships in the state"
    ],
    "qualifications": [
      "several years of legislative experience",
      "outstanding writing and communication skills",
      "ability to work well under pressure",
      "Western states or Idaho ties are preferred",
      "Policy expertise in defense, healthcare and/or personal liberty/social issues are a plus"
    ],
    "how_to_apply": "Email résumé, cover letter and two writing samples to ID01.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ID01.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-340-14",
    "position_title": "Staff Assistant",
    "office": "Virginia Democrat",
    "location": "Capitol Hill",
    "posting_date": "2014-12-01",
    "description": "Virginia Democrat seeks an energetic, self-motivated, and organized Staff Assistant. Applicants should demonstrate strong interpersonal skills, be comfortable with managing multiple tasks, and have experience working on deadline in a high pressure setting.",
    "responsibilities": [
      "Staffing the front office and greeting visitors",
      "Answering phones",
      "Coordinating and executing flag and tour requests",
      "Managing office intern program",
      "Assisting with mail processing -- reviewing, sorting and responding to constituent mail",
      "Tracking legislative issues",
      "Assisting with research",
      "Coordinating IT services",
      "Helping with other projects as needed"
    ],
    "qualifications": [
      "Experience interacting with the public",
      "Strong writing, communication, and organizational skills",
      "Positive, team-oriented attitude required",
      "Previous Capitol Hill or internship experience preferred",
      "Ties to Virginia and bilingual in Spanish a plus"
    ],
    "how_to_apply": "Please submit resume and cover letter to vacongressionalresumes@gmail.com.",
    "salary_info": null,
    "contact": "vacongressionalresumes@gmail.com",
    "equal_opportunity": null
  }
]