[
  {
    "id": "MEM-089-21",
    "position_title": "CASEWORKER",
    "office": "Congresswoman Elissa Slotkin",
    "location": "Lansing, Michigan",
    "posting_date": "2021-03-22",
    "description": "Congresswoman Elissa Slotkin is seeking a full-time Caseworker to serve in her\nLansing, Michigan office. The Caseworker will report to the Constituent Services\nDirector.",
    "responsibilities": [
      "Serves as the representative for the Member within his or her area of\nresponsibility including answering casework correspondence, verbal\ncommunications with constituents, and acting as liaison with federal, district, and\nlocal agencies;",
      "Handles all casework assignments in a timely and professional manner, seeing\ncasework issues through to resolution;",
      "Assesses casework for problems requiring legislative action and makes\nrecommendations;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to\ncasework, maintains up-to-date files on all cases and categories of information of\nimportance to the Office;",
      "Monitors and updates the Member and District Director on district and local\nissues;",
      "As appropriate, acts as liaison and interfaces with city, county, district, and\nfederal officials, and other persons or groups to form effective relationships for\nthe Member;",
      "Manages the office’s grants program, including proactively identifying\norganizations that would benefit from federal grants, assisting organizations that\nare applying for grants, and recognizing organizations that have received grants.",
      "As appropriate, trains and supervises Interns, to handle Office matters such as\nlogging incoming and outgoing correspondence, handling visitors, telephone\ncalls, and computer operations;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Have experience working directly with constituents/clients in a service provision\nrole",
      "Are able to produce high quality work in a fast-paced environment under tight\ndeadlines",
      "Are hardworking and detail-oriented self-starters",
      "Have a high attention to detail;",
      "Have the ability to exercise discretion and independent judgment in fulfillment\nof casework responsibilities;",
      "Are team players, able to work both collaboratively and individually"
    ],
    "how_to_apply": "Interested candidates should submit a cover letter, a resume with two professional\nreferences, and a writing sample of 1000 words or less to\n“jobs.mi08@mail.house.gov” by March 26, 2021.",
    "salary_info": null,
    "contact": "jobs.mi08@mail.house.gov",
    "equal_opportunity": "The Office of Representative Slotkin is an Equal Opportunity Employer and\nstrongly encourages women, minority, and LGBTQ+ candidates to apply. As an\nEqual Opportunity Employer, the office does not discriminate on the basis of\nrace, color, religion, sex, sexual orientation, gender identity and expression,\nnational origin, disability, military status, age, or parental status."
  },
  {
    "id": "MEM-087-21",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2021-03-22",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible legislative office staff. The candidate must have strong interpersonal skills, be comfortable with managing multiple tasks and able to work well under pressure.\n\nThe staff assistant is responsible for front office duties, including answering and screening telephone calls, mail distribution, room reservations, and responding to constituent requests for flags, tours, and other information. The staff assistant also serves as intern coordinator by recruiting training, scheduling and assigning duties.",
    "responsibilities": [
      "Answering and screening telephone calls",
      "Mail distribution",
      "Room reservations",
      "Responding to constituent requests for flags, tours, and other information",
      "Intern coordinator by recruiting training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge of the District of Columbia",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-086-21",
    "position_title": "Legislative Director",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-03-22",
    "description": "The Office of Congressman Kweisi Mfume seeks a Legislative Director for its Washington, DC office. The ideal candidate is highly-organized, passionate, friendly, and has noteworthy experience.\n\nDue to COVID19 work is often from home.",
    "responsibilities": [
      "Assisting in the development of policy positions and legislative initiatives",
      "Managing and supervising the office's legislative staff"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a resume and cover letter to MD07employment@mail.house.gov. Applications will be considered on a rolling basis, but no application will be considered later than April 16, 2021. No phone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-085-21",
    "position_title": "Communications Director",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-03-22",
    "description": "The Office of Congressman Kweisi Mfume seeks a Communications Director for its Washington, DC office. The ideal candidate is highly-organized, passionate, friendly, and has noteworthy experience.\n\nTraditional and digital communications are managed by the Communications Director including press statements, press releases, mass emails, social media posts, and website updates.\n\nThe position requires an incredible attention to detail. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Due to COVID19, work is often from home.",
    "responsibilities": [
      "Managing and coordinating the messaging and communications activities, including media contacts, for the Member and the office.",
      "Traditional and digital communications are managed by the Communications Director including press statements, press releases, mass emails, social media posts, and website updates."
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a resume and cover letter to MD07employment@mail.house.gov. Applications will be considered on a rolling basis, but no application will be considered later than April 16, 2021. No phone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-084-21",
    "position_title": "Legislative Assistant",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-03-22",
    "description": "The Office of Congressman Kweisi Mfume seeks a Legislative Assistant for its\nWashington, DC office. The ideal candidate is highly-organized, passionate,\nfriendly, and has noteworthy experience.",
    "responsibilities": [
      "Developing and planning legislative initiatives",
      "Monitoring legislative developments within Committees and on the House floor",
      "Tracking legislation, executive action, administrative action, and other governmental developments",
      "Drafting constituent correspondence for the Member",
      "Preparing for committee meetings and hearings",
      "Answering constituent letters",
      "Helping constituents with federal matters"
    ],
    "qualifications": [
      "The position requires an incredible attention to detail."
    ],
    "how_to_apply": "Applicants should send a resume and cover letter\nto MD07employment@mail.house.gov. Applications will be considered on a\nrolling basis, but no application will be considered later than April 16, 2021. No\nphone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Due to COVID19 work is often from home."
  },
  {
    "id": "MEM-083-21",
    "position_title": "Staff/Digital Assistant",
    "office": "New Jersey Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2021-03-22",
    "description": "New Jersey Democrat is seeking a motivated and organized Staff Assistant with excellent oral and written communication skills for the Washington, D.C. office.\n\nAdditional duties include management of the website and social media activities, including official Facebook, Instagram, and Twitter accounts, drafting social media and outreach content, filming, taking photos, and occasionally producing graphics and videos. Knowledge of Adobe Creative Cloud and Canva is a plus.",
    "responsibilities": [
      "Managing front desk operations",
      "Answering telephones",
      "Greeting visitors",
      "Coordinating tours for visiting guests",
      "Processing flag requests",
      "Reviewing, sorting, and responding to incoming constituent correspondence",
      "Addressing constituent matters",
      "Assisting the Member and legislative staff as needed"
    ],
    "qualifications": [],
    "how_to_apply": "Please e-mail cover letter, resume and a brief writing sample to: NJ08jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ08jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-081-21",
    "position_title": "SUBCOMMITTEE STAFF DIRECTOR",
    "office": "Office of Rep. Karen Bass, House Foreign Affairs Subcommittee on Africa, Global Health, and Global Human Rights",
    "location": "Washington, DC",
    "posting_date": "2021-03-22",
    "description": "The Staff Director will support the Chairwoman and lead a small team to support the policy direction of the Africa Subcommittee by implementing the legislative and oversight agenda. Responsibilities include drafting legislation, developing policy and communications objectives; managing implementation of Subcommittee hearings and briefings; drafting official letters, memoranda, and investigative reports; helping publicize activities and investigative findings; organizing and acting as lead staff on Congressional Delegations abroad; managing, mentoring, and directing Subcommittee staff; serving as primary support for Subcommittee Members and staff; and coordinating with the House Foreign Affairs Committee staff.\n\nThis is not an entry-level position. The candidate will be able utilize a broad array of legislative, oversight, and regulatory tools to enact the foreign policy related goals focused on Africa.",
    "responsibilities": [
      "Drafting legislation",
      "Developing policy and communications objectives",
      "Managing implementation of Subcommittee hearings and briefings",
      "Drafting official letters, memoranda, and investigative reports",
      "Helping publicize activities and investigative findings",
      "Organizing and acting as lead staff on Congressional Delegations abroad",
      "Managing, mentoring, and directing Subcommittee staff",
      "Serving as primary support for Subcommittee Members and staff",
      "Coordinating with the House Foreign Affairs Committee staff"
    ],
    "qualifications": [
      "A clear background in foreign policy, with a specific expertise on the continent of Africa",
      "A strong network of ties in the foreign affairs policy community",
      "Strong leadership skills and verifiable experience managing a team",
      "Robust verbal and written communication skills",
      "The ability to manage multiple projects at one time in a fast-paced environment",
      "A deep understanding of the Hill and a proven track record of achieving policy goals"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to CA37.HR@mail.house.gov. Please include “Subcommittee Staff Director” in the subject line.",
    "salary_info": null,
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, disability, military status, age, marital status, or parental status. and candidates of color are strongly encouraged to apply. Please no calls or drop-ins."
  },
  {
    "id": "MEM-078-21",
    "position_title": "Scheduler",
    "office": "Western Republican Member",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "Western Republican Member has opportunity for a motivated, well organized, and talented scheduler.\nQualified candidates will have experience managing a fast-paced schedule for a Member of Congress, processing all incoming schedule requests and arranging travel. The scheduler will work closely with Member, Chief of Staff, and District Director in advancing priorities of the office. This position requires attention to detail, problem solving skills, good judgment and the ability to work as part of a team.",
    "responsibilities": [],
    "qualifications": [
      "Prior relevant experience required",
      "Position requires reasonable flexibility and availability beyond normal office hours."
    ],
    "how_to_apply": "Please email cover letter and resume to uscongressjobs@gmail.com",
    "salary_info": "salary commensurate with experience",
    "contact": "uscongressjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-077-21",
    "position_title": "Legislative Director",
    "office": "Congressman Mondaire Jones (D-NY)",
    "location": "Washington, D.C.",
    "posting_date": "2021-03-22",
    "description": "The Legislative Director will be responsible for advancing the Congressman’s legislative priorities and supporting his work on the Judiciary and Education and Labor Committees. Rep. Jones serves as Freshman Representative to Leadership, co-chair of the Equality Caucus, Deputy Whip of the Congressional Progressive Caucus, and Vice Chair of the Subcommittee on Courts, Intellectual Property, and the Internet.\n\nThe ideal candidate will have substantial experience working on a variety of issues, including education, health, employment, labor, transportation, appropriations, housing, and other issues that impact majority-minority communities. Strong academic credentials, committee experience, and proven leadership skills are required. In addition, the candidate should possess strong oral and written communication skills, the ability to work well under pressure, extensive knowledge of the legislative process, and be available to work long hours.\n\nThis is not an entry-level position; only candidates with previous House-side Hill experience and extensive legislative acumen will be considered and contacted. JD and previous experience serving as a Legislative Director or senior policy staff are strongly preferred.",
    "responsibilities": [
      "Advancing the Congressman’s legislative priorities",
      "Supporting his work on the Judiciary and Education and Labor Committees"
    ],
    "qualifications": [
      "Substantial experience working on a variety of issues, including education, health, employment, labor, transportation, appropriations, housing, and other issues that impact majority-minority communities",
      "Strong academic credentials",
      "Committee experience",
      "Proven leadership skills",
      "Strong oral and written communication skills",
      "Ability to work well under pressure",
      "Extensive knowledge of the legislative process",
      "Available to work long hours",
      "Previous House-side Hill experience",
      "Extensive legislative acumen",
      "JD and previous experience serving as a Legislative Director or senior policy staff are strongly preferred"
    ],
    "how_to_apply": "You can find the application via the following link: https://airtable.com/shriBI8YHiyDXXfR0\n\nDue to the volume of applications we receive, we will only contact you if we decide to move forward with your application. Please no calls, direct emails, or walk-ins.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": "Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with ties to New York (and NY-17 in particular)."
  },
  {
    "id": "MEM-076-21",
    "position_title": "Economist",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an\nEconomist to provide expert advice on labor economics, and support policy\nmaking initiatives in health, education and human services.\nThe Economist must be able to successfully communicate data and findings in an\naccessible manner to a non-technical audience and demonstrate a commitment to\nsocial justice and expanding economic opportunity. Responsibilities include\nassisting labor, health and education policy staff to draft legislation; prepare\nmaterials for hearings, markups and floor activity; and draft memos.\n\nThe Economist is also expected to conduct research, track and report on labor\nmarket and macroeconomic developments; coordinate appropriations and budget\nrelated matters; evaluate regulatory proposals; track other committees’ activities\nthat intersect with the Ed and Labor Committee; provide cost/budget\njustifications for policy priorities; and, coordinate with oversight and\ncommunications teams in support of the Committee’s agenda.",
    "responsibilities": [
      "Assist labor, health and education policy staff to draft legislation",
      "Prepare materials for hearings, markups and floor activity",
      "Draft memos",
      "Conduct research, track and report on labor market and macroeconomic developments",
      "Coordinate appropriations and budget related matters",
      "Evaluate regulatory proposals",
      "Track other committees’ activities that intersect with the Ed and Labor Committee",
      "Provide cost/budget justifications for policy priorities",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "At a minimum a Bachelor’s degree in Economics",
      "Quantitative aptitude",
      "Analytical mindset",
      "Good problem-solving skills",
      "At least 5 years of experience as a professional economist",
      "Strong writing, communication, and organizational skills",
      "Ability to successfully manage multiple projects under deadlines",
      "Display a collaborative disposition"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Economist\" in the subject line.",
    "salary_info": "The salary range is $70K to $95K, commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-075-21",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Professional Staff member to provide expert advice, advance legislation and provide oversight on workplace safety and health, and to support policy making where workplace safety issues cross cut with the Committee’s initiatives in health, education and human services.\n\nThe Candidate will draft legislation, organize and prepare materials for hearings, markups and floor activity; draft memos; research, track and report on workplace safety and health developments; engage with other committees and the full array of stakeholders; evaluate regulatory and legislative proposals from relevant agencies, including OSHA, MSHA, NIOSH, and the Department of Labor’s Office of Workers’ Compensation Programs; and coordinate with oversight and communications teams in support of the Committee’s agenda.",
    "responsibilities": [
      "Draft legislation",
      "Organize and prepare materials for hearings, markups and floor activity",
      "Draft memos",
      "Research, track and report on workplace safety and health developments",
      "Engage with other committees and the full array of stakeholders",
      "Evaluate regulatory and legislative proposals from relevant agencies, including OSHA, MSHA, NIOSH, and the Department of Labor’s Office of Workers’ Compensation Programs",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "Applicants should have a degree in a relevant discipline or at least 3 years of experience in Congress, a regulatory agency, union or other organization working on health and safety issues.",
      "Key to this position is the ability to anticipate emerging issues, support build support for initiatives, and successfully communicate safety and health information in an accessible manner to a nontechnical audience.",
      "The successful applicant should have an analytical mindset and good problem-solving skills.",
      "This position is writing intensive and requires the candidate to have exceptional writing, communication, and organizational skills.",
      "Must demonstrate the ability to successfully manage multiple projects under tight deadlines; display a collaborative disposition; and a commitment to social justice and expanding economic opportunity."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Workplace Safety\" in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-074-21",
    "position_title": "Legislative Counsel",
    "office": "House Ways and Means Committee",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "Progressive California Democrat and member of the House Ways and Means\nCommittee seeks a Legislative Counsel to handle an active immigration and\njudiciary portfolio. This position also leads the member’s work on the Ways and\nMeans Worker & Family Support Subcommittee in addition to handling child\nwelfare, poverty, labor, civil rights, and social security issues.",
    "responsibilities": [
      "preparing and staffing the Member in committee\nhearings and markups",
      "developing and advancing legislation and other policy\npriorities of the Member",
      "researching and advising the Member on policy issues\nand vote recommendations",
      "drafting talking points and speeches",
      "representing the Member in meetings and events"
    ],
    "qualifications": [
      "independent worker and a self-starter",
      "possess the capacity to produce high-quality work in a fast-paced environment",
      "strong communication and writing skills",
      "background in immigration policy (preferred)",
      "able to synthesize complex technical information under tight deadlines",
      "able to work well with a variety of competing interest groups",
      "positive attitude, a good sense of humor and thrive in a team environment",
      "not an entry level position",
      "J.D. preferred but not required"
    ],
    "how_to_apply": "Please e-mail\nyour resume, cover letter, and a short writing sample to ca27jobs@gmail.com.",
    "salary_info": null,
    "contact": "ca27jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, LGBTQ+\nindividuals, people with disabilities, and members of other underrepresented\ncommunities are strongly encouraged to apply."
  },
  {
    "id": "MEM-073-21",
    "position_title": "General Counsel",
    "office": "House Committee on Small Business",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "The House Committee on Small Business seeks a General Counsel to advise the Chairwoman, Members, and staff on the rules and procedures of the Committee and assist senior staff in overseeing the legislative activities of the Committee.\n\nResponsibilities include preparing for hearings, markups, and floor activity, tracking legislation, drafting and editing Committee documents. Candidates should possess excellent writing and organizational skills, be detail-oriented, and demonstrate an ability to work well under pressure and short deadlines.\n\nAn ideal candidate will have prior Hill experience and/or and a strong understanding of the House Rules. This is not an entry level position. The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply.",
    "responsibilities": [
      "Preparing for hearings, markups, and floor activity",
      "Tracking legislation",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Excellent writing and organizational skills",
      "Detail-oriented",
      "Ability to work well under pressure and short deadlines",
      "Prior Hill experience and/or and a strong understanding of the House Rules"
    ],
    "how_to_apply": "Interested applicants should submit a resume, cover letter and writing sample to: hsbcdems@gmail.com with the subject line General Counsel.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-071-21",
    "position_title": "Communications Director",
    "office": "House Select Subcommittee on the Coronavirus Crisis",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "The House Select Subcommittee on the Coronavirus Crisis majority staff seeks a Communications Director. The ideal candidate will be a communications professional with several years of congressional experience.\n\nResponsibilities include developing and implementing the Select Subcommittee’s communications strategy across digital and traditional media, drafting press releases and other materials, responding to media inquiries, coordinating interviews and press events, and preparing the Chairman for these events.\n\nCandidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [
      "Developing and implementing the Select Subcommittee’s communications strategy across digital and traditional media",
      "Drafting press releases and other materials",
      "Responding to media inquiries",
      "Coordinating interviews and press events",
      "Preparing the Chairman for these events"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-070-21",
    "position_title": "DISTRICT OFFICE CASEWORKER",
    "office": null,
    "location": "District Office",
    "posting_date": "2021-03-22",
    "description": "The District Office Caseworker acts a constituent liaison for the Member. This position also monitors and updates the Member and District Director on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Member and constituents and answers casework correspondence and verbal communications with constituents.",
    "responsibilities": [
      "Handles casework assignments;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Acts as a liaison to local, state, and federal officials and other persons or groups to form effective relationships for the Member;",
      "Acts as a liaison to and notifies the appropriate media when the Member will be in the liaison’s area and works with the Member's Communications Director and Scheduler to ensure appropriate media participation;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director, Legislative Director, and Chief of Staff.",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Trains and supervises Staff Assistants, including interns, to handle office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Accepts performance-based criticism and direction;",
      "Meets attendance requirements as established by the office;",
      "Works under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights, and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Strong oral and written communication skills;",
      "Thorough knowledge of local, state, and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "All applicants should submit a Resume and Cover letter",
    "salary_info": null,
    "contact": "MD07Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-068-21",
    "position_title": "Staff Assistant /District Field Representative",
    "office": "Congressman Frank Pallone, Jr.",
    "location": "New Jersey",
    "posting_date": "2021-03-22",
    "description": "The district office of Congressman Frank Pallone, Jr. seeks a hard-working, organized individual to serve as a Staff Assistant & District Field Representative.\n\nThis position primarily entails constituent casework and community outreach.\n\nOther responsibilities include meeting with local community officials, representing the Congressman at community and governmental events, special projects, as well as general office work. Candidates should possess excellent verbal and written communication skills, and must enjoy working with the public.\n\nPrior experience in government, the non-profit sector, community and grassroots organizing is preferred.",
    "responsibilities": [
      "Constituent casework",
      "Community outreach",
      "Meeting with local community officials",
      "Representing the Congressman at community and governmental events",
      "Special projects",
      "General office work"
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Enjoy working with the public",
      "Prior experience in government, the non-profit sector, community and grassroots organizing is preferred"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, writing sample, and references by email to NJ06.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-062-21",
    "position_title": "Legislative Assistant",
    "office": "House Judiciary Committee",
    "location": "Washington, DC",
    "posting_date": "2021-03-22",
    "description": "Rep. Jerrold Nadler, Chairman of the House Judiciary Committee and the most senior Jewish Member in Congress, seeks a Legislative Assistant to handle Israel/Middle East and issues of importance to the American Jewish community, foreign affairs, defense, financial services, and other issues in the Chairman’s Washington, DC office.",
    "responsibilities": [
      "Staffing and preparing the Chairman for meetings and events with Members, outside organizations, and other stakeholders",
      "Serving as a resource to other offices on Israel/Middle East and other issues",
      "Writing statements and briefing materials",
      "Drafting legislation where appropriate",
      "Meeting with stakeholders both with and without the Chairman"
    ],
    "qualifications": [
      "A deep understanding of issues relating to Israel and the relevant stakeholders in this area is required.",
      "Strong writing skills, sound political judgment, and the ability to work closely and collaboratively with others is essential.",
      "Chairman Nadler is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
    ],
    "how_to_apply": "To apply send a resume and cover letter to NY10.DCJOB@mail.house.gov",
    "salary_info": null,
    "contact": "NY10.DCJOB@mail.house.gov",
    "equal_opportunity": "Chairman Nadler’s office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-059-21",
    "position_title": "Legislative Counsel",
    "office": "House Judiciary Subcommittee on Immigration and Citizenship",
    "location": "Capitol Hill",
    "posting_date": "2021-03-22",
    "description": "The House Judiciary Subcommittee on Immigration and Citizenship seeks a hardworking lawyer with significant experience in immigration and nationality law to serve as legislative counsel.\n\nA strong background in immigration law and policy is required. Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are essential. The ideal candidate will have Capitol Hill experience and a minimum of five years of experience in immigration law.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Judiciary Committee on matters involving immigration law and policy",
      "Drafting legislation",
      "Coordinating hearings and witnesses",
      "Preparing Members for hearings and markups",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to other offices within the Democratic Caucus on immigration-related matters"
    ],
    "qualifications": [
      "Strong background in immigration law and policy is required.",
      "Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are essential.",
      "The ideal candidate will have Capitol Hill experience and a minimum of five years of experience in immigration law."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Immigration Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-058-21",
    "position_title": "Digital Director",
    "office": "House Committee on the Judiciary",
    "location": null,
    "posting_date": "2021-03-22",
    "description": "The Democratic staff of the House Committee on the Judiciary is seeking a Digital Director. The Digital Director is responsible for developing the long-term, short-term, and rapid response digital strategy as well as innovative digital content. The Digital Director works closely with chief counsels, the communications team, and the senior staff to advance the Committee's goals and legislative priorities.",
    "responsibilities": [
      "the production of all outward and inward facing products for the Committee, including graphics, images, videos, manuals, presentations, templates, and demonstratives",
      "the development of new and innovative digital strategies to expand the audience",
      "the design and implementation of paid and organic online media strategies",
      "the coordination of hybrid and virtual hearings, including serving as the technical lead and primary liaison with the CAO, HRS, and Committee staff"
    ],
    "qualifications": [
      "Experience in Adobe Photoshop, Illustrator, Premier Pro, After Effects, LightRoom, InDesign, or Audition is preferred.",
      "Experience in HTML, CSS, CRM, UX and UCD, hard-skills technology, big-data analysis and graphical representation, Webex, Zoom, OBS, and Wirecast is preferred.",
      "Mastery in manual photography and videography.",
      "The Committee is looking for candidates who are highly creative, pay close attention to detail, and have a strong work ethic. Willingness to take initiative, generate creative ideas, work on your own or as part of a team, train and mentor digital interns and fellows, and work under deadline pressure is a must."
    ],
    "how_to_apply": "Please send a resume, writing sample and digital portfolio to HouseJud.DemsJob@mail.house.gov",
    "salary_info": null,
    "contact": "HouseJud.DemsJob@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country's population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-049-21",
    "position_title": "Communications Director",
    "office": "Congresswoman Eddie Bernice Johnson (TX-30)",
    "location": "Washington, DC",
    "posting_date": "2021-03-22",
    "description": "The Communications Director will be responsible for overseeing the planning and execution of the overall media strategy and managing the day-to-day communications operation. Candidates must possess excellent written and oral communications skills, as well as be able to make critical decisions independently.",
    "responsibilities": [
      "Working with local and national reporters",
      "Proactively engaging in media outreach",
      "Managing online communications",
      "Drafting press releases and op-eds"
    ],
    "qualifications": [
      "Strong writing skills",
      "Understanding of political messaging",
      "Sound judgment"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and two writing samples to tx30@mail.house.gov No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "tx30@mail.house.gov",
    "equal_opportunity": null
  }
]