[
  {
    "id": "MEM-331-15",
    "position_title": "Committee Clerk/Administrator",
    "office": "House Committee Democratic staff",
    "location": "Washington, DC",
    "posting_date": "2015-10-26",
    "description": "House Committee Democratic staff seeks a detail-oriented Committee Clerk/Administrator to handle committee legislative clerk responsibilities as well as office administrator/payroll work. Hill experience strictly required, preferably 2+ years -- this is not an entry-level position. Committee legislative clerk, hearing coordination, or similar experience strongly preferred, familiarity with Congressional payroll and Hill office administrative work a strong plus.",
    "responsibilities": [
      "Handle committee legislative clerk responsibilities",
      "Office administrator/payroll work"
    ],
    "qualifications": [
      "Hill experience strictly required, preferably 2+ years",
      "Committee legislative clerk, hearing coordination, or similar experience strongly preferred",
      "Familiarity with Congressional payroll and Hill office administrative work a strong plus"
    ],
    "how_to_apply": "Please e-mail your resume and cover letter to demcommitteejob@mail.house.gov. No phone calls, please.",
    "salary_info": null,
    "contact": "demcommitteejob@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-330-15",
    "position_title": "Press Assistant/Speechwriter",
    "office": "Rep. Cheri Bustos (D-IL)",
    "location": "Capitol Hill",
    "posting_date": "2015-10-26",
    "description": "This position will require strong writing skills, attention to detail and a willingness to be flexible. Primary responsibilities will include drafting remarks, op-eds, press releases, talking points, social media, e-newsletters, compiling media clips and franked communication.\nCapitol Hill or campaign experience is preferred, but not a requirement, as are ties to Illinois.",
    "responsibilities": [
      "Drafting remarks",
      "Op-eds",
      "Press releases",
      "Talking points",
      "Social media",
      "E-newsletters",
      "Compiling media clips",
      "Franked communication"
    ],
    "qualifications": [
      "Strong writing skills",
      "Attention to detail",
      "Willingness to be flexible",
      "Capitol Hill or campaign experience is preferred",
      "Ties to Illinois are preferred"
    ],
    "how_to_apply": "To be considered, please send a cover letter, two writing samples and resume to illinois17job@gmail.com with the subject line \"Press Assistant/Speechwriter\". No phone calls or drop-bys, please.",
    "salary_info": null,
    "contact": "illinois17job@gmail.com",
    "equal_opportunity": "The Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-316-15",
    "position_title": "Legislative Correspondent",
    "office": "Senior Midwest Appropriator",
    "location": null,
    "posting_date": "2015-10-26",
    "description": "Senior Midwest Appropriator seeks a Legislative Correspondent to handle issue-specific constituent communications and legislative research.",
    "responsibilities": [
      "Drafting constituent correspondence",
      "Tracking legislation",
      "Meeting with constituents and interest groups",
      "Briefing the Congressman",
      "Generally supporting the legislative and front office operations"
    ],
    "qualifications": [
      "Must be highly dependable, flexible, value responsiveness to constituents, and have superior organizational and writing skills.",
      "Knowledge of the legislative process and Indiana ties a plus."
    ],
    "how_to_apply": "Please send a cover letter, resume, and a short writing sample to in01.resume@mail.house.gov with “Legislative Correspondent” in the subject line. No calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "in01.resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-302-15",
    "position_title": "District Representative",
    "office": "Congresswoman Norma J. Torres",
    "location": "Ontario, CA District Office",
    "posting_date": "2015-10-26",
    "description": "The District Representative will act as a liaison between constituent groups and Congresswoman Torres, in addition to initiating community outreach projects. The District Representative will respond to in-person, written and telephone inquiries from constituents, as well as make legislative and ceremonial presentations on behalf of Congresswoman Torres. The District Representative will also maintain an awareness and involvement in district affairs, representing the Congresswoman at public events in the district. In addition, the District Representative will work with the Press Secretary to maintain Congresswoman Torres' social media accounts.",
    "responsibilities": [],
    "qualifications": [
      "Strong public speaking skills",
      "Flexible schedule; the ability to attend early morning, evening and weekend events",
      "The ability to handle difficult situations with courtesy, tact and compassion",
      "Strong writing skills",
      "Problem solving abilities",
      "The ability to exercise a high degree of initiative",
      "The ability to work independently and use good judgment",
      "The ability to maintain confidentiality",
      "Knowledge of the cities, communities and issues of concern to the 35th Congressional District"
    ],
    "how_to_apply": "Qualified candidates should send a cover letter and resume to caldemresumes@gmail.com with “District Representative” in the subject. No phone calls please.",
    "salary_info": null,
    "contact": "caldemresumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-297-15",
    "position_title": "Communications Director",
    "office": "Conservative western republican",
    "location": null,
    "posting_date": "2015-10-26",
    "description": "Conservative western republican seeks motivated and aggressive Communications Director to work placement of stories in local district media. Must have demonstrated experience working with various forms of media, pitching stories, and solid verbal and writing skills. Understanding of policy issues and ability to critically think of district implications a must.",
    "responsibilities": [],
    "qualifications": [
      "Demonstrated experience working with various forms of media",
      "Pitching stories",
      "Solid verbal and writing skills",
      "Understanding of policy issues",
      "Ability to critically think of district implications"
    ],
    "how_to_apply": "Send resume and cover letter to western.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "western.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-292-15",
    "position_title": "Communications Director",
    "office": "Progressive Tennessee Member",
    "location": "DC",
    "posting_date": "2015-10-26",
    "description": "Progressive Tennessee Member seeks experienced, media-savvy, proactive Communications Director to manage a fast-paced communications operation. Responsibilities include developing and implementing a coordinated and strategic communications plan; identifying emerging press opportunities; writing press releases, talking points, speeches and op-eds; pitching stories and responding to press inquiries; booking interviews on radio and television; scheduling and organizing press events; managing congressional website, Facebook and Twitter accounts; producing a comprehensive weekly e-newsletter and regular print mailings to constituents; and fostering strong relationships with reporters to secure local and national coverage of the member's work.\n\nMust work closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively. Additionally, CD will be responsible for portions of the office's mail operation. Strong political judgment, good sense of humor and ability to work under short deadlines in a rapidly changing environment is required. Must be comfortable with and show good judgment speaking on the record with press. Ideal candidate will have an existing network of press contacts, strong writing skills, political savvy and ability to strategically connect DC policy with district press opportunities.\n\nIdeal candidate will have at least 3 years’ experience in media relations or in journalism. Hill experience and Tennessee ties are a plus, as are knowledge of Judiciary and Transportation issues.",
    "responsibilities": [
      "Developing and implementing a coordinated and strategic communications plan",
      "Identifying emerging press opportunities",
      "Writing press releases, talking points, speeches and op-eds",
      "Pitching stories and responding to press inquiries",
      "Booking interviews on radio and television",
      "Scheduling and organizing press events",
      "Managing congressional website, Facebook and Twitter accounts",
      "Producing a comprehensive weekly e-newsletter and regular print mailings to constituents",
      "Fostering strong relationships with reporters to secure local and national coverage of the member's work",
      "Working closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively",
      "Responsible for portions of the office's mail operation"
    ],
    "qualifications": [
      "At least 3 years’ experience in media relations or in journalism",
      "Strong political judgment, good sense of humor and ability to work under short deadlines in a rapidly changing environment is required",
      "Must be comfortable with and show good judgment speaking on the record with press",
      "Existing network of press contacts, strong writing skills, political savvy and ability to strategically connect DC policy with district press opportunities",
      "Hill experience and Tennessee ties are a plus",
      "Knowledge of Judiciary and Transportation issues is a plus"
    ],
    "how_to_apply": "Interested parties should send a cover letter, resume and 2 writing samples to cohen.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "cohen.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-276-15",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Colorado Republican",
    "location": "Washington, DC",
    "posting_date": "2015-10-26",
    "description": "Responsibilities include: management of constituent mail and social media accounts; execution of 499 program; drafting op-eds, press releases, and talking points; coordinating media efforts; and working directly with the Communications Director. Applicants should be able to write quickly and effectively in a fast paced environment. Colorado ties and Hill experience a plus.",
    "responsibilities": [
      "Management of constituent mail and social media accounts",
      "Execution of 499 program",
      "Drafting op-eds, press releases, and talking points",
      "Coordinating media efforts",
      "Working directly with the Communications Director"
    ],
    "qualifications": [
      "Able to write quickly and effectively in a fast paced environment",
      "Colorado ties and Hill experience a plus"
    ],
    "how_to_apply": "Please send a cover letter, writing sample, and resume to ColoradoRepublican06@gmail.com.",
    "salary_info": null,
    "contact": "ColoradoRepublican06@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-273-15",
    "position_title": "Legislative Director",
    "office": "Senior Member of Congress from the southern US",
    "location": null,
    "posting_date": "2015-10-26",
    "description": "Incumbent will be responsible for driving member legislative initiatives, briefing the member and Chief of Staff on all policy matters, meetings with relevant public interest groups and constituents, providing real time vote recommendations, and assisting the Chief of Staff on policy matters.\n\nPosition requires a comprehensive knowledge of House procedures as well as a working knowledge of all current issues debated in the House.",
    "responsibilities": [
      "Driving member legislative initiatives",
      "Briefing the member and Chief of Staff on all policy matters",
      "Meetings with relevant public interest groups and constituents",
      "Providing real time vote recommendations",
      "Assisting the Chief of Staff on policy matters"
    ],
    "qualifications": [
      "Current/previous Legislative Directors or Senior Legislative Assistants with experience",
      "Comprehensive knowledge of House procedures",
      "Working knowledge of all current issues debated in the House",
      "Team-oriented skill",
      "Outgoing personality",
      "Sense of humor",
      "Strong written and oral communication and analytical skills",
      "Attention to detail",
      "Management skills",
      "Ties to the south (special consideration)",
      "Legal background (special consideration)"
    ],
    "how_to_apply": "Send a cover letter, resume, 2 writing samples, and salary requirements to HouseStaffOpening@gmail.com.",
    "salary_info": null,
    "contact": "HouseStaffOpening@gmail.com",
    "equal_opportunity": null
  }
]