[
  {
    "id": "MEM-193-18",
    "position_title": "Communications Director",
    "office": "New York Congressman",
    "location": "DC or NY",
    "posting_date": "2018-07-09",
    "description": "The communications director is responsible for developing and executing a media strategy, which includes writing press releases, talking points, and op-eds, while also managing the Member's social media pages, web site, pitching story ideas and working closely with reporters. Must have on-the-record experience and strong writing skills. Candidates with NY ties a plus. This is not an entry level position.",
    "responsibilities": [
      "Developing and executing a media strategy",
      "Writing press releases, talking points, and op-eds",
      "Managing the Member's social media pages",
      "Managing the web site",
      "Pitching story ideas",
      "Working closely with reporters"
    ],
    "qualifications": [
      "On-the-record experience",
      "Strong writing skills",
      "NY ties a plus",
      "Not an entry level position"
    ],
    "how_to_apply": "Please send resume and writing sample to ny03.resumes@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "ny03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-186-18",
    "position_title": "Military Legislative Assistant",
    "office": "Republican Member of Congress",
    "location": null,
    "posting_date": "2018-07-09",
    "description": "This position is open for individuals to apply that have a minimum of two years Congressional staff experience and prior military service preferred.\nThe position would include staffing a conservative Republican Member of Congress highly engaged through Committee work on Defense and Veterans policy. Some other policy areas this position would cover include appropriations, foreign affairs, homeland security, immigration, and intelligence.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of two years Congressional staff experience",
      "Prior military service preferred"
    ],
    "how_to_apply": "Please send your resume and a cover letter to defensehilljob@gmail.com.",
    "salary_info": null,
    "contact": "defensehilljob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-185-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Progressive Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2018-07-09",
    "description": "Progressive Democrat seeks a highly motivated, detail-orientated and energetic Scheduler/Executive Assistant with excellent communications, organizational and inter-personal skills to maintain the Member’s daily and long-range official Washington, D.C. and district appointments.\n\nPrimary responsibilities are tracking, evaluating and responding to invitations and incoming requests for appointments, managing all travel and logistical details, and working directly with the Chief of Staff and District Director to ensure smooth daily operations and a seamless schedule between both offices.\n\nAdditionally, the Scheduler manages the Member’s correspondence, performs various additional administrative duties, and effectively relays changes and updated information to the Member and staff in a timely manner.\n\nThe successful candidate is a self-starter, able to multi-task, quickly solve problems in a fast-paced, dynamic, team-oriented and constantly changing environment. The candidate must also be comfortable communicating with a wide variety of people. Previous Capitol Hill scheduling or other related experience is strongly preferred.\n\nThis position requires a positive attitude, an ability to be flexible and adapt quickly to changing circumstances, a strong level of competency and attention to detail and availability to assist the Member outside of regular business hours.",
    "responsibilities": [
      "Tracking, evaluating and responding to invitations and incoming requests for appointments",
      "Managing all travel and logistical details",
      "Working directly with the Chief of Staff and District Director to ensure smooth daily operations and a seamless schedule between both offices",
      "Managing the Member’s correspondence",
      "Performing various additional administrative duties",
      "Effectively relaying changes and updated information to the Member and staff in a timely manner"
    ],
    "qualifications": [
      "Bachelor’s degree is required",
      "1-3 years of prior scheduling experience desired",
      "Previous Capitol Hill scheduling or other related experience is strongly preferred",
      "Positive attitude",
      "Ability to be flexible and adapt quickly to changing circumstances",
      "Strong level of competency and attention to detail",
      "Availability to assist the Member outside of regular business hours",
      "Bay Area ties are a plus"
    ],
    "how_to_apply": "Interested applicants should email their resume, one short writing sample and a list of references to CA17Scheduler@gmail.com. Please no walk-ins, faxes or phone-calls.",
    "salary_info": "The salary is commensurate with the candidate’s level of experience with a wide range of benefits.",
    "contact": "CA17Scheduler@gmail.com",
    "equal_opportunity": "Women and people of color are strongly encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity, or expression, or sexual orientation, or in any of its activities or operations."
  },
  {
    "id": "MEM-182-18",
    "position_title": "Legislative Correspondent",
    "office": "Rep. Tom McClintock",
    "location": "DC",
    "posting_date": "2018-07-09",
    "description": "Rep. Tom McClintock is seeking a Legislative Correspondent in his DC office to manage all aspects of constituent correspondence and handle a small legislative portfolio. Ideal candidates will have knowledge of the legislative process, excellent writing and organizational skills, strong attention to detail, and familiarity with Intranet Quorum (IQ).",
    "responsibilities": [
      "Processing incoming correspondence through Intranet Quorum (IQ)",
      "Drafting timely responses",
      "Reviewing and writing legislation",
      "Meeting with constituents on policy matters"
    ],
    "qualifications": [
      "Knowledge of the legislative process",
      "Excellent writing and organizational skills",
      "Strong attention to detail",
      "Familiarity with Intranet Quorum (IQ)"
    ],
    "how_to_apply": "Please email resume and cover letter to ca04resumes@gmail.com.",
    "salary_info": null,
    "contact": "ca04resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-180-18",
    "position_title": "Legislative Assistant",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2018-07-09",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and self-motivated legislative assistant with a background in law to join our Washington, DC-based policy team.\n\nThe legislative assistant will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The person will be expected to handle a diverse portfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "Applicants must have a JD or equivalent.",
      "Two years of relevant policy experience is preferred, although Hill experience is not required.",
      "The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.",
      "The person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"legislative assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-179-18",
    "position_title": "Executive Assistant",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2018-07-09",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking a professional and dynamic executive assistant to join our Washington, DC-based team.\n\nThe executive assistant will be responsible for efficient and accurate management of all aspects of the member’s daily and long-term schedule, meeting logistics, maintaining files and drafting correspondence, greeting visitors, answering phones, and contributing to other miscellaneous projects as needed. The person also will be involved in scheduling staff meetings and briefings, and helping constituents with their visits to Washington, DC, among other duties.",
    "responsibilities": [
      "Efficient and accurate management of all aspects of the member’s daily and long-term schedule",
      "Meeting logistics",
      "Maintaining files and drafting correspondence",
      "Greeting visitors",
      "Answering phones",
      "Contributing to other miscellaneous projects as needed",
      "Scheduling staff meetings and briefings",
      "Helping constituents with their visits to Washington, DC"
    ],
    "qualifications": [
      "Personable, organized, flexible, and calm under pressure.",
      "Excellent communication and time-management skills",
      "A sense of urgency and the ability to work independently with sound judgment and minimal direction",
      "The ability to work cooperatively and courteously with others.",
      "Applicants must have a BA or equivalent.",
      "Two years of experience in an administrative or scheduling role is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"executive assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-177-18",
    "position_title": "Digital Press Secretary",
    "office": "House Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2018-07-09",
    "description": "The Democratic Staff of the House Committee on Oversight and Government Reform seeks an active and reliable Digital Press Secretary.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-174-18",
    "position_title": "Digital Press Secretary",
    "office": "Oversight Committee",
    "location": "Washington, DC",
    "posting_date": "2018-07-09",
    "description": "Responsibilities include managing the website, crafting content for social media channels, developing graphics and videos, covering hearings and press events, and working with our press team to identify new ways to engage our followers.\n\nSuccessful candidates will have at least 1 to 2 years of communications and digital experience. Candidates with diverse backgrounds are strongly encouraged to apply.\n\nIdeal candidates will be proficient in Adobe programs (Photoshop, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects), CMS, CSS, HTML, manual photography, analytics, and enjoy working in a fast-paced, rapid response environment.",
    "responsibilities": [
      "Managing the website",
      "Crafting content for social media channels",
      "Developing graphics and videos",
      "Covering hearings and press events",
      "Working with our press team to identify new ways to engage our followers"
    ],
    "qualifications": [
      "At least 1 to 2 years of communications and digital experience",
      "Proficient in Adobe programs (Photoshop, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects)",
      "Experience with CMS, CSS, HTML, manual photography, and analytics",
      "Ability to enjoy working in a fast-paced, rapid response environment"
    ],
    "how_to_apply": "Candidates should submit a resume and portfolio with the subject line “Digital Press Secretary” to Oversightpress@mail.house.gov. Please, no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "Oversightpress@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-174-18",
    "position_title": "Press Aide/Press Secretary",
    "office": "West Coast Democrat",
    "location": "Washington, DC",
    "posting_date": "2018-07-09",
    "description": "Duties of the position include but are not limited to:",
    "responsibilities": [
      "Coordinating and managing all district and national communications operations.",
      "Developing and executing a proactive press strategy.",
      "Drafting written materials including press releases, op-eds, and talking points.",
      "Planning and coordinating press conferences and other media events.",
      "Pitching and booking interviews with local and national media outlets.",
      "Oversee all social media platforms and website content.",
      "Build and maintain excellent relationships with members of the district and national and media and act as a spokesperson for the Member."
    ],
    "qualifications": [
      "Exceptional oral and written communication skills, as well as excellent interpersonal skills.",
      "Excellent writing skills with a strong attention to detail.",
      "The ability to multi-task in a fast-paced environment.",
      "Applicants should have superior organizational abilities.",
      "A successful candidate will be discreet, goal oriented, and driven.",
      "A sense of humor and the ability to work well as an individual and as a member of a team.",
      "Spanish fluency is required.",
      "Relevant press experience is required."
    ],
    "how_to_apply": "If interested, please email a resume, cover letter, references, and salary history to CAJobs@mail.house.gov with “Press Aide/Press Secretary” in the subject line.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-173-18",
    "position_title": "CASEWORKER POSITION",
    "office": "DISTRICT OFFICE IN FLORIDA",
    "location": "FLORIDA",
    "posting_date": "2018-07-09",
    "description": "The Caseworker acts as a liaison to federal agencies for constituents and answers casework correspondence and verbal communications with constituents.",
    "responsibilities": [
      "Acts as the representative for the Congressman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal agencies;",
      "Handles casework assignments at the direction of the Director of Casework;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the Director of Casework, District Director.",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to said cases;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the congressional staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "At least 2 years of experience; strong academic credentials.",
      "Alternatively, 2 years of related experience or training in customer/constituent relations or equivalent experience.",
      "Bilingual speaking preferred but not required.",
      "Strong oral and written communication skills;",
      "Thorough knowledge of federal agencies and departments;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and confidentiality procedures",
      "Knowledge of office computer applications; and",
      "Proficiency in word processing."
    ],
    "how_to_apply": "Applicants should send resume and cover letter to fl.conservativerep@gmail.com.",
    "salary_info": null,
    "contact": "fl.conservativerep@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-169-18",
    "position_title": "Policy Advisor",
    "office": "Senior Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2018-07-09",
    "description": "Position will develop and implement legislative initiatives, conduct oversight and investigations, write floor speeches and committee statements, and handle meetings with constituents and interest groups on behalf of Member. Portfolio will cover housing/foreclosure, financial services, banking, economic development, consumer protection, and other issues and special projects as necessary.",
    "responsibilities": [
      "Develop and implement legislative initiatives",
      "Conduct oversight and investigations",
      "Write floor speeches and committee statements",
      "Handle meetings with constituents and interest groups on behalf of Member"
    ],
    "qualifications": [
      "Extensive background in housing and financial policy issues",
      "Exceptional writing ability",
      "Advanced degree (JD, MPA etc.) required",
      "Hill experience strongly preferred"
    ],
    "how_to_apply": "To apply, please email a cover letter and resume with the words “Policy Advisor” in the subject line to job_09@live.com.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  }
]