[
  {
    "id": "MEM-141-17",
    "position_title": "Staffer",
    "office": "U.S. Rep. Lloyd Doggett",
    "location": "San Antonio, Texas",
    "posting_date": "2017-05-08",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks motivated, hard-working staffer for his fast-paced San Antonio federal office. Responsibilities include handling district scheduling requests, administrative duties, intern supervision, and community and constituent work.",
    "responsibilities": [
      "Handling district scheduling requests",
      "Administrative duties",
      "Intern supervision",
      "Community and constituent work"
    ],
    "qualifications": [
      "Highly-organized",
      "Detail orientated",
      "Work well under pressure",
      "Able to manage multiple tasks",
      "Possess excellent writing skills for handling correspondence",
      "Have strong interpersonal skills",
      "Spanish speaking and strong local ties a plus"
    ],
    "how_to_apply": "Email resume, three references, and brief writing sample to DoggettJobs@mail.house.gov. Entitle your email: San Antonio District Office Position. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-140-17",
    "position_title": "Deputy Chief Clerk/Calendar Clerk",
    "office": "House Committee on Homeland Security",
    "location": "Capitol Hill",
    "posting_date": "2017-05-08",
    "description": "The House Committee on Homeland Security, is looking for a non-partisan, Deputy Chief Clerk/Calendar Clerk to assist with Committee operations. Among other duties, the person filling this role will assist the Chief Clerk in the performance of the following:",
    "responsibilities": [
      "Managing Committee hearings and markups",
      "Plan and manage Committee field hearings",
      "Maintain Committee legislative calendar",
      "Prepare Committee archive and historical records"
    ],
    "qualifications": [
      "The ideal candidate for this position is detail oriented, a self-starter and works well independently as well as with others.",
      "Previous experience in a Capitol Hill office required, Committee preferred."
    ],
    "how_to_apply": "Please send resumes and statement of interest to: Resumes.CHS@mail.house.gov.",
    "salary_info": null,
    "contact": "Resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-139-17",
    "position_title": "Professional Staffer or Counsel",
    "office": "House Committee on Energy and Commerce, Subcommittee on Oversight & Investigations",
    "location": null,
    "posting_date": "2017-05-08",
    "description": "House Committee on Energy and Commerce, Subcommittee on Oversight & Investigations is seeking a professional staffer or counsel to work on public health and Food and Drug Administration issues for the Committee's Democratic staff. Experience with congressional oversight, investigations, or issues within the Committee's jurisdiction, a plus. Responsibilities include staffing Congressional hearings, conducting research and investigations, writing and editing, and conducting document review and analysis. Successful candidate will be detail oriented, possessing strong communication and writing skills. Two to five years of professional experience and J.D. preferred but not required, as experience within the areas of the Committee's public health jurisdiction may be equally relevant.",
    "responsibilities": [
      "Staffing Congressional hearings",
      "Conducting research and investigations",
      "Writing and editing",
      "Conducting document review and analysis"
    ],
    "qualifications": [
      "Detail oriented",
      "Strong communication and writing skills",
      "Two to five years of professional experience",
      "J.D. preferred but not required, as experience within the areas of the Committee's public health jurisdiction may be equally relevant."
    ],
    "how_to_apply": "Please send resume, cover letter, writing sample, and at least two professional references to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-138-17",
    "position_title": "Press Secretary",
    "office": "Southern Republican",
    "location": "Washington",
    "posting_date": "2017-05-08",
    "description": "Responsibilities include: writing all press releases, drafting statements, working with both national and district reporters, acting as an official spokesperson, and maintaining the Member’s official website and social media pages.\n\nThe ideal candidate for this position is detail-oriented, proactive, and can thrive in a fast paced environment. Prior Hill communications experience is preferred.",
    "responsibilities": [
      "writing all press releases",
      "drafting statements",
      "working with both national and district reporters",
      "acting as an official spokesperson",
      "maintaining the Member’s official website and social media pages"
    ],
    "qualifications": [
      "detail-oriented",
      "proactive",
      "can thrive in a fast paced environment",
      "Prior Hill communications experience is preferred."
    ],
    "how_to_apply": "Please email your resume to tnjobvacancy@gmail.com to apply.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "tnjobvacancy@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-130-17",
    "position_title": "Legislative Assistant",
    "office": "New Jersey Democrat",
    "location": "Washington, DC",
    "posting_date": "2017-05-08",
    "description": "New Jersey Democrat is seeking a legislative assistant to handle the Member's work on the Transportation and Infrastructure Committee. Responsibilities include: preparing and staffing the Member for committee hearings and markups, developing and advancing legislation and other policy priorities of the Member, researching and advising the Member on bills and other issues, representing the Member in meetings, and drafting constituent correspondence. The ideal candidate will have a transportation background and Hill experience.",
    "responsibilities": [
      "Preparing and staffing the Member for committee hearings and markups",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "qualifications": [
      "Transportation background",
      "Hill experience"
    ],
    "how_to_apply": "Please e-mail cover letter, resume and two brief writing samples to nj08jobs@gmail.com. Please no calls or drop-ins.",
    "salary_info": null,
    "contact": "nj08jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-129-17",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Homeland Security",
    "location": null,
    "posting_date": "2017-05-08",
    "description": "The Majority staff of the House Committee on Homeland Security is seeking a Professional Staff Member. This individual should have extensive background in border and maritime related security issues, and previous experience on the Hill is preferred.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please email a resume and writing sample to resumes.CHS@mail.house.gov.",
    "salary_info": null,
    "contact": "resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-127-17",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington, DC",
    "posting_date": "2017-05-08",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks an experienced Legislative Assistant to work on issues, including education. Excellent written and oral communication skills required. Hill experience and law degree a plus.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill experience a plus.",
      "Law degree a plus."
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-124-17",
    "position_title": "Staff Assistant",
    "office": "Congressman Thomas Massie of the 4th District of Kentucky",
    "location": "Northern Kentucky District Office",
    "posting_date": "2017-05-08",
    "description": "The office of Congressman Thomas Massie of the 4th District of Kentucky, is seeking a pleasant, energetic, highly-organized, detail-oriented, Staff Assistant for the Northern Kentucky District Office.\n\nThe Staff Assistant duties include: greeting visitors, answers the telephone and answers constituent requests for general information, casework, and other inquiries. This position also monitors delivery and pickup of materials, maintains the front office, and assists other staff members with various administrative and legislative duties.",
    "responsibilities": [
      "Provide staff coverage for the District Office, answer constituent phone calls and office visits, and the handling of constituent correspondence",
      "Review and assign incoming casework",
      "Act as a liaison between constituents and other government agencies",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until resolutions are reached",
      "Train and supervise interns to handle routine office matters, such as incoming correspondence, visitors, telephone calls, and other issues that may arise",
      "Maintain office supplies and equipment, and the maintenance of the office organizational system",
      "Handle other tasks as assigned"
    ],
    "qualifications": [
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Understands the value/art of the \"follow-up\"",
      "Works well under pressure while managing multiple tasks with competing priorities",
      "Ability to exercise discretion and independent judgment",
      "Availability to occasionally work nights and weekends, if needed",
      "Ability to work cooperatively and courteously with others",
      "Knowledge of legislative process helpful",
      "Strong oral and written communication skills",
      "Previous office experience a plus"
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis until the position is filled. To apply, please submit via email a resume and cover letter to: KY4district@gmail.com.\nNo phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "KY4district@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-123-17",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2017-05-08",
    "description": "The Committee on Oversight and Government Reform is the principal\ninvestigative body for the U.S. House of Representatives, and Ranking\nMember Elijah Cummings seeks to fill a Counsel position on the Democratic\nstaff. The ideal candidate will be a junior attorney (less than five years of\nexperience) with a background or strong interest in environmental matters,\nincluding investigations, hearings, depositions, and briefings. Candidates with\ndiverse backgrounds and experiences are strongly encouraged to apply.\nCandidates must have superior attention to detail, work well under pressure,\nbe self-motivated, and possess excellent written and oral communication\nskills.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to\noversightjobs@mail.house.gov, with “Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-122-17",
    "position_title": "Press Assistant",
    "office": "Energy and Commerce Committee Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2017-05-08",
    "description": "The Energy and Commerce Committee Democratic Staff seeks a motivated and hardworking communications professional to join fast-paced communications team as a press assistant. Responsibilities include drafting news releases, social media posts, op-eds and talking points; designing graphics for both social media and web content; monitoring social media for trending topics; maintaining and updating press lists; and compiling daily press clips.",
    "responsibilities": [
      "Drafting news releases",
      "Drafting social media posts",
      "Drafting op-eds and talking points",
      "Designing graphics for both social media and web content",
      "Monitoring social media for trending topics",
      "Maintaining and updating press lists",
      "Compiling daily press clips"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Proven ability to perform under pressure while juggling multiple tasks",
      "Sound political judgment",
      "Prior Hill or campaign communications experience preferred",
      "Professional social media and digital experience (including graphic design and photo and video editing) preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to ecdjobs@mail.house.gov. Please no walk ins or phone calls.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-120-17",
    "position_title": "Military Legislative Assistant",
    "office": "Senior Republican Appropriator",
    "location": "Washington office",
    "posting_date": "2017-05-08",
    "description": "Responsibilities will include staffing Member on Defense Appropriations Subcommittee, conducting meetings and advising on defense policy, coordinating with DOD representatives, and supporting Member and district staff to represent the interest of significant military installation within the district.",
    "responsibilities": [
      "Staffing Member on Defense Appropriations Subcommittee",
      "Conducting meetings and advising on defense policy",
      "Coordinating with DOD representatives",
      "Supporting Member and district staff to represent the interest of significant military installation within the district"
    ],
    "qualifications": [
      "Absolute minimum 5 years relevant experience within Department of Defense or as MLA required",
      "Prior military experience preferred",
      "Active TS Clearance required--applicants without active TS or higher will not be considered"
    ],
    "how_to_apply": "Interested applicants should send both cover letter and resume to GOPJobOpportunity@gmail.com.",
    "salary_info": null,
    "contact": "GOPJobOpportunity@gmail.com",
    "equal_opportunity": null
  }
]