[
  {
    "id": "MEM-248-22",
    "position_title": "Legislative Assistant",
    "office": "Rep. Donald McEachin (VA-4)",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "Rep. Donald McEachin (VA-4) is seeking a hardworking, motivated Legislative\nAssistant to primarily assist with the environment, environmental justice and\npublic health portfolio related to the Member’s work on the Environment\nSubcommittee of the House Energy and Commerce Committee.\n\nThe primary responsibilities for this position will be leading the Member’s\nexisting environmental justice and healthcare initiatives, identifying new areas for\nlegislative action, and coordinating with other Members and outside stakeholders.\nAdditional duties will be assigned based on experience and office needs.\n\nThis is not an entry level position. Experience working on issues related to the\nenvironment and/or environmental justice and previous experience working in a\nCongressional office is strongly preferred. The ideal candidate is resilient in the\nface of a fast-paced and ever-changing environment, organized, focused on\ndetails, and driven to affect change.\n\nThe ideal candidate will be proactive in their policy portfolio and comfortable\nworking with diverse sets of constituents, staff, and community and\norganizational groups.",
    "responsibilities": [
      "Leading the Member’s existing environmental justice and healthcare initiatives",
      "Identifying new areas for legislative action",
      "Coordinating with other Members and outside stakeholders",
      "Additional duties will be assigned based on experience and office needs."
    ],
    "qualifications": [
      "Experience working on issues related to the environment and/or environmental justice and previous experience working in a Congressional office is strongly preferred.",
      "The ideal candidate is resilient in the face of a fast-paced and ever-changing environment, organized, focused on details, and driven to affect change.",
      "The ideal candidate will be proactive in their policy portfolio and comfortable working with diverse sets of constituents, staff, and community and organizational groups."
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to McEachin.Jobs@mail.house.gov by Thursday, May 12, 2022.",
    "salary_info": "$68,000",
    "contact": "McEachin.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-246-22",
    "position_title": "Press Secretary/Digital Manager",
    "office": "Congressional LGBTQ+ Equality Caucus",
    "location": "Washington, DC",
    "posting_date": "2022-05-09",
    "description": "The Congressional LGBTQ+ Equality Caucus seeks a hardworking, organized, and detail-oriented Press Secretary/Digital Manager.\n\nThe Congressional LGBTQ+ Equality Caucus, which is Chaired by Rep. David Cicilline (RI-01), works to promote equality for all, regardless of sexual orientation or gender identity, and is committed to achieving the full enjoyment of human rights for LGBTQ+ people in the U.S. and around the world. The Equality Caucus serves as a resource to Members of Congress, their staff, and the public on LGBTQ+ issues at the federal level.\n\nIdeal candidates will be excellent writers, detail-oriented, organized, self-starters, team players, and able to produce high quality work in a fast-paced environment under tight deadlines.\n\nIdeal candidates will also have experience working with the press and creating social media content, including graphics. Experience on Capitol Hill or working on LGBTQ+ issues is a plus but not required. This is not an entry-level position.\n\nCandidates should have 2-3 years of communications experience. Salary is commensurate with experience.",
    "responsibilities": [
      "Developing communication plans, in coordination with the Executive Director, to increase the Caucus’ reach in the news and on digital platforms and to highlight the work of Caucus members;",
      "Managing the Caucus’ website and social media channels, including updating the website, drafting Facebook posts, tweets, and Instagram posts, and creating graphics and videos;",
      "Creating communication resources for Caucus Member offices, including social media toolkits, messaging guidance, and talking points;",
      "Drafting press releases, communicating with the press, and organizing press conferences;",
      "Drafting the Caucus’ weekly newsletter;",
      "Building and maintaining relationships with Caucus Members’ communications staff;",
      "Assisting the Executive Director, as needed, with coordinating events and briefs, membership outreach, tracking LGBTQ+ legislation, and policy work;",
      "Other duties as assigned."
    ],
    "qualifications": [
      "hardworking",
      "organized",
      "detail-oriented",
      "excellent writers",
      "self-starters",
      "team players",
      "able to produce high quality work in a fast-paced environment under tight deadlines",
      "experience working with the press",
      "experience creating social media content, including graphics",
      "2-3 years of communications experience"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and a short writing sample, as a single PDF, to equality.caucushire@mail.house.gov. Please put “Press Secretary/Digital Manager – [Your First and Last Name]” in the subject line.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "equality.caucushire@mail.house.gov",
    "equal_opportunity": "The LGBTQ+ Equality Caucus is an Equal Opportunity Employer. The caucus benefits from a staff that reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The caucus does not discriminate on the basis of race, color, religion, sex (including marital or parental status), sexual orientation, gender identity and expression, disability, age, or national origin."
  },
  {
    "id": "MEM-245-22",
    "position_title": "Caseworker",
    "office": "Congressman Ted Lieu",
    "location": "Los Angeles District Office, West Los Angeles",
    "posting_date": "2022-05-09",
    "description": "Primary responsibilities include assisting constituents with federal casework, assisting the Casework Supervisor with casework outreach, intake, and processing.\n\nThe Caseworker would also attend community events and conduct casework outreach directly with constituents. Caseworkers meet frequently with constituents and liaise with federal agencies and help organize outreach events for the Congressman's office.\n\nThe successful applicant should have experience working on federal casework, must have a positive attitude and the ability to work and set priorities in a fastpaced and challenging environment. Strong writing and verbal communications skills are essential. At least one year of experience working for an elected official or community-based organization is strongly preferred. A valid California Driver License and automobile are required. Bilingual skills are a plus.",
    "responsibilities": [
      "Assisting constituents with federal casework",
      "Assisting the Casework Supervisor with casework outreach, intake, and processing",
      "Attend community events",
      "Conduct casework outreach directly with constituents",
      "Liaise with federal agencies",
      "Help organize outreach events"
    ],
    "qualifications": [
      "Experience working on federal casework",
      "Positive attitude",
      "Ability to work and set priorities in a fast-paced and challenging environment",
      "Strong writing and verbal communications skills",
      "At least one year of experience working for an elected official or community-based organization is strongly preferred",
      "Valid California Driver License and automobile are required",
      "Bilingual skills are a plus"
    ],
    "how_to_apply": "If interested, please send a resume, cover letter, and two short writing samples no later than May 20, 2022 to:\n\nNICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33) 1645 Corinth Avenue, Suite #101 Los Angeles, CA 90025\nLieu.Staff@mail.house.gov",
    "salary_info": "full-time with federal benefits",
    "contact": "NICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33)\nLieu.Staff@mail.house.gov",
    "equal_opportunity": "This office is an Equal Opportunity Employer."
  },
  {
    "id": "MEM-244-22",
    "position_title": "Staff Assistant",
    "office": "Representative Spanberger",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-09",
    "description": "Representative Spanberger seeks a Staff Assistant for her Washington, D.C. office. Qualified applicants should be motivated self-starters, highly organized, detail-oriented, able to multitask, have exceptional interpersonal skills, and ability to thrive in a fast-paced environment.\n\nCandidates must demonstrate excellent “people skills,” most importantly displaying compassion in all interactions, and a strong commitment to providing outstanding constituent service.\n\nThe ideal candidate should: be able to think on their feet, be a problem-solver, demonstrate excellent oral and written skills, maintain a positive demeanor, and demonstrate resilience in a busy environment.",
    "responsibilities": [
      "Managing the front office, including answering, appropriately logging, and directing telephone calls",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Distributing hard and electronic mail",
      "Other administrative duties",
      "Serve as the office tour coordinator and will be responsible for managing constituent requests for Capitol and White House tours, as well as constituent requests for flags flown over the Capitol"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Highly organized",
      "Detail-oriented",
      "Able to multitask",
      "Exceptional interpersonal skills",
      "Ability to thrive in a fast-paced environment",
      "Excellent “people skills,” most importantly displaying compassion in all interactions",
      "Strong commitment to providing outstanding constituent service",
      "Able to think on their feet",
      "Problem-solver",
      "Excellent oral and written skills",
      "Maintain a positive demeanor",
      "Demonstrate resilience in a busy environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, 1-page writing sample, and two references to spanberger.inquiries@mail.house.gov with “DC Staff Assistant” in the subject line. Applications will be reviewed on a rolling basis.",
    "salary_info": "$50,000",
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-243-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Seth Moulton",
    "location": "Capitol Hill",
    "posting_date": "2022-05-09",
    "description": "Congressman Seth Moulton is seeking a Legislative Assistant.\nThe office is looking for a principled, mission-driven, and energetic candidate\nwith a domestic policy background. The Legislative Assistant will assist in the\ndevelopment of strategic policy goals and support the Member’s work on the\nHouse Committee on Transportation and Infrastructure. The Legislative Assistant\nwill advise the Member on assigned legislative areas including transportation,\ninfrastructure, education, labor, and appropriations.\nThis is not an entry level position. A bachelor’s degree is required, advanced\ndegrees preferred. A minimum of 2 years of experience on Capitol Hill in\ndomestic policy and/or other legislative experience is required. Depending on\nprofessional experience, the candidate may be eligible to start as Senior\nLegislative Assistant.\nSuccessful Applicants will have the ability to think creatively, operate\nentrepreneurially, and build and motivate strong and effective coalitions of\npartners on and off the Hill.",
    "responsibilities": [
      "Long-term and short-term legislative planning for the Member and for ensuring\nprogress on the Member's domestic legislative goals within the Legislative\nAssistant’s portfolio",
      "Staffing the Member for all House Committee on Transportation and\nInfrastructure activities including full committee and subcommittee hearings and\nmarkups",
      "Writing and developing a range of high-quality written materials, including\npolicy reports and policy memos",
      "Tracking policy proposals and implementation in assigned issue areas",
      "Representing the Member externally by attending policy briefings and meetings"
    ],
    "qualifications": [
      "Bachelor’s degree is required, advanced degrees preferred.",
      "A minimum of 2 years of experience on Capitol Hill in domestic policy and/or other legislative experience is required."
    ],
    "how_to_apply": "To Apply, please provide a resume and cover letter to ma06.resumes@mail.house.gov, with the subject line “Legislative Assistant” by Wednesday, May 18, 2022 at 11:59pm.",
    "salary_info": null,
    "contact": "ma06.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-242-22",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Hill",
    "posting_date": "2022-05-09",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a Legislative Assistant with Hill experience. This is not an entry level position. Excellent written and oral communication skills required. Advanced degree a plus.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience",
      "Excellent written and oral communication skills required",
      "Advanced degree a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use this title on your email: “Legislative Assistant Application”\nNo drop-ins or calls please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-241-22",
    "position_title": "Press Assistant/Deputy Press Secretary",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "The Democratic staff of the House Committee on Veterans’ Affairs seeks a Press Assistant/Deputy Press Secretary to work closely with the Communications Director to implement the Committee Communications Strategy.\n\nThey will lead the drafting of press materials, monitor media and issues relevant to the Committee, primarily handle press inquiries and media relationships, and largely be responsible for day-to-day press operations. On occasion, and in consultation with the Communications Director or Senior Staff, they will serve as the on-the-record spokesperson.",
    "responsibilities": [
      "Lead the development of talking points, remarks, statements, press releases, advisories, and caucus messaging guides",
      "Lead the coordination, preparation, and execution of media interviews, speaking engagements, and press conferences",
      "Monitor and track media appearances, manage media relationships, and work with policy subject matter experts to identify opportunities for media engagement",
      "Assist with rapid response efforts",
      "Assist Committee Member offices with any press related needs",
      "Hire, manage, and supervise press interns",
      "Staff Chairman at press events"
    ],
    "qualifications": [
      "3+ years’ experience working in communications or related field",
      "Excellent written and verbal communications skills",
      "Willing to execute day-to-day tasks and work successfully within a team",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response"
    ],
    "how_to_apply": "All candidates are required to complete an Online Application via https://docs.google.com/forms/d/e/1FAIpQLScLDNEck7GezSWFthWkageU5X4EG9JmGIaxSTeJfOhLDt4BZw/viewform to be considered. There you can upload your resume, cover letter, and writing sample.",
    "salary_info": "Starting salary is $55K. Title and salary negotiable depending on experience.",
    "contact": null,
    "equal_opportunity": "In an effort to build a diverse and more inclusive work environment, the committee strongly encourages veterans, minorities, women, people with disabilities, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-240-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2022-05-09",
    "description": "The Legislative Assistant will be responsible for handling a broad range of domestic policy issues, including the member’s Science and Technology Committee work. The Legislative Assistant will be responsible for drafting and monitoring legislation, preparing materials for committee hearings and markups, representing the Member in meetings/briefings, working with constituent organizations, and performing other tasks as assigned.\n\nThe ideal candidate will have a strong understanding of the legislative process, excellent writing and communication skills, and a demonstrated ability to work effectively in a fast-paced office. Press and communications experience is also a plus, but not required.",
    "responsibilities": [
      "Handling a broad range of domestic policy issues, including the member’s Science and Technology Committee work.",
      "Drafting and monitoring legislation",
      "Preparing materials for committee hearings and markups",
      "Representing the Member in meetings/briefings",
      "Working with constituent organizations",
      "Performing other tasks as assigned"
    ],
    "qualifications": [
      "Hill experience in a legislative role or comparable experience is required.",
      "Strong understanding of the legislative process",
      "Excellent writing and communication skills",
      "Demonstrated ability to work effectively in a fast-paced office",
      "Press and communications experience is a plus, but not required."
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to legislativeposition2022@gmail.com",
    "salary_info": null,
    "contact": "legislativeposition2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-239-22",
    "position_title": "Constituent Services Representative",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "Willingboro office",
    "posting_date": "2022-05-09",
    "description": "The Constituent Services Representative is a field representative and caseworker on behalf of the Congressman that acts as a public-facing community representative to constituents and organizations and as a liaison to various federal, state and local agencies. The Constituent Services Representative assesses problems and finds solutions in a professional manner and screens and refers cases, as appropriate.\n\nIdeal candidates will have experience managing casework, be exceptionally wellorganized and attentive to detail, be able to adhere to established casework processes, have the ability to work nights and weekends, have strong oral and written communication skills, including public speaking skills, excel at time management, manage multiple tasks simultaneously, and be able to maintain good working relationships with the Congressman, staff and constituents. An even temperament, ability to deal effectively with a wide range of personalities, and creative problem solving skills are essential.",
    "responsibilities": [
      "Interact with constituents via phone, email and in person",
      "Establish, follow through and complete constituent casework",
      "Keep accurate and complete case notes and alerts at all times",
      "Interact with assigned federal agencies",
      "Interact with local, county and state offices to make and accept referrals",
      "Establish efficient processes to handle common issues and problems",
      "Cross-train and accept changing areas of focus as needed",
      "Build and maintain relationships with constituents, community leaders and organizations on behalf of the Member",
      "Monitor and update the Member and Senior Staff of important local issues",
      "Draft memos and staff the Member at public events and meetings",
      "Manage special projects independently under the supervision of the Outreach Director and/or District Director"
    ],
    "qualifications": [
      "Casework or other high volume, high touch work",
      "Time spent in a customer service role",
      "Prior experience in community organizing",
      "Work with federal, state or local government",
      "Experience with casework IQ program is a plus",
      "Candidates with ties to New Jersey are strongly encouraged to apply",
      "Candidates must be able to work a flexible schedule, including nights and weekends"
    ],
    "how_to_apply": "Email cover letter, resume and 2-3 references to NJ03resumes@mail.house.gov with the subject line “Constituent Services Representative: [NAME]”. Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-238-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-09",
    "description": "Congressman Andy Kim (NJ-03) seeks a hard-working Legislative Assistant to join his policy team. This is not an entry-level position and 1-2 years of experience as a Legislative Assistant in the House or Legislative Correspondent in the Senate is required.\n\nThe ideal applicant will have experience in formulating and advancing legislation and a demonstrated ability to brief a Member of Congress on complex policy issues both orally and in writing. Successful applicants will work quickly under pressure, have good working knowledge of House legislative processes and procedures, excellent organization and communication skills, and work well with others. This position reports to the Legislative Director and works closely with the rest of the Congressman's legislative and communications teams.",
    "responsibilities": [
      "Handles a portfolio of legislative issues, which may be tailored to the candidate's expertise but will likely include: veterans, transportation & infrastructure, economic development, technology & innovation, tax/financial services, and Small Business Committee.",
      "Tracks legislation and other developments in assigned issue areas.",
      "Takes constituent and advocacy group meetings.",
      "Builds relationships with district and national stakeholders and advocacy organizations.",
      "Reviews legislation and makes recommendations for cosponsorships and letters for the Congressman to sign.",
      "Builds support for the Member's legislation and develops/implements ideas for new legislation to advance the Congressman's strategic priorities, with guidance from the Legislative Director.",
      "Exercises discretion and independent judgment in the formulation and recommendation of policy positions for the Member.",
      "Reviews draft press releases and social media in assigned issue areas for technical accuracy."
    ],
    "qualifications": [
      "Knowledge of or ties to New Jersey a plus"
    ],
    "how_to_apply": "Email a cover letter, resume, a short writing sample, and 2-3 references to NJ03Resumes@mail.house.gov with the subject line, “Legislative Assistant: [Your Full Name]” Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-237-22",
    "position_title": "Digital Director / Press Secretary",
    "office": "Congressman Jake Auchincloss (D, MA-04)",
    "location": "Washington, DC or Massachusetts",
    "posting_date": "2022-05-09",
    "description": "The office of Congressman Jake Auchincloss (D, MA-04) is seeking a Digital Director / Press Secretary to work closely with the Communications Director to elevate the Member’s communications operation and strategically run a social media program.\n\nThis position will require work outside standard office hours and can be based in either Washington, DC or Massachusetts with regular travel required. Previous congressional or campaign experience and photography/videography/graphic design skills are strongly preferred.\n\nPlease indicate in the application if you have on-the-record experience.",
    "responsibilities": [
      "Staffing the Member at open press events in the District and DC",
      "Working closely with the District team to amplify local events",
      "Media monitoring",
      "Maintenance of the Member’s social media accounts",
      "Drafting and posting content for social media",
      "Producing graphics and videos",
      "Editing photos and videos",
      "Maintaining the website",
      "Compiling daily press clips",
      "Assisting with the drafting of press releases and media advisories, e-newsletters, franked mailings, opeds"
    ],
    "qualifications": [
      "Organized",
      "Detail-oriented",
      "Tech-savvy",
      "Able to work long hours in a fast-paced environment",
      "Superior writing and proofreading skills",
      "Ability to work closely and collaborate with Senior Staff both in the District and in DC",
      "Previous experience building audiences online and maintaining social media accounts",
      "Excellent writing skills",
      "Ability to work well on a team",
      "Experience in principal management",
      "Experience meeting tight deadlines under pressure"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and 1-2 writing samples or sample graphics/videos or tweets to AuchinclossJobs@gmail.com.",
    "salary_info": "Title and salary are competitive and negotiable based on previous experience.",
    "contact": "AuchinclossJobs@gmail.com",
    "equal_opportunity": "Congressman Auchincloss’ office is an equal opportunity employer.\nThe office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-236-22",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-09",
    "description": "Congressman Mark Pocan (WI-02), member of both the House Appropriations and Education & Labor Committees, is seeking an experienced and enthusiastic Legislative Assistant. Ideal candidate will have 2-3 years of Hill experience, a good understanding of House procedures, an understanding of developing and tracking legislative initiatives and political awareness. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. Job responsibilities will include drafting legislation, writing hearing statements, legislative memos, constituent correspondence and preparing briefing materials.\n\nA sense of humor is greatly appreciated.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements",
      "Writing legislative memos",
      "Writing constituent correspondence",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "2-3 years of Hill experience",
      "Good understanding of House procedures",
      "Understanding of developing and tracking legislative initiatives",
      "Political awareness",
      "Excellent writing skills",
      "Excellent verbal skills",
      "Excellent organizational skills",
      "Ability to be a self-starter"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to WI02JobOpening@gmail.com with “Legislative Assistant” in the Subject Line. Job opening closes at the end of business on Friday, May 20th. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-234-22",
    "position_title": "Research Assistant, Subcommittee on Economic Opportunity",
    "office": "House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "Provides administrative, legislative, and research support to Subcommittee staff, and assists with other duties as assigned.",
    "responsibilities": [
      "Answering the telephone and responding to caller inquiries",
      "Reviewing incoming mail and preparation of correspondence",
      "Maintaining Subcommittee archive, activities report, and relevant publications",
      "Assisting with Subcommittee hearings and full Committee hearings on matters within Subcommittee jurisdiction",
      "Maintaining the Subcommittee’s outstanding deliverable requests made to the Department of Veterans Affairs (VA)",
      "Determining and tracking the status of pending legislation",
      "Participating in staff-level negotiations, to include knowledge of background information on legislation being considered",
      "Assisting Subcommittee staff in organization of, and preparation for, hearings, to include determination of Minority agenda, preparation of research and hearing briefing memo, and development of questions",
      "Conducting meetings with VA, veteran service organizations or other scheduled parties",
      "Briefing subcommittee Members’ staff",
      "Drafting remarks for Ranking Member and suggested questions for hearings",
      "Preparing memorandums for the full Committee and Subcommittee Ranking Members on matters under the jurisdiction of the Subcommittee",
      "Research preparation of hearings by reviewing previous hearing transcripts, relevant statutes, and VA policy",
      "Responsible for all other duties assigned by the full Committee Ranking Member, Staff Director, or Deputy Staff Director; and assist other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "Work, internship, or other experience in a professional environment",
      "Strong writing skills",
      "Proficiency in Microsoft Office",
      "Organizational skills",
      "Problem solving skills",
      "Strong verbal communication",
      "Team oriented",
      "Ability to work well under pressure",
      "Strong attention to detail"
    ],
    "how_to_apply": "Qualified candidates please send resumes and cover letter only to the following email address: VAR.Resumes@mail.house.gov with “EO Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-232-22",
    "position_title": "Counsel or Professional Staff",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation’s response to the coronavirus crisis is efficient, effective, and equitable.\nChairman James E. Clyburn seeks to fill a Counsel or Professional Staff position on the Majority staff. The ideal candidate will be an attorney or policy professional with several years of investigative or litigation experience. Recent law school graduates with relevant professional experience prior to attending law school may be considered on a case-by-case basis.",
    "responsibilities": [
      "Leading investigations",
      "Conducting depositions and transcribed interviews",
      "Preparing for hearings",
      "Drafting reports"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Counsel / Professional Staff” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-231-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-05-09",
    "description": "Constituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.",
    "responsibilities": [
      "Assists the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Help with neighborhood events",
      "Resolving the problems of constituents",
      "Handle multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia",
      "Ability to work independently",
      "Think outside the box about various constituent issues and community events",
      "Prior community or casework experience is helpful"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-230-22",
    "position_title": "Chief of Staff",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": "Washington D.C. and district office(s)",
    "posting_date": "2022-05-09",
    "description": "The Office of Congresswoman Alma S. Adams, Ph.D. is seeking a Chief of Staff to act as the Member's chief policy advisor.\n\nThis position develops and implements all policy objectives, strategies and operating plans for the Member's offices and manages and directs all activities and staff of the Member's Washington D.C. and district office(s), as well as coordinates the activities of the Member with Leadership and committee office(s).",
    "responsibilities": [
      "Supervisory: Directly supervises up to eighteen full time employees and up to four part-time and temporary employees; carries out responsibilities in accordance with office policy and applicable laws. Responsibilities include interviewing, hiring and training employees; planning, assigning and directing work; appraising performances; rewarding and disciplining employees; addressing complaints; and resolving problems;",
      "Manages the Washington, D.C. and district office staffs;",
      "Sets and oversees the administration of office goals, policies and procedures and has oversight responsibility for all personnel matters including hiring, salary, and disciplinary decisions;",
      "Manages long-term legislative plan of the Member;",
      "Coordinates and supervises the efforts of all employees including the press and constituent service staffs;",
      "Conducts staff meetings;",
      "Approves strategies and tactics on legislative issues;",
      "Acts as the Member's principal liaison and responds to office visits and telephone inquiries from constituents and various interest groups;",
      "Maintains a good working relationship with the Member, staff, constituents, stakeholders, and other political offices;",
      "Speaks to local and national groups, as well as the press, when the Member is unavailable;",
      "Oversees the office budget;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Meets attendance requirements as established by the office;",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned by the Member."
    ],
    "qualifications": [
      "A minimum of a bachelor’s degree in political science or related field, including strong academic credentials is preferred. Alternatively, five years of related experience or training in management and/or legislation or equivalent experience.",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Thorough knowledge of the Members' Congressional Handbook and House Rules;",
      "An understanding of the district and federal political process;",
      "Provides necessary organization, supervisory leadership, and motivation to manage a House office;",
      "Ability to perform essential job functions above;",
      "Ability to maintain a good working relationship with the Congresswoman, staff and constituents;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Excellent oral and written communication skills;",
      "Knowledge of the office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "Qualified applicants should send a cover letter and resume, along with three references to nc12.resume@mail.house.gov. Please use CHIEF OF STAFF in the subject line when submitting your materials.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-229-22",
    "position_title": "Scheduler",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "DC and the District",
    "posting_date": "2022-05-09",
    "description": "Main responsibilities include maintaining the Member's daily and long-term schedules for both DC and the District; organizing and evaluating all incoming meeting requests and invitations; keeping the Member on schedule throughout the day; working with legislative and communications staff to ensure the Member is prepared for events/meetings; coordinating travel arrangements; processing and managing expenses and reimbursements for the Member; and communicating with constituents by phone and email to address requests, concerns, and questions.\n\nAdditional responsibilities include other administrative tasks.",
    "responsibilities": [
      "Maintaining the Member's daily and long-term schedules for both DC and the District",
      "Organizing and evaluating all incoming meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Coordinating travel arrangements",
      "Processing and managing expenses and reimbursements for the Member",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented and able to multi-task",
      "Resourceful",
      "Team-oriented",
      "Positive attitude",
      "Availability outside of regular business hours including some weekend availability as needed.",
      "Previous scheduling experience (at least one year in a similar position).",
      "Southern California | Los Angeles Metro area ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three references with “SCHEDULER” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-228-22",
    "position_title": "Press Secretary|Digital Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "Representative Nanette Diaz Barragan (CA-44) is seeking a talented and highly motivated individual to assume the role of Press Secretary|Digital Director. The person chosen for the position will work closely with the Communications Director to develop and execute the Congresswoman’s long-term communications plan. They will be charged with overseeing the communications schedule, managing the Member’s digital media accounts, and working with local and national reporters.\n\nThe Press Secretary|Digital Director will be responsible for a wide range of critical functions, including developing original social media content, designing graphics, editing and posting videos, maintaining the office’s website, and managing media lists. Additionally, they will assist the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials.\n\nSuccessful applicants will need to demonstrate their writing ability by completing a writing and editing test.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics",
      "Editing and posting videos",
      "Maintaining the office’s website",
      "Managing media lists",
      "Assisting the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials."
    ],
    "qualifications": [
      "Must have strong writing, editing, proofreading skills",
      "Be proficient in photography, video recording and editing",
      "Must be detail-oriented, news savvy and able to work in a fast-paced, demanding work setting - a sense of humor and ability to be a team player is a must.",
      "Previous experience in press or relevant social media experience is required.",
      "Experience with Adobe Creative Cloud Products are a plus.",
      "Southern California|Los Angeles ties are a plus.",
      "Spanish fluency preferred."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples with “Press Secretary” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-227-22",
    "position_title": "Legislative Assistant|CHC Liaison",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC House office",
    "posting_date": "2022-05-09",
    "description": "with the primary responsibilities of handling the Member’s immigration, foreign affairs, military, and criminal justice, Homeland Security Committee work, and serve as Member’s liaison to the Congressional Hispanic Caucus (CHC).\nCandidates must have a proven record of proposing legislation, developing amendments, and leading on letters.",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various legislative vehicles",
      "Preparing hearing binders and questions for witnesses for Homeland Security Committee hearings",
      "Drafting talking points, vote recommendations and other materials",
      "Monitoring and analyzing legislative developments, committee proceedings, news stories and other relevant info",
      "Representing the Member in meetings with constituents and stakeholders"
    ],
    "qualifications": [
      "Ability to work under pressure and meet deadlines in a fast-paced work environment.",
      "Strong organizational and time management skills, excellent written and verbal communication skills, and a keen attention to detail are required.",
      "Spanish language skills preferred.",
      "Southern California ties a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-226-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "San Pedro, CA",
    "posting_date": "2022-05-09",
    "description": "Candidate should possess excellent verbal and written communication skills, have the proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests, highly organized, and the ability to manage multiple tasks and competing deadlines simultaneously.",
    "responsibilities": [
      "Answer and log incoming phone calls, conducts casework intake, and work on casework through completion",
      "Identify event and correspondence opportunities in their geographic and issue areas",
      "Staff the Congresswoman and serves as staff representative for the Congresswoman at community meetings and events",
      "Lead or assist with planning, organizing, and executing district outreach efforts in their geographic and issue areas",
      "Identifying issues related to federal programs for possible legislation and|or letters",
      "Managing correspondence and acknowledgements from the office",
      "Meeting with constituent and community leaders and developing relationships and networks in their geographic and issue areas",
      "Working with community groups and organizations, local elected officials, and others in the District to identify potential opportunities for federal funding",
      "Serving as a liaison with federal, state, and local agencies, and committees"
    ],
    "qualifications": [
      "Knowledge of communities within California's 44th District and Spanish fluency preferred.",
      "A car and good driving record required.",
      "Candidates must also be able to work a flexible schedule, including some nights and weekends as required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with “CA44 Field Rep” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-225-22",
    "position_title": "District Staff Assistant",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "San Pedro, CA",
    "posting_date": "2022-05-09",
    "description": "The District Staff Assistant greets visitors, answers the telephone, supervises the district internship program, and responds to constituent requests for general information and other inquiries. This position maintains the front office and assists district office staff with various administrative duties while maintaining an external agenda that interacts frequently with constituents. The position will also support aspects of the Office’s outreach function.\n\nThe District Staff Assistant will also be integrated into the Congresswoman’s scheduling team to assist in the various aspects of District Scheduling.",
    "responsibilities": [
      "Greets visitors",
      "Answers the telephone",
      "Supervises the district internship program",
      "Responds to constituent requests for general information and other inquiries",
      "Maintains the front office",
      "Assists district office staff with various administrative duties",
      "Maintains an external agenda that interacts frequently with constituents",
      "Supports aspects of the Office’s outreach function",
      "Assists in the various aspects of District Scheduling"
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Strong interpersonal skills",
      "Proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests",
      "Highly organized",
      "Ability to manage multiple tasks and competing deadlines simultaneously",
      "Able to work in a fast-paced environment",
      "Familiarity with communities in California’s 44th District",
      "Spanish fluency and a car (with good driving record) preferred",
      "Candidates must also be able to work a flexible schedule, including some nights and weekends as required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with “CA44 Staff Assistant” in the subject line to CA44Resumes@mail.house.gov",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-224-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-09",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, and energetic.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\n\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging. The Communications Director is responsible for maintaining the Congresswoman's voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman's values and advocacy to a diverse constituent base.\n\nAdditionally, the Communications Director must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude.",
    "responsibilities": [
      "Oversee day-to-day press operations, including coordinating and managing the press team",
      "Responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member's social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters and franked mailings"
    ],
    "qualifications": [
      "This is NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill.",
      "They must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Fluency in Spanish is a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-221-22",
    "position_title": "Digital/Press Assistant",
    "office": "Congresswoman Gwen Moore (WI-04)",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "Congresswoman Moore is a member of the Ways and Means Committee, Science, Space, and Technology Committee, and the Select Committee on Economic Disparity and Fairness in Growth, and her office is looking to expand its communications team and digital outreach.\n\nThe Digital/Press Assistant position will collaborate in a supportive team. This position reports to the Chief of Staff and the Communications Director. Their responsibilities will include drafting newsletters, creating digital content for social media platforms, such as videos and graphics, and assisting with press events and media interviews.\n\nA strong candidate will be creative, a self-starter, and adaptable in a fast-paced environment. Great writing skills, experience in graphic design, and a strong work ethic are essential for this position. Wisconsin ties are a plus.",
    "responsibilities": [
      "drafting newsletters",
      "creating digital content for social media platforms, such as videos and graphics",
      "assisting with press events and media interviews"
    ],
    "qualifications": [
      "creative",
      "self-starter",
      "adaptable in a fast-paced environment",
      "Great writing skills",
      "experience in graphic design",
      "strong work ethic",
      "Wisconsin ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples, and an example of previous digital media or graphic design projects to WI04Resume@mail.house.gov with “Digital/Press Assistant” in the subject line. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "WI04Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-217-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-05-09",
    "description": "Senior Democratic Member of Congress seeks a bilingual English/Spanish speaker who is an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work. Importantly, constituent services staff also assist with neighborhood events and visits community groups in the district.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and in handling multiple tasks and issues effectively while making sure federal agencies respond in a timely manner and assuring our office responds promptly to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to communicate fluently in Spanish and English, work independently, and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.\n\nThe ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Assisting with neighborhood events",
      "Visiting community groups in the district",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Ensuring federal agencies respond in a timely manner",
      "Assuring our office responds promptly to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Must be able to communicate fluently in Spanish and English",
      "Must be able to work independently",
      "Must be able to think outside the box about various constituent issues and community events",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Candidate must possess a bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": null,
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-216-22",
    "position_title": "Policy Aide",
    "office": "House Small Business Committee Democrats",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "House Small Business Committee Democrats seeks a policy aide to assist senior\nstaff on wide ranging policy issues, including, tax, health, retirement, agriculture,\nprocurement, technology, and other issues.\n\nCore responsibilities include researching, drafting memos, and questions to\nsupport senior staff, drafting reports, assisting in the drafting of legislation, and\nother assignments. Exceptional writing and analytical skills are a must. Prior Hill\nor federal agency experience is preferred.",
    "responsibilities": [
      "researching",
      "drafting memos",
      "drafting questions to support senior staff",
      "drafting reports",
      "assisting in the drafting of legislation",
      "other assignments"
    ],
    "qualifications": [
      "Exceptional writing and analytical skills are a must",
      "Prior Hill or federal agency experience is preferred"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position\nname in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-213-22",
    "position_title": "Wounded Warrior Fellow",
    "office": "Congressman David Trone (MD06)",
    "location": "District Office (Gaithersburg, Frederick, Hagerstown, or Cumberland, MD)",
    "posting_date": "2022-05-09",
    "description": "This position is limited to veterans desiring to serve a two-year paid congressional Fellowship as part of the House of Representatives Wounded Warrior Fellowship Program.\n\nSelected Fellows will work directly for Congressman Trone as part of his District Office staff, located in once of his District Offices. (Gaithersburg, Frederick, Hagerstown, or Cumberland, MD)",
    "responsibilities": [
      "Serve as the official representative for the Member in the Veterans community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations in the Veterans community to form effective relationships for the Member.",
      "Monitor and update the Member and District Director on issues facing military members and veterans in the district.",
      "Provide direct casework assistance to military members and veterans in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Assess veterans issues that constituents are facing for problems requiring possible legislative action; make recommendations to the District and Legislative Directors.",
      "Answer casework correspondence and verbal communications with constituents."
    ],
    "qualifications": [
      "Detail oriented; excellent organization skills; excellent communication skills; strong computer skills; ability to complete projects within timelines and under minimal supervision.",
      "Ability to work well under pressure and maintain a professional and courteous work disposition; ability to exercise discretion and independent judgment in handling sensitive information; ability to manage multiple tasks simultaneously.",
      "High School Diploma required.",
      "Some college level classes are preferred but not required."
    ],
    "how_to_apply": "To apply, please go to the following link to submit your application:\nhttps://house.csod.com/ux/ats/careersite/1/home/requisition/478?c=house&source\n=USAJobs.\nNo phone calls or walk-ins.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-212-22",
    "position_title": "CONSTITUENT SERVICES REPRESENTATIVE",
    "office": "OFFICE of CONGRESSMAN EARL L. “BUDDY” CARTER",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "The Constituent Services Representative acts as a liaison to federal, state, and local agencies as well as external organizations for the Congressman and constituents of the First District. Additionally, the CSR monitors local issues for the Congressman and the Office and serves and the representative of the Office at public events.",
    "responsibilities": [
      "Acts as the representative for the Congressman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal and written communications with constituents, and serving as a liaison with federal, district, and local agencies as well as external organizations;",
      "Informs the Congressman and the District Director of all happenings in his or her assigned areas by screening district media sources and interacting with constituents;",
      "Handles casework assignments;",
      "Specializes in Veterans Affairs and events;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Office;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director;",
      "Monitors scheduled district meetings for the Congressman with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Trains and supervises interns to handle office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the Office;",
      "Meets attendance requirements as established by the Office;",
      "Maintains a good working relationship with the Congressman, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Strong oral and written communication skills;",
      "Knowledge of local, state and federal agencies and departments;",
      "Experience with the U.S. Military, veterans issues, organizations and the Department of Veterans Affairs;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications; and",
      "Proficiency in word processing."
    ],
    "how_to_apply": "To apply, please submit a resume to Brooke.childers@mail.house.com",
    "salary_info": null,
    "contact": "Brooke.childers@mail.house.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-209-22",
    "position_title": "Staff Assistant",
    "office": "House Committee on Energy and Commerce Democratic Staff (majority)",
    "location": "Washington, DC",
    "posting_date": "2022-05-09",
    "description": "The House Committee on Energy and Commerce Democratic Staff (majority) seeks an enthusiastic, motivated, and highly organized staff assistant for fastpaced committee office.",
    "responsibilities": [
      "Tasks associated with a front office such as receptionist duties",
      "Answering phones",
      "Greeting visitors",
      "Ensuring that office and meeting rooms are kept in order",
      "Supporting staff in preparations for committee events such as hearings, markups, meetings, and events",
      "Delivering documents and obtaining signatures on letters",
      "Training and supervising interns",
      "Handling and sorting incoming mail",
      "Maintaining both digital and paper records and files",
      "Maintaining office supplies and mastering basic equipment operations",
      "Assisting other staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "Must possess excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Exceptional time management skills",
      "Ability to work collaboratively",
      "Hill experience preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and a short writing sample to ecdjobs@mail.house.gov",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age."
  },
  {
    "id": "MEM-208-22",
    "position_title": "Communications Director",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-05-09",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks an experienced Communications Director based in the DC office to develop and execute the Congressman’s communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.\nThe Communications Director will serve as the spokesperson and primary communications advisor to Congressman Horsford and will supervise the work of junior communications staff. They will be responsible for executing an aggressive communications plan that generates positive local and national media coverage, reaches diverse communities, and expands the Congressman’s reach to new audiences.",
    "responsibilities": [
      "Working with Congressman Horsford, the Chief of Staff, the Deputy Chief of Staff, and the District Director to develop strategic messaging priorities.",
      "Managing all day-to-day external communications from the office, including press releases, remarks, floor speeches, interview memos, newsletters, op-eds, and social media.",
      "Proactively identifying opportunities to expand Congressman Horsford’s local and national media profile and working closely with the Congressional Black Caucus, the House Labor Caucus, and other affiliated caucuses on shared priorities.",
      "Pitching stories to local and national press and planning press conferences, press calls, and other press events.",
      "Developing a strategic plan and budget for all communications programs.",
      "Designing and implementing a creative digital communications program, including both paid advertising and organic social media. The Communications Director will also be responsible for keeping the Congressman’s website up-to-date.",
      "Overseeing franked communications and a robust 499 program."
    ],
    "qualifications": [
      "This is not an entry-level position, and candidates must have previous press experience on or off Capitol Hill.",
      "Strong oral and written communications skills are required.",
      "Prior experience managing franked communications is a plus.",
      "The ideal candidate must be collaborative, creative, energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours in a fastpaced and demanding setting.",
      "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus and Nevada ties a plus."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Communications Director” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-206-22",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Republican Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "Provides administrative, legislative, and research support to Subcommittee staff, and assists with duties as assigned.",
    "responsibilities": [
      "Answering the telephone and responding to caller inquiries",
      "Reviewing incoming mail and preparation of correspondence",
      "Maintaining Subcommittee archive, activities report, and relevant publications",
      "Assisting with full Committee hearings on matters within Subcommittee jurisdiction",
      "Maintaining the Subcommittee’s outstanding deliverable requests made to the Department of Veterans Affairs (VA)",
      "Determining and tracking the status of pending legislation",
      "Reviewing the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to subcommittee Members and staff",
      "Participating in staff-level negotiations, to include knowledge of background information on legislation being considered",
      "Assisting Subcommittee staff in organization of, and preparation for, hearings, to include determination of Minority agenda, briefing of Members, and development of questions",
      "Conducting meetings with VA, veteran service organizations or other scheduled parties",
      "Drafting remarks for Ranking Member and suggested questions for hearing",
      "Preparation of memorandums for the full Committee and Subcommittee Ranking Members on matters under the jurisdiction of the Subcommittee",
      "Research preparation of hearings by reviewing previous hearing transcripts, relevant statutes, and VA policy",
      "Responsible for all other duties assigned by the full Committee Ranking Member, Staff Director, or Deputy Staff Director; and assist other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "Work, internship, or other experience in a professional environment",
      "Must be able to pass a Public Trust Background Investigation",
      "Strong writing skills",
      "Proficiency in Microsoft Office",
      "Organizational skills",
      "Problem solving",
      "Strong verbal communication",
      "Team oriented",
      "Ability to work well under pressure",
      "Attention to detail"
    ],
    "how_to_apply": "Qualified candidates please send resumes and cover letter only to the following email address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-204-22",
    "position_title": "Staff Assistant",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2022-05-09",
    "description": "The Democratic staff of the House Judiciary Committee seeks a Staff Assistant. Candidates should have excellent organizational skills and strong research, writing, and communication skills.\nResponsibilities include overseeing Committee hearing and markup logistics -which often include being physically present; serving as assistant clerk during markups; providing administrative and research support to the Staff Director, Deputy Staff Director/Senior Advisor, and Deputy Staff Director/Chief Counsel; coordinating the Deputy Staff Director/Chief Counsel's calendar and the Committee's calendar; co-managing the intern program; and managing Committee administrative needs.",
    "responsibilities": [
      "Overseeing Committee hearing and markup logistics -which often include being physically present",
      "Serving as assistant clerk during markups",
      "Providing administrative and research support to the Staff Director, Deputy Staff Director/Senior Advisor, and Deputy Staff Director/Chief Counsel",
      "Coordinating the Deputy Staff Director/Chief Counsel's calendar and the Committee's calendar",
      "Co-managing the intern program",
      "Managing Committee administrative needs"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Strong research skills",
      "Strong writing skills",
      "Strong communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to JDEM.job@mail.house.gov and include “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff reflects the diversity of the country's population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-203-22",
    "position_title": "Scheduler & Office Manager",
    "office": "Congressman Glenn “GT” Thompson",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-09",
    "description": "The office of Congressman Glenn \"GT\" Thompson (PA-15), Ranking Member of the House Agriculture Committee, is seeking a highly motivated, detail-oriented, and energetic individual with excellent organizational, oral, and written communications skills to serve as Scheduler & Office Manager in the Washington, D.C. office.\n\nThis is not an entry-level position. Viable candidates will have at minimum three years of prior scheduling or executive assistant experience.",
    "responsibilities": [
      "managing the Member's D.C. schedule",
      "correspondence",
      "travel",
      "financial record keeping",
      "staff and Member receipts for reimbursement",
      "aiding the Chief of Staff with various administrative duties"
    ],
    "qualifications": [
      "Strong organizational skills are essential, along with the ability to be a self-starter while working in a fast-paced environment.",
      "Candidates should be team-oriented and have the ability to multi-task.",
      "Pennsylvania ties, prior Capitol Hill experience, and a sense of humor are preferred, but not required."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter and resume via email to Renee.Gamela@mail.house.gov with \"Scheduler\" in the subject line. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "Renee.Gamela@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-202-22",
    "position_title": "Systems Administrator",
    "office": "Office of the Parliamentarian in the U.S. House of Representatives",
    "location": "U.S. Capitol building",
    "posting_date": "2022-05-09",
    "description": "The Systems Administrator will assist the Office of the Parliamentarian in traditional IT areas as well as in some aspects of digital publication.\nPrior experience in the legislative branch is strongly preferred. Please note that while many aspects of this position may be performed remotely, some cannot. Accordingly, the position requires physical presence in the U.S. Capitol building on a regular basis.",
    "responsibilities": [
      "maintaining and managing all office computers, servers, and associated equipment and software",
      "maintaining and managing other office communications technology, including cell phones and tablets",
      "serving as a liaison between the office and House Information Resources",
      "serving as principal contact for office staff and for outside vendors with respect to database issues",
      "SQL database maintenance, including uploading and storing files, batch processing of data, and coordinating with the office as needed to export material from the database to aid in publications work",
      "ensuring all electronic devices and files are maintained in a secure manner",
      "managing procurement of information technology for the office",
      "coordinating with outside vendors and the Government Publishing Office as needed"
    ],
    "qualifications": [
      "a degree in computer science or a related field",
      "strong academic credentials",
      "thorough knowledge of Microsoft Excel, XMetaL, SQL, and other current computer software and applications",
      "the ability communicate with industry peers",
      "superior attention to detail",
      "a desire to work in a fast-paced environment",
      "the ability to work on a flexible schedule"
    ],
    "how_to_apply": "Applicants may e-mail a resume and cover letter using the word \"resume\" in the subject to Mr. Jason Smith, Parliamentarian, at jason.smith@mail.house.gov.",
    "salary_info": null,
    "contact": "Mr. Jason Smith, Parliamentarian, at jason.smith@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-200-22",
    "position_title": "Staff Assistant",
    "office": "The Office of Congresswoman Alma S. Adams, Ph.D. (NC-12)",
    "location": "Washington, DC",
    "posting_date": "2022-05-09",
    "description": "Duties will include:\n\nCandidates should have superior time management skills, work well under time constraints, and have excellent communication skills. Multi-tasking, enthusiasm, good sense of humor, and keen attention to detail are necessary. North Carolina ties are a plus but not required.",
    "responsibilities": [
      "Managing the front office, answering phones, greeting visitors, scheduling tours, processing constituent requests and incoming mail, and managing a robust intern program.",
      "Assisting the Legislative Correspondent in sorting and batching correspondence, as well as drafting routine responses.",
      "Other duties as assigned, including assisting staff on special projects."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and two brief writing samples along with three references to nc12.resume@mail.house.gov.\nPlease use STAFF ASSISTANT in the subject line when submitting your materials.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-149-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-05-09",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks)",
      "Serving as intern coordinator by recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing, and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to:",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-05-09",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media Secretary based in the DC office to work closely with the Communications Director, based in the district office to develop and execute the Congressman’s communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital, technical, and social media trends. Able to express the Congressman's voice creatively and promote social media presence, ensuring high web traffic and constituent engagement.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines. This position serves as a part of the Communications team and reports directly to the Director of Communications based in the district, however, this person will be the main point of contact in the D.C. office.",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman’s social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman’s website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman’s media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada’s Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford’s digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "The candidate will report to the Communications Director and work closely with legislative and district staff. The ideal candidate will have experience in or interest in learning about aspects of the office’s traditional press operations, including writing press releases, drafting talking points and speeches, forming relationships with members of the media, and pitching stories.",
      "This is an ideal position for someone with 1-2 years of communications or digital experience. Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus. Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  }
]