[
  {
    "id": "MEM-072-17",
    "position_title": "Communications Director",
    "office": "Congresswoman Tulsi Gabbard",
    "location": "Washington, DC",
    "posting_date": "2017-03-06",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a Communications Director to manage and coordinate all media and public relations activities in a very busy and dynamic office. The ideal candidate will be able to develop integrated communications plans, collaborate effectively with colleagues and implement all public relations strategies.\n\nThis is a senior level position in a fast-paced office and requires dedication, close attention to detail and the ability to think outside the box. Nontraditional work hours, and travel to the District are required. Hawaii ties, and connections with national media are ideal, veteran applications are welcome.",
    "responsibilities": [
      "Building and expanding the office’s relationships with media outlets",
      "Working with the Chief of Staff and Deputy Chief of Staff to develop media strategies",
      "Successfully pitching stories and press events to a wide range of media outlets",
      "Responding to and managing media inquiries from diverse media outlets",
      "Writing op-eds, speeches, press releases, statements and talking points",
      "Working with the deputy communications director in Hawaii",
      "Maintaining an active social media profile",
      "Managing the Member’s official website"
    ],
    "qualifications": [
      "Ability to keep up with the fast pace of the office",
      "Excellent written and oral communication skills",
      "Strong editing and proofreading abilities",
      "Ability to develop a keen understanding of the unique priorities and views of the district and find ways to advance the Member’s objectives"
    ],
    "how_to_apply": "Qualified applicants may email a cover letter, resume and writing samples to the provided email address.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-069-17",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2017-03-06",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include: answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.\nNO PHONE CALLS PLEASE.",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-068-17",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2017-03-06",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "Outstanding analytical skills",
      "Written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-067-17",
    "position_title": "Counsel",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2017-03-06",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Office of Advice and Education. The Committee’s Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics, ethics counseling and training, corporate finance, securities law, and criminal law.",
    "responsibilities": [
      "Providing a high volume of ethics advice",
      "Education, and training to Members of Congress and their staff through frequent telephone calls",
      "In-person meetings",
      "Written work product"
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling and training, corporate finance, securities law, and criminal law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-065-17",
    "position_title": "Office Manager/Scheduler",
    "office": "Congressman Thomas Massie",
    "location": "D.C.",
    "posting_date": "2017-03-06",
    "description": "The Office Manager/Scheduler assists in the overall operation, logistics, and compliance of the D.C. office of Congressman Thomas Massie.\nESSENTIAL JOB FUNCTION: SUPERVISORY\nCarries out responsibilities in accordance with office policy and applicable laws. Responsibilities include training support staff employees; planning, assigning and directing work of support staff employees;",
    "responsibilities": [
      "Scheduling",
      "Coordinates with Congressman on a daily basis, schedules appointments, events, and manage general demands on the Congressman’s time;",
      "Prepares weekly schedules for Congressman, including details of names, times, places, and topics to be discussed;",
      "Provides staff with Congressman’s schedule, ensuring that relevant staff are notified of meetings and events;",
      "Manages travel arrangements for Congressman and staff, including lodging, transportation, ticketing, etc.;",
      "Reviews invitations and prepare responses;",
      "Coordinates with district staff;",
      "Works a flexible schedule including long hours, nights, and weekends;",
      "Performs other duties as assigned;",
      "Budget/Finance/Payroll",
      "Manages the MRA",
      "Monitors expenditures",
      "Pays bills",
      "Processes reimbursements",
      "House Ethics and Compliance",
      "Monitors and ensures the Office's compliance with House Rules",
      "General Office Functions",
      "Maintains and updates, as necessary, an employee handbook and policy manual for theoffice;",
      "Provides orientation and training for new staff;",
      "Assists departing employees with necessary administrative procedures (i.e., returning keys, House I.D. cards, and other office property; obtaining forwarding addresses, work\nfiles, and records);",
      "Administers parking space assignments for office;",
      "Maintains confidential medical files, as necessary, for all staff members, including interns and volunteers;",
      "Maintains emergency information sheets for each staff member;",
      "Maintains leave and time records for the Washington, D.C. staff;",
      "Manages office supplies for the Washington, D.C. and district offices;",
      "Orders business cards for the Washington, D.C. and district office staff;",
      "Supervises the reception desk, mail operations and the administrative files and personnel records;",
      "Assumes responsibility for overall office appearance and layout;",
      "Assists the staff in all mass mailings and ensures that quarterly mass mailing reports are filed;",
      "Maintains borrowing lists and staff borrowing I.D.'s for the Library of Congress;",
      "Assists staff in scheduling House or Capitol rooms for outside group functions;",
      "Maintains a good working relationship with the Member, staff and constituents;",
      "Accepts performance based criticism and direction;",
      "Meets attendance requirements as established by the office;",
      "Works under pressure and handles stress;",
      "Responsible for responding to ADA and OSHA questionnaires;",
      "Works a flexible schedule including long hours, nights, and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "At least two years of office management experience.",
      "At least one year of working in a congressional office.",
      "Alternatively, five years of related work experience.",
      "Thorough knowledge of the Members' Congressional Handbook and House Rules;",
      "Provides necessary organization, supervisory, leadership and motivation to manage office operations;",
      "Ability to perform essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Strong leadership and organizational skills;",
      "Ability to manage multiple tasks and projects;",
      "Thoroughness and careful attention to detail;",
      "Knowledge of office policies, practices and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing.",
      "Noisy, hectic, fast-paced, unpredictable environment with large number simultaneous tasks."
    ],
    "how_to_apply": "Qualified candidates please submit resume to chris.mccane@mail.house.gov.",
    "salary_info": null,
    "contact": "chris.mccane@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-063-17",
    "position_title": "Legislative Assistant",
    "office": "Ways and Means Committee Republican",
    "location": null,
    "posting_date": "2017-03-06",
    "description": "Ways and Means Committee Republican is seeking a Legislative Assistant to handle a legislative portfolio with an emphasis on veterans, housing, and education issues. Duties include, but are not limited to, drafting responses to constituent mail and calls for all issue areas; monitoring floor, committee, and regulatory activity; conducting meetings with constituents and stakeholders; developing legislation; and advising the Congressman and senior staff.",
    "responsibilities": [
      "Drafting responses to constituent mail and calls for all issue areas",
      "Monitoring floor, committee, and regulatory activity",
      "Conducting meetings with constituents and stakeholders",
      "Developing legislation",
      "Advising the Congressman and senior staff"
    ],
    "qualifications": [
      "Applicants must have experience as a Legislative Correspondent",
      "Strong writing, organizational, and project management skills"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and writing sample to: gopjobopening@gmail.com.",
    "salary_info": null,
    "contact": "gopjobopening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-061-17",
    "position_title": "Legislative Assistant",
    "office": "Southern Conservative Congressman",
    "location": "Capitol Hill",
    "posting_date": "2017-03-06",
    "description": "Southern Conservative Congressman seeks a Legislative Assistant to handle a diverse portfolio of issues with a particular emphasis on Committee related topics of health care, education and labor issues. Prior legislative experience on Capitol Hill dealing with policy issues is required. Individuals will be expected to have excellent research, writing, and communication skills.\n\nThis individual must be confident and well spoken, and should possess strong interpersonal skills and a willingness to work in a team environment. Southern ties preferred.",
    "responsibilities": [
      "Briefing the Congressman regarding bills on the floor and policy proposals",
      "Committee prep for hearings and markups",
      "Generating policy positions",
      "Taking meetings with constituents",
      "Helping with constituent correspondence program"
    ],
    "qualifications": [
      "Prior legislative experience on Capitol Hill dealing with policy issues is required.",
      "Excellent research, writing, and communication skills.",
      "Confident and well spoken",
      "Strong interpersonal skills",
      "Willingness to work in a team environment.",
      "Southern ties preferred."
    ],
    "how_to_apply": "Qualified candidates should send resume, cover letter, and writing samples to southerncongressmanjob@gmail.com.",
    "salary_info": null,
    "contact": "southerncongressmanjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-058-17",
    "position_title": "Scheduler",
    "office": "Midwestern Republican House member",
    "location": "Washington, D.C. and in District",
    "posting_date": "2017-03-06",
    "description": "Midwestern Republican House member seeks an energetic, highly-organized and detail-oriented Scheduler. Responsibilities focus primarily on managing the Member's schedule in Washington, D.C. and in District, but also include evaluating all meeting requests, and coordinating office travel arrangements and special events. The ideal candidate will be extremely detail oriented, proactive, motivated, and will possesses flexibility and the ability to thrive in a fast paced environment. Prior scheduling experience is preferred, and some driving will be required.",
    "responsibilities": [
      "Managing the Member's schedule in Washington, D.C. and in District",
      "Evaluating all meeting requests",
      "Coordinating office travel arrangements",
      "Coordinating special events"
    ],
    "qualifications": [
      "Extremely detail oriented",
      "Proactive",
      "Motivated",
      "Possesses flexibility",
      "Ability to thrive in a fast paced environment",
      "Prior scheduling experience is preferred"
    ],
    "how_to_apply": "Please email your resume to midwestmember@mail.house.gov to apply.",
    "salary_info": null,
    "contact": "midwestmember@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-053-17",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Michelle Lujan Grisham",
    "location": null,
    "posting_date": "2017-03-06",
    "description": "Portfolio includes defense, veterans, foreign affairs, homeland security, education, transportation, and science and technology. A positive attitude, sense of humor, and excellent written and oral communication skills are essential. Significant congressional or public policy experience is required. New Mexico ties are a plus and the office encourages candidates of diverse backgrounds to apply.",
    "responsibilities": [],
    "qualifications": [
      "Significant congressional or public policy experience is required.",
      "Excellent written and oral communication skills are essential.",
      "Positive attitude and sense of humor."
    ],
    "how_to_apply": "To apply, applicants should submit one document which includes only their resume and cover letter to NM01.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-043-17",
    "position_title": "Staff Assistant",
    "office": "Energy and Commerce Committee Democratic Staff",
    "location": null,
    "posting_date": "2017-03-06",
    "description": "The Energy and Commerce Committee Democratic Staff seeks an enthusiastic, motivated, and highly-organized Staff Assistant for fast-paced committee office. Responsibilities include front office reception; preparation for committee hearings, markups, meetings and events; training and supervising interns; maintaining files, office supplies and equipment; assisting staff with research, work product, web content, special projects, and other duties as assigned.",
    "responsibilities": [
      "front office reception",
      "preparation for committee hearings, markups, meetings and events",
      "training and supervising interns",
      "maintaining files, office supplies and equipment",
      "assisting staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "excellent written and oral communication skills",
      "attention to detail",
      "professionalism",
      "strong organizational skills",
      "Hill experience preferred"
    ],
    "how_to_apply": "Please submit a cover letter, resume and a short writing sample to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, sexual orientation, or gender identity. The office encourages candidates of diverse backgrounds to apply."
  }
]