[
  {
    "id": "MEM-108-18",
    "position_title": "Staff Assistant",
    "office": "Congressman John Delaney",
    "location": "Hagerstown District Office",
    "posting_date": "2018-03-26",
    "description": "Congressman John Delaney is seeking a high energy, highly-organized, and detail oriented Staff Assistant for his Hagerstown District Office.",
    "responsibilities": [
      "Provide staff coverage for the District Office, answer constituent phone calls and visits and oversee the handling of constituent correspondence.",
      "Review and assign incoming casework.",
      "Act as a liaison between constituents and other government agencies.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Train and supervise interns to handle routine office matters, such as incoming correspondence, visitors, telephone calls, and other issues that may arise.",
      "Maintain office supplies and equipment. Oversee the maintenance of the office organizational system.",
      "Handle other tasks as assigned."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment.",
      "Availability to work nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved."
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis until the position is filled. To apply, please email a resume and cover letter to MD06.Jobs@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "MD06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-104-18",
    "position_title": "Veterans Services Representative",
    "office": "Congressman Tom O’Halleran",
    "location": "Casa Grande District Office",
    "posting_date": "2018-03-26",
    "description": "CORE RESPONSIBILITIES:\n• coordinate and complete veterans casework and answer all related\ncorrespondence;\n• plan and engage in outreach with veterans in the First District; and\n• monitor and update Rep. O’Halleran and staff on local veterans issues.\nQUALIFICATIONS:\n• thorough knowledge of veterans issues and programs;\n• knowledge and familiarity with local, state, and federal agencies\nserving veterans;\n• strong oral and written communication skills;\n• ability to exercise discretion and independent judgment in casework\nresponsibilities;\n• proficiency in word processing;\n• thoroughness and careful attention to detail;\n• ability to work well under pressure;\n• ability to work cooperatively and courteously with our team; and\n• military service background preferred.\nDUTIES:\n• acts as the grassroots representative for Rep. O’Halleran with veterans\nand on veterans issues, including handling all veterans casework,\nverbal communications with constituents, and acting as liaison with\nfederal, district, and local agencies;\n• informs Rep. O’Halleran and staff of all happenings on veterans issues\nby screening district media sources and interacting with constituents;\n• handles all veterans casework assignments, and other casework as\nneeded;\n• acts as liaison and interfaces with local veterans’ organizations;\n• assesses casework for problems requiring legislative action and makes\nrecommendations to the Chief of Staff or Legislative Director;\n• monitors scheduled district meetings for the Member with\nconstituents;\n• occasionally handles Office matters such as logging incoming and\noutgoing correspondence, greeting visitors, telephone calls, and\ncomputer operations;\n• logs in all incoming and outgoing mail and incoming telephone calls\nrelating to assigned casework;\n• prepares monthly reports on pending cases and district activities;\n• continually screens active cases and acts as liaison with constituents to\nensure that their cases are handled in a responsive manner;\n• maintains up-to-date files on all constituent cases; and\n• performs other duties as assigned.",
    "responsibilities": [
      "coordinate and complete veterans casework and answer all related correspondence",
      "plan and engage in outreach with veterans in the First District",
      "monitor and update Rep. O’Halleran and staff on local veterans issues"
    ],
    "qualifications": [
      "thorough knowledge of veterans issues and programs",
      "knowledge and familiarity with local, state, and federal agencies serving veterans",
      "strong oral and written communication skills",
      "ability to exercise discretion and independent judgment in casework responsibilities",
      "proficiency in word processing",
      "thoroughness and careful attention to detail",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with our team",
      "military service background preferred"
    ],
    "how_to_apply": "Military veterans encouraged to apply. Interested candidates should email a cover letter and resume to jeremy.nordquist@mail.house.gov and blanca.varela@mail.house.gov.",
    "salary_info": null,
    "contact": "jeremy.nordquist@mail.house.gov and blanca.varela@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-103-18",
    "position_title": "Press Secretary",
    "office": "Northeast Democrat",
    "location": "Washington",
    "posting_date": "2018-03-26",
    "description": "Northeast Democrat seeks Press Secretary to run Washington press operations, including working closely with Member’s legislative staff, leadership and committee press staff, and national TV news producers. Position also includes management of the Member’s website, social media pages, newsletters, e-news updates, and other constituent outreach. Will work closely with District Communications Director on some joint projects.",
    "responsibilities": [],
    "qualifications": [
      "Excellent legislative research and writing skills required."
    ],
    "how_to_apply": "Send cover letter and resume to democratic.hilljob@gmail.com.",
    "salary_info": "Commensurate with experience",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Minority and women candidates encouraged to apply."
  },
  {
    "id": "MEM-100-18",
    "position_title": "Legislative Assistant",
    "office": "T&I Subcommittee Ranking Member",
    "location": "District of Columbia",
    "posting_date": "2018-03-26",
    "description": "The ideal candidate will be able to manage multiple tasks and work well under pressure. The Legislative Assistant works with the Chief Counsel/Legislative Director and with the Chief of Staff to develop and implement the Member’s legislative strategy in his/her issue areas; prepares materials for hearings; drafts legislation, amendments, and congressional record statements; and conducts research. Responsibilities include managing and handling the Member’s transportation and infrastructure portfolio that includes but is not limited to highways and transit, economic development, aviation, railroads, water resources and emergency management. The ability to write well under tight deadlines is essential.\n\nCandidate must be able to handle multiple tasks and issues effectively while meeting deadlines. A successful candidate will be a results-oriented problem solver and motivated self-starter who can think outside the box. Prior Hill, law firm or similar experience is preferred. Candidate must possess a law degree and be, or be willing to become, a resident of the District of Columbia. Salary based on skill and experience level.",
    "responsibilities": [
      "develop and implement the Member’s legislative strategy in his/her issue areas",
      "prepares materials for hearings",
      "drafts legislation, amendments, and congressional record statements",
      "conducts research",
      "managing and handling the Member’s transportation and infrastructure portfolio that includes but is not limited to highways and transit, economic development, aviation, railroads, water resources and emergency management"
    ],
    "qualifications": [
      "law degree",
      "Prior Hill, law firm or similar experience is preferred.",
      "be, or be willing to become, a resident of the District of Columbia",
      "handle multiple tasks and issues effectively while meeting deadlines",
      "results-oriented problem solver",
      "motivated self-starter who can think outside the box"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov.",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-095-18",
    "position_title": "Press Secretary",
    "office": "Rep. Scott Peters of San Diego",
    "location": "DC",
    "posting_date": "2018-03-26",
    "description": "Rep. Scott Peters of San Diego is seeking an experienced, assertive and creative press secretary to join our DC office. The Press Secretary will be part of an aggressive communications team and responsible for assisting with media strategy development and implementation, including: drafting statements, releases, talking points, opinion editorials and responses to reporter queries; generating ideas for press conferences; pitching story ideas; managing coverage of legislative action and events; and serving as an on-the-record spokesperson as necessary. Applicants must be able to generate ideas that produce local and national media coverage that raise awareness of the Congressman’s priorities, must have a minimum of two years of experience as communications staff in a political office, and must be a strong writer and needs to either have a strong network of national media reporters or be able to build one. Applicants will be required to perform a long-form writing test. Candidates with political campaign experience and San Diego ties strongly preferred. This is not an entry level position.",
    "responsibilities": [
      "assisting with media strategy development and implementation",
      "drafting statements, releases, talking points, opinion editorials and responses to reporter queries",
      "generating ideas for press conferences",
      "pitching story ideas",
      "managing coverage of legislative action and events",
      "serving as an on-the-record spokesperson as necessary"
    ],
    "qualifications": [
      "must be able to generate ideas that produce local and national media coverage that raise awareness of the Congressman’s priorities",
      "must have a minimum of two years of experience as communications staff in a political office",
      "must be a strong writer",
      "needs to either have a strong network of national media reporters or be able to build one",
      "Candidates with political campaign experience and San Diego ties strongly preferred",
      "This is not an entry level position."
    ],
    "how_to_apply": "Interested applicants must send a resume, three writing samples (one news release, one op ed, and one speech/talking points), along with three professional references to SDRepCommsJob@gmail.com.",
    "salary_info": null,
    "contact": "SDRepCommsJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-082-18",
    "position_title": "Legislative Correspondent",
    "office": "Conservative Western Republican",
    "location": "DC",
    "posting_date": "2018-03-26",
    "description": "Conservative Western Republican is seeking a Legislative Correspondent in his DC office to manage all aspects of constituent correspondence. Ideal candidates will have knowledge of the legislative process, excellent writing and organizational skills, strong attention to detail, and familiarity with iConstituent.",
    "responsibilities": [
      "Processing incoming correspondence through iConstituent",
      "Drafting timely responses",
      "Assisting with updating website",
      "Creating graphics/images",
      "Assisting with projects and events"
    ],
    "qualifications": [
      "Knowledge of the legislative process",
      "Excellent writing and organizational skills",
      "Strong attention to detail",
      "Familiarity with iConstituent",
      "Western ties are preferred but not required"
    ],
    "how_to_apply": "Email resume, cover letter and two writing samples to WesternRepublicanJob@yahoo.com.",
    "salary_info": null,
    "contact": "WesternRepublicanJob@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-078-18",
    "position_title": "Social Media Manager & Press Assistant",
    "office": "The press office of Rep. Louise Slaughter (NY-25) and the House Rules Committee",
    "location": null,
    "posting_date": "2018-03-26",
    "description": "Responsibilities include managing the congresswoman's digital media channels, including website and social media accounts, developing engaging online content, writing e-newsletters, and taking photos and video. The social media manager & press assistant will also compile press clips, copy-edit press releases and talking points, and other projects as necessary. Must be comfortable working collaboratively to execute a broad communications strategy. Prior press and/or digital experience and familiarity with both graphic design and video editing is preferred. Ideal candidates must also have strong written and verbal communications skills and be able to work demanding hours in a fast-paced environment.",
    "responsibilities": [
      "Managing the congresswoman's digital media channels, including website and social media accounts",
      "Developing engaging online content",
      "Writing e-newsletters",
      "Taking photos and video",
      "Compile press clips",
      "Copy-edit press releases and talking points",
      "Other projects as necessary"
    ],
    "qualifications": [
      "Prior press and/or digital experience and familiarity with both graphic design and video editing is preferred.",
      "Strong written and verbal communications skills",
      "Able to work demanding hours in a fast-paced environment."
    ],
    "how_to_apply": "Interested candidates must submit a resume, cover letter, two writing samples, and two examples of social media or digital media work to digitalpressposting@mail.house.gov. Candidates will be considered on a rolling basis until the position is filled.",
    "salary_info": null,
    "contact": "digitalpressposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-076-18",
    "position_title": "Legislative Director",
    "office": "Rep. Jerry McNerney, CA-09",
    "location": "Washington, DC",
    "posting_date": "2018-03-26",
    "description": "California Democrat (Rep. Jerry McNerney, CA-09) seeks experienced legislative director to develop and advance long-term legislative agenda. Legislative Director will work closely with the Member, Chief of Staff, Communications Director, District Director, and staff to advance Member’s priorities and implement strategic legislative and outreach strategies. Successful candidate must work well in a collaborative, team-oriented environment and have the ability to oversee an active legislative team in implementing and advancing an expansive legislative agenda.\n\nLegislative Director must be highly organized, detail oriented, and able to manage multiple tasks and projects. Excellent interpersonal skills and written and verbal communication, as well as strong editing and proofreading abilities are required.\n\nIdeal candidate will be politically astute and have a good sense of humor and positive attitude.\n\nSuccessful candidate must have the ability to thrive in a demanding, fastpaced, deadline-driven environment, and must be able to respond to challenging situations quickly and strategically.\n\nThis is not an entry-level position; only candidates with previous Hill experience and a solid knowledge of legislative and political processes will be considered. Prior experience serving as a Legislative Director or working on Energy and Commerce Committee-related policy issues – including energy, environment, and water – is strongly preferred.\n\nCalifornia ties, Spanish literacy, and previous supervisory experience are a plus. Minorities and candidates with CA-09 ties are encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Previous Hill experience and a solid knowledge of legislative and political processes",
      "Prior experience serving as a Legislative Director or working on Energy and Commerce Committee-related policy issues – including energy, environment, and water – is strongly preferred",
      "California ties, Spanish literacy, and previous supervisory experience are a plus"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to: McNerneyResumes@mail.house.gov. No calls or drop ins, please.",
    "salary_info": null,
    "contact": "McNerneyResumes@mail.house.gov",
    "equal_opportunity": "Minorities and candidates with CA-09 ties are encouraged to apply."
  }
]