[
  {
    "id": "MEM-142-20",
    "position_title": "Communications Director",
    "office": "House Leadership",
    "location": "DC and the district",
    "posting_date": "2020-04-27",
    "description": "Active, hard-working Member of House Leadership seeks an outstanding Communications Director for a fast-paced office.\n\nResponsibilities include planning and implementing communications strategy across a broad portfolio, working closely with legislative and district staff to effectively communicate the Member’s message, handling daily media inquiries, maintaining relationships with national and local reporters, writing talking points and press releases, pitching op-eds, managing website, producing videos and social media content, planning and pitching press events in DC and the district, overseeing daily clips, and keeping press lists up-to-date.",
    "responsibilities": [
      "Planning and implementing communications strategy across a broad portfolio",
      "Working closely with legislative and district staff to effectively communicate the Member’s message",
      "Handling daily media inquiries",
      "Maintaining relationships with national and local reporters",
      "Writing talking points and press releases",
      "Pitching op-eds",
      "Managing website",
      "Producing videos and social media content",
      "Planning and pitching press events in DC and the district",
      "Overseeing daily clips",
      "Keeping press lists up-to-date"
    ],
    "qualifications": [
      "Hill press experience",
      "Strong writing and oral communication skills",
      "The ability to multitask and prioritize under pressure",
      "A good sense of humor",
      "Connecticut ties are a plus"
    ],
    "how_to_apply": "Please send cover letter, resume, and a writing sample as one attachment to ctcommsjob@gmail.com",
    "salary_info": null,
    "contact": "ctcommsjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-140-20",
    "position_title": "Digital/Press Assistant",
    "office": "The Office of Congressman Andy Kim (NJ03)",
    "location": "Washington, D.C.",
    "posting_date": "2020-04-27",
    "description": "The Office of Congressman Andy Kim (NJ03) seeks a Digital/Press\nAssistant to assist the Communications Director in formulating and executing\ndigital and traditional communications efforts for the office.\n",
    "responsibilities": [
      "Creating digital content such as graphics, videos and ads",
      "Drafting social media posts and statements",
      "Working with House Franking to get materials approved"
    ],
    "qualifications": [
      "Team-player with strong written and verbal communication skills, attention to detail, follow through, self-motivation, ability to multi-task and an even temperament",
      "Proficient in digital graphic design and editing programs, as well as in creating ads in social media platforms",
      "1-3 years of digital or press experience"
    ],
    "how_to_apply": "Please send resume and cover letter to nj03resumes@mail.house.gov with “Digital/Press Assistant” in the subject line.\nNo phone calls, faxes, or walk-ins please.",
    "salary_info": null,
    "contact": "nj03resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Andy Kim is an equal opportunity employer, and\nas such, is committed to building and maintaining an inclusive and diverse\nwork environment."
  },
  {
    "id": "MEM-139-20",
    "position_title": "Director of Constituent Services",
    "office": "Southern California Democrat",
    "location": "Southern California",
    "posting_date": "2020-04-27",
    "description": "Job responsibilities include: acting as the representative for the Member; answering casework correspondence; meeting with constituents; serving as a liaison with federal, district, and local agencies; screening and referring cases, when appropriate, to other district offices; preparing reports for the District Director on pending cases; assessing casework for problems requiring legislative action; and making recommendations to the District Director and Chief of Staff.\n\nA successful candidate for this position will be empathetic, has the ability to actively listen, problem-solve, and be comfortable documenting casework progression in a database.\n\nCandidates should have a minimum of 3- 5 years of case work experience for a Member of Congress. Preference will be given to candidates who have a degree in social work. Southern California ties are a plus.",
    "responsibilities": [
      "Acting as the representative for the Member",
      "Answering casework correspondence",
      "Meeting with constituents",
      "Serving as a liaison with federal, district, and local agencies",
      "Screening and referring cases, when appropriate, to other district offices",
      "Preparing reports for the District Director on pending cases",
      "Assessing casework for problems requiring legislative action",
      "Making recommendations to the District Director and Chief of Staff"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented",
      "Friendly",
      "Strong written and verbal communication skills in both English and a second language",
      "Strong analytical skills and the ability to work independently and as part of a team",
      "Empathetic",
      "Ability to actively listen",
      "Problem-solve",
      "Comfortable documenting casework progression in a database",
      "Minimum of 3-5 years of case work experience for a Member of Congress",
      "Preference will be given to candidates who are fluent in Spanish, Farsi, Mandarin, or Korean",
      "Preference will be given to candidates who have a degree in social work",
      "Southern California ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and writing sample to dd45lb@gmail.com with “Director of Constituent Services” in the subject line.",
    "salary_info": null,
    "contact": "dd45lb@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and all qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-137-20",
    "position_title": "Junior Professional Staff Member",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2020-04-27",
    "description": "The Energy & Commerce Committee, Democratic Staff, seeks Junior\nProfessional Staff Member for the Consumer Protection Subcommittee staff.\nThe broad jurisdiction of the subcommittee includes consumer protection\ngenerally; motor vehicle safety; consumer product safety; regulation of\ncommercial practices, including sports-related matters; consumer privacy and\ndata security; and travel, tourism, and time. The subcommittee oversees the\nNational Highway Traffic Safety Administration, the Consumer Product\nSafety Commission, and the Federal Trade Commission, among others.\n\nThe position requires the handling of substantive legislative and\nadministrative tasks, including staffing hearings and markups, conducting\noversight, and drafting legislation.",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation"
    ],
    "qualifications": [
      "A minimum of 2-4 years of experience in the House of Representatives",
      "Strong writing, analytical, and legislative skills",
      "Sound political judgment",
      "A proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "A willingness to work long hours and weekends",
      "Experience working with relevant public interest groups, relevant agencies, Congress, and industry"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two\nprofessional references to ecdjobs@mail.house.gov using the subject line\nConsumer Protection Junior PSM Candidate.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin,\nreligion, sex (including marital or parental status), gender identity, disability,\nor age. Women, minority, and veteran candidates are highly encouraged to\napply."
  },
  {
    "id": "MEM-136-20",
    "position_title": "Scheduler/Executive Assistant",
    "office": "New York Democrat",
    "location": "Washington, DC",
    "posting_date": "2020-04-27",
    "description": "Duties include, but not limited to the following:\n\npreparing the Member's daily and monthly schedules, briefing the Member on all scheduling activities and requests of the Washington, DC and district offices, managing all of the Member's travel and lodging reservations, and maintaining the Member's files and correspondence.\n\nThe ideal candidate must work well under pressure and be willing to work a flexible schedule that includes non-traditional work hours. Qualified applicants should have at least three to five years of related work experience including prior scheduling and professional office experience.\n\nThe Scheduler/Executive Assistant will report to the Chief of Staff. Prior Capitol Hill experience and ties to Brooklyn is a plus. This position is based in Washington, DC.\n\nThis is a permanent, full-time position.",
    "responsibilities": [
      "preparing the Member's daily and monthly schedules",
      "briefing the Member on all scheduling activities and requests of the Washington, DC and district offices",
      "managing all of the Member's travel and lodging reservations",
      "maintaining the Member's files and correspondence"
    ],
    "qualifications": [
      "must work well under pressure",
      "be willing to work a flexible schedule that includes non-traditional work hours",
      "at least three to five years of related work experience including prior scheduling and professional office experience",
      "Prior Capitol Hill experience and ties to Brooklyn is a plus."
    ],
    "how_to_apply": "Qualified applicants should send a cover letter and resume to ResumeNY@mail.house.gov. Please place SCHEDULER/EXECUTIVE ASSISTANT in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-135-20",
    "position_title": "District Director",
    "office": "Southern California Democrat",
    "location": "Southern California",
    "posting_date": "2020-04-27",
    "description": "Oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans, as well as direct all activities and staff of the district offices.\n\nThis position is responsible for recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures; represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.\n\nResponsibilities include strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management. This individual also serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district; and, acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region.",
    "responsibilities": [
      "Oversee all operations of the district offices",
      "Development and implementation of policy objectives, strategies and operating plans",
      "Direct all activities and staff of the district offices",
      "Recruiting, hiring, training, and managing district staff",
      "Ensuring district staff complies with office policies, practices, and procedures",
      "Representing the Member at events or functions through the district",
      "Strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management",
      "Serving as the primary liaison between the Congresswoman and constituents and special interest groups in the district",
      "Acting as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region"
    ],
    "qualifications": [
      "Minimum of 3-5 years of management experience",
      "Strong ability to provide necessary organization, leadership and motivation to manage a Congressional office",
      "Excellent oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "Energetic, detail-oriented, able to multi-task, politically astute",
      "Willing to work long hours (including evenings and weekends) in a fast-paced and demanding setting",
      "Spanish fluency and Southern California ties are a plus"
    ],
    "how_to_apply": "Submit a cover letter, resume, and appropriate writing samples to CA26Resumes@gmail.com with just “District Director” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-132-20",
    "position_title": "Press Secretary/Digital Director",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2020-04-27",
    "description": "California Democrat is seeking a talented and highly motivated Press\nSecretary/Digital Director. The person chosen for the position will work\nclosely with the Communications Director to develop and execute the\nCongresswoman’s long-term communication plan.\nThey will assist with media relations, oversee all video production and\nphotography, and be responsible for leading or contributing to regular\nnewsletters, mail pieces and reports.\nThe Press Secretary/Digital Director will be responsible for a wide range of\ncritical functions, including developing original social media content;\ndesigning graphics and web content and maintaining the office’s website.\nAdditionally, they will assist the Communications Director with drafting press\nreleases, advisories, talking points, op-eds and other materials. Media list\nmaintenance is an important part of this job.\nThis is not an entry-level position. Previous experience in press or relevant\nsocial media experience is required. Qualified applicants must have strong\nwriting, editing, proofreading skills and be proficient in photography, video\nrecording and editing.\nThey must be detail-oriented, news savvy and able to work in a fast-paced,\ndemanding work setting. A sense of humor and ability to be a team player is a\nmust. Spanish language skills are also a big plus. Like all communications\njobs, evening and weekend work will be expected.\nSuccessful applicants will need to demonstrate their writing ability by\ncompleting an in person writing and editing test.",
    "responsibilities": [
      "Assist with media relations",
      "Oversee all video production and photography",
      "Lead or contribute to regular newsletters, mail pieces and reports",
      "Developing original social media content",
      "Designing graphics and web content",
      "Maintaining the office’s website",
      "Assist the Communications Director with drafting press releases, advisories, talking points, op-eds and other materials",
      "Media list maintenance"
    ],
    "qualifications": [
      "Previous experience in press or relevant social media experience is required",
      "Strong writing, editing, proofreading skills",
      "Proficient in photography, video recording and editing",
      "Detail-oriented, news savvy",
      "Able to work in a fast-paced, demanding work setting",
      "A sense of humor and ability to be a team player",
      "Spanish language skills are also a big plus"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples to ResumeInbox5@mail.house.gov",
    "salary_info": null,
    "contact": "ResumeInbox5@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-112-20",
    "position_title": "Legislative Counsel",
    "office": "Office of Rep. Justin Amash (I-MI)",
    "location": "Washington, DC",
    "posting_date": "2020-04-27",
    "description": "The Office of Rep. Justin Amash (I-MI) is seeking a bright, creative, and selfmotivated legislative counsel to join our Washington, DC-based policy team.\n\nThe legislative counsel will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The person will be expected to handle a diverse portfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "Applicants must have a JD or equivalent.",
      "Two years of relevant policy experience is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"legislative counsel applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Capitol Hill",
    "posting_date": "2020-04-27",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others.\n\nThis is not an entry level position.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2020-04-27",
    "description": "Qualified candidates should have a minimum of 2 years’ experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects.\n\nA flexible schedule and ability to travel throughout the district is required.\n\nEqual opportunity employer.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Meet deadlines",
      "Manage multiple projects",
      "Flexible schedule and ability to travel throughout the district is required"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]