[
  {
    "id": "MEM-025-24",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Representative Jim Costa (CA-21)",
    "location": "Washington D.C.",
    "posting_date": "2024-01-15",
    "description": "Representative Jim Costa (CA-21), a senior member of the House Agriculture Committee and member of the House Foreign Affairs Committee, seeks a friendly, organized, and detail-oriented Staff Assistant/Legislative Correspondent to manage the front office and constituent mail program in his Washington D.C. Office.",
    "responsibilities": [
      "Manage the front office including answering phones, monitoring voicemails, greeting guests, and other administrative tasks.",
      "Oversee Washington DC internship program.",
      "Coordinate tour and flag requests; including leading Capitol tours.",
      "Liaise with Technology Support and other service contractors.",
      "Serve as the Emergency Coordinator, including reporting threats and emergency coordination.",
      "Sort, track, and process incoming mail, while overseeing the drafting of letters and ensuring timely, accurate responses through our constituent correspondence system, Intranet Quorum (IQ).",
      "Assist the communications and legislative staff with other duties as assigned."
    ],
    "qualifications": [
      "Ideal candidates must be detail-oriented professionals with excellent verbal and written communication skills, and strong interpersonal and organizational skills who can thrive in a fast-paced environment.",
      "Candidates must have a proficient understanding of technology and commit to a flexible working schedule.",
      "Candidates with California Central Valley ties and/or previous experience working in a House or Senate office are preferred.",
      "Spanish fluency and experience with IQ are a plus."
    ],
    "how_to_apply": "All interested candidates must submit a resume, cover letter, and TWO short writing samples (memo, speech, constituent letter, or related) in a single PDF to resume@mail.house.gov and use “CA-21 Staff Assistant/Legislative Correspondent” in the subject line. No phone calls, e-mails, or walk-ins – applications must be submitted by 11:59 P.M. (ET) on Sunday, January 28, 2024.",
    "salary_info": "The Office of Rep. Jim Costa offers a competitive salary and package of benefits (health insurance, retirement match, student loan repayment program, and more).",
    "contact": "resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQIA+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. The Office of Rep. Jim Costa is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-024-24",
    "position_title": "Communications Director",
    "office": "U.S. Rep. Jonathan L. Jackson",
    "location": "Washington, D.C.",
    "posting_date": "2024-01-15",
    "description": "The Office of U.S. Rep. Jonathan L. Jackson has an immediate need to hire an experienced full-time Communications Director in the Washington, D.C., office to lead a fast-paced and highly engaged press operation.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
    "responsibilities": [
      "Reports to Chief of Staff and Deputy Chief of Staff;",
      "Develops and implements media and communications strategy for the Member;",
      "Tracks current legislative and non-legislative issues about which the Member may be questioned;",
      "Evaluates current events and media reports in the district and the nation for their impact on the Member;",
      "Provides ideas and advice on the effect in the media of the Member's actions and legislative activities;",
      "Writes remarks and speeches for the Member; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Bachelor’s or master’s degree;",
      "2-5 years of Capitol Hill experience (this is NOT an entry-level position);",
      "Strong writing, editing, and proofreading skills;",
      "Strong relationships with reporters and ability to regularly pitch stories;",
      "Understanding of print, digital, and broadcast media;",
      "Knowledge of current issues and events in which the Member is involved;",
      "Understanding of House franking rules; and",
      "Ability to work well under pressure and to work cooperatively and courteously with others."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, a writing sample, a list of three references, and a resume by Friday, January 26, 2024, to LaTreshia Hamilton at LaTreshia.Hamilton01@mail.house.gov. Incomplete applications will not be considered.",
    "salary_info": "Commensurate with Experience",
    "contact": "LaTreshia.Hamilton01@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-023-24",
    "position_title": "Legislative Assistant",
    "office": "Congressman Gabe Amo (RI-01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-01-15",
    "description": "The primary policy areas of responsibility for this position will include issues related to the House Committee on Foreign Affairs, including Defense, Immigration, and Veterans. Additional policy areas may be assigned based on the strengths, interests, and experiences of the candidate and needs of the office. This position reports to the Legislative Director and will work in close collaboration with the Member, Chief of Staff, and communications and district staff.\n\nThe individual will prepare and staff the Member for meetings, committee activity, and related events. The individual is expected to represent the Member in meetings with constituents, local and national stakeholder organizations, and administration officials. The individual will track legislation, monitor relevant committee and floor activity, track news events, and make recommendations in the assigned legislative areas. The individual will build support for the Member’s legislative agenda through developing and implementing new initiatives and be primarily responsible for drafting legislation, letters, remarks, and other written material related to policy portfolio.",
    "responsibilities": [
      "Prepare and staff the Member for meetings, committee activity, and related events.",
      "Represent the Member in meetings with constituents, local and national stakeholder organizations, and administration officials.",
      "Track legislation, monitor relevant committee and floor activity, track news events, and make recommendations in the assigned legislative areas.",
      "Build support for the Member’s legislative agenda through developing and implementing new initiatives.",
      "Draft legislation, letters, remarks, and other written material related to policy portfolio."
    ],
    "qualifications": [
      "Knowledge of the legislative process",
      "Ability to take initiative",
      "Hill experience is strongly preferred",
      "Rhode Island ties are a plus"
    ],
    "how_to_apply": "To apply, send in a single PDF with a resume, cover letter, and brief writing sample, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01AmoJobs@gmail.com, with the following subject line: “Full Name – Legislative Assistant.”",
    "salary_info": null,
    "contact": "RI01AmoJobs@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-021-24",
    "position_title": "Legislative Assistant",
    "office": "Congressman Gabe Vasquez (NM-02)",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "This staff member will be responsible for developing and implementing a policy agenda, staffing Committee hearings, and providing vote and policy recommendations to the member.\nThis Legislative Assistant will cover the Agriculture Committee, healthcare and additional issues.\nThis position reports directly to the Legislative Director, Chief of Staff, and Member. Responsibilities include developing and advancing a policy agenda; drafting legislation and letters to agencies and stakeholders; engaging stakeholders and constituents; staffing and preparing the Member for hearings, markups, and relevant briefings; and advancing the constituent correspondence program.\nThis is not an entry-level position. Qualified candidates will excel in the following areas:",
    "responsibilities": [
      "developing and advancing a policy agenda",
      "drafting legislation and letters to agencies and stakeholders",
      "engaging stakeholders and constituents",
      "staffing and preparing the Member for hearings, markups, and relevant briefings",
      "advancing the constituent correspondence program"
    ],
    "qualifications": [
      "Project Management: Responsible for managing and advancing both long and short-term goals",
      "Stakeholder Management: Responsible for building coalitions to advance the Member's agenda, and building relationships with relevant stakeholders and constituents.",
      "Sound Judgment: Must use sound judgment when making recommendations for votes, cosponsorships, and new legislation to ensure actions reflect the interests of all NM-02 constituents.",
      "Effective Communication: Must be able to communicate policy implications and recommendations effectively and concisely as well as exhibit strong external writing skills.",
      "previous legislative and/or policy experience",
      "interest/experience in the issue area portfolio described above",
      "strong written and interpersonal skills",
      "New Mexico ties and/or Spanish language proficiency is a plus."
    ],
    "how_to_apply": "Interested candidates should submit their resume, cover letter, and two references to NM02Applications@mail.house.gov by January 19, 2024. Applicants will be considered on a rolling basis.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NM02Applications@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Gabe Vasquez is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-020-24",
    "position_title": "Staff Assistant",
    "office": "Rep. Sharice Davids (KS-03)",
    "location": "Overland Park, KS",
    "posting_date": "2024-01-15",
    "description": "Responsibilities include welcoming office visitors, answering telephone calls, managing interns, sorting, and processing constituent correspondence, and other administrative duties as assigned.\n\nThe ideal candidate will be detail-oriented, able to multi-task and have a positive attitude. Applications will be accepted until Wednesday, January 17, 2024. This is an entry-level position.",
    "responsibilities": [
      "Welcoming office visitors",
      "Answering telephone calls",
      "Managing interns",
      "Sorting, and processing constituent correspondence",
      "Other administrative duties as assigned"
    ],
    "qualifications": [
      "Detail-oriented",
      "Able to multi-task",
      "Positive attitude"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and writing sample to ks03.jobs@mail.house.gov with the subject line “Staff Assistant”. A writing test will be administered. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ks03.jobs@mail.house.gov",
    "equal_opportunity": "The office is committed to building a diverse and inclusive team and is an equal opportunity employer."
  },
  {
    "id": "MEM-019-24",
    "position_title": "Press Assistant",
    "office": "Office of Congresswoman Kathy Manning",
    "location": "Capitol Hill",
    "posting_date": "2024-01-15",
    "description": "Ideal candidates are highly motivated and detail-oriented with some previous experience in communications, social media, and drafting short remarks.\n\nThis job requires the ability to execute multiple competing priorities in a fastpaced environment. It also offers the opportunity to work with a cohesive team with future growth potential in an office that values maintaining a positive environment for all members of staff. Previous work and/or internships on Capitol Hill and North Carolina ties are a plus.\n\nThis is a full-time position with some evening and weekend work as needed.",
    "responsibilities": [
      "Assisting the Communications Director",
      "Maintaining news and video clips",
      "Assisting with press event logistics",
      "Drafting newsletters, memos, social media posts, and remarks for the Congresswoman",
      "General offices tasks such as greeting visitors, answering phones as needed, and other duties as assigned"
    ],
    "qualifications": [
      "Candidates should possess strong writing skills",
      "Work well in a team environment",
      "Be able to handle multiple assignments simultaneously"
    ],
    "how_to_apply": "Candidates should submit a cover letter, a one-page resume, two references, and a writing sample to NC.Resumes@mail.house.gov by January 24th. Please use “Press Assistant” in the subject line, and do not reach out to the office directly.",
    "salary_info": "Salary is commensurate with experience. Among other benefits, the position offers health insurance, retirement benefits with an employer match, paid sick leave and annual leave, transit or parking benefits, and access to the Student Loan Repayment Program.",
    "contact": "NC.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-018-24",
    "position_title": "Staff Assistant/Constituent Services",
    "office": "Congressman Vern Buchanan (FL District 16)",
    "location": "Hillsborough County District Office, Brandon, Florida",
    "posting_date": "2024-01-15",
    "description": "The Office of Congressman Vern Buchanan (FL District 16) is looking for a dynamic Staff Assistant/Constituent Services candidate for its Hillsborough County District Office. The position is responsible for managing the front desk during office hours, handling constituent case work assignments, occasionally attending events, and assisting the area manager with special projects.\n\nThe work involves carrying light items such as books, papers, and small office equipment. The incumbent must be able to meet minimum physical requirements (e.g., lifting, bending, crouching, standing, etc.). Physical Requirements and work environment are subject to reasonable accommodations.",
    "responsibilities": [
      "Greets constituents and visitors to provide a welcoming environment and positive first impression.",
      "Answers and directs incoming calls, voicemails, and constituent inquiries to appropriate staff.",
      "Handles constituent casework assignments to include meetings with constituents, contacting agencies, researching cases, and case resolution.",
      "Occasionally attending events and/or meeting within the district, representing the Office",
      "Completes special projects as assigned by Area Manager.",
      "Orders all office supplies to maintain office equipment."
    ],
    "qualifications": [
      "Attention to Detail",
      "Ability to multitask",
      "Initiative",
      "Planning and Coordination",
      "Research and Analysis",
      "Interpersonal Skills",
      "Teamwork",
      "Verbal Communication",
      "Written Communication",
      "Coalition Building",
      "Decision Making",
      "Influencing and Advising",
      "Managing Others",
      "House Knowledge",
      "Legislative Knowledge",
      "Political Acumen",
      "Bachelor's degree or equivalent combination of education and experience preferred.",
      "Prior constituent service or customer relationship management is preferred",
      "Demonstrated interest in public service is preferred"
    ],
    "how_to_apply": "Send your resume and a cover letter detailing your relevant experience to MarDee.Buchman@mail.house.gov. No phone calls please. Deadline to submit resumes is February 2, 2024.",
    "salary_info": "Competitive salary and benefits package.",
    "contact": "MarDee.Buchman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-014-24",
    "position_title": "Senior Legislative Assistant",
    "office": "Rep. Kevin Mullin (CA-15)",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "Rep. Kevin Mullin (CA-15) is seeking a Senior Legislative Assistant to manage\nhis work in the environment, clean energy, water, wildlife, and climate change\nportfolios and to take the lead on other issue areas dependent on the interests of\nthe person and needs of the office. The person in this role will primarily focus on\nRep. Mullin’s work on the Natural Resources Committee, but will support his\nother committee work (Science, Space, and Technology) and/or other issues as\nneeded.\n\nRep. Mullin’s first pieces of legislation in Congress focused on environmental\njustice, equity for marginalized communities, and combating poverty. The person\nin this role should be interested and excited to approach policy work through this\nlens.\n\nThe Senior Legislative Assistant will report to the Legislative Director and will\nhave regular interaction with Rep. Mullin as well as with other legislative,\ncommunications, operations, and District staff. The ideal candidate will have 2-3\nyears of prior experience as a Legislative Assistant or comparable policy\nexperience, significant education and/or work experience on issues under the\njurisdiction of the Natural Resources Committee, and a commitment to public\nservice.",
    "responsibilities": [
      "Building relationships and working closely with Hill staff, governmental\nofficials, outside organizations, constituents, and other stakeholders",
      "Advancing the Member’s policy priorities via legislation, letters, and other\nopportunities",
      "Tracking legislation, formulating vote recommendations, and generating policy\nideas",
      "Preparing the Member for and staffing him in stakeholder meetings, hearings,\nmarkups, Floor votes, and related events as needed",
      "Representing the Member in meetings with constituents and stakeholders",
      "Closely monitoring and engaging in committee work",
      "Making recommendations to the Member on Floor and committee votes and on\nother actions, such as cosponsoring legislation and co-signing letters",
      "Drafting memos, legislation, letters, committee and Floor remarks, talking\npoints, and other written material",
      "Traveling to/from the District as needed",
      "Performing other duties as assigned by the Legislative Director and Chief of\nStaff"
    ],
    "qualifications": [
      "Excellent oral and written communication skills, including being able to write\nquickly and effectively with little oversight",
      "Interpersonal skills demonstrated by positive working relationships across the\npolitical spectrum",
      "Deep understanding of the legislative process and procedures",
      "A demonstrable record of developing and advancing legislation and other policy\nvehicles",
      "The ability to collaborate respectfully and productively on a small team",
      "Exceptional organizational skills",
      "Effectively balancing high attention to detail with the need for efficiency",
      "The ability to stay calm under pressure",
      "Interest in and ability to adapt to feedback",
      "The ability to take initiative in a fast-paced setting"
    ],
    "how_to_apply": "To apply, submit a cover letter and resume\nvia https://airtable.com/apprYNgTcbCLqWcnA/shrGkcYDV3btAsBUY",
    "salary_info": "The starting salary for this position is $70,000. The office also provides to all\nemployees:\n•Health, dental, and vision insurance coverage\n•Retirement benefits with an employer match and pension contributions\n•Paid vacation (20 days) plus Federal holidays\n•Paid sick and bereavement leave\n•Paid parental leave (12 weeks)\n•Paid FMLA leave (6 weeks)\n•Transit or parking benefits\n•Federal student loan repayment\n•Access to life insurance coverage\n•Flexible remote work policy out of session",
    "contact": null,
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on\nrace, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ\nidentification, family status, or military status. Women, people of color, and other\nmembers of traditionally underrepresented communities are strongly encouraged\nto apply."
  },
  {
    "id": "MEM-013-24",
    "position_title": "Field Representative/Caseworker",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Cypress, CA",
    "posting_date": "2024-01-15",
    "description": "Under the supervision of the Chief of Staff and the District Director, the Field Representative/ Caseworker acts as the representative for the Member. Field Representative responsibilities include strengthening relationships with key stakeholders, as well as attending engagements on behalf of the Member. Caseworker responsibilities include helping constituents resolve problems with federal agencies through written and verbal communication.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned",
      "Maintain up-to-date files on all cases and categories of information",
      "Continually manage active cases and serve as a liaison with constituents to ensure that cases are handled in a timely and appropriate manner"
    ],
    "qualifications": [
      "Political savvy and comfortable navigating complicated situations",
      "Strong written, verbal, analytical, and organization skills; impeccable customer service manners; public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including occasional nights/weekends",
      "Bachelor’s degree or related job experience is required. A demonstrated interest in public service and familiarity with Orange and Los Angeles Counties is preferred."
    ],
    "how_to_apply": "Submit a cover letter and resume to Stephanie Hu, District Director, Office of Congresswoman Steel, Stephanie.Hu@mail.house.gov.",
    "salary_info": "Salary starts at $50,000 per year. Salary commensurate with experience.",
    "contact": "Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin"
  },
  {
    "id": "MEM-012-24",
    "position_title": "Legislative Counsel",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "The Office of Congresswoman Pramila Jayapal (WA-07) is seeking a Legislative Counsel to lead the office's Judiciary portfolio.\n\nThe Congresswoman is a Member of the House Judiciary Committee and the Ranking Member on the Subcommittee on Immigration Integrity, Security and Enforcement. This position will lead on all issues within the jurisdiction of the Judiciary Committee (except Immigration), which include but are not limited to: antitrust, courts, criminal justice, elections, protection of civil rights and civil liberties, and intellectual property.",
    "responsibilities": [
      "Preparing and staffing the Congresswoman for committee hearings and markups including proposing strategic approaches, drafting remarks and questions, preparing amendments and talking points;",
      "Advancing current and new legislative initiatives including idea generation, building support, legislative drafting and producing accompanying materials, such as speeches, policy memos, and factsheets;",
      "Developing expertise in new issue areas as they arise;",
      "Representing the Congresswoman's priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal stakeholders including advocacy organizations; academics; fellow Congressional and Committee offices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values;",
      "Excellent writing and time management skills;",
      "Ability to digest new content with a political and ideological lens that is appropriate for the office;",
      "Previous Hill experience strongly preferred;",
      "Poised, level-headed, flexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Candidates should submit their resume, cover letter, two writing samples, and references in PDF format to jobs.pramila@mail.house.gov with “Legislative Counsel”: [Applicant’s First and Last Name]” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus. Prior Hill experience is strongly preferred."
  },
  {
    "id": "MEM-011-24",
    "position_title": "STAFF ASSISTANT",
    "office": "Rep. Jake Auchincloss",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "Rep. Jake Auchincloss has an immediate need to hire a Staff Assistant for the\nWashington, DC office in a full-time capacity. The Staff Assistant will be\nexpected to drive the Member to and from official activities, manage the front\ndesk during office hours, handle all tour requests, fulfill flag requests, support the\ndistrict office with administrative office needs, and assist the DC office staff with\nwork as assigned. Staff Assistants often provide the first impression of the office\nto constituents, guests, and other VIPs.\n\nThe ideal candidate should have excellent attention to detail, a strong work ethic\nand exceptional written communication skills, an eagerness to learn and grow\nwithin the office, and a desire to be part of a highly-collaborative, high-achieving\nteam. The position is full time with a salary of $55,000 and federal benefits,\nincluding student loan repayment program (if eligible) and transit or parking\nbenefits.",
    "responsibilities": [
      "Drives the Member to and from official activities",
      "Provides a welcoming environment and positive first impression of the office to constituents, visitors, and other VIPs",
      "Handles incoming calls with poise, professionalism, and promptness",
      "Captures input from constituents on policy matters for the Member office’s consideration and response",
      "Works closely with the Member’s Director of Operations to ensure appointments are on time",
      "Organizes and manages tasks for constituents to include flag requests, providing tours of the Capitol, and arranging visits to other national landmarks",
      "And other duties as assigned"
    ],
    "qualifications": [
      "Access to a car and a license in good standing with the DMV of their state of residence",
      "Exceptional communication skills for verbal and written correspondence",
      "Effective teamwork skills and the ability to support the needs of multiple team members and leaders in the office required",
      "Professional demeanor and an upbeat disposition while interacting with visitors, staff members, and stakeholders in a fast-paced, highly dynamic environment required",
      "Time management skills including the ability to prioritize, and track work status required",
      "Attention to detail",
      "Willingness to learn"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, cover letter, writing sample, and references to AuchinclossJobs@mail.house.gov with the subject line “Staff Assistant- [applicant’s last name]”. Applications will be considered on a rolling basis.",
    "salary_info": "$55,000 and federal benefits, including student loan repayment program (if eligible) and transit or parking benefits.",
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, sexual orientation, or any other characteristic protected by applicable law. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-009-24",
    "position_title": "Financial Services Fellow",
    "office": "Rep. French Hill, Vice Chairman of the House Financial Services Committee and Chairman of the Subcommittee on Digital Assets and Financial Technology",
    "location": "Capitol Hill",
    "posting_date": "2024-01-15",
    "description": "From the Member's personal office, the Fellow will assist the Senior Policy Advisor on committee work as well as substantive financial services issues including policy related to: financial institutions; digital assets; financial technology; capital markets; housing; and insurance. The Fellow's day-to-day activities will include: attending and reporting on hearings; monitoring legislation and regulatory proposals; drafting official and constituent correspondence; and drafting meeting materials.\n\nDuring the fellowship, the Fellow will gain an in-depth understanding of how Capitol Hill operates, as well as the major policy issues in financial services.",
    "responsibilities": [
      "Attending and reporting on hearings",
      "Monitoring legislation and regulatory proposals",
      "Drafting official and constituent correspondence",
      "Drafting meeting materials"
    ],
    "qualifications": [
      "Excellent writers",
      "Able to work in a fast-paced environment",
      "Able to exercise good judgment",
      "A background in finance, whether from the private sector, government, or education, is strongly preferred but not required"
    ],
    "how_to_apply": "Interested candidates should send their resume to ar02.applications@mail.house.gov with 'Financial Services Fellow' in the subject line.",
    "salary_info": "This is a paid fellowship.",
    "contact": "ar02.applications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-008-24",
    "position_title": "Staff Assistant",
    "office": "Northeastern Democrat",
    "location": "Capitol Hill office",
    "posting_date": "2024-01-15",
    "description": "Senior Northeastern Democrat seeks Staff Assistant for Capitol Hill office for typical front desk duties, including answering phones, managing D.C. office interns, processing flag and tour requests, and office-supporting administrative tasks.\nOther press and correspondence tasks may also figure into the job.",
    "responsibilities": [
      "Answering phones",
      "Managing D.C. office interns",
      "Processing flag and tour requests",
      "Office-supporting administrative tasks",
      "Other press and correspondence tasks"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should send a cover letter, resume, and brief writing sample to housedemjobs@gmail.com with “Staff Assistant” in the subject line.",
    "salary_info": "$45,000",
    "contact": "housedemjobs@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Women, candidates of color, and LGBTQ+ candidates are encouraged to apply."
  },
  {
    "id": "MEM-007-24",
    "position_title": "STAFF ASSISTANT/DRIVER",
    "office": "Sr. Florida Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2024-01-15",
    "description": "Responsibilities include transporting the Member (including evenings), answering phones, processing mail, welcoming office visitors, processing flag requests, logging constituent mail, assisting with scheduling/operations and working with legislative staff on other duties as assigned.\n\nSuccessful candidates will have professional experience and familiarity working in a legislative environment. Additional experience including professional writing, customer service, time-management, and organizational skills are required. A positive, solution-oriented personality who has an ability to multitask effectively in a fast-paced environment is ideal.\n\nSouth Florida/Florida ties are required and prior work in a Congressional or Senate office is a major plus.\n\nA car and a good driving record are required for this position.",
    "responsibilities": [
      "transporting the Member (including evenings)",
      "answering phones",
      "processing mail",
      "welcoming office visitors",
      "processing flag requests",
      "logging constituent mail",
      "assisting with scheduling/operations",
      "working with legislative staff on other duties as assigned"
    ],
    "qualifications": [
      "professional experience",
      "familiarity working in a legislative environment",
      "professional writing skills",
      "customer service skills",
      "time-management skills",
      "organizational skills",
      "positive, solution-oriented personality",
      "ability to multitask effectively in a fast-paced environment",
      "South Florida/Florida ties",
      "prior work in a Congressional or Senate office (major plus)",
      "A car and a good driving record"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to FL25Resume@mail.house.gov with the subject line “SA/DRIVER.” Please save cover letter and resume in a single file (pdf preferred) and name the file “Last name, First name.”",
    "salary_info": null,
    "contact": "FL25Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-005-24",
    "position_title": "Legislative Director",
    "office": "Congressman Pat Ryan (NY-18)",
    "location": "Washington D.C.",
    "posting_date": "2024-01-15",
    "description": "The office of Congressman Pat Ryan (NY-18) is hiring a Legislative Director.\nThe role will report to the Chief of Staff and be based in Washington D.C. Rep.\nRyan serves on T&I and HASC.",
    "responsibilities": [
      "Implementing the legislative priorities of the Member and developing innovative policy solutions to deliver for core constituencies throughout the district.",
      "Managing a legislative team, including, but not limited to, day-to-day project management, goal-setting and tracking, fostering professional development, and overseeing legislative personnel hiring.",
      "Advising the Member on legislative matters, including vote recommendations, cosponsorship requests, and bill introductions.",
      "Providing status reports on all legislation affecting the district in order to keep the full team up-to-date on office priorities, goals, and accomplishments.",
      "Working alongside the communications team to disseminate timely and accurate information to constituents regarding legislative activity within the House.",
      "Oversee the Office’s correspondence program",
      "Collaborating with the Chief of Staff & District Director to identify legislative solutions and outreach opportunities to address constituents’ casework concerns."
    ],
    "qualifications": [
      "Successful and impactful experience as a Senior Staffer or Legislative Staffer in a battleground House Congressional office.",
      "Strong understanding of Committee, floor, and other House procedures",
      "Strong written and verbal communication skills.",
      "Exceptional time management and organizational skills.",
      "Staff management experience.",
      "Ability to build and maintain strong partner relationships, including with constituency organizations, advocacy groups, colleagues, as well as caucus, committee, and leadership staff.",
      "Preferred: Experience working in a district office or for a battleground member.",
      "Preferred: Staff management experience.",
      "Integrity, compassion, sound judgment, and a commitment to Democratic values."
    ],
    "how_to_apply": "To apply, please send your resume, cover letter, and three references to ny18resumes@mail.house.gov with the job title in the subject line and your full name (e.g.: “Legislative Director - Jed Bartlet). The deadline to apply is COB 1/31/24 and applicants will be evaluated on a rolling basis.",
    "salary_info": "The pay range for a Legislative Director is $90,000-$110,000.",
    "contact": "ny18resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-004-24",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Susan Wild",
    "location": "Washington, D.C.",
    "posting_date": "2024-01-15",
    "description": "Congresswoman Susan Wild, a member of the House Foreign Affairs Committee and House Education and the Workforce Committee, seeks an experienced Legislative Assistant to join her team.\n\nThe policy portfolio and areas of responsibility for this position are fluid, reflecting the strengths, interests, and experiences of the candidate. Primary responsibilities include closely tracking legislation and making vote recommendations, regularly meeting with constituent and stakeholder groups, and actively implementing legislative initiatives consistent with the Congresswoman’s policy goals.\n\nThis position reports to the Legislative Director and Deputy Chief of Staff and will include extensive work with the Congresswoman and the rest of her team.\n\nQualified candidates should have knowledge of the legislative process and demonstrate an ability to take initiative. Hill experience is strongly preferred.",
    "responsibilities": [
      "Preparing and staffing Member for meetings, committee hearings and markups, floor votes, and related events;",
      "Representing Member in meetings with constituents and both national- and local-level advocacy groups, think thanks, and other groups relevant to policy portfolio;",
      "Tracking legislation and other developments in assigned issue area(s), monitor relevant committee and floor activity, track developing local/international news events, make recommendations for votes, cosponsorships and letters for Member to sign;",
      "Building and maintaining positive relationships with congressional staff, district and national stakeholders, advocacy organizations, Executive Branch officials, and other key stakeholders relevant to policy portfolio;",
      "Building support for Member’s policy priorities and developing/implementing ideas for new initiatives (legislation, letters, events, press, etc.) including a strong emphasis on bipartisanship;",
      "Drafting legislation, letters, floor/committee remarks, talking points, press related materials, and other written material related to policy portfolio; and",
      "Other duties as assigned by senior staff."
    ],
    "qualifications": [
      "Knowledge of the legislative process",
      "Ability to take initiative",
      "Hill experience strongly preferred"
    ],
    "how_to_apply": "To apply, please submit a cover letter, resume, and writing sample to RepWildJobs@gmail.com with “Legislative Assistant” in the subject line. Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": "RepWildJobs@gmail.com",
    "equal_opportunity": "The Office of Representative Susan Wild is an equal opportunity employer, committed to developing an organization that is reflective of and attentive to the needs of the diverse community we serve. The office does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-003-24",
    "position_title": "Communications Director",
    "office": "Office of Representative Susan Wild",
    "location": null,
    "posting_date": "2024-01-15",
    "description": "Congresswoman Susan Wild, a member of the House Foreign Affairs Committee and House Education and the Workforce Committee, seeks an experienced Communications Director to join her team.\nThis position reports to the Deputy Chief of Staff and Chief of Staff and will include extensive work with the Congresswoman and the rest of her team.\nQualified candidates should have extensive experience pitching earned media and with all forms of traditional media.",
    "responsibilities": [
      "Designing and executing an aggressive communications plan that highlights Rep. Wild’s work in-district;",
      "Constantly driving an aggressive earned media plan;",
      "Working with legislative staff and others to prepare the congresswoman’s remarks for public and private events;",
      "Prepare briefing materials for the congresswoman and lead sessions to prepare her for press appearances;",
      "Overseeing and approving all digital communications and social media content;",
      "Overseeing a Press Assistant and managing and collaborating with a constituent communications consultant;"
    ],
    "qualifications": [
      "extensive experience pitching earned media",
      "experience with all forms of traditional media"
    ],
    "how_to_apply": "To apply, please submit a cover letter, resume, and writing sample to RepWildJobs@gmail.com with “Communications Director” in the subject line. Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": "RepWildJobs@gmail.com",
    "equal_opportunity": "The Office of Representative Susan Wild is an equal opportunity employer, committed to developing an organization that is reflective of and attentive to the needs of the diverse community we serve. The office does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-001-24",
    "position_title": "Press Secretary",
    "office": "Congressman Gabe Amo (RI-01)",
    "location": "Rhode Island",
    "posting_date": "2024-01-15",
    "description": "The Press Secretary will be responsible for drafting press releases, statements, talking points, booking interviews with national and local press outlets, pitching stories, responding to reporter inquiries, creating and posting social media posts, compiling news clips, managing the Member’s website, assisting with the constituent outreach program, and other duties as assigned.\n\nThe Press Secretary is expected to advance press events and staff the Member as needed. The Press Secretary will work in close collaboration with the Chief of Staff, District Director, and legislative and district staff as appropriate.",
    "responsibilities": [
      "Drafting press releases, statements, talking points",
      "Booking interviews with national and local press outlets",
      "Pitching stories",
      "Responding to reporter inquiries",
      "Creating and posting social media posts",
      "Compiling news clips",
      "Managing the Member’s website",
      "Assisting with the constituent outreach program",
      "Advance press events",
      "Staff the Member"
    ],
    "qualifications": [
      "Previous communications experience",
      "Exceptional writing skills",
      "Proficiency in photo and video editing and graphic design tools",
      "Organized",
      "Detail-oriented",
      "Highly motivated to serve on an active team",
      "Experience working in a fast-paced environment",
      "Prepared to implement a communications plan",
      "Rhode Island ties are a plus"
    ],
    "how_to_apply": "To apply, send in a single PDF with a resume, cover letter, and brief writing sample, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01AmoJobs@gmail.com, with the following subject line: “Full Name – Press Secretary.”",
    "salary_info": null,
    "contact": "RI01AmoJobs@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-636-23",
    "position_title": "Chief of Staff",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "Washington, D.C.",
    "posting_date": "2024-01-15",
    "description": "Congressman Glenn Ivey (MD-04) seeks a seasoned and empathetic manager of staff and leader of his strategic vision based in the Washington, D.C., office with a background in matters before the House Homeland Security and Judiciary Committees, preferably with a knowledge base in oversight and investigations. Candidates with J.D. degrees are strongly encouraged to apply but not required and familiarity with the district is preferred.\n\nWorking for this freshman office represents an opportunity to build something dynamic and enduring from the ground up, particularly for a Member of Congress who is a great communicator and cares deeply about the well-being and professional development of his staff.",
    "responsibilities": [
      "Formulating policy positions",
      "Overseeing the office’s legislative, constituent, correspondence, and media-relations strategies",
      "Handing all recruiting and hiring efforts, the establishment of office policies and procedures, and supervision of senior staff",
      "Serving as the Member’s chief advisor",
      "Developing and implementing all policy objectives, strategies, and operating plans",
      "Representing the Member with House leadership and committee staff",
      "Managing the office budget and personnel activities"
    ],
    "qualifications": [
      "Extensive experience in Congress or the federal government",
      "Developed and implemented an overarching strategy for an organization or Member before",
      "Strong written and verbal communication skills",
      "Interest in cultivating a warm, supportive, and productive work environment",
      "Comfort balancing responsibilities and competing deadlines",
      "A cool and levelheaded demeanor in fast-paced environments",
      "Political savvy and knowledge of Hill culture",
      "Good judgment and strong decision-making skills",
      "Expertise in developing and maintaining relationships with constituents and community leaders",
      "Background in matters before the House Homeland Security and Judiciary Committees, preferably with a knowledge base in oversight and investigations",
      "J.D. degrees are strongly encouraged",
      "Familiarity with the district is preferred"
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, and a writing sample to md04resumes@gmail.com with the subject line: “Full Name – Chief of Staff.” We will accept applications until the position is filled.",
    "salary_info": null,
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an equal-opportunity employer that does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-633-23",
    "position_title": "Military Legislative Assistant or National Security Advisor",
    "office": "Congressman Jason Crow (D-CO)",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "This person will be responsible for managing a high-profile national security portfolio; developing the Congressman’s national security agenda; seeking opportunities for leadership; handling the Congressman’s work on HPSCI, HASC, and some aspects of HFAC; and, managing relationships with senior government officials, industry, and NGO leaders.",
    "responsibilities": [
      "Managing a high-profile national security portfolio",
      "Developing the Congressman’s national security agenda",
      "Seeking opportunities for leadership",
      "Handling the Congressman’s work on HPSCI, HASC, and some aspects of HFAC",
      "Managing relationships with senior government officials, industry, and NGO leaders"
    ],
    "qualifications": [
      "A strong background in national security and defense issues",
      "Excellent attention to detail",
      "A proactive work ethic",
      "Willing to travel",
      "Eligible for a TS clearance"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to CO06.resumes@mail.house.gov. No phone calls or drop ins please.",
    "salary_info": null,
    "contact": "CO06.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer."
  },
  {
    "id": "MEM-630-23",
    "position_title": "Communications Director",
    "office": "Representative Josh Gottheimer",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "Representative Josh Gottheimer seeks an experienced Communications\nDirector for their Washington, DC office.",
    "responsibilities": [
      "Developing and implementing an aggressive media and communications strategy;",
      "Serving as the on-the-record spokesperson and primary media liaison for the Member;",
      "Proactively seeking local and national interviews with radio, print, television, and new media outlets;",
      "Maintaining good, working relationships with members of the press corps;",
      "Overseeing the implementation of a multi-faceted Franked communications program with a large budget;",
      "Drafting talking points, speeches, press releases, media advisories, op-eds, and statements for the Member;",
      "Organizing, coordinating, and staffing events with the media;",
      "Managing all members of the Communications team;",
      "Managing the process for the updates to social media platforms and the office website;",
      "Managing the organization and distribution of the daily news clips for the Member and office staff;",
      "Working closely with the District Office to ensure coverage of local priorities;",
      "And working closely with the legislative team to ensure coverage of the Member’s policy priorities."
    ],
    "qualifications": [
      "A Bachelor’s degree or related job experience;",
      "3-5 years of communications experience in a Congressional office, on a political campaign, or in another fast-paced environment;",
      "Excellent attention to detail;",
      "Sound judgment;",
      "Strong communication skills;",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner;",
      "Willingness to accept direction and guidance on performance and process improvements form the Chief of Staff and Member;",
      "The ability to anticipate challenges and proactively offer solutions;",
      "The ability to thrive in a fast-paced environment;",
      "And the ability to work flexible hours including long hours, nights, and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Communications Director” as the subject line to NJ5Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-546-23",
    "position_title": "Member Services Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": null,
    "posting_date": "2024-01-15",
    "description": "The Congressional Black Caucus (CBC) seeks a Member Services Director who\nis exceptionally motivated, dynamic, strategic, and detail-oriented to engage with\nCBC Member offices and outside partners to advance a robust member services\nportfolio.\n\nThe Member Services Director will be expected to proactively build strong\nrelationships across CBC Member offices and develop strategic opportunities for\nMember engagement advancing shared priorities. The individual will also be\nexpected to coordinate with CBC staff to field and respond to inquiries and\nrequests for support from Member offices and respond to and share external\nopportunities for Member engagement as they arise.\n\nThe Member Services Director is also responsible for assisting in overseeing all\naspects of caucus operations, logistics, designated administrative responsibilities\nand to support caucus leadership.",
    "responsibilities": [
      "Conducting regular outreach to Member offices to build relationships with staff,\nshare opportunities for Member or staff participation in events, messaging, and\nother efforts, and identify new ideas for collaboration with Member offices",
      "Sharing resources with Member offices and working with CBC, congressional,\nand external staff to develop high-quality materials for Member office use",
      "Drafting regular newsletters for Member offices with relevant updates and\nopportunities, as well as for external audiences to uplift Member engagement on\nCBC issues",
      "Developing a network of external partners working on issues relevant to the\nCBC and Member offices",
      "Maintaining staff contact information and distribution lists",
      "Provides orientation and training for new staff;",
      "Assists departing employees with necessary administrative procedures (i.e.,\nreturning keys, House I.D. cards, and other office property; obtaining forwarding\naddresses, work files, and records);",
      "Supervises the mail operations and the administrative files and personnel\nrecords;",
      "Assists staff in scheduling House or Capitol rooms for outside group functions;",
      "Organize and facilitate meetings and other strategic convenings to support institutional",
      "change, policies, and programmatic work;",
      "Oversees operations for CBC including organizing weekly meetings and events",
      "Provides logistical support for all programming",
      "Works with the CBC personal office staffs and coordinates with the CBC\nSchedulers to implement the Caucus’ priorities",
      "Builds and maintains databases of internal and external stakeholders"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and\nfamiliarity working with the African American community.",
      "Outstanding writing\nand communication skills, sound political judgment, and the ability to work\nclosely and collaboratively with multiple Member offices and key stakeholders\nare essential.",
      "Top candidates should also be detail-oriented and possess the ability\nto multi-task, work well in a fast-paced setting, and act as a team player.",
      "Candidates should have a demonstrated understanding of House and Senate\nlegislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-508-23",
    "position_title": "Press Secretary/Digital Director (PS/DD)",
    "office": "Congresswoman Shontel Brown (OH-11)",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "Working with the Communications Director, located in the District, the PS/DD will develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence. Other primary responsibilities include but are not limited to developing, editing, and producing graphics, videography, and other creative tools to enhance messaging; fielding press requests from local and national media; producing the Member’s newsletters; drafting releases and advisories, speeches , and talking points.\n\nThe successful candidate will have a creative and strategic approach to visual and graphic design, excellent oral and written communications skills, an ability to handle multiple assignments on tight deadlines, a desire to hone the Member’s voice, a strong collaborative approach to cross functional teaming, and a good sense of humor. They will also have a working knowledge of the legislative process, procedures, and organization of the House, with a proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately. Ohio ties are a plus, but not required, but proven effective digital and videography experience is required.\n\nThis is not an entry level position. The ideal candidate will have at least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level.",
    "responsibilities": [
      "Develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence.",
      "Developing, editing, and producing graphics, videography, and other creative tools to enhance messaging",
      "Fielding press requests from local and national media",
      "Producing the Member’s newsletters",
      "Drafting releases and advisories, speeches , and talking points."
    ],
    "qualifications": [
      "Creative and strategic approach to visual and graphic design",
      "Excellent oral and written communications skills",
      "Ability to handle multiple assignments on tight deadlines",
      "Desire to hone the Member’s voice",
      "Strong collaborative approach to cross functional teaming",
      "Good sense of humor",
      "Working knowledge of the legislative process, procedures, and organization of the House",
      "Proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately",
      "Proven effective digital and videography experience is required",
      "At least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level."
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume, two writing and one creative samples to Ohio11Resumes@mail.house.gov with the subject line “Press Secretary – Last Name, First Initial.” No drop-ins, direct emails to staff or phone calls, please. The position is open until filled, but applications will be screened as they are received.",
    "salary_info": "The salary is flexible and dependent upon proven experience and expertise.",
    "contact": "Ohio11Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-468-23",
    "position_title": "Investigative Counsel",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2024-01-15",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks one attorney with 5-10 years of experience to serve as Investigative Counsel.\n\nThe Investigative Counsel reports to the Staff Director and Chief Counsel and will be responsible for conducting sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives and advising the Staff Director and Chief Counsel on legal and policy matters.\n\nThe OCE is seeking attorneys interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Counsel would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Review information received by OCE, discern possible violations, and identify facts requiring further investigation",
      "Plan, organize and conduct investigations regarding allegations and advise the Staff Director and Chief Counsel regarding appropriate evaluation of cases",
      "Advise the Staff Director and Chief Counsel on legal issues in matters under investigation and on broader legal and policy issues involved in the operations of OCE",
      "Draft lengthy and detailed memoranda, reports, and referrals for Board consideration and potential public release",
      "Developing investigative strategies and implementing investigative plans",
      "Reviewing evidence and data in order to analyze, develop, and provide detailed written and oral reports of findings",
      "Identifying information to substantiate or disprove allegations and assess the likely sources of that information",
      "Collecting and reviewing documents, electronic media, and physical evidence",
      "Interviewing witnesses and subjects",
      "Performing other duties as assigned"
    ],
    "qualifications": [
      "Demonstrated ability to conduct and direct complex legal research and present the results in a clear, precise and persuasive manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Strong legal judgment and demonstrated professional integrity",
      "Experience auditing large sets of data or evidence and providing detailed analysis",
      "Investigative experience with high-profile and sensitive matters",
      "Experience with investigations involving public officials",
      "Experience with campaign finance or ethics law",
      "Experience conducting interviews or depositions",
      "Experience writing public reports or legal documents",
      "Advanced proficiency in development and use of electronic databases, and other computer skills including knowledge of current information technology tools related to investigations",
      "work independently or as part of an investigative team",
      "manage multiple tasks and projects",
      "work well under pressure and tight time deadlines",
      "exercise discretion and independent judgment",
      "Ability to pass Security Background Investigation to obtain Top Secret clearance",
      "Graduation from an ABA accredited law school and active bar membership"
    ],
    "how_to_apply": "Please send cover letter, short writing sample, and resume (electronic submissions preferred) to:",
    "salary_info": null,
    "contact": {
      "name": "Omar S. Ashmawy",
      "title": "Staff Director and Chief Counsel",
      "office": "Office of Congressional Ethics",
      "address": "P.O. Box 895\nWashington, DC 20515-0895",
      "email": "OCEJOB@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-01-15",
    "description": "The Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-354-23",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2024-01-15",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public. The Policy Director’s responsibilities will include:",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  }
]