[
  {
    "id": "MEM-219-20",
    "position_title": "Press Secretary",
    "office": "New York Congressman",
    "location": "DC",
    "posting_date": "2020-08-03",
    "description": "The press secretary is responsible for developing and executing a media strategy, which includes writing press releases, talking points, and op-eds, while also managing the Member's social media pages, web site, pitching story ideas and working closely with reporters. Must have on-the-record experience and strong writing skills. Candidates with NY ties a plus. This is not an entry level position.",
    "responsibilities": [
      "Developing and executing a media strategy",
      "Writing press releases, talking points, and op-eds",
      "Managing the Member's social media pages",
      "Managing the web site",
      "Pitching story ideas",
      "Working closely with reporters"
    ],
    "qualifications": [
      "On-the-record experience",
      "Strong writing skills",
      "NY ties a plus"
    ],
    "how_to_apply": "Please send resume and writing sample to ny03.resumes@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "ny03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-217-20",
    "position_title": "Legislative Correspondent",
    "office": "Conservative Congressman",
    "location": "Washington, DC",
    "posting_date": "2020-08-03",
    "description": "Responsibilities include drafting constituent letters, sorting and batching mail, and assisting the legislative staff with various projects.",
    "responsibilities": [
      "Drafting constituent letters",
      "Sorting and batching mail",
      "Assisting the legislative staff with various projects"
    ],
    "qualifications": [
      "Strong conservative credentials",
      "Effective writing and research skills",
      "Attention to detail",
      "Ability to manage multiple tasks at once",
      "Previous Capitol Hill experience preferred"
    ],
    "how_to_apply": "To apply, send resume and cover letter to goplc1776@gmail.com",
    "salary_info": null,
    "contact": "goplc1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-210-20",
    "position_title": "Communications Director",
    "office": "Congresswoman Yvette D. Clarke",
    "location": "Washington, D.C.",
    "posting_date": "2020-08-03",
    "description": "Responsibilities include communications planning and press strategy for D.C. and the district; drafting press materials including: remarks, talking points, newsletters, statements, press releases, and media advisories; pitching media events; assisting with the management of the Congresswoman’s social media accounts; interview preparation; and overseeing the office’s franked mail and digital programs.\n\nThe ideal candidate is a strong writer, politically savvy, detail-oriented, flexible, creative, and a self-starter.\n\nOccasional travel to the district and non-traditional hours - including night and weekend work - should be expected. Strong ties to New York press preferred.",
    "responsibilities": [
      "Communications planning and press strategy for D.C. and the district",
      "Drafting press materials including: remarks, talking points, newsletters, statements, press releases, and media advisories",
      "Pitching media events",
      "Assisting with the management of the Congresswoman’s social media accounts",
      "Interview preparation",
      "Overseeing the office’s franked mail and digital programs"
    ],
    "qualifications": [
      "Strong writer",
      "Politically savvy",
      "Detail-oriented",
      "Flexible",
      "Creative",
      "Self-starter",
      "Strong ties to New York press preferred"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three writing samples to ResumeNY@mail.house.gov and include “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-206-20",
    "position_title": "Research and Data Analyst",
    "office": "House Office of Diversity and Inclusion",
    "location": null,
    "posting_date": "2020-08-03",
    "description": "In this capacity the Analyst will be responsible for leading data and research\ncollection and analysis for the Office of Diversity and Inclusion. This\nindividual will lead the development of the required diversity report, maintain\nkey metrics and key performance indicators for the Office, and serve as a\nresource for external and internal diversity best practices.\n\nThis individual will also serve as the project manager for any consultants\nand/or contractors with whom the Office may engage to support the\ncompletion of the diversity report and to develop relevant diversity and\ninclusion-based training, in collaboration with the Congressional Staff\nAcademy.",
    "responsibilities": [
      "This staffer will assist in the translation of research findings into materials\nthat staff can effectively utilize in their engagements with Members and\nMember offices.",
      "Provide research support on diversity and inclusion studies, techniques and\ntools.",
      "Serve as project manager for the diversity report and, where necessary,\ndirect and coordinate activities of external consultants.",
      "Research and study best practices for retention and growth in House\nemploying offices.",
      "Lead data tracking and reporting with a focus on performance and results.",
      "Prepare regular updates and briefing documents on research that is relevant\nto House employing offices.",
      "Assist with the development and delivery of training sessions and, as\nneeded, conduct presentations at professional conferences and meetings."
    ],
    "qualifications": [
      "Master’s degree in social or behavioral sciences or related field; or equivalent\nlevel of experience providing technical assistance, data collections and/or\nresearch.",
      "Must have knowledge and experience in diversity, equity, and inclusion\nresearch efforts, ideally with a strong background in curriculum development.",
      "Current working knowledge of coalition functioning, evaluation and research.",
      "Quantitative and qualitative evaluation and research skills.",
      "Expertise using relevant software.",
      "Customer-service orientation and ability to work harmoniously with a\ndiverse team.",
      "Ability to work under deadline pressure and extra hours if needed on\nassignment.",
      "Demonstrated ability to self-motivate, initiate project activities, and work on\nmultiple assignments simultaneously.",
      "Extensive computer skills, including data input."
    ],
    "how_to_apply": "Interested candidates should apply by following the instructions here:\nhttps://house.csod.com/ux/ats/careersite/1/home/requisition/86?c=house\n\nCandidates will be asked to upload a cover letter, resume, and two writing\nsamples.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "No phone calls or drop-ins please.",
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+\ncandidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-191-20",
    "position_title": "Communications Director",
    "office": "Member",
    "location": null,
    "posting_date": "2020-08-03",
    "description": "The Communications Director manages and coordinates the messaging and\ncommunications activities, including media contacts, for the Member and the\noffice. Traditional and digital communications including emails, social media\nposts, and website updates fall within the management of the\nCommunications Director. The position reports to the Member and Chief of\nStaff.",
    "responsibilities": [
      "Acts as the formal spokesperson and media liaison for the Member;",
      "Develops and implements media, communications, and public relations\nstrategy for the Member;",
      "Remains abreast of current legislative and non-legislative issues about which\nthe Member may speak or be questioned;",
      "Evaluates current events and media reports in the District and the nation for\ntheir impact on the Member;",
      "Provides ideas and advice on the effect, in the media, of the Member's\nactions and legislative activities;",
      "Writes speeches for the Member;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Member, staff, media, and\nconstituents;",
      "Works well under pressure and handles stress;",
      "Accepts performance-based criticism and direction;",
      "Works a flexible schedule including long hours, nights, and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Bachelor’s degree in journalism, public relations, or a closely related field; strong academic credentials; and at least 5 years of professional media experience. Graduate degree preferred. Alternatively, 15 years of related experience or training may suffice.",
      "Strong writing, editing, and proofreading skills;",
      "Strong communication skills;",
      "Thorough understanding of digital, print, social and broadcast media;",
      "Thorough knowledge of the legislative process, procedures, and organization of the House;",
      "Knowledge of current issues and events in which the Member is involved;",
      "Ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications; and",
      "Proficiency in Microsoft Word, Power Point, Access, and Excel."
    ],
    "how_to_apply": "To apply, please send resume, cover letter, and two writing samples to\nMD07employment@mail.house.gov",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": null
  }
]