[
  {
    "id": "MEM-541-19",
    "position_title": "Press/Digital Assistant",
    "office": "Congressman Harley Rouda (CA-48)",
    "location": "Orange County office",
    "posting_date": "2019-10-28",
    "description": "The Office of Congressman Harley Rouda (CA-48) is seeking a Press/Digital Assistant in his Orange County office.\n\nThis position requires the ability to thrive under pressure, multi-task, and work in a team environment.",
    "responsibilities": [
      "Drafting social posts + press releases",
      "Compiling daily press clips",
      "Assisting with speechwriting",
      "Maintaining/updating website",
      "Filming speeches + events",
      "Designing graphics + editing photos/videos"
    ],
    "qualifications": [
      "Qualified candidates will have strong writing, editing, and social media skills, as well as basic familiarity with graphic design/video editing software.",
      "One to two years of experience in a press or digital media role (including internships) preferred."
    ],
    "how_to_apply": "Interested applicants should email a cover letter, resume, and a short writing sample/portfolio to ca48resumes@gmail.com with \"Orange County Press/Digital Assistant\" in the subject line.",
    "salary_info": null,
    "contact": "ca48resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-539-19",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-10-28",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office. The Committee’s financial disclosure counsel are responsible for reviewing and providing guidance on a high volume of financial disclosure issues, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Reviewing and providing guidance on a high volume of financial disclosure issues",
      "Education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product."
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-533-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Washington, DC",
    "posting_date": "2019-10-28",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to work on a broad range of portfolio issues. The ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position. Excellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Job responsibilities will include drafting legislation, writing hearing statements and legislative memos, and preparing briefing materials.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast-paced environment",
      "North Carolina ties preferred"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-532-19",
    "position_title": "Press Assistant",
    "office": "Southern Republican",
    "location": null,
    "posting_date": "2019-10-28",
    "description": "Southern Republican seeks an energetic Press Assistant to support Communications Director. The ideal candidate will have experience in social media management and communications. Excellent writing, verbal and organizational skills are essential along with the ability to efficiently communicate while working in a fast-paced environment.",
    "responsibilities": [
      "Maintaining social media accounts",
      "Consistent communication with media networks"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Press Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-531-19",
    "position_title": "Communications Director",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2019-10-28",
    "description": "Southern Republican seeks an experienced and enthusiastic Communications Director. The ideal candidate will have 2-3 years of member experience on the Hill. This is not an entry level position. Excellent writing, verbal and organizational skills are essential along with the ability to create and produce in a timely fashion while working in a fast-paced environment.",
    "responsibilities": [
      "Management of social media accounts to maintaining active and consistent engagement on various media networks."
    ],
    "qualifications": [
      "2-3 years of member experience on the Hill",
      "Excellent writing, verbal and organizational skills",
      "Ability to create and produce in a timely fashion while working in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-519-19",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2019-10-28",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include\nassisting the technology needs of Committee staff; editing and maintaining\nthe Committee’s website; answering telephones; assisting with the tracking\nand processing of committee correspondence; providing administrative\nsupport in setting up committee meetings; and entering data and navigating\ndatabases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members\nof Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee’s website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Applicants with experience or interest in learning information technology assistance are strongly encouraged to apply."
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$38,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Washington, D.C.",
    "posting_date": "2019-10-28",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others. The ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Job responsibilities will include drafting legislation, writing hearing statements and legislative memos, and preparing briefing materials.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements",
      "Writing legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience",
      "2-3 years on the Hill (ideally)",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing skills",
      "Excellent verbal skills",
      "Excellent organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-506-19",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Democratic Congressman",
    "location": null,
    "posting_date": "2019-10-28",
    "description": "Democratic Congressman seeks a Legislative Correspondent/Press Assistant to oversee an active mail program and to strengthen the office's communications capabilities.\n\nLC responsibilities include sorting/batching correspondence, drafting letters and ensuring a swift turnaround time. Press responsibilities include drafting press releases, crafting social media posts, designing graphics, GIFs and other web content, monitoring the Congressman's social media platforms, assembling and maintaining press lists and compiling daily press clips. Must have strong writing skills. Knowledge of Intertrac, IQ and Adobe Creative Suite are a plus.\n\nIdeal applicants will have 1-2 years of policy or communications experience.",
    "responsibilities": [
      "Sorting/batching correspondence",
      "Drafting letters and ensuring a swift turnaround time",
      "Drafting press releases",
      "Crafting social media posts",
      "Designing graphics, GIFs and other web content",
      "Monitoring the Congressman's social media platforms",
      "Assembling and maintaining press lists",
      "Compiling daily press clips"
    ],
    "qualifications": [
      "Must have strong writing skills.",
      "Knowledge of Intertrac, IQ and Adobe Creative Suite are a plus.",
      "Ideal applicants will have 1-2 years of policy or communications experience."
    ],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and two writing samples to employment@mail.house.gov.",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "This Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-498-19",
    "position_title": "Staff Assistant",
    "office": "Congressman Tom Malinowski",
    "location": "Somerville District Office",
    "posting_date": "2019-10-28",
    "description": "The Staff Assistant will act as the first point of contact for the front office.",
    "responsibilities": [
      "Office Management",
      [
        "Greet and provide direction to visitors",
        "Manage office inventory",
        "Oversee office internship program"
      ],
      "Constituent Communications",
      [
        "Field constituent phone calls",
        "Log incoming and outgoing correspondence",
        "Prepare congressional commendations and certificates",
        "Draft birthday greetings, thank you notes, and letters of congratulation from the Congressman"
      ],
      "Request and secure Presidential greetings, birthday cards, and letters of congratulation",
      "Operations and Logistics",
      [
        "Staff the Member in meetings and at public events",
        "Assist with event preparations",
        "Schedule Capitol Hill and White House tours",
        "Liaise with Congressman’s DC office staff"
      ]
    ],
    "qualifications": [
      "Good candidates will have an outgoing and positive demeanor, be natural problem solvers with meticulous attention to detail, can remain calm in high stakes situations, and work well as part of a team.",
      "Spanish or Hindi language skills are preferred but not required.",
      "A standard work week is 40-50 hours depending on the congressional calendar.",
      "Evening and weekend availability is required.",
      "Applicants should have access to a vehicle, and a valid divers license.",
      "Recent graduates are encouraged to apply.",
      "This is an entry level position."
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, writing sample and three references to nj07resumes2018@gmail.com.",
    "salary_info": "$32,000-$38,000 annually. Healthcare and retirement benefits provided with 15 days paid vacation and 7 days paid sick leave annually.",
    "contact": "nj07resumes2018@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and veterans, LGBTQ individuals, women, and diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-495-19",
    "position_title": "Communications Director",
    "office": "Iowa Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-10-28",
    "description": "Iowa Democrat seeks an experienced Communications Director to lead an\nactive press operation. Candidates must have experience pitching and placing\nstories, op-eds, and letters to the editor in traditional and digital media.",
    "responsibilities": [
      "maintaining relationships with Iowa and national reporters",
      "developing and implementing weekly and long-term strategic communications plans",
      "briefing and preparing the Member for interviews",
      "writing press releases, talking points, and speeches",
      "collaborating with the legislative team on initiative roll-outs",
      "Managing an active social media and digital newsletter program"
    ],
    "qualifications": [
      "Previous Hill or campaign experience required",
      "Iowa ties preferred",
      "This is NOT an entry level position",
      "Applicants with ties to Iowa are encouraged to apply"
    ],
    "how_to_apply": "Interested candidates should send an email to\nmidwestdemjob2020@gmail.com with “Communications Director/Press\nSecretary” in the subject line, and should include a cover letter, resume, short\nwriting sample (no more than 250 words), and long writing sample (between\n500 and 750 words).",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "midwestdemjob2020@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, national origin, uniformed\nstatus, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-487-19",
    "position_title": "Constituent Services Representative",
    "office": "Virginia Congressional Office",
    "location": "Danville district office",
    "posting_date": "2019-10-28",
    "description": "The primary responsibilities would include assisting constituents with issues involving federal agencies, attending meetings and events with and on behalf of the representative, and general office duties.",
    "responsibilities": [
      "Assisting constituents with issues involving federal agencies",
      "Attending meetings and events with and on behalf of the representative",
      "General office duties"
    ],
    "qualifications": [
      "Excellent writing, communications and time management skills",
      "Possess patience",
      "Sharp attention to details",
      "Able to work in a fast-paced environment",
      "Bachelor’s degree and work experience in casework, public service or social work is preferred."
    ],
    "how_to_apply": "Please send resume and cover letter with salary requirements to varepdistrictoffice@gmail.com.",
    "salary_info": null,
    "contact": "varepdistrictoffice@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-483-19",
    "position_title": "Operations Manager/Executive Assistant",
    "office": "New York Democrat",
    "location": "Brooklyn, NY",
    "posting_date": "2019-10-28",
    "description": "Responsibilities include managing the Member’s schedule, travel plans and related events in the district.\nDuties also include managing the internship program and other office operations including office equipment and supplies, required reporting, and assisting with personnel tracking, as well as fielding requests of the Member with staff and the public.\nThis is an entry to mid-level position in a fast-paced office that frequently requires non-traditional work hours. Qualified applicants should have prior professional office experience.\nThe Operations Manager/Executive Assistant will report to the Chief of Staff and District Director. Ties to Brooklyn and fluency in Arabic are a plus. This position is based in the local Brooklyn, NY office.\nThis is a permanent, full-time position.",
    "responsibilities": [
      "Managing the Member’s schedule, travel plans and related events in the district.",
      "Managing the internship program",
      "Managing other office operations including office equipment and supplies",
      "Required reporting",
      "Assisting with personnel tracking",
      "Fielding requests of the Member with staff and the public."
    ],
    "qualifications": [
      "Prior professional office experience",
      "Ties to Brooklyn and fluency in Arabic are a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place OPERATIONS MANAGER/EXECUTIVE ASSISTANT in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-482-19",
    "position_title": "Economic Policy Staffer",
    "office": "House Committee Democrats",
    "location": null,
    "posting_date": "2019-10-28",
    "description": "House Committee Democrats seek an economic policy staffer to manage a broad policy portfolio including, tax, retirement, immigration, and other economic issues.\n\nCore responsibilities include developing legislation, planning events on key policy priorities, coordinating hearings, staffing Member, and drafting reports.\n\nExceptional writing and analytical skills are a must. Prior Hill, federal agency, private sector, or policy think tank experience is preferred. An advanced degree is a plus.",
    "responsibilities": [
      "Developing legislation",
      "Planning events on key policy priorities",
      "Coordinating hearings",
      "Staffing Member",
      "Drafting reports"
    ],
    "qualifications": [
      "Exceptional writing and analytical skills are a must",
      "Prior Hill, federal agency, private sector, or policy think tank experience is preferred",
      "An advanced degree is a plus"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-480-19",
    "position_title": "Legislative Counsel",
    "office": "Office of Rep. Justin Amash (MI-03)",
    "location": "Washington, DC",
    "posting_date": "2019-10-28",
    "description": "The Office of Rep. Justin Amash (MI-03) is seeking a bright, creative, and self-motivated legislative counsel to join our Washington, DC-based policy team.\n\nThe legislative counsel will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The person will be expected to handle a diverse portfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "Applicants must have a JD or equivalent.",
      "Two years of relevant policy experience is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"legislative counsel applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-479-19",
    "position_title": "Constituent Services Representative",
    "office": "Congresswoman Lauren Underwood",
    "location": "Woodstock, IL or rotations between Woodstock and West Chicago offices",
    "posting_date": "2019-10-28",
    "description": "Congresswoman Lauren Underwood seeks a full-time Constituent Services Representative to serve as a federal problem solver in 14th Congressional District of Illinois. In this role, you will serve as a representative of the Office of the Congresswoman by acting as a liaison between the community and federal agencies to help constituents resolve matters (“casework”) they have before federal agencies.\n\nIn managing constituent casework, you will help residents of the IL-14 resolve primarily immigration-related issues (e.g. visa and passport processing) with federal agencies including the U.S. Citizenship and Immigration Services and the Department of State.\nThe role could also include casework related to Social Security benefits, Medicare benefits, Veterans benefits, postal issues, and others. This role requires investigation, intervention, facilitation, follow-up, and creative problem-solving.\n\nThis role requires conducting significant outreach throughout the IL-14 by hosting meetings in our office and throughout the District and representing the Office at community meetings. The role also requires community event planning and staffing the Congresswoman.\n\nIn serving as a Constituent Services Representative, you will work with local stakeholders, including community organizations and local and state governments, to identify and understand opportunities for Federal resources and legislation to advance the interest of people in the IL-14 Congressional District.\n\nThis is not an entry-level position. The ideal candidate must be a skilled listener and communicator, self-motivated and assertive, detail-oriented and organized, and a creative problem solver. Experience in social work, legal services, project management, customer service/hospitality, or claims processing are transferable to this role.",
    "responsibilities": [
      "Serve as a representative of the Office of the Congresswoman by acting as a liaison between the community and federal agencies to help constituents resolve matters (“casework”) they have before federal agencies.",
      "Help residents of the IL-14 resolve primarily immigration-related issues (e.g. visa and passport processing) with federal agencies including the U.S. Citizenship and Immigration Services and the Department of State.",
      "Casework related to Social Security benefits, Medicare benefits, Veterans benefits, postal issues, and others.",
      "Conducting significant outreach throughout the IL-14 by hosting meetings in our office and throughout the District and representing the Office at community meetings.",
      "Community event planning and staffing the Congresswoman.",
      "Work with local stakeholders, including community organizations and local and state governments, to identify and understand opportunities for Federal resources and legislation to advance the interest of people in the IL-14 Congressional District."
    ],
    "qualifications": [
      "Must be a skilled listener and communicator",
      "Self-motivated and assertive",
      "Detail-oriented and organized",
      "A creative problem solver",
      "Experience in social work, legal services, project management, customer service/hospitality, or claims processing are transferable to this role."
    ],
    "how_to_apply": "To apply for the position, please send a cover letter and resume to Illinois14.DistrictJobs@gmail.com with “Constituent Services Representative” in the subject line. This is NOT an entry-level position. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "Illinois14.DistrictJobs@gmail.com",
    "equal_opportunity": "Women and people of color are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-477-19",
    "position_title": "Legislative Correspondent",
    "office": "Office of Rep. Pete Aguilar (CA-31)",
    "location": "Washington, D.C.",
    "posting_date": "2019-10-28",
    "description": "The LC is responsible for managing an active mail program and hiring and supervising the interns who manage the front office.\n\nThe successful candidate will be extremely organized, an excellent writer and editor, a self-starter, dependable and someone who is able to work collaboratively as part of a close-knit team.",
    "responsibilities": [
      "Managing the constituent mail program by sorting and batching incoming correspondence, drafting and editing letters, managing the letter approval process, maintaining and utilizing the mail databases, and ensuring the office maintains a short mail turnaround time.",
      "Hiring and supervising the interns, who manage the front office, handle tours and flags, answer the phones and greet visitors."
    ],
    "qualifications": [
      "Ties to the Inland Empire",
      "Spanish language skills",
      "Previous Congressional experience"
    ],
    "how_to_apply": "Please submit your application using this form https://docs.google.com/forms/d/e/1FAIpQLScPqypjFt_4gsZww_nVvVYL_cMxGDhRr0jke0FjejNqwGrGQ/viewform and email a copy of your resume and cover letter using the directions included in the form.",
    "salary_info": "$40,000 to $45,000 a year plus student loan repayment and transit benefits. Our office also offers compensation time in addition to paid vacation and sick leave.",
    "contact": "If you have any questions please call our office at (202) 2253201.",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-474-19",
    "position_title": "Energy Professional Staff or Counsel",
    "office": "The Committee on Energy and Commerce Majority",
    "location": null,
    "posting_date": "2019-10-28",
    "description": "The Committee on Energy and Commerce Majority is seeking a professional staff member or counsel to focus on energy issues within the Committee's jurisdiction.\nResponsibilities will include drafting legislation, preparing hearings, and coordinating with stakeholders and member offices. Ideal candidates will have a demonstrated interest in and understanding of energy policy issues, and some public policy experience. Knowledge of energy efficiency policy is particularly helpful, but not necessary.",
    "responsibilities": [
      "drafting legislation",
      "preparing hearings",
      "coordinating with stakeholders and member offices"
    ],
    "qualifications": [
      "demonstrated interest in and understanding of energy policy issues",
      "some public policy experience",
      "knowledge of energy efficiency policy is particularly helpful, but not necessary"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and short writing sample to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "The Committee is an equal opportunity employer. Diverse candidates, women, and veterans are strongly encouraged to apply."
  },
  {
    "id": "MEM-462-19",
    "position_title": "Attorney",
    "office": "Office of the Law Revision Counsel",
    "location": "U.S. House of Representatives",
    "posting_date": "2019-10-28",
    "description": "The Office of the Law Revision Counsel—a small, nonpartisan office within the U.S. House of Representatives—seeks an attorney to assist in the editing and publishing of the United States Code, the codification of general and permanent Federal statutory law.\n\nIn addition to the basic tasks required to integrate new laws into the Code, other duties may be required, such as reviewing drafts of bills to enact titles as positive law, doing extensive research and editorial work to improve the organization of existing provisions in the Code, and assisting in the continuing modernization of the Office, including support of online and machine readable versions of the Code.\n\nPlease be aware that this is a long-term career position with the Office, not a stepping stone to another position within Congress or the Federal Government.",
    "responsibilities": [
      "reading new laws to determine which provisions should appear in the Code and where",
      "updating the Code to reflect new law and amendments to existing law",
      "writing concise editorial notes to explain amendments, effective dates, references within the text to other laws, and a variety of other legislative concepts",
      "preparing statutory citations and tables",
      "identifying errors in grammar and spelling"
    ],
    "qualifications": [
      "J.D. degree and attorney license in any U.S. jurisdiction or intention to obtain license within one year.",
      "At least one year of professional experience in editing or publishing, preferably in the legal field.",
      "Meticulous attention to detail and dedication to accuracy.",
      "Excellent verbal and written communication skills.",
      "Absolute proficiency in grammar, spelling, and usage.",
      "Ability to analyze and summarize complex legal issues.",
      "Ability to identify issues affecting Federal statutes and explain them clearly and concisely within firmly established parameters.",
      "Familiarity with Federal or State statutory law is highly desirable.",
      "This position is better suited to someone able to engage in extended periods of solitary work, often involving tedious and repetitive tasks.",
      "The ability to adhere to, and function comfortably within, established styles and practices is essential."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter with salary requirements to:\nuscodeapplicant@mail.house.gov\nApplicants will be evaluated based on the ability to meet the qualifications stated above. Significant weight will be given to the applicant's cover letter. If chosen for an interview, an applicant will be requested to submit a writing sample.",
    "salary_info": null,
    "contact": "uscodeapplicant@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2019-10-28",
    "description": "Qualified candidates should have a minimum of 2 years’ experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects. A flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Ability to meet deadlines",
      "Ability to manage multiple projects",
      "Flexible schedule",
      "Ability to travel throughout the district"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]