[
  {
    "id": "MEM-203-16",
    "position_title": "Legislative Correspondent",
    "office": "Southern Republican",
    "location": "Washington, D.C.",
    "posting_date": "2016-07-11",
    "description": "Primary responsibilities include managing constituent correspondence, conducting research, and providing support to the legislative staff when necessary. Applicants must be hardworking, detail oriented, and possess strong writing skills. Experience with the Intranet Quorum database and having ties to Tennessee are preferred but not required. This position also allows for the opportunity to experience the press side of a congressional office if interested.",
    "responsibilities": [
      "Managing constituent correspondence",
      "Conducting research",
      "Providing support to the legislative staff when necessary"
    ],
    "qualifications": [
      "Hardworking",
      "Detail oriented",
      "Strong writing skills",
      "Experience with the Intranet Quorum database (preferred)",
      "Ties to Tennessee (preferred)"
    ],
    "how_to_apply": "Qualified candidates should send their resume to TN08.HouseJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "TN08.HouseJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-199-16",
    "position_title": "Communications & Outreach Coordinator",
    "office": "U.S. Rep. Ann McLane Kuster",
    "location": "Concord, New Hampshire",
    "posting_date": "2016-07-11",
    "description": "Communications:\n\nIssue Area Outreach:\n\nGeneral:",
    "responsibilities": [
      "Work with Communications team to draft and disseminate press releases, media advisories, statements, and other communications material.",
      "Help plan local press events and assist Communications Director in pitching stories to the media as needed.",
      "Manage Facebook, Twitter, and other social media pages.",
      "Work with Communications Director and other staff to develop and implement office messaging strategy.",
      "Develop and maintain relationships with leaders and stakeholders in assigned issue areas.",
      "Attend and hold meetings as necessary with issue area leaders and stakeholders; engage with the public on projects within these areas.",
      "Monitor ongoing projects and legislative actions connected to assigned issue areas.",
      "Develop and coordinate public events, business visits and private meetings in connection with assigned issue areas.",
      "Answer phones and walk-in cases as necessary.",
      "Draft letters, memos and reports on meetings, events and projects.",
      "Attend occasional night or weekend events as necessary."
    ],
    "qualifications": [
      "Strong writing skills",
      "Strict attention-to-detail",
      "Ability to \"think on your toes\" and work in a constantly shifting, fast-paced work environment",
      "Prior political or press experience strongly preferred."
    ],
    "how_to_apply": "If interested, please submit resume, cover letter, and two writing samples to NH02.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NH02.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-194-16",
    "position_title": "Legislative Assistant",
    "office": "U.S. Member of Congress in New York",
    "location": "D.C. Office",
    "posting_date": "2016-07-11",
    "description": "Individuals will handle a portfolio of legislative issues including small business, economic development, housing, environment, immigration, and foreign affairs – including the Middle East and Caribbean. This individual is responsible for drafting legislation and amendments, tracking legislative, developing legislative initiatives, writing speeches and floor statements, staffing the Member in Committee, and representing the Member in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking legislative",
      "Developing legislative initiatives",
      "Writing speeches and floor statements",
      "Staffing the Member in Committee",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Ability to work well under pressure in a fast-paced environment",
      "Strong team player",
      "At least two years of legislative experience on Capitol Hill",
      "Ties to New York are a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and brief writing sample to ResumeNY@mail.house.gov. Please be sure to put LEGISLATIVE ASSISTANT in the subject line.\nPLEASE NO WALK-INS OR PHONE CALLS",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": "An Equal Opportunity Employer."
  },
  {
    "id": "MEM-189-16",
    "position_title": "Press Office Position",
    "office": "Rules Committee Ranking Member Louise Slaughter (NY-25)",
    "location": "Capitol Hill",
    "posting_date": "2016-07-11",
    "description": "The press office of Rules Committee Ranking Member Louise Slaughter (NY-25) is looking for talented candidates with a passion for public policy messaging, strong writing and communications skills, and the ability to work collaboratively.",
    "responsibilities": [],
    "qualifications": [
      "Has Capitol Hill and campaign experience",
      "Writes beautiful speeches with historical references",
      "Is an expert social media manager with attention to detail",
      "Enjoys making info graphics during lunch breaks",
      "Does not offend easily during the editing process",
      "Likes staying up late and waking up early",
      "Loves Rochester, NY and the Rules Committee"
    ],
    "how_to_apply": "Applicants should submit a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-184-16",
    "position_title": "Legislative Assistant",
    "office": "House Foreign Affairs Committee",
    "location": "Capitol Hill",
    "posting_date": "2016-07-11",
    "description": "A Senior Member of the House Foreign Affairs Committee is seeking a skilled and experienced Legislative Assistant to handle foreign policy and related issues.",
    "responsibilities": [],
    "qualifications": [
      "Relevant Capitol Hill experience",
      "Excellent communications skills",
      "Background in foreign policy and/or an advanced degree"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to ForeignAffairsLA@gmail.com.",
    "salary_info": null,
    "contact": "ForeignAffairsLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-183-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "California Republican",
    "location": "Washington, DC",
    "posting_date": "2016-07-11",
    "description": "Duties include management of constituent correspondence program, flag requests, tour coordinating, and general administrative duties.",
    "responsibilities": [
      "Management of constituent correspondence program",
      "Flag requests",
      "Tour coordinating",
      "General administrative duties"
    ],
    "qualifications": [
      "Excellent writing and research ability",
      "Self-starters",
      "Energetic",
      "Strong organizational and time management skills"
    ],
    "how_to_apply": "Please send resume, cover letter, and short writing sample to CARepublicanjobs@gmail.com.",
    "salary_info": null,
    "contact": "CARepublicanjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-182-16",
    "position_title": "Scheduler",
    "office": "Senior House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2016-07-11",
    "description": "Senior House Democrat seeks experienced individual to handle all facets of the member's Washington, D.C. schedule as well as staffing the reception area. Scheduler responsibilities include managing heavy volume of meeting, speaking and traveling requests, provide transportation (which can include late evenings), manage personal correspondence, greeting visitors and answering phones.",
    "responsibilities": [
      "Managing heavy volume of meeting, speaking and traveling requests",
      "Provide transportation (which can include late evenings)",
      "Manage personal correspondence",
      "Greeting visitors",
      "Answering phones"
    ],
    "qualifications": [
      "Must be detail oriented",
      "Able to work in a fast-paced environment",
      "Possess excellent oral and written communication skills",
      "Spanish fluency a plus"
    ],
    "how_to_apply": "Please send cover letter and resume to one_vacancy@yahoo.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "one_vacancy@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-179-16",
    "position_title": "Communications Director",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2016-07-11",
    "description": "The office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and hard-working communications director to join our Washington, DC-based team.\n\nThe communications director will be responsible for coordinating with the legislative team and member to develop and implement all communications activities for the office, including acting as the member's spokesperson and drafting op-eds, speeches, press releases, and newsletters.\n\nThe successful applicant will be an excellent writer and editor, clear thinker, and persuasive advocate for individual liberty, economic freedom, and the Constitution. He or she must demonstrate a breadth of policy knowledge, familiarity with the legislative process, and the ability to exercise sound, independent judgment. Individuals who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "coordinating with the legislative team and member to develop and implement all communications activities for the office",
      "acting as the member's spokesperson",
      "drafting op-eds, speeches, press releases, and newsletters"
    ],
    "qualifications": [
      "libertarian (classical liberal and constitutional conservative)",
      "BA or equivalent",
      "at least two years of professional experience",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to mi03.apply@gmail.com. Please include \"communications director applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-167-16",
    "position_title": "Communications Director",
    "office": null,
    "location": null,
    "posting_date": "2016-07-11",
    "description": "Seeking a Communications Director to develop and implement aggressive communications strategy with local and national media. Ideal applicant is a quick and clean writer, detail-oriented, able to juggle numerous tasks successfully and best under tight deadlines. Responsibilities include writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters; coordinating interviews with reporters, setting up press events and press conferences, developing relationships with the media; implementing district outreach activities (as it relates to press); responding to media inquiries and coordinating the office's online and social media operations.\n\nRequires strong written and oral communication skills, creativity, and the ability to work well with legislative and district office staff. An ideal candidate will possess a minimum of 3-5 years of communications experience, a demonstrated understanding of federal politics and policy and a desire to work in a fast-paced and fluid environment. Bilingual a plus. Valid driver's license desired. Availability for Evening and Weekend assignments is required.",
    "responsibilities": [
      "Writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters",
      "Coordinating interviews with reporters",
      "Setting up press events and press conferences",
      "Developing relationships with the media",
      "Implementing district outreach activities (as it relates to press)",
      "Responding to media inquiries",
      "Coordinating the office's online and social media operations"
    ],
    "qualifications": [
      "Strong written and oral communication skills",
      "Creativity",
      "Ability to work well with legislative and district office staff",
      "Minimum of 3-5 years of communications experience",
      "Demonstrated understanding of federal politics and policy",
      "Desire to work in a fast-paced and fluid environment",
      "Bilingual a plus",
      "Valid driver's license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume and three writing samples to ResumeNY@mail.house.gov. Please be sure to put COMMUNICATIONS DIRECTOR in the subject line. PLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-166-16",
    "position_title": "District Scheduler / Office Manager",
    "office": "Bay Area legislative office",
    "location": "California",
    "posting_date": "2016-07-11",
    "description": "Responsibilities include coordinating the legislator's California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans; working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters. Also responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties. Opportunities for additional responsibilities commensurate with skills and abilities. A successful candidate will be highly organized, detail oriented, possess strong writing skills, have experience working in a fast-paced office, and the ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects.",
    "responsibilities": [
      "Coordinating the legislator's California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans",
      "Working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters.",
      "Assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Have experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov.",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  }
]