[
  {
    "id": "MEM-395-14",
    "position_title": "Press Secretary",
    "office": "Ohio Democratic Member",
    "location": "D.C./District",
    "posting_date": "2014-12-08",
    "description": "Applicant must have previous speech writing experience; thrive at multitasking and working long hours; and, have sound political judgment.\n\nThe successful applicant must be a team player, and will work closely with the Chief of Staff, Communications Director, and D.C./ District team.\n\nThis is not an entry-level position. Professional communications and on-the-record experience is required. Hill experience and familiarity with Ohio, especially Northeastern Ohio, is strongly preferred. Candidates should have knowledge of the legislative process, as well as the ability to identify local and national press opportunities.",
    "responsibilities": [
      "speech writing",
      "drafting news releases, talking points, and op-eds",
      "responding to press inquiries in a timely and appropriate manner",
      "early daily news clips",
      "monitoring the news/ social media platforms throughout the day",
      "supervising the development of website and social media content",
      "booking interviews and pitching stories",
      "developing relationships with reporters",
      "organizing events",
      "developing and implementing media, communications, and public relations strategies"
    ],
    "qualifications": [
      "Professional communications and on-the-record experience is required.",
      "Hill experience and familiarity with Ohio, especially Northeastern Ohio, is strongly preferred.",
      "Candidates should have knowledge of the legislative process, as well as the ability to identify local and national press opportunities."
    ],
    "how_to_apply": "Please send cover letter, resume, and three original writing samples to District11Resumes@mail.house.gov with “PRESS SECRETARY” in the subject line. No walk-ins or phone calls",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "District11Resumes@mail.house.gov",
    "equal_opportunity": null
  }
]