[
  {
    "id": "MEM-056-22",
    "position_title": "Staff Assistant",
    "office": "Rep. Dina Titus",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "Primary responsibilities include managing the front office, answering and logging telephone calls, managing constituent requests for flags and tours, assisting with constituent correspondence, recruiting and managing interns, supporting legislative and communications staff, and other administrative duties.\n\nCandidates should be motivated self-starters with excellent oral, written, and interpersonal communication skills, strong organizational skills, demonstrate an ability to think quickly when troubleshooting, and maintain a positive demeanor in a busy environment. Capitol Hill or other relevant experience is preferred.\n\nCandidates with a diverse background, Nevada state ties, and Spanish-language proficiency are strongly encouraged to apply. Rep. Titus is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.",
    "responsibilities": [
      "Managing the front office",
      "Answering and logging telephone calls",
      "Managing constituent requests for flags and tours",
      "Assisting with constituent correspondence",
      "Recruiting and managing interns",
      "Supporting legislative and communications staff",
      "Other administrative duties"
    ],
    "qualifications": [
      "Motivated self-starters with excellent oral, written, and interpersonal communication skills",
      "Strong organizational skills",
      "Demonstrate an ability to think quickly when troubleshooting",
      "Maintain a positive demeanor in a busy environment",
      "Capitol Hill or other relevant experience is preferred",
      "Candidates with a diverse background, Nevada state ties, and Spanish-language proficiency are strongly encouraged to apply"
    ],
    "how_to_apply": "Those interested in applying should e-mail a cover letter, resume, and one short writing samples to NV01Jobs@gmail.com subject: “Staff Assistant”.\nApplications will be accepted on a rolling basis and will remain open until the position is filled.",
    "salary_info": null,
    "contact": "NV01Jobs@gmail.com",
    "equal_opportunity": "Rep. Titus is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-055-22",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2022-02-07",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Office of Advice and Education.\n\nThe Committee’s Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.\n\nCandidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics; ethics counseling and training; and criminal law. The salary range for this position is $126,614 and $134,782.",
    "responsibilities": [
      "Providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.",
      "Serve all Members of Congress equally",
      "Refrain from political or partisan activity."
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is desirable: government ethics; ethics counseling and training; and criminal law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "$126,614 and $134,782",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-053-22",
    "position_title": "Legislative Correspondent / Staff Assistant",
    "office": "Representative Emanuel Cleaver (MO-05)",
    "location": "Washington D.C.",
    "posting_date": "2022-02-07",
    "description": "Primary responsibilities include collecting and organizing constituent mail, drafting response letters, managing the front office, answering and logging telephone calls, managing constituent requests for flags and tours, recruiting and managing interns, supporting legislative and communications staff, and other administrative duties.\n\nIdeal candidates will be motivated self-starters with excellent oral, written, and interpersonal communication skills, strong organizational skills, demonstrate an ability to think quickly when troubleshooting, and maintain a positive demeanor in a busy environment. Capitol Hill or other relevant experience is preferred. Missouri ties are a plus.",
    "responsibilities": [
      "Collecting and organizing constituent mail",
      "Drafting response letters",
      "Managing the front office",
      "Answering and logging telephone calls",
      "Managing constituent requests for flags and tours",
      "Recruiting and managing interns",
      "Supporting legislative and communications staff",
      "Other administrative duties"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Excellent oral, written, and interpersonal communication skills",
      "Strong organizational skills",
      "Ability to think quickly when troubleshooting",
      "Ability to maintain a positive demeanor in a busy environment",
      "Capitol Hill or other relevant experience is preferred",
      "Missouri ties are a plus"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and writing sample to midwest.jobs@mail.house.gov and list “LC/SA” in the subject line by February 18th with applications considered on a rolling basis.",
    "salary_info": null,
    "contact": "midwest.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, sexual orientation, gender identity, or uniformed status. Diverse candidates, women, and LGBTQ persons are strongly encouraged to apply."
  },
  {
    "id": "MEM-052-22",
    "position_title": "Legislative Assistant",
    "office": "Representative Emanuel Cleaver (MO-05)",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "Responsibilities include but are not limited to drafting and analyzing legislation, providing policy memos and vote recommendations, advising the Member on policy issues, and representing the Congressman in meetings with constituents and outside groups. The position also requires strong organizational and time management skills, excellent written and verbal communication, and keen attention to detail.",
    "responsibilities": [
      "Drafting and analyzing legislation",
      "Providing policy memos and vote recommendations",
      "Advising the Member on policy issues",
      "Representing the Congressman in meetings with constituents and outside groups"
    ],
    "qualifications": [
      "At least 2 years of Hill or comparable policy experience",
      "Missouri ties are a plus"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and one writing sample to midwest.jobs@mail.house.gov and include “Legislative Assistant” in the subject line by February 18th with applications considered on a rolling basis.",
    "salary_info": null,
    "contact": "midwest.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages diverse candidates, women, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-051-22",
    "position_title": "Special Assistant and Driver",
    "office": "Congressman Seth Moulton (MA-06)",
    "location": "Washington, DC",
    "posting_date": "2022-02-07",
    "description": "The primary function of the special assistant/driver is to ensure the Member arrives at scheduled events in a timely manner with the briefing and background material that he needs to be successful. In addition to reporting to the Scheduler, this position will work closely with the Member and the Communications Department.\n\nDuties include driving the Member to meetings, smoothly communicating the Member's movements with the team, briefing the Member on the purpose and goal of each meeting, communicating priorities to the Member for the use of his time between meetings, staffing assistance for the Communications Department, and additional duties as required.",
    "responsibilities": [
      "Driving the Member to meetings",
      "Smoothly communicating the Member's movements with the team",
      "Briefing the Member on the purpose and goal of each meeting",
      "Communicating priorities to the Member for the use of his time between meetings",
      "Staffing assistance for the Communications Department",
      "Additional duties as required"
    ],
    "qualifications": [
      "A bachelor's degree is preferred.",
      "Experience on Capitol Hill, and/or other work experience is beneficial.",
      "Car and driver's license in good standing",
      "Superb organizational skills",
      "Ability to prioritize and execute numerous tasks",
      "Ability to be flexible and find creative solutions to problems",
      "Ability to foresee scheduling conflicts and remedy them before they are an issue",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner"
    ],
    "how_to_apply": "Please send a resume and cover letter to ma06.resumes@mail.house.gov by February 12th.",
    "salary_info": null,
    "contact": "ma06.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-050-22",
    "position_title": "District Representative",
    "office": "Representative McEachin (VA04)",
    "location": "Richmond, VA",
    "posting_date": "2022-02-07",
    "description": "The Office of Representative McEachin (VA04) seeks a motivated, creative, selfstarter to join the district staff as a District Representative in the Richmond, VA office.\n\nThe primary casework focus for this position will be Veteran’s Affairs and the Department of Defense; the staff member will also manage the Congressman’s Service Academy nomination process and outreach to Fort Lee.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congressman, representing the office, listening to district stakeholders, and updating the community at district events"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment",
      "Virginia ties and military experience/exposure are not necessary but are a plus"
    ],
    "how_to_apply": "Please submit a resume and references to McEachin.Jobs@mail.house.gov with “District Representative” in the subject line. Applications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "McEachin.Jobs@mail.house.gov",
    "equal_opportunity": "Representative McEachin’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-049-22",
    "position_title": "Legislative Assistant",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "California Democrat seeks a Legislative Assistant who will be responsible for a portfolio that includes health care, economy and labor, immigration, and other issues.\n\nThe position also requires strong organizational and time management skills, excellent written and verbal communication, and keen attention to detail.",
    "responsibilities": [
      "Drafting and analyzing legislation",
      "Preparing memos and remarks",
      "Representing the Congressman in meetings with constituents and outside groups"
    ],
    "qualifications": [
      "At least 2 years of Hill or comparable policy experience",
      "Strong organizational and time management skills",
      "Excellent written and verbal communication",
      "Keen attention to detail"
    ],
    "how_to_apply": "Please submit a cover letter, resume, two references, and one writing sample to CAHouseJob@mail.house.gov and include “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "CAHouseJob@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of color, women, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-048-22",
    "position_title": "Chief Operations Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, D.C. and District",
    "posting_date": "2022-02-07",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks a Chief Operations Director who will work under the guidance of the Member, the Chief of Staff, and partner with the District Director to help determine and execute the overall strategies of the office. This includes, but is not limited to, media relations strategies, and collaborating with District staff on important outreach and communication efforts.\n\nIn addition, the Chief Operations Director will provide leadership and guidance to structure the office to provide outstanding constituent relations. The Chief Operations Director will also assist with recruiting and hiring efforts, the establishment of office policies and procedures, and perform other critical functions to support administrative operations.\n\nFinally, they will supervise and oversee various operational components related to the duties of the Communications Director, Scheduler and District Director; and during the Chief of Staff’s absence, the entire Team. Travel to the District is required.",
    "responsibilities": [
      "Assist Chief of Staff and District Director with staff management, including but not limited to elevated personnel issues/staff conflict",
      "Under direction of Chief of Staff, assist in draft MRA budget proposals for franking/events for Chief and Member approval.",
      "Under direction of Chief of Staff and District Director, onboard new staff and off board outgoing staff – assist staff with understanding staff health and retirement benefits; ensure staff ID is secured; office equipment is provided and returned as needed. Oversee timely and proper staff and Member submissions and reimbursements.",
      "Under direction of Chief of Staff, plan staff retreats and ensure goals derived from strategic planning session are relevant and actively implemented.",
      "Negotiate, finalize, and process district office leases.",
      "Review Staff Handbook periodically. Solicit staff and Member feedback to suggest updates to office policies. Ensure all language is in compliance with House Rules, Standards and Federal Leave Law.",
      "Work with Chief of Staff, District Director, Legislative Director, and Communications Director to identify district legislative priorities and develop and implement action plans for the office to engage constituents on the issue(s) through direct outreach, events, social media, etc.; corresponding outreach to federal, state, local agencies; and potential legislation.",
      "Participate in both district and DC office department meetings, e.g., casework, communications, outreach, and legislation and ensure meeting discussions throughout offices accurately identify existing challenges and discuss time sensitive and relevant office and Member goals. Inform counterpart offices and departments of new developments from other team members as needed.",
      "Assist Chief of Staff and Member with staff evaluations and decision on bonuses."
    ],
    "qualifications": [
      "Prior experience working in the US Congress and/or Federal government preferred",
      "Experience developing and implementing a strategy for an organization or Member office",
      "Build productive working relationships and serve as a leader for staff in the Member office",
      "Strong written and verbal communication skills",
      "Able to positively influence and advise staff on policy decisions, legislative initiatives, and office management",
      "Comfortable balancing multiple responsibilities and competing deadlines",
      "Politically savvy and has experience navigating the culture at the House of Representatives",
      "Strong decision-making and strategic thinking skills"
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Operations Director” to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-046-22",
    "position_title": "LEGISLATIVE AIDE",
    "office": "Rep. Jim Costa (CA-16)",
    "location": "Washington, DC",
    "posting_date": "2022-02-07",
    "description": "The Legislative Aide will handle a diverse portfolio of issues including Health Care, Education, Labor, Housing, and Immigration, among others.\nResponsibilities will include drafting legislation, monitoring legislative priorities both on and off committees of jurisdiction, taking meetings and building relationships with constituent groups, providing vote recommendations, advising the Member on policy issues, and performing other tasks as required.",
    "responsibilities": [
      "Drafting legislation",
      "Monitoring legislative priorities both on and off committees of jurisdiction",
      "Taking meetings and building relationships with constituent groups",
      "Providing vote recommendations",
      "Advising the Member on policy issues",
      "Performing other tasks as required"
    ],
    "qualifications": [
      "Prior Capitol Hill or relevant policy experience",
      "Highly motivated, detail-oriented professionals with strong organizational and time-management skills",
      "Positive attitudes, and pride in work",
      "Ties to California's 16th Congressional District are strongly encouraged to apply.",
      "Spanish fluency is a plus."
    ],
    "how_to_apply": "Please e-mail cover letter, resume, and a short writing sample in a single PDF to resume@mail.house.gov with “Legislative Aide” in the subject line. Absolutely no phone calls, e-mails, or walk-ins.",
    "salary_info": null,
    "contact": "resume@mail.house.gov",
    "equal_opportunity": "The Office of Representative Costa is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-045-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democrat",
    "location": "District of Columbia",
    "posting_date": "2022-02-07",
    "description": "Senior Democrat is seeking a highly energetic, motivated and organized lawyer with strong interpersonal, legal and writing skills.\nThe ideal candidate will be able to manage multiple tasks and work well under pressure. The Legislative Assistant works with the Chief Counsel/Legislative Director and with the Chief of Staff to develop and implement the Member's legislative strategy in his/her issue areas; prepares materials for hearings; drafts legislation, amendments; assists with press releases; and conducts research. The ability to write well under tight deadlines is essential.\nCandidate must be able to handle multiple tasks and issues effectively while meeting deadlines. A successful candidate will be a results-oriented, problem solving lawyer and motivated self-starter who can think outside the box. Prior Hill, law firm or similar experience is preferred but not always required.\nCandidate must possess a law degree and be, or be willing to become, a resident of the District of Columbia. Salary based on skill and experience level.",
    "responsibilities": [
      "Develop and implement the Member's legislative strategy in his/her issue areas",
      "Prepares materials for hearings",
      "Drafts legislation, amendments",
      "Assists with press releases",
      "Conducts research"
    ],
    "qualifications": [
      "Law degree required",
      "Must be, or be willing to become, a resident of the District of Columbia",
      "Strong interpersonal, legal and writing skills",
      "Ability to manage multiple tasks",
      "Ability to work well under pressure",
      "Results-oriented and problem solving lawyer",
      "Motivated self-starter who can think outside the box",
      "Prior Hill, law firm or similar experience is preferred but not always required"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov.",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-044-22",
    "position_title": "Press Secretary or Deputy Communications Director",
    "office": "House Committee on Budget Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "The Democratic Staff of the House Committee on Budget is seeking an experienced and motivated communicator to serve as Press Secretary/Deputy Communications Director.\n\nThis position is based in Washington, D.C. and will work closely with the Communications Director with potential opportunities to manage others.\n\nThe position may require work outside standard office hours.",
    "responsibilities": [
      "developing and honing a proactive press strategy",
      "pitching, prepping, and staffing the Chairman",
      "drafting press releases and written content",
      "assist with creating talking points and toolkits for the caucus",
      "maintaining and updating the press list",
      "tracking media",
      "working with the Communications team to identify new ways to engage with press and digital audiences"
    ],
    "qualifications": [
      "3 – 5 years of experience, including working with reporters and on-the-record, experience staffing a principal, and strong writing skills",
      "Ability to work well with others, willingness to take initiative, manage competing priorities, and turn around high-quality products under tight deadlines are a must"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter describing their fit for the role, a resume, and three writing samples to BudgetDemocrat.Jobs@mail.house.gov with “HBC Communications Candidate” in the subject line. Application deadline is Friday, February 11, 2022.\n\nNo calls or walk-ins please.",
    "salary_info": "The starting salary for this senior press position is $70,000 but salary and title are both commensurate with experience.",
    "contact": "BudgetDemocrat.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer with a team that highly values mentorship and professional development. Candidates with diverse backgrounds, women, people of color, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-042-22",
    "position_title": "Communications Director",
    "office": "House Select Subcommittee on the Coronavirus Crisis",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "Congressman James E. Clyburn, Chairman of the House Select Subcommittee on the Coronavirus Crisis, seeks a Communications Director to lead the Majority staff’s press operations. The ideal candidate will be a communications professional with extensive experience working with media, as well as impeccable writing skills and experience drafting and editing press releases, opeds, and talking points.",
    "responsibilities": [
      "Developing and implementing the Select Subcommittee’s communications strategy across digital and traditional media",
      "Drafting press releases and other materials",
      "Responding to media inquiries",
      "Coordinating interviews and press events",
      "Preparing the Chairman for these events"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-040-22",
    "position_title": "Director of Outreach and Community Engagement",
    "office": "New York City Democrat",
    "location": "Brooklyn, NY",
    "posting_date": "2022-02-07",
    "description": "Responsibilities include building strategic relationships with community leaders and constituent groups, executing various outreach activities, and recruiting volunteers for events and outreach programs in the district.\n\nDuties also include coordinating initiatives designed to promote the office and services to the community, managing an outreach and organizing plan for the team, and any other assigned duties. Candidates should possess excellent organization, leadership, teamwork, and management skills, as well as verbal and written communication skills.\n\nThe Director of Outreach and Community Engagement will report to the District Director. Ties to Brooklyn, a proven management record, and a minimum of three years of related experience are required. This position is based in the local Brooklyn, NY office. This is a permanent, full-time position and a senior-level position in a fast-paced office that frequently requires some non-traditional work hours.\n\nFluency in other language other than English (Creole, Arabic, Russian) highly preferred.",
    "responsibilities": [
      "Building strategic relationships with community leaders and constituent groups",
      "Executing various outreach activities",
      "Recruiting volunteers for events and outreach programs in the district",
      "Coordinating initiatives designed to promote the office and services to the community",
      "Managing an outreach and organizing plan for the team",
      "Any other assigned duties"
    ],
    "qualifications": [
      "Excellent organization, leadership, teamwork, and management skills",
      "Verbal and written communication skills",
      "Ties to Brooklyn",
      "Proven management record",
      "Minimum of three years of related experience",
      "Fluency in other language other than English (Creole, Arabic, Russian) highly preferred"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place DIRECTOR OF OUTREACH AND COMMUNITY ENGAGEMENT in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-039-22",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nProfessional Staff member responsible for higher education.\nCandidates should have familiarity with federal higher education policy and must\ndemonstrate a proficiency in programs authorized in the Higher Education Act.\nApplicants should have two to four years of higher education policy or research\nexperience or two years of higher education policy or research experience and an\nadvanced degree.\n\nThis position is writing intensive and requires the ideal candidate to have\nexceptional writing, communication, and organizational skills. Must demonstrate\nthe ability to successfully manage multiple projects under deadlines; display a\ncollaborative disposition; and a commitment to social justice and expanding\neconomic opportunity.",
    "responsibilities": [
      "Leading a discrete number of higher education issue areas",
      "Researching, reviewing, and drafting legislation",
      "Providing technical assistance to Member offices",
      "Preparing written materials including talking points, letters, memos, and legislative analyses",
      "Tracking regulatory developments, floor activity, and the related activities of other committees",
      "Supporting the execution of committee proceedings and events related to higher education",
      "Coordinating with the oversight and communications teams in support of the Committee's agenda"
    ],
    "qualifications": [
      "Familiarity with federal higher education policy",
      "Proficiency in programs authorized in the Higher Education Act",
      "Two to four years of higher education policy or research experience or two years of higher education policy or research experience and an advanced degree",
      "Exceptional writing, communication, and organizational skills",
      "Ability to successfully manage multiple projects under deadlines",
      "Collaborative disposition",
      "Commitment to social justice and expanding economic opportunity"
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter, resume and two short writing samples demonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with \"Higher Ed Professional Staff\" in the subject line. Please apply no later than February 11.",
    "salary_info": "Salary range is between $65,000 and $80,000, commensurate with experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-038-22",
    "position_title": "Labor Policy Director",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Labor\nPolicy Director to lead a team in advancing a progressive labor rights agenda\ncovering labor and employment law, health and safety, workforce development,\nretirement security, economic policy, and employment-based civil rights\nprotections.\nThe successful candidate will have experience managing a team, familiarity with\nthe range of labor issues within the jurisdiction of the committee and possess\nhands-on experience in drafting and enacting legislation. The candidate will have\nat least 5 years of Congressional experience, in-depth knowledge on labor and\nemployment law and policy, and strong communication skills.",
    "responsibilities": [],
    "qualifications": [
      "Experience managing a team",
      "Familiarity with the range of labor issues within the jurisdiction of the committee",
      "Hands-on experience in drafting and enacting legislation",
      "At least 5 years of Congressional experience",
      "In-depth knowledge on labor and employment law and policy",
      "Strong communication skills"
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter, resume, and two short writing\nsamples demonstrating a proficiency in policy analysis\nto E&L.Jobs@mail.house.gov with \"Labor Policy Director\" in the subject line.\nPlease apply no later than February 11.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are encouraged to\napply."
  },
  {
    "id": "MEM-037-22",
    "position_title": "Workforce Development Professional Staff",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nWorkforce Development Professional Staff to join a team working on\nworkforce development legislation, including the Workforce Innovation and\nOpportunity Act, the National Apprenticeship Act, and other federal workforce\ndevelopment programs.\n\nThe candidate must have two years or more of experience working on the\nimplementation and/or oversight of federal workforce development programs.\nCongressional experience is welcomed but not necessary. This is not an entry\nlevel position.",
    "responsibilities": [],
    "qualifications": [
      "Two years or more of experience working on the implementation and/or oversight of federal workforce development programs.",
      "Congressional experience is welcomed but not necessary.",
      "This is not an entry level position."
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter, resume, and two short writing\nsamples demonstrating a proficiency in policy analysis\nto E&L.Jobs@mail.house.gov with \"Workforce Development Professional Staff\"\nin the subject line. Please apply no later than February 11.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are encouraged to\napply."
  },
  {
    "id": "MEM-036-22",
    "position_title": "Labor Counsel",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Labor Counsel to lead the Committee’s efforts on legislation and regulatory issues related to federal wage and hour laws.\n\nThe work scope includes issues associated with the Fair Labor Standards Act (FLSA) including minimum wage, overtime, subminimum wages (such as tip, youth and disability), child labor, and misclassification, as well as prevailing wage laws, including the Service Contract Act and the Davis Bacon Act.\n\nResponsibilities may include guestworker programs, the Migrant and Seasonal Agricultural Workers Protection Act, and the Family and Medical Leave Act. The candidate must have a J.D., three or more years of experience working in the executive, judicial or legislative branch on wage and hour legal and/or policy issues. Congressional experience is welcomed but not necessary. This is not an entry level position.",
    "responsibilities": [
      "Issues associated with the Fair Labor Standards Act (FLSA) including minimum wage, overtime, subminimum wages (such as tip, youth and disability), child labor, and misclassification",
      "Prevailing wage laws, including the Service Contract Act and the Davis Bacon Act",
      "Guestworker programs",
      "The Migrant and Seasonal Agricultural Workers Protection Act",
      "The Family and Medical Leave Act"
    ],
    "qualifications": [
      "J.D.",
      "Three or more years of experience working in the executive, judicial or legislative branch on wage and hour legal and/or policy issues.",
      "Congressional experience is welcomed but not necessary.",
      "Not an entry level position."
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter, resume, and two short writing samples demonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with \"Labor Counsel\" in the subject line. Please apply no later than February 11.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-033-22",
    "position_title": "Temporary Staff Associate",
    "office": "Chairman of the Foreign Affairs Subcommittee on the Western Hemisphere, Civilian Security, Migration, and International Economic Policy",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "The Staff Associate will serve as a subcommittee staffer coordinating hearings and assisting with preparing legislative documents.\nSuccessful candidates will be enthusiastic, professional, hard-working, and detailoriented, with strong writing and communication skills and able to work in a fastpaced environment.\nCandidates must hold a bachelor’s degree and demonstrate clear interest in U.S. policy toward Latin America and the Western Hemisphere more broadly.\nPrevious Hill experience is preferred but not required. Previous relevant work experience is preferred.",
    "responsibilities": [
      "Handle day to day administration",
      "Subcommittee event coordination",
      "Intern management",
      "Conduct policy research",
      "Draft press and social media statements",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Candidates must hold a bachelor’s degree and demonstrate clear interest in U.S. policy toward Latin America and the Western Hemisphere more broadly.",
      "Previous Hill experience is preferred but not required.",
      "Previous relevant work experience is preferred.",
      "Spanish proficiency preferred."
    ],
    "how_to_apply": "Qualified candidates should send resume and cover letter to WHEMjobs@gmail.com with the subject line “Temporary Staff Associate.” No calls or drop-ins.",
    "salary_info": null,
    "contact": "WHEMjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-031-22",
    "position_title": "Communications Director",
    "office": "Senior Republican Member",
    "location": "Capitol Hill",
    "posting_date": "2022-02-07",
    "description": "Senior Republican Member seeking a talented and highly motivated individual to assume the role of Communications Director. The Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director will oversee day-to-day press operations, responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member’s social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters.\n\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.\n\nThis is NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill (2 years+). They must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations, responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member’s social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters",
      "Working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging."
    ],
    "qualifications": [
      "Candidates must have previous press-related experience either on or off Capitol Hill (2 years+).",
      "Must be highly organized",
      "Proficient in multi-tasking",
      "Have strong political judgment and instincts",
      "Possess superior writing, editing, and proofreading skills."
    ],
    "how_to_apply": "Candidate should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communication’s Director” to Suzanne.scruggs@mail.house.gov",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "Suzanne.scruggs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-028-22",
    "position_title": "Staff Assistant",
    "office": "California House Democrat",
    "location": "Washington D.C.",
    "posting_date": "2022-02-07",
    "description": "Ideal candidate will be a motivated self-starter with outstanding customer service, excellent time-management, and strong organizational skills.\n\nIdeal candidates will have relevant experience, excellent oral, written, and interpersonal skills, demonstrate the ability to think on their feet to solve problems, and maintain a positive demeanor in a busy environment.\n\nCandidates with California ties are preferred but not required.",
    "responsibilities": [
      "managing the front office including answering and logging telephone calls",
      "recruiting and managing interns",
      "managing constituent requests for flags and tours",
      "supporting legislative and communications staff",
      "assisting with constituent mail responses and other administrative duties"
    ],
    "qualifications": [],
    "how_to_apply": "Please submit a resume and cover letter in a single PDF document to ca07jobs@gmail.com with “DC Staff Assistant” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-027-22",
    "position_title": "Scheduler/Office Manager",
    "office": "Senior Democratic Congresswoman",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "Responsibilities include managing office calendars and visitor access to Member, organizing and tracking meeting and event invitations, speaking engagements, travel reservations and other requests for the Member, coordinating with district staff, and maintaining administrative demands. This individual will also manage the intern program in the office.\n\nThe Scheduler/Office Manager will work closely with other staff members, particularly senior staffers, to ensure efficient and seamless office operations. Ideal candidates are flexible, responsive, collaborative, work well under pressure and on short deadlines, and are able to balance competing demands.\n\nCandidates must be available to assist the Member outside of regular business hours. Applicants should also have a positive attitude, excellent organizational skills, strong written and verbal communication and interpersonal skills, political instincts and an ability to thrive in a fast-paced environment.",
    "responsibilities": [
      "Managing office calendars and visitor access to Member",
      "Organizing and tracking meeting and event invitations",
      "Organizing speaking engagements",
      "Organizing travel reservations",
      "Handling other requests for the Member",
      "Coordinating with district staff",
      "Maintaining administrative demands",
      "Managing the intern program in the office",
      "Working closely with other staff members, particularly senior staffers, to ensure efficient and seamless office operations"
    ],
    "qualifications": [
      "Previous Capitol Hill operational and/or scheduling experience is required",
      "3+ years of experience a plus",
      "Ohio ties preferred",
      "Flexible",
      "Responsive",
      "Collaborative",
      "Ability to work well under pressure and on short deadlines",
      "Able to balance competing demands",
      "Positive attitude",
      "Excellent organizational skills",
      "Strong written and verbal communication and interpersonal skills",
      "Political instincts",
      "Ability to thrive in a fast-paced environment",
      "Available to assist the Member outside of regular business hours"
    ],
    "how_to_apply": "Please submit cover letter, and resume to Midwestern.Resume@mail.house.gov. No phone calls, emails, or drop-bys.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-021-22",
    "position_title": "Legislative Correspondent/Legislative Aide",
    "office": "Representative Tom Suozzi (NY-03",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "The Office of Representative Tom Suozzi (NY-03 is looking for a Legislative Correspondent/Legislative Aide to assist both our constituent mail program and with the Member’s legislative program in the Washington, D.C. office.\nCandidates should possess previous Hill experience, a working knowledge of the legislative process, and excellent communication and organization skills. The successful candidate should be detail oriented, have strong writing and and editing skills, and be able to manage and prioritize a variety of assignments at one time.",
    "responsibilities": [
      "managing the constituent correspondence program",
      "assisting with other communication projects",
      "tracking legislation",
      "assisting staff with legislative needs"
    ],
    "qualifications": [
      "previous Hill experience",
      "a working knowledge of the legislative process",
      "excellent communication and organization skills",
      "detail oriented",
      "strong writing and editing skills",
      "able to manage and prioritize a variety of assignments at one time",
      "New York State ties, especially to Long Island, are a plus"
    ],
    "how_to_apply": "Please email a cover letter, resume, and short writing sample to NY03resumes@mail.house.gov",
    "salary_info": null,
    "contact": "NY03resumes@mail.house.gov",
    "equal_opportunity": "The office of Rep. Suozzi is an equal opportunity employer and is committed to a diverse and inclusive workforce."
  },
  {
    "id": "MEM-019-22",
    "position_title": "Communications Director",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C. and Seattle, WA",
    "posting_date": "2022-02-07",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07), chair of the Congressional Progressive Caucus, seeks an experienced, creative, and highly motivated Communications Director to lead media and strategy efforts in her fast-paced Washington, D.C. and Seattle, WA offices.\n\nAn ideal candidate will:\n\nThis is a senior level position. Applicants must have a proven track record of working with the press, and a minimum of two years of experience as a press secretary or communications director is required. Previous experience on campaigns (political, legislative, or issue-based) and on Capitol Hill is preferred.\n\nWomen, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus.",
    "responsibilities": [
      "Developing and executing the office’s communications strategy for Capitol Hill and Seattle, including national and local press, messaging, writing, events, and digital",
      "Working directly with the Congresswoman to prepare and staff her for interviews, speeches, press conferences, public events, roundtables, and other opportunities",
      "Building and sustaining strong relationships with local and national reporters (including Capitol Hill reporters, local reporters, and issue-specific reporters at national outlets), editors, columnists, producers, bookers, and advocacy groups",
      "Proactively and strategically engaging in media outreach, including pitching reporters while also fielding and responding to press inquiries at the local and national levels",
      "Serving as the spokesperson (on the record, on background, and off the record) for the Congresswoman",
      "Drafting written materials including press statements, quotes, speeches, remarks, op-eds, press releases and advisories, and talking points",
      "Designing creative plans to effectively roll out legislation, letters, and other policy initiatives that include press components, and events",
      "Overseeing a robust, aggressive, engaging, and data-driven online communications program",
      "Supervising and partnering with the Digital Manager, who manages all digital and online content, to maintain strategic messaging across official channels while collaborating with Progressive Caucus staff",
      "Working collaboratively with the District Office to ensure a consistently strong local/state media presence while collaborating with the legislative team on a daily basis"
    ],
    "qualifications": [
      "Possess strong written and oral communications skills and the ability to multitask while thriving in a fast-paced setting under tight deadlines",
      "Have experience working directly with local and national reporters, bookers, and other members of the media to proactively pitch stories and respond to inquiries",
      "Think strategically and creatively while designing, implementing, and evaluating both short and long-term communications plans in addition to leading rapid response efforts",
      "Have a proven track record of writing in the voice of a principal (op-eds, speeches, statements, messaging, talking points, digital content, etc.) and explaining policy issues in ways that people can easily understand",
      "Know how to operate directly with a principal and collaboratively across departments while demonstrating experience managing a team",
      "Understand the digital media landscape and current digital trends, with experience overseeing a digital program",
      "Have a strong record of advocating for progressive values",
      "Be willing to staff the Congresswoman for press, and work weekends and irregular hours",
      "Applicants must have a proven track record of working with the press, and a minimum of two years of experience as a press secretary or communications director is required",
      "Previous experience on campaigns (political, legislative, or issue-based) and on Capitol Hill is preferred"
    ],
    "how_to_apply": "Qualified candidates should include the following in their application:\n\nResume\nCover letter\nThree writing samples including an op-ed or speech, and a statement\nThree references\n\nPlease send applications to jobs.pramila@mail.house.gov with “Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-018-22",
    "position_title": "Legislative Assistant",
    "office": "U.S. Representative Jimmy Panetta",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "U.S. Representative Jimmy Panetta seeks a Legislative Assistant to lead the\nMember’s work on health care, immigration, housing, transportation, social\nsecurity, social justice, criminal justice, equality, and government and postal\nreform issues. The position manages priority legislation and requires working\nclosely with diverse coalitions of stakeholders and advocates located in the\ndistrict on California’s central coast.\n\nApplicants should have experience in formulating legislation and planning the\npathway for the legislation to become law. Other duties include drafting talking\npoints, memos, and recommendations on legislation and floor proceedings,\nrepresenting the Member before stakeholders, federal agencies and constituents,\ntravel to the district, and frequent outreach and involvement with constituents.\n\nThis is not an entry-level position. Qualified applicants have at least two years of\nexperience in a congressional office or in a position primarily involved in\nlegislative and policy affairs. The position also requires strong interpersonal\ncommunication skills, the ability to manage multiple assignments and deadlines\nsimultaneously, and a will to work across the aisle to advance bipartisan\ninitiatives.\n\nSuccessful applicants must have superior written, verbal, research, analytical and\nproblem-solving skills. Candidates must be able to perform under pressure and\npossess a strong work ethic, a commitment to public service, and an\nunderstanding of what it takes to be a part of a successful team effort.",
    "responsibilities": [
      "Formulating legislation",
      "Planning the pathway for the legislation to become law",
      "Drafting talking points, memos, and recommendations on legislation and floor proceedings",
      "Representing the Member before stakeholders, federal agencies and constituents",
      "Travel to the district",
      "Frequent outreach and involvement with constituents"
    ],
    "qualifications": [
      "At least two years of experience in a congressional office or in a position primarily involved in legislative and policy affairs",
      "Strong interpersonal communication skills",
      "The ability to manage multiple assignments and deadlines simultaneously",
      "A will to work across the aisle to advance bipartisan initiatives",
      "Superior written, verbal, research, analytical and problem-solving skills",
      "Ability to perform under pressure",
      "Strong work ethic",
      "Commitment to public service",
      "Understanding of what it takes to be a part of a successful team effort"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples of\none page or less and three references with “LEGISLATIVE ASSISTANT” in the\nsubject line to ca20.jobs@mail.house.gov",
    "salary_info": null,
    "contact": "ca20.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status."
  },
  {
    "id": "MEM-017-22",
    "position_title": "Field Deputy",
    "office": "Congressman Brad Sherman (CA-30)",
    "location": "Sherman Oaks, CA",
    "posting_date": "2022-02-07",
    "description": "The Office of Congressman Brad Sherman (CA-30) is seeking to fill a job\nopening for a field deputy position in the (Sherman Oaks) district office.",
    "responsibilities": [
      "Attending and speaking at meetings and events hosted by constituents, community organizations and government agencies;",
      "Advising the Congressman and senior staff on policy developments and the viewpoints of stakeholders by preparing briefing materials and post-event memoranda;",
      "Working with staff members and community leaders to plan and participate in outreach events;",
      "Interacting with constituents via phone, e-mail and in-office meetings, and providing assistance with federal agencies."
    ],
    "qualifications": [
      "Applicant should be organized, professional, highly motivated and must possess strong writing, typing and interpersonal skills.",
      "Must be able to work in a fast-paced environment and meet deadlines.",
      "Proficiency with Microsoft Office and database software preferred.",
      "Past experience in a non-profit or government field is highly regarded.",
      "Candidate should have graduated from an accredited four-year college or university with a bachelor's degree.",
      "Applicant should expect weekend, holiday and after-hours assignments."
    ],
    "how_to_apply": "Please submit cover letter and resume attn: Scott Abrams\nto scott.abrams@mail.house.gov\nNo calls please.",
    "salary_info": "Salary commensurate with experience. We offer a generous student loan reimbursement package.",
    "contact": "scott.abrams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-22",
    "position_title": "Scheduler/Administrative Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "Scheduling duties include but are not limited to managing all aspects of the Congressman’s daily and long-term schedule in D.C., Hawai‘i and elsewhere. Other duties include coordinating and implementing administrative functions of the D.C. office, including constituent mail, tours requests, inventory management and records management. Direct report is to the Chief of Staff, although the individual will work closely with the Deputy Chief of Staff and the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Managing all aspects of the Congressman’s daily and long-term schedule in D.C., Hawai‘i and elsewhere.",
      "Coordinating and implementing administrative functions of the D.C. office, including constituent mail, tours requests, inventory management and records management."
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Prior scheduling experience",
      "Hawai’i background",
      "Initiative",
      "Strong interpersonal skills",
      "Multitasking",
      "The ability to work independently and effectively under pressure",
      "Make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Scheduler/Administrative Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-011-22",
    "position_title": "Communications Director",
    "office": "Republican Natural Resource and Judiciary Member office",
    "location": null,
    "posting_date": "2022-02-07",
    "description": "Republican Natural Resource and Judiciary Member office seeking a\nCommunications Director to develop and lead a communications plan and\nmanage all media operations for the Member’s outreach and legislative items.\nThis includes but is not limited to pitching and booking local and national media.\nGrow strong local and national press relations. Formulate talking points and\nspeeches. Create daily social media content, statements, press releases, media\nadvisories, radio ad scripts, op-eds, and the newsletter. Maintain updates to\nMember’s website. Generate and oversee a communications budget strategy that\nconsists of digital ads, radio ads, mass mailers and telephone town halls.",
    "responsibilities": [
      "Develop and lead a communications plan",
      "Manage all media operations for the Member’s outreach and legislative items",
      "Pitch and book local and national media",
      "Grow strong local and national press relations",
      "Formulate talking points and speeches",
      "Create daily social media content, statements, press releases, media advisories, radio ad scripts, op-eds, and the newsletter",
      "Maintain updates to Member’s website",
      "Generate and oversee a communications budget strategy that consists of digital ads, radio ads, mass mailers and telephone town halls"
    ],
    "qualifications": [
      "Detail-oriented",
      "Hands-on",
      "Strong writer",
      "Team player",
      "Ability to work under tight and simultaneously competing deadlines"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to: ResumesOR@mail.house.gov",
    "salary_info": null,
    "contact": "ResumesOR@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-594-21",
    "position_title": "Field Representative",
    "office": "Southern California Republican Member of the House",
    "location": "Southern California",
    "posting_date": "2022-02-07",
    "description": "Are you looking for an exciting and fast-paced career in public service? A Southern California Republican has an immediate need to hire a full-time Field Representative. We are looking for an enthusiastic and motivated individual to join our high-energy team.\n\nThe Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfort navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including nights and weekends",
      "Constituent service oriented; patient empathetic, with a desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director\nStephanie.Hu@mail.house.gov",
    "salary_info": "Salary starts at $3,500 per month. Salary commensurate with experience.",
    "contact": "Stephanie Hu, District Director\nStephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-539-21",
    "position_title": "Staff Assistant",
    "office": "Nevada’s 4th District Democratic Member of Congress",
    "location": "North Las Vegas, Nevada District office",
    "posting_date": "2022-02-07",
    "description": "Candidates must be comfortable working with the public, have excellent oral and written communication skills, problem solving abilities.",
    "responsibilities": [
      "Managing the front desk, greeting visitors, processing flag requests, answering phones, conducting tours, overseeing an active mail program",
      "Sorting/batching correspondence, drafting correspondence and ensuring a swift turnaround time",
      "Responding to constituent mail, keeping abreast of legislative developments, and meeting with constituent groups",
      "Assisting District Representatives as needed",
      "Perform all other duties as assigned and required"
    ],
    "qualifications": [
      "Passionate about public service and committed to democratic values",
      "Strong writing, communication skills and be detail-oriented",
      "Have advanced experience with spreadsheets and forms",
      "A poised, confident, self-starter, and team-player with a sense of humor",
      "The ability to work in a high-paced environment.",
      "The ability work weekends and holidays",
      "Have reliable transportation, auto insurance and a clean driving record",
      "Currently enrolled in an ungraduated degree program at a college or university or have a minimum of a bachelor’s degree in the related fields of human services or social work, and a minimum of one-year relevant experience in community or human services."
    ],
    "how_to_apply": "Qualified candidates must include a cover letter, resume, one writing sample and three professional references in a single PDF file. Email submissions to the Director of Administration, nv04resume@mail.house.gov. Subject line must read",
    "salary_info": null,
    "contact": "Director of Administration, nv04resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Spanish language skills and District ties are a plus."
  },
  {
    "id": "MEM-NV04-2",
    "position_title": "Staff Assistant",
    "office": "Congressman Steven Horsford",
    "location": "Washington, D.C.",
    "posting_date": "2022-02-07",
    "description": "Congressman Steven Horsford is seeking a Staff Assistant for his Washington, D.C. office. Responsibilities include managing the front office, answering phones, greeting visitors, sorting mail, processing flag requests and tour requests, and assisting with administrative tasks. Qualified candidates should possess excellent organizational, interpersonal, and written communication skills. Nevada ties are a plus. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation. To apply, please email a resume and cover letter to NV04.applications@mail.house.gov with the subject line \"Staff Assistant\".",
    "responsibilities": [
      "Managing the front office",
      "Answering phones",
      "Greeting visitors",
      "Sorting mail",
      "Processing flag requests",
      "Processing tour requests",
      "Assisting with administrative tasks"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Excellent interpersonal skills",
      "Excellent written communication skills",
      "Nevada ties are a plus"
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to NV04.applications@mail.house.gov with the subject line \"Staff Assistant\".",
    "salary_info": null,
    "contact": "NV04.applications@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation."
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2022-02-07",
    "description": "The Office of Representative Spanberger seeks a motivated, creative, self-starter to join the district constituent services staff as a District Coordinator in the Glen Allen, VA office.\n\nResponsibilities include responding to constituent inquiries, managing constituent casework with federal agencies, working with the legislative team to address constituent concerns, and district outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events. Additional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills and have significant experience interacting with the public.\n\nAdditionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail and an ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]