[
  {
    "id": "MEM-388-18",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2018-10-29",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks)",
      "Serving as intern coordinator by recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov .",
    "salary_info": null,
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-379-18",
    "position_title": "Senior Legislative Aide",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Hill",
    "posting_date": "2018-10-29",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a Senior Legislative Aide with a minimum of three years of Hill experience. This is not an entry level position. Excellent written and oral communication skills required. Advanced degree a plus. Spanish ability a plus. Texas ties are a plus though not necessary.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of three years of Hill experience",
      "Excellent written and oral communication skills required",
      "Advanced degree a plus",
      "Spanish ability a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use title on your email: Senior LA Position. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-375-18",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Southern Republican Congressman",
    "location": "Capitol",
    "posting_date": "2018-10-29",
    "description": "Southern Republican Congressman is seeking a Staff Assistant/Legislative Correspondent to join a fast-paced, hardworking team. The ideal candidate will be detail oriented, well organized and must have exceptional interpersonal skills and excellent oral and written communication skills.",
    "responsibilities": [
      "Answering constituent phone calls",
      "Greeting visitors",
      "Leading Capitol tours",
      "Assisting the staff by performing various tasks"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Prioritize duties",
      "Perform under pressure",
      "Keen attention to detail",
      "A car and Tennessee ties are required"
    ],
    "how_to_apply": "Please send resumes to tngopapplications@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "tngopapplications@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-371-18",
    "position_title": "Legislative Director",
    "office": "Congresswoman Frederica S. Wilson",
    "location": "Washington, D.C.",
    "posting_date": "2018-10-29",
    "description": "The office of Congresswoman Frederica S. Wilson seeks a Legislative Director in her Washington, D.C. office. Responsibilities will include developing and implementing the Member’s legislative priorities, advising her on various issues, and managing the legislative agenda. A well matched candidate will have substantive legislative experience, strong academic credentials and proven leadership and organizational skills. Moreover, the candidate should possess excellent oral and written communication skills, strong editing and proofreading skills, the ability to work well under pressure, an extensive knowledge of the legislative process, and the availability to work long hours.\n\nThis is not an entry-level position; only candidates with previous Hill experience and proven knowledge of legislative and political processes will be considered. Law degree, previous capitol hill experience in a leadership position and Florida ties are strongly preferred.",
    "responsibilities": [
      "Developing and implementing the Member’s legislative priorities",
      "Advising her on various issues",
      "Managing the legislative agenda"
    ],
    "qualifications": [
      "Substantive legislative experience",
      "Strong academic credentials",
      "Proven leadership and organizational skills",
      "Excellent oral and written communication skills",
      "Strong editing and proofreading skills",
      "Ability to work well under pressure",
      "Extensive knowledge of the legislative process",
      "Availability to work long hours",
      "Previous Hill experience",
      "Proven knowledge of legislative and political processes",
      "Law degree (strongly preferred)",
      "Previous capitol hill experience in a leadership position (strongly preferred)",
      "Florida ties (strongly preferred)"
    ],
    "how_to_apply": "To apply, please submit cover letter and resume in one single pdf to FL24.Resumes@mail.house.gov and include “Legislative Director” in the subject line by October 31, 2018.\nNo phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-361-18",
    "position_title": "Military & Veterans Constituent Service Representative (CSR)",
    "office": "Congresswoman Katherine M. Clark",
    "location": "District Office",
    "posting_date": "2018-10-29",
    "description": "The District Office of Congresswoman Katherine M. Clark is currently\naccepting applicants for the position of Military & Veterans Constituent\nService Representative (CSR). The CSR monitors and updates the Member\nand District Director on district and local issues as well as serves as a liaison\nto federal, district, and local agencies for the member and constituents.\nThis position is responsible for a wide range of outreach, relationship\nmanagement, event coordination, and correspondence. We’re looking for\nsomeone who has great judgment, keen political skills, is quick on their feet\nand ready to seize opportunities (or create them). The ideal candidate is fast\nbut highly detail oriented and is a strong written and oral communicator.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman within his or her area of\nresponsibility including answering casework correspondence, meeting with\nconstituents, verbal communications with constituents, and serving as a\nliaison with federal, district, and local agencies;",
      "Informs the Congresswoman and the District Director of all happenings in\nhis or her assigned issue areas by screening district media sources and\ninteracting with constituents;",
      "Acts as a liaison to local, state and federal officials and other persons or\ngroups to form effective relationships for the Member;",
      "Manages at least 1 casework assignment area & assesses casework for\nproblems requiring legislative action and makes recommendations to the\nDistrict Director and/or Chief of Staff;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Prepares periodic reports for the District Director on pending cases and\ndistrict activities in his or her assigned geographic & issue areas;",
      "Continually screens active cases and acts as liaison with constituents to\nensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of\nimportance to the office;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "3-5 years relevant experience required; experience with the military &\nveteran’s issues preferred.",
      "Exceptional written & oral communication, organizational and project\nmanagement skills with an overall execution orientation; track record of\neffectively managing complex, multi-stakeholder projects;",
      "Thorough knowledge of legislative process and of House organization and\nprocedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the\nCongresswoman is involved;",
      "Strong political instincts, and a proactive entrepreneurial mindset;",
      "Grace under pressure; ability to delegate, communicate, and act decisively as\nwell as adapt well to changing priorities;",
      "Availability & ability to work long, irregular hours including evenings and\nweekends;",
      "A professional style that includes flexibility, evenness, and sense of humor."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, & 2 writing\nsamples to: Jobs.MA05@mail.house.gov.\nAll materials will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "Jobs.MA05@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-360-18",
    "position_title": "Oversight and Investigations Committee Staff Position",
    "office": "House Committee on Energy and Commerce, Subcommittee on Oversight & Investigations",
    "location": null,
    "posting_date": "2018-10-29",
    "description": "House Committee on Energy and Commerce, Subcommittee on Oversight & Investigations is seeking a professional staffer or counsel to work on oversight issues related to the Committee’s broad jurisdiction for the Committee’s Democratic staff. Areas of expertise under the Committee’s jurisdiction preferred, including environment, energy, public health and cyber security. Background in investigations and oversight a plus. Responsibilities include staffing Congressional hearings, overseeing federal agencies, conducting research and investigations, writing and editing, and conducting document review and analysis. Successful candidate will be detail-oriented and possess strong communication and writing skills. Five years of professional experience and J.D. preferred but not required, as experience within the areas of the Committee’s public issue area jurisdiction may be equally relevant.",
    "responsibilities": [
      "staffing Congressional hearings",
      "overseeing federal agencies",
      "conducting research and investigations",
      "writing and editing",
      "conducting document review and analysis"
    ],
    "qualifications": [
      "detail-oriented",
      "strong communication and writing skills",
      "Five years of professional experience and J.D. preferred but not required, as experience within the areas of the Committee’s public issue area jurisdiction may be equally relevant."
    ],
    "how_to_apply": "Please send resume, cover letter, writing sample, and at least two professional references to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-354-18",
    "position_title": "Digital Content Manager",
    "office": "Congressman Jimmy Gomez (CA-34)",
    "location": "Los Angeles",
    "posting_date": "2018-10-29",
    "description": "Congressman Jimmy Gomez (CA-34) seeks a Los Angeles-based Digital\nContent Manager to join fast-paced, innovative communications team. This\nindividual will report to the Communications Director and responsibilities\ninclude: developing long-term and short-term digital plans and strategies;\ncreating, drafting and posting content on all platforms; creating graphics,\nvideo and other sharable content; managing and growing the Congressman's\ne-newsletter program and overseeing the website. Ideal candidate is a\npolitically savvy, detail-oriented and creative self-starter, who is familiar with\nsocial media trends and able to use data to evaluate and improve the digital\nprogram. This is not an entry-level position.",
    "responsibilities": [
      "developing long-term and short-term digital plans and strategies",
      "creating, drafting and posting content on all platforms",
      "creating graphics, video and other sharable content",
      "managing and growing the Congressman's e-newsletter program and overseeing the website"
    ],
    "qualifications": [
      "Previous digital communications experience, on Capitol Hill, a campaign, or at a communications firm, is required."
    ],
    "how_to_apply": "To apply, please email cover letter, resume and digital sample to Gomez.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-352-18",
    "position_title": "Outreach Representative",
    "office": "Virginia Democratic Congressman",
    "location": "Richmond, VA",
    "posting_date": "2018-10-29",
    "description": "The Outreach Representative will be responsible for cultivating strategic relationships with community leaders and constituent groups, as well as developing and executing an outreach plan for the district.\n\nDuties also include coordinating events and initiatives that will promote services that the office provides, organizing events that relate to the Congressman’s legislative and district priorities, and monitoring and updating office leadership on local district issues. The Outreach Representative may also be assigned additional short-term or special projects and will be responsible for recruiting and managing office interns.\n\nAdditional responsibilities include staffing the Congressman at various events and meetings in the district and working on nights and weekends as needed. Access to a vehicle is required.",
    "responsibilities": [
      "Cultivating strategic relationships with community leaders and constituent groups",
      "Developing and executing an outreach plan for the district",
      "Coordinating events and initiatives that will promote services that the office provides",
      "Organizing events that relate to the Congressman’s legislative and district priorities",
      "Monitoring and updating office leadership on local district issues",
      "Recruiting and managing office interns",
      "Staffing the Congressman at various events and meetings in the district",
      "Working on nights and weekends as needed"
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Organization",
      "A spirit of teamwork and service",
      "Priority given to candidates with Virginia ties and related experience",
      "Access to a vehicle is required"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and three references to vaoutreachrep@gmail.com as soon as possible.",
    "salary_info": null,
    "contact": "vaoutreachrep@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-330-18",
    "position_title": "Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Government Reform",
    "location": "District of Columbia",
    "posting_date": "2018-10-29",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives. Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff. The ideal candidate will be an attorney with several years of investigative or litigation experience. Responsibilities include depositions, transcribed interviews, briefings, and congressional hearings. Candidates with diverse backgrounds and experiences are strongly encouraged to apply. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  }
]