[
  {
    "id": "MEM-485-22",
    "position_title": "Oversight Counsel and Investigator",
    "office": "Permanent Subcommittee on Investigations (PSI)",
    "location": null,
    "posting_date": "2022-10-11",
    "description": "The Permanent Subcommittee on Investigations (PSI) is the U.S. Senate’s\npremiere investigative body and its oversight jurisdiction is extremely broad,\nincluding issues related to national health, welfare, safety and security. The\nSubcommittee is seeking an Oversight Counsel and an Investigator to help\nnavigate its various investigations and engage in interactions with Executive\nBranch officials and private entities regarding PSI oversight efforts. This may\ninclude conducting extensive record reviews and interviews with witnesses,\nwriting an assortment of products, including the drafting of PSI bipartisan staff\nreports, in addition to supporting and advising PSI’s Chair (Senator Jon Ossoff)\nand other PSI staff.\n\nBoth positions require a seasoned investigator or counsel who is energetic,\ndetermined, thoughtful, and well organized with outstanding written and oral\ncommunications skills. The individual should have experience investigating cases\nof waste, fraud, abuse, corruption and/or mismanagement. The ability to work\nwell in a fast-paced environment with small teams and the ability to pursue\noversight opportunities on their own is critical. A calm and positive disposition\nunder demanding conditions and the ability to multitask under tight deadlines is\nessential. Congressional experience is useful but not required. Investigative\nreporters and others with investigative experience are encouraged to apply. This\nis a unique opportunity to engage in in-depth congressional investigations. This is\nnot an entry-level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and writing sample to:\nPSIjobapplication@hsgac.senate.gov. All applications are due by COB on Friday,\nOctober 21, 2022.",
    "salary_info": "$70,000 to $75,000",
    "contact": "PSIjobapplication@hsgac.senate.gov",
    "equal_opportunity": "The Subcommittee is an equal employment opportunity employer and does not\ndiscriminate on the bases of race, color, religion, national origin, disability, age,\nuniformed service, genetic information, sex, sexual orientation, gender identity or\ngender expression. The subcommittee benefits from a diverse staff, and\ncandidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-480-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Lisa Blunt Rochester (DE-At Large)",
    "location": null,
    "posting_date": "2022-10-11",
    "description": "Legislative portfolio will be focused on education, labor, and financial services, but will also include tax, budget, trade, among other issues. Depending on ideal candidate’s experience, there is an opportunity to modify the portfolio.\n\nThis position will also spearhead the Congresswoman’s Future of Work Caucus, which encompasses crafting legislation, developing stakeholder relationships, managing the caucus as a resource for Congress on related issues, and putting together caucus events with members and stakeholders.",
    "responsibilities": [
      "Crafting legislation",
      "Developing stakeholder relationships",
      "Managing the caucus as a resource for Congress on related issues",
      "Putting together caucus events with members and stakeholders"
    ],
    "qualifications": [
      "Good knowledge of the legislative process",
      "Coalition building",
      "Ability to maintain strategic relationships with constituent organizations",
      "Ability to advance the Congresswoman’s legislative priorities in their issue portfolio",
      "Be creative in spotting new legislative opportunities",
      "Self-starters",
      "Able to meet short deadlines",
      "Juggle many priorities in a fast-paced environment",
      "Ties to Delaware are a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and two writing samples to lbr.jobposting@gmail.com with “Legislative Assistant” in the subject line by COB October 14th. No phone calls, drop-ins, or emails please.",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This is an Equal Opportunity Employer."
  },
  {
    "id": "MEM-472-22",
    "position_title": "Staff Assistant/Driver",
    "office": "Rep. A. Donald McEachin (VA-04)",
    "location": "D.C.",
    "posting_date": "2022-10-11",
    "description": "Duties include driving the Congressman in D.C., helping to manage the front office, answering phones, greeting visitors, processing flag and tour requests, assisting with constituent mail responses, managing the office intern program, and performing other tasks as assigned.\n\nThe ideal candidate will be energetic, organized, flexible, and efficient, with strong interpersonal skills and a good sense of humor. Access to a car is not required. Ability to work late nights when necessary is a must. Capitol Hill experience and Virginia ties preferred but not required.",
    "responsibilities": [
      "Driving the Congressman in D.C.",
      "Helping to manage the front office",
      "Answering phones",
      "Greeting visitors",
      "Processing flag and tour requests",
      "Assisting with constituent mail responses",
      "Managing the office intern program",
      "Performing other tasks as assigned"
    ],
    "qualifications": [
      "Energetic, organized, flexible, and efficient",
      "Strong interpersonal skills",
      "Good sense of humor",
      "Ability to work late nights when necessary is a must.",
      "Capitol Hill experience and Virginia ties preferred but not required."
    ],
    "how_to_apply": "To apply, please send your resume, cover letter, and a brief writing sample in a single PDF document to McEachin.Jobs@mail.house.gov with “Staff Assistant” in the subject line.",
    "salary_info": "$55,000",
    "contact": "McEachin.Jobs@mail.house.gov",
    "equal_opportunity": "Equal opportunity employer. Diverse candidates are encouraged to apply. No calls or drop-bys, please."
  },
  {
    "id": "MEM-471-22",
    "position_title": "Staff/Digital Assistant",
    "office": "Rep. Dutch Ruppersberger’s office",
    "location": "Timonium, MD",
    "posting_date": "2022-10-11",
    "description": "The ideal candidate is an organized, empathetic, self-starter with excellent interpersonal communication and time management skills.\n\nThis is a utility position that is responsible for managing all administrative duties, such as, answering phones, drafting letters, processing vouchers, invoices, and staff reimbursements, preparing congressional citations, processing mail, and other duties as needs arise.\n\nThe Digital Assistant portion of the position would require you to manage our website, coordinate all social media (Twitter, Instagram and YouTube), and assist our Director of Communications as needed. Access to a vehicle is required, as driving the Congressman on evenings and weekends is sometimes needed.\n\nThis position provides an opportunity to be part of a dedicated, compassionate team that is committed to providing exceptional constituent service.",
    "responsibilities": [
      "Managing all administrative duties, such as answering phones, drafting letters, processing vouchers, invoices, and staff reimbursements, preparing congressional citations, processing mail, and other duties as needs arise.",
      "Manage our website",
      "Coordinate all social media (Twitter, Instagram and YouTube)",
      "Assist our Director of Communications as needed.",
      "Driving the Congressman on evenings and weekends is sometimes needed."
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "An ability to work collaboratively",
      "Flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Interested candidates should submit their resume to jasmine.ginn@mail.house.gov.",
    "salary_info": "The starting salary for this position is 45k base pay with an annual bonus structure. We offer a tuition reimbursement program that is a 10k a year benefit for eligible candidates. We earn 12 paid sick days and 15 vacations days each the first year, with one additional day every year after.",
    "contact": "jasmine.ginn@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-470-22",
    "position_title": "Press Secretary/Digital Director",
    "office": "Office of Congresswoman Frederica S. Wilson",
    "location": "DC- and district-based",
    "posting_date": "2022-10-11",
    "description": "The Office of Congresswoman Frederica S. Wilson seeks an experienced, creative, and tech-savvy press secretary/digital director to join our communications team.\n\nThe press secretary/digital director will work closely with the communications director to implement an ambitious communications strategy. Candidates should have strong writing and creative skills, strong editing and proofreading skills, and work well under pressure.\n\nThe ideal candidate will have at least one year or one federal campaign cycle of communications experience, including digital strategy, social media management, content creation, editing of graphics, photos, and videos using multimedia software including Adobe Creative Cloud. Experience with Facebook business manager, Google Ads, and digital analytics is a preferred!\n\nCandidates from diverse backgrounds and with Florida ties are highly encouraged to apply. Fluency in Spanish or Kreyòl is a plus.",
    "responsibilities": [
      "Managing the member’s social media accounts, official website, media lists, newsletters, mailers, advertisements, communications schedule, and other resources",
      "Compiling daily press clips, creating communications briefings, monitoring analytic data",
      "Assisting in the development of materials intended for the media, such as press releases, talking points, newsletters, pitches, media kits, and weekly reports",
      "Creating graphics, editing photos, and videos",
      "Planning and staffing virtual, DC- and district-based events such as press conferences, tele-townhalls, and roundtables.",
      "Building relationships with local and national reporters",
      "Maximizing the member’s visibility through digital solutions and advertising",
      "Pitching innovative strategies to expand the Congresswoman’s reach on social media and elsewhere",
      "Photographing the Congresswoman at press conferences and other events",
      "Managing press interns and fellows"
    ],
    "qualifications": [
      "at least one year or one federal campaign cycle of communications experience, including digital strategy, social media management, content creation, editing of graphics, photos, and videos using multimedia software including Adobe Creative Cloud.",
      "Experience with Facebook business manager, Google Ads, and digital analytics is a preferred!"
    ],
    "how_to_apply": "Please submit your resume, cover letter, two writing samples, and digital samples to FL24.Resumes@mail.house.gov and include “Press Secretary/Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-465-22",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2022-10-11",
    "description": "Duties include assisting the technology needs of Committee staff; editing and maintaining the Committee’s website; answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee’s website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Applicants with experience or interest in learning information technology assistance are strongly encouraged to apply"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$47,093 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-462-22",
    "position_title": "Policy Advisor",
    "office": "The Congressional Asian Pacific American Caucus (CAPAC)",
    "location": "Capitol Hill",
    "posting_date": "2022-10-11",
    "description": "The Congressional Asian Pacific American Caucus (CAPAC) seeks a Policy\nAdvisor to manage the Caucus’ policy agenda, including crafting and executing\neffective legislative strategies to advance Caucus policy priorities, representing\nthe Caucus as point of contact on all policy engagements, working with\nMembers’ staff to advance legislative proposals, developing materials to support\nthe goals and mission of the Caucus, and promoting the Caucus both internally\nwithin the House of Representatives and externally to the public.\n\nThis is not an entry-level position and candidates should have a demonstrated understanding of\nHouse and Senate legislative processes.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with Executive Director and other Caucus staff to advance CAPAC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CAPAC priorities forward",
      "Collaborating with CAPAC Member office staff to further Caucus policy objectives and managing communication with CAPAC policy liaisons",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Must have an understanding of CAPAC’s policy priorities and familiarity working with the Asian American, Native Hawaiian, and Pacific Islander community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Should also be detail-oriented and possess the ability to multitask, work well in a fast-paced setting, and act as a team player."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample\nto congressional.apa.caucus@gmail.com. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "congressional.apa.caucus@gmail.com",
    "equal_opportunity": null
  }
]