[
  {
    "id": "MEM-266-24",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2024-07-08",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office.\n\nThe Committee’s financial disclosure counsel is responsible for reviewing and certifying a large volume of Financial Disclosure Reports, providing legal advice on financial disclosure related matters, providing education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Reviewing and certifying a large volume of Financial Disclosure Reports",
      "Providing legal advice on financial disclosure related matters",
      "Providing education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line",
    "salary_info": "The salary range for this position is $136,780 and $145,604 per annum.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-248-24",
    "position_title": "Deputy Director of Scheduling",
    "office": "House Democratic Leadership office",
    "location": "Washington, D.C.",
    "posting_date": "2024-07-08",
    "description": "House Democratic Leadership office is seeking a proactive, resourceful, detailoriented person with strong writing and organizational skills to fill the Deputy Director of Scheduling position. Successful candidates will demonstrate outstanding interpersonal, written and oral communication skills, and be able to prioritize and follow through on multiple tasks in a high-pressure/fast-paced environment.\n\nThe Deputy Director of Scheduling works closely with the Director of Scheduling as well as Leader and Chief of Staff with all projects and assignments. The Deputy Director will assist the Director of Scheduling in longrange planning, but is primarily responsible for booking travel for the Leader, assisting the Deputy Chief of Staff with day of changes in the Leader’s schedule, field incoming scheduling requests, and assisting with administrative support to the Executive Office.\n\nRegular responsibilities include coordinating with event participants and the appropriate staff to ensure the Leader is provided with briefing materials, and liaising between other Congressional Leadership, Member and Committee Offices, as well as the White House and other government offices.\n\nThe ideal candidate will exercise sound judgment, be professional at all times, and have a sense of humor. Hill experience is preferred, but not required.\n\nThis is not an entry level position.",
    "responsibilities": [
      "Coordinating with event participants and the appropriate staff to ensure the Leader is provided with briefing materials",
      "Liaising between other Congressional Leadership, Member and Committee Offices, as well as the White House and other government offices"
    ],
    "qualifications": [
      "Strong writing and organizational skills",
      "Outstanding interpersonal, written and oral communication skills",
      "Ability to prioritize and follow through on multiple tasks in a high-pressure/fast-paced environment",
      "Exercise sound judgment",
      "Be professional at all times",
      "Have a sense of humor",
      "Hill experience is preferred, but not required"
    ],
    "how_to_apply": "Interested applicants should send resume to resumes.jeffries@mail.house.gov with a brief cover letter.",
    "salary_info": null,
    "contact": "resumes.jeffries@mail.house.gov",
    "equal_opportunity": "Our office is committed to employing a diverse staff where each team member’s unique identity is celebrated and valued."
  },
  {
    "id": "MEM-243-24",
    "position_title": "Staff Assistant",
    "office": "Congressman Bill Pascrell, Jr.",
    "location": "Paterson, New Jersey",
    "posting_date": "2024-07-08",
    "description": "New Jersey Congressman Bill Pascrell, Jr. seeks an organized Staff Assistant for\nhis Paterson, New Jersey, district office to handle general reception duties,\nconduct constituent services, and drive the Congressman to and from events,\nmeetings, and other engagements.\n\nThe Staff Assistant can also expect to represent the congressman at community\nevents. Candidates should be motivated self-starters with excellent oral and\nwritten communication skills. Applicants must have a valid driver's license. This\nentry-level position is a tremendous opportunity to learn the ins-and-outs of the\nUnited States Congress, collaborate with professionals and elected officials and\nnavigate the unparalleled Garden State political realm.",
    "responsibilities": [
      "Handle general reception duties",
      "Conduct constituent services",
      "Drive the Congressman to and from events, meetings, and other engagements",
      "Represent the congressman at community events"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Excellent oral and written communication skills",
      "Valid driver's license"
    ],
    "how_to_apply": "To apply, please send a resume and cover letter via email to NJ09position@mail.house.gov with “Staff Assistant” in the subject line. We will consider applications until the position is filled.",
    "salary_info": "The position is full time with federal benefits, including student loan repayment program (if eligible).",
    "contact": "NJ09position@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status."
  },
  {
    "id": "MEM-242-24",
    "position_title": "Legislative Aide",
    "office": "Congressman Dan Kildee (MI-08)",
    "location": "Washington, D.C.",
    "posting_date": "2024-07-08",
    "description": "The legislative aide will be responsible for issues areas such as energy and environment, transportation and infrastructure, and veterans’ affairs, among others, in a fast-paced congressional office of a member of House Democratic Leadership on the Ways and Means Committee and Budget Committee.\n\nResponsibilities are wide-ranging, including interacting with constituents, district stakeholders, committee staff, and federal agencies; writing policy memos and talking points; monitoring committee and floor activities; and supporting strategic efforts to advance legislation through Congress.",
    "responsibilities": [
      "Interacting with constituents, district stakeholders, committee staff, and federal agencies",
      "Writing policy memos and talking points",
      "Monitoring committee and floor activities",
      "Supporting strategic efforts to advance legislation through Congress"
    ],
    "qualifications": [
      "Self-starting personality",
      "Passion for public service",
      "Strong written and verbal communication skills",
      "Eagerness to work on a team in a collaborative office environment",
      "This is not an entry-level position.",
      "Michigan ties are preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to kildeejobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": "$70,000 - $80,000 commensurate with experience",
    "contact": "kildeejobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-240-24",
    "position_title": "Staff Assistant/Scheduler",
    "office": "Congressman's Office",
    "location": "Washington, D.C.",
    "posting_date": "2024-07-08",
    "description": "The Staff Assistant/Scheduler will be entrusted with maintaining the Congressman's official schedule, travel plans, and related records. They will also oversee the congressional intern program and be responsible for various administrative functions in the Washington, D.C. office.",
    "responsibilities": [
      "Work with the Chief of Staff to prepare and coordinate the Member’s schedule.",
      "Serve as a liaison with external stakeholders on meeting requests.",
      "Process official travel vouchers and office expenses for reimbursement.",
      "Maintain and organize important administrative files.",
      "Coordinate travel and planning activities for the Member and office staff.",
      "Ensure the Congressman is provided with briefing materials and memos for each event.",
      "Coordinate scheduling of press interviews with the Communications Director.",
      "Manage the D.C. office tour program for constituents.",
      "Oversee the internship program for the office including the following:",
      "Compile applications for consideration by the Chief of Staff;",
      "Train and orient new interns;",
      "Assign daily duties to interns;",
      "Be responsive to scheduling matters outside of office hours and on the weekend.",
      "Staffs the front reception area, greets visitors and answers telephones.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Exceptional attention to detail.",
      "Strong interpersonal, verbal and written communication skills.",
      "Ability to be diplomatic in liaising with outside groups.",
      "Thorough knowledge of office administration, policies, practices, and procedures.",
      "Strong sense of urgency and responsiveness."
    ],
    "how_to_apply": "Resumes may be emailed to housegopemployment@gmail.com",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-238-24",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Rosa L. DeLauro (CT-03)",
    "location": "Washington, DC",
    "posting_date": "2024-07-08",
    "description": "The staff assistant will work closely with the chief of staff and the scheduler, and responsibilities include managing the front office and welcoming constituents and other visitors; driving the Member; processing incoming mail, phone calls, and constituent requests including tours and flags; managing the intern program; greeting visitors; providing administrative support for the office including support for events; and other duties assisting the staff and Member as assigned.\n\nApplicants should be detail-oriented, proactive, calm under pressure, able to exercise discretion, eager to work in a fast-paced office, and willing to work flexible hours when the Member is in DC. Strong communication, logistical, interpersonal, and organizational skills are essential.\n\nApplicants must have a valid driver’s license, a clean driving record, and be comfortable driving in DC. Access to personal car preferred, although not required. This role provides a unique entry level opportunity to work closely with a senior Member of Congress.",
    "responsibilities": [
      "Managing the front office and welcoming constituents and other visitors",
      "Driving the Member",
      "Processing incoming mail, phone calls, and constituent requests including tours and flags",
      "Managing the intern program",
      "Greeting visitors",
      "Providing administrative support for the office including support for events",
      "Other duties assisting the staff and Member as assigned"
    ],
    "qualifications": [
      "Detail-oriented",
      "Proactive",
      "Calm under pressure",
      "Able to exercise discretion",
      "Eager to work in a fast-paced office",
      "Willing to work flexible hours when the Member is in DC",
      "Strong communication, logistical, interpersonal, and organizational skills",
      "Valid driver’s license",
      "Clean driving record",
      "Comfortable driving in DC",
      "Access to personal car preferred, although not required"
    ],
    "how_to_apply": "Please send a cover letter, resume, writing sample (1-2 pages), and two reference contacts in a single pdf file to Daniel.Robillard@mail.house.gov with the subject line “Staff Assistant: [Your name (First/Last)]” No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "Daniel.Robillard@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and encourages all qualified candidates to apply."
  },
  {
    "id": "MEM-236-24",
    "position_title": "Communications Director/Press Secretary",
    "office": "Congresswoman Sylvia Garcia",
    "location": "DC",
    "posting_date": "2024-07-08",
    "description": "The Communications Director/Press Secretary is expected to work closely with the Chief of Staff, Legislative Director and District Director to develop and execute a comprehensive and aggressive strategic plan to inform constituents and the media on issues that are important to the Congresswoman. This includes making media pitches, organizing press events, and reviewing, drafting, and finalizing statements, remarks/speeches, press releases, media advisories, and other messaging (e.g., social media). Finally, the Communications Director/Press Secretary will work closely with and manage other members of the communications team, including the DC-based speechwriter and the districtbased communications assistant.",
    "responsibilities": [
      "Work closely with the Chief of Staff, Legislative Director and District Director to develop and execute a comprehensive and aggressive strategic plan to inform constituents and the media on issues that are important to the Congresswoman.",
      "Making media pitches",
      "Organizing press events",
      "Reviewing, drafting, and finalizing statements, remarks/speeches, press releases, media advisories, and other messaging (e.g., social media).",
      "Work closely with and manage other members of the communications team, including the DC-based speechwriter and the districtbased communications assistant."
    ],
    "qualifications": [
      "Ideal candidates will be bilingual in Spanish",
      "Demonstrate a successful track record of communications experience",
      "Have supervisory experience"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and 1-2 short writing samples to TX29Jobs@Gmail.com with “Communications” in the subject line.",
    "salary_info": "The title and salary are commensurate with experience.",
    "contact": "TX29Jobs@Gmail.com",
    "equal_opportunity": "The Office of Congresswoman Garcia is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, religion, sex, national origin, age, disability, sexual orientation or gender identity. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-233-24",
    "position_title": "SCHEDULER",
    "office": "Congressman Jake Auchincloss (MA-04)",
    "location": "Washington, DC",
    "posting_date": "2024-07-08",
    "description": "Congressman Jake Auchincloss (MA-04) is seeking a highly motivated, detail-orientated, and energetic individual with excellent oral and written communications skills for a Scheduler position in the Washington, DC office.\n\nDaily tasks include managing and maintaining the Member’s daily and long-term DC schedule; coordinating travel, booking flight reservations, and managing logistics for events; evaluating and organizing all incoming meeting and event requests; communicating key information regarding the Member and the Member’s schedule to staff; and working closely with both DC and District staff to ensure smooth daily office operations. Candidates must be available to assist the Member outside of regular business hours.\n\nThis position requires proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member, Chief of Staff, District Director, and District Scheduler. Excellent writing, verbal and strong organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Previous Capitol Hill or scheduling experience is required; this is not an entry level position.\n\nAccess to a car and a clean driving record is preferred. The salary range for this position is $65,000-$75,000.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long-term DC schedule",
      "Coordinating travel, booking flight reservations, and managing logistics for events",
      "Evaluating and organizing all incoming meeting and event requests",
      "Communicating key information regarding the Member and the Member’s schedule to staff",
      "Working closely with both DC and District staff to ensure smooth daily office operations",
      "Assist the Member outside of regular business hours"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member, Chief of Staff, District Director, and District Scheduler",
      "Excellent writing, verbal and strong organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Previous Capitol Hill or scheduling experience is required; this is not an entry level position",
      "Access to a car and a clean driving record is preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and one writing sample to AuchinclossJobs@mail.house.gov with “First Name Last Name—Scheduler” in the Subject Line. Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": "$65,000-$75,000",
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-230-24",
    "position_title": "CONSTITUENT SERVICES REPRESENTATIVE",
    "office": "Senior Democratic Member of Congress",
    "location": "Santa Rosa, California",
    "posting_date": "2024-07-08",
    "description": "Overview: Senior Democratic Member of Congress seeks Constituent Services Representative for his office in Santa Rosa, California. The Constituent Services Representative responsibilities include answering casework correspondence and verbal communications with constituents; acting as liaison with federal, district, and local agencies for the Member and constituents; office administrative responsibilities and other duties important to serving the people of the congressional district.",
    "responsibilities": [
      "Serves as a liaison with federal government entities for individual constituent concerns",
      "Assesses casework trends and identifies issues requiring legislative action and/or additional Congressional oversight",
      "Prepares incoming and outgoing constituent casework to manage casework in assigned areas of expertise",
      "Maintains accurate and complete files on all assigned casework to keep track of all casework progress",
      "Screens and monitors cases to determine if referring the case to other government entities is appropriate",
      "Answers casework correspondence, meets with constituents, and serves as a liaison with federal, state, and local authorities to act as the representative for the Member within their areas of responsibility",
      "Writes responses to constituent letters relating to casework to answer questions or inform them of case progress",
      "Support Office in executing public meetings and annual Congressional activities such as the Congressional Art Competition, Congressional App Competition, and other similar events.",
      "Orders all office supplies to maintain office functionality and similar administrative duties",
      "Acts as the Intern Coordinator supporting the onboarding, training, and supervision of interns",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner"
    ],
    "qualifications": [
      "Candidates must be a self-starter, hard-working, highly dependable, and organized as well as possess strong oral and written communication skills and the ability to work quickly under pressure.",
      "Good judgment, strong customer service and interpersonal skills, attention to detail, ability to work in a team environment, a passion for public service, and availability to work some evenings and weekends are required.",
      "Driver’s license and access to vehicle is required.",
      "Bachelor's degree or equivalent combination of education and experience preferred.",
      "Prior experience working for federal, state, or local government, especially related to casework is preferred.",
      "Familiarity with Member's district, especially the Sonoma Valley, is preferred.",
      "Ability to communicate in multiple languages, especially Spanish, is highly desirable."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples and three references to ca04districtstaff@gmail.com with the Subject Line: Constituent Services Representative Vacancy.",
    "salary_info": "Commensurate with Experience.",
    "contact": "ca04districtstaff@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-229-24",
    "position_title": "FIELD REPRESENTATIVE",
    "office": "Senior Democratic Member of Congress",
    "location": "Santa Rosa, California",
    "posting_date": "2024-07-08",
    "description": "Overview: Senior Democratic Member of Congress seeks Field Representative\nfor office in Santa Rosa, California, to cover Rohnert Park, Cotati and Penngrove.\nThe Field Representative serves as the Member's community representative for\nissues and programs within their assigned areas, including monitoring and\nupdating the Member and their colleagues on important local issues, emerging\ntrends, and critical developments.\nThey also represent the Member at community events and meetings, schedule the\nMember while in the district, prepare and attend meetings and events with the\nMember, answer casework correspondence and verbal communications with\nconstituents, act as liaison with federal, district, and local agencies for the\nMember and constituents, and other duties important to serving the people of the\ncongressional district.",
    "responsibilities": [
      "Coordinates with the Member and colleagues to ensure outreach efforts align\nwith the Member’s strategic vision, goals, and priorities",
      "Collaborates with district and D.C. colleague to ensure district priorities are\naligned and inform the Member’s legislative strategy",
      "Serves as a liaison with federal government entities for individual constituent\nconcerns, including the handling of constituent casework",
      "Collaborates with colleagues to schedule the Member while in their assigned\nareas in the district",
      "Assesses casework trends and identifies issues requiring legislative action and/or\nadditional Congressional oversight",
      "Informs the Member and colleagues on any important developments and current\nevents impacting the district",
      "Builds and maintains positive relationships with constituents, key community\nleaders, and other stakeholders",
      "Tracks news stories and social media posts for the Member and colleagues,\nincluding the communications team",
      "Acts as a liaison to local, state, and federal officials and stakeholders to form\neffective relationships for the Member",
      "Attends events to serve as a representative for the Member, as determined by\ntheir supervisor",
      "Handles various community issues in accordance with office policies and\nprocedures.",
      "Support Office in executing public meetings and annual Congressional activities\nsuch as the Congressional Art Competition, Congressional App Competition, and\nother similar events.",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and\nensure work is completed in an efficient and effective manner",
      "Understands differing perspectives and opinions to navigate conflicts and\ndevelop solutions effectively"
    ],
    "qualifications": [
      "Candidates must be a self-starter, hard-working, highly\ndependable, adaptable, and organized as well as possess strong oral and written\ncommunication skills and the ability to work quickly under pressure.",
      "Good\njudgment, strong customer service and interpersonal skills, ability to develop and\ncollaborate with coalitions, works well in a team environment, a passion for\npublic service, and availability to work evenings and weekends are required.",
      "Driver’s license and access to vehicle is required.",
      "Bachelor's degree or equivalent\ncombination of education and experience preferred.",
      "Prior experience developing\na community relations strategy for a Member of Congress, elected official, or\nFederal agency is preferred.",
      "Familiarity with Member's district, especially\nRohnert Park, Cotati, and Penngrove, is preferred.",
      "Ability to communicate in\nmultiple languages, especially Spanish, is highly desirable."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume,\ntwo writing samples and three references to ca04districtstaff@gmail.com with the\nSubject Line: Field Representative Vacancy.",
    "salary_info": "Commensurate with Experience.",
    "contact": "ca04districtstaff@gmail.com",
    "equal_opportunity": "All applicants will be considered\nwithout regard to race, color, religion, sex (including marital or parental status),\nsexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-180-24",
    "position_title": "District Representative",
    "office": "Congressman Steven Horsford’s District Office",
    "location": "North Las Vegas district office",
    "posting_date": "2024-07-08",
    "description": "Under the supervision of the District Director, the District Representative acts as the representative for the Member. District Representative responsibilities include strengthening relationships with key stakeholders, as well as attending engagements on behalf of the Member. Caseworker responsibilities include helping constituents resolve problems with federal agencies through written and verbal communication.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals.",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities.",
      "Build and maintain relationships with constituents and key community leaders.",
      "Organize and participate in community events, town halls, and outreach campaigns to engage constituents.",
      "Act as the representative for the Member within his or her area of responsibility, including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies.",
      "Handle casework assignments and assess casework for problems requiring legislative action, making recommendations to the District Director and Chief of Staff.",
      "Monitor scheduled district meetings for the Member with constituents.",
      "Maintain a good working relationship with the Member, staff, and constituents.",
      "Accept performance-based criticism and directions.",
      "Work well under pressure and handle stress.",
      "Work a flexible schedule including long hours, nights, and weekends.",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Political knowledge and comfortable navigating complicated situations",
      "Strong written, verbal, analytical, and organization skills; impeccable customer service manners; public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including occasional nights, weekends and some holidays.",
      "Bachelor’s degree or related job experience is required.",
      "A demonstrated interest in public service and familiarity with District 4 community is preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples (no longer than two pages) and three professional references to NV04Resume@mail.house.gov with \"District Representative,” [Last Name, First Name]\" in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, minorities, individuals with disabilities, and veteran are encouraged to apply."
  },
  {
    "id": "MEM-155-24",
    "position_title": "PRESS SECRETARY",
    "office": "The Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-07-08",
    "description": "The Office of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. office.\nCandidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staff the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the office’s larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  },
  {
    "id": "MEM-135-24",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-07-08",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  }
]