[
  {
    "id": "MEM-239-16",
    "position_title": "Office Administrator",
    "office": "Office of General Counsel",
    "location": "Washington, DC",
    "posting_date": "2016-08-01",
    "description": "The Office of General Counsel (\"OGC\"), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation, seeks a motivated, detail-oriented, and energetic individual with excellent administrative skills to serve as office administrator. Candidates should demonstrate strong interpersonal skills, be comfortable with managing multiple tasks, and have a strong work ethic.",
    "responsibilities": [
      "answer incoming calls and distribute requests for advice among office attorneys",
      "assist with personnel/human relations matters and ensure that office policies and procedures are followed",
      "maintain office finance and payroll accounts in accordance with applicable House regulations and office policies",
      "assist with annual budgeting process",
      "procure and maintain software, equipment, office supplies, and library for the office",
      "serve as point of contact for IT-related issues for the office, perform ITrelated tasks, and coordinate with HIR and outside computer vendors as needed",
      "perform general administrative tasks as needed"
    ],
    "qualifications": [
      "bachelor’s degree or equivalent",
      "at least three years of office management experience",
      "at least two years of experience working in a congressional office",
      "strong administrative and organizational skills",
      "ability to manage multiple tasks and projects and to work well under pressure",
      "familiarity with House Rules, policies, and procedures relating to use of appropriated funds, purchasing, budgeting, payroll, personnel, and management of IT resources",
      "thoroughness and careful attention to detail"
    ],
    "how_to_apply": "Email cover letter and resume to OGC.Employment@mail.house.gov.",
    "salary_info": null,
    "contact": "OGC.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-238-16",
    "position_title": "Legislative Assistant",
    "office": "Texas Democrat",
    "location": "Hill",
    "posting_date": "2016-08-01",
    "description": "Active Texas Democrat seeking enthusiastic, well-organized Legislative Assistant in a fast-paced team-oriented office. Portfolio includes but is not limited to: energy, transportation, veterans affairs and armed services. Applicant must be able to multi-task, have strong work ethic and the ability to work flexible hours. Ideal candidate should have at least 2-3 years of Hill legislative experience. This is NOT an entry-level position. Individual interested in this position must have strong written and oral communication skills and the ability to work under pressure to meet deadlines. Willingness to also serve as driver to Member a major plus.",
    "responsibilities": [],
    "qualifications": [
      "Must be able to multi-task",
      "Strong work ethic",
      "Ability to work flexible hours",
      "At least 2-3 years of Hill legislative experience",
      "Strong written and oral communication skills",
      "Ability to work under pressure to meet deadlines",
      "Willingness to also serve as driver to Member a major plus"
    ],
    "how_to_apply": "Please e-mail resume and cover letter to TXLegislativeAssistant@Mail.House.Gov. NO PHONE CALLS OR DROP-BYS PLEASE.",
    "salary_info": null,
    "contact": "TXLegislativeAssistant@Mail.House.Gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-234-16",
    "position_title": "Field Representative",
    "office": "A Maryland Democrat",
    "location": "District Office",
    "posting_date": "2016-08-01",
    "description": "A Maryland Democrat is seeking a high energy, highly-organized, and detail oriented Field Representative for his District Office.",
    "responsibilities": [
      "Serve as the official representative for the Member in the local community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Directors on district and local issues of importance.",
      "Staff and provide logistical support for scheduled district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Directors and Chief of Staff.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Train and supervise a staff of Interns to handle routine office matters, such as incoming correspondence, visitors, telephone calls, and other issues that may arise."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "A working knowledge of the VA and military issues is a plus, but not required.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis until the position is filled. To apply, please email a resume and cover letter to MD06.Jobs@mail.house.gov. No phone calls or walk-ins please",
    "salary_info": null,
    "contact": "MD06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-217-16",
    "position_title": "Military Legislative Assistant",
    "office": "Congresswoman Gabbard",
    "location": "Washington, D.C.",
    "posting_date": "2016-08-01",
    "description": "The MLA will be the primary staffer for the Members’ work on House Armed Services Committee, working closely under the guidance of the Legislative Director. He or she will also manage the Congresswoman’s Asia-Pacific policy work on the Foreign Affairs Committee. This position’s portfolio focuses primarily on Asia-Pacific policy and defense-related issues, but also includes Veterans Affairs and Homeland Security. Responsibilities include preparing and staffing the Member for committee hearings, development of Member requests for the National Defense Authorization Act, working closely with the Legislative Director on NDAA strategy, researching and advising the Member on bills and other issues, and representing the Member in meetings and events.\n\nWe are seeking someone to join our fun, team-oriented, hard-working office.\nThe successful candidate will possess a can-do attitude and will be solutions oriented. He or she will also be an independent worker, a self-starter and will possess the capacity to produce high quality work on short deadlines. He or she will have strong writing skills and a demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment.\n\nIdeal candidates should have experience working on Asia-Pacific issues and/or defense-related issues in a policy context, Hill experience, or both.\nHawaii ties and an active security clearance are a plus.",
    "responsibilities": [
      "Preparing and staffing the Member for committee hearings",
      "Development of Member requests for the National Defense Authorization Act",
      "Working closely with the Legislative Director on NDAA strategy",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings and events"
    ],
    "qualifications": [
      "Experience working on Asia-Pacific issues and/or defense-related issues in a policy context, Hill experience, or both.",
      "Hawaii ties (a plus)",
      "Active security clearance (a plus)",
      "Can-do attitude",
      "Solutions oriented",
      "Independent worker",
      "Self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Strong writing skills",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment"
    ],
    "how_to_apply": "To submit your application, please email a resume, cover letter, and two short writing samples with the subject line “military legislative assistant” to hi02jobs@gmail.com. Please no calls or walk-ins.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-216-16",
    "position_title": "Senior Legislative Assistant",
    "office": "Congresswoman Gabbard",
    "location": "Hill",
    "posting_date": "2016-08-01",
    "description": "This position opening is for a Senior Legislative Assistant, who will work closely with the Legislative Director as a senior member of the legislative team. The staffer’s legislative work will focus on helping the Member build upon and expand her work on domestic policy issues. The portfolio includes financial services, jobs, healthcare, small business, Social Security, Medicare and Medicaid, and education.\n\nWe are seeking someone to join our fun, team-oriented, hard-working office.\n\nThe successful candidate will possess a can-do attitude and will be solutions oriented. He or she will also be an independent worker, a self-starter and will possess the capacity to produce high quality work on short deadlines. He or she will have strong writing skills, and the ability to communicate effectively with colleagues and superiors in a dynamic work environment. Ideal candidates should have three to four years of Hill experience and time working on the issues in the portfolio. This is not an entry-level position. Hawaii ties are a plus.",
    "responsibilities": [
      "Developing and advancing legislation and other policy priorities of the Member",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings and events"
    ],
    "qualifications": [
      "Three to four years of Hill experience",
      "Time working on the issues in the portfolio",
      "Strong writing skills",
      "Ability to communicate effectively with colleagues and superiors in a dynamic work environment",
      "Can-do attitude",
      "Solutions oriented",
      "Independent worker",
      "Self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Hawaii ties are a plus"
    ],
    "how_to_apply": "To submit your application, please email a resume, cover letter, and two short writing samples with the subject line “senior legislative assistant” to hi02jobs@gmail.com. Please no calls or walk-ins.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-212-16",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member",
    "location": "Capitol Hill",
    "posting_date": "2016-08-01",
    "description": "Senior Democratic Member seeks motivated, detail-oriented, and energetic individual with excellent oral and written communication skills to serve as a staff assistant. Candidates should demonstrate strong interpersonal skills, be comfortable with managing multiple tasks, and have a strong work ethic.",
    "responsibilities": [
      "Managing the front office",
      "Answering and screening telephone calls",
      "Greeting visitors",
      "Coordinating tour requests for visiting constituents",
      "Managing flag requests",
      "Supervising and coordinating the intern program",
      "Assisting staff"
    ],
    "qualifications": [
      "Capitol Hill experience preferred"
    ],
    "how_to_apply": "Email cover letter and resume to job_09@live.com.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-209-16",
    "position_title": "Communications Director",
    "office": "New England Democrat",
    "location": null,
    "posting_date": "2016-08-01",
    "description": "Communications Director is responsible for managing all aspects of very active, fast-paced press operation. Duties include but are not limited to: crafting overall message strategy; planning and executing local and national press events; drafting and distributing press releases, advisories, and statements; engaging in outreach to and maintaining relationships with local and national media; managing social media pages; preparing speeches and written remarks; drafting internal communications documents for Member and staff. Candidates must demonstrate excellent written and verbal skills, keen attention to detail, strong organizational skills, ability to perform well under pressure, and comfort working in team environment. This is not an entry-level position.",
    "responsibilities": [
      "Crafting overall message strategy",
      "Planning and executing local and national press events",
      "Drafting and distributing press releases, advisories, and statements",
      "Engaging in outreach to and maintaining relationships with local and national media",
      "Managing social media pages",
      "Preparing speeches and written remarks",
      "Drafting internal communications documents for Member and staff"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Keen attention to detail",
      "Strong organizational skills",
      "Ability to perform well under pressure",
      "Comfort working in team environment",
      "Not an entry-level position"
    ],
    "how_to_apply": "Interested applicants should submit cover letter, resume, and two writing samples to hill.jobs@mail.house.gov. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-203-16",
    "position_title": "Legislative Correspondent",
    "office": "Southern Republican",
    "location": "Washington, D.C.",
    "posting_date": "2016-08-01",
    "description": "Primary responsibilities include managing constituent correspondence, conducting research, and providing support to the legislative staff when necessary. Applicants must be hardworking, detail oriented, and possess strong writing skills. Experience with the Intranet Quorum database and having ties to Tennessee are preferred but not required. This position also allows for the opportunity to experience the press side of a congressional office if interested.",
    "responsibilities": [
      "Managing constituent correspondence",
      "Conducting research",
      "Providing support to the legislative staff when necessary"
    ],
    "qualifications": [
      "Hardworking",
      "Detail oriented",
      "Strong writing skills",
      "Experience with the Intranet Quorum database (preferred)",
      "Ties to Tennessee (preferred)"
    ],
    "how_to_apply": "Qualified candidates should send their resume to TN08.HouseJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "TN08.HouseJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-199-16",
    "position_title": "Communications & Outreach Coordinator",
    "office": "U.S. Rep. Ann McLane Kuster",
    "location": "Concord, New Hampshire",
    "posting_date": "2016-08-01",
    "description": "Communications:\n\nIssue Area Outreach:\n\nGeneral:",
    "responsibilities": [
      "Work with Communications team to draft and disseminate press releases, media advisories, statements, and other communications material.",
      "Help plan local press events and assist Communications Director in pitching stories to the media as needed.",
      "Manage Facebook, Twitter, and other social media pages.",
      "Work with Communications Director and other staff to develop and implement office messaging strategy.",
      "Develop and maintain relationships with leaders and stakeholders in assigned issue areas.",
      "Attend and hold meetings as necessary with issue area leaders and stakeholders; engage with the public on projects within these areas.",
      "Monitor ongoing projects and legislative actions connected to assigned issue areas.",
      "Develop and coordinate public events, business visits and private meetings in connection with assigned issue areas.",
      "Answer phones and walk-in cases as necessary.",
      "Draft letters, memos and reports on meetings, events and projects.",
      "Attend occasional night or weekend events as necessary."
    ],
    "qualifications": [
      "Strong writing skills",
      "Strict attention-to-detail",
      "Ability to “think on your toes” and work in a constantly shifting, fast-paced work environment",
      "Prior political or press experience strongly preferred."
    ],
    "how_to_apply": "If interested, please submit resume, cover letter, and two writing samples to NH02.Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NH02.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-194-16",
    "position_title": "Legislative Assistant",
    "office": "U.S. Member of Congress in New York",
    "location": "D.C. Office",
    "posting_date": "2016-08-01",
    "description": "Individuals will handle a portfolio of legislative issues including small business, economic development, housing, environment, immigration, and foreign affairs – including the Middle East and Caribbean. This individual is responsible for drafting legislation and amendments, tracking legislative, developing legislative initiatives, writing speeches and floor statements, staffing the Member in Committee, and representing the Member in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking legislative",
      "Developing legislative initiatives",
      "Writing speeches and floor statements",
      "Staffing the Member in Committee",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Work well under pressure in a fast-paced environment",
      "Strong team player",
      "At least two years of legislative experience on Capitol Hill",
      "Ties to New York are a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and brief writing sample to ResumeNY@mail.house.gov. Please be sure to put LEGISLATIVE ASSISTANT in the subject line.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": "An Equal Opportunity Employer."
  }
]