[
  {
    "id": "MEM-052-19",
    "position_title": "Staff Assistant",
    "office": "Republican Staff of the Committee on Oversight and Reform",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "The Republican Staff of the Committee on Oversight and Reform, the chief investigative body of the House of Representatives, seeks a Staff Assistant to perform administrative functions, research projects, and other special assignments. Qualified candidates will have previous Hill or public policy experience, hold a Bachelors’ Degree, and be knowledgeable about or interested in congressional oversight. The ideal candidate will possess a strong research and writing skills, a demonstrated attention to detail, the ability to multitask in a fast-paced environment, work well on teams, and a be willing to accomplish a variety of assignments quickly and effectively.",
    "responsibilities": [
      "Perform administrative functions",
      "Research projects",
      "Other special assignments"
    ],
    "qualifications": [
      "Previous Hill or public policy experience",
      "Bachelors’ Degree",
      "Knowledgeable about or interested in congressional oversight",
      "Strong research and writing skills",
      "Demonstrated attention to detail",
      "Ability to multitask in a fast-paced environment",
      "Work well on teams",
      "Willingness to accomplish a variety of assignments quickly and effectively"
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to oversight.committee@mail.house.gov.",
    "salary_info": null,
    "contact": "oversight.committee@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-049-19",
    "position_title": "Military Legislative Assistant",
    "office": "Texas Democrat",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "A Texas Democrat seeks an experienced Military Legislative Assistant to oversee a wide-ranging policy portfolio including Armed Services Committee work. This is not an entry-level position and a minimum of 3 years of legislative or equivalent experience is required. Responsibilities include staffing member in committee, drafting bills, tracking legislation, writing talking points, providing vote recommendations, and meeting with constituents and interest groups. Ideal candidates will have excellent research and writing skills, and the ability to work under pressure and meet deadlines. Women and minorities are encouraged to apply. Former military service, Texas ties, and an active security clearance are a plus.",
    "responsibilities": [
      "Staffing member in committee",
      "Drafting bills",
      "Tracking legislation",
      "Writing talking points",
      "Providing vote recommendations",
      "Meeting with constituents and interest groups"
    ],
    "qualifications": [
      "Minimum of 3 years of legislative or equivalent experience",
      "Excellent research and writing skills",
      "Ability to work under pressure and meet deadlines",
      "Former military service (a plus)",
      "Texas ties (a plus)",
      "Active security clearance (a plus)"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to TX16Resumes@gmail.com and write “Military Legislative Assistant” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "TX16Resumes@gmail.com",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-048-19",
    "position_title": "Legislative Director",
    "office": "Office of Congresswoman Sylvia R. Garcia (TX-29)",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "CORE RESPONSIBILITIES:\n\nDUTIES:\n\nQualified applicants should submit a cover letter and resume to\nTX29SG.Resumes@mail.house.gov with “TX-29 Legislative Director” in the\nsubject line.\nFemale, minority, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please.",
    "responsibilities": [
      "to advise the Member on all legislative areas",
      "to assist in development of policy positions and legislative initiatives",
      "to manage and supervise the office's legislative staff",
      "ensures that the legislative staff is properly focused on the Member's legislative goals",
      "works to formulate positions on legislative issues",
      "monitors legislative activity on the House floor and handles long-term and short-term legislative planning for the Member",
      "oversees the progression of bills with which the Member is involved as they move from Committee to the floor",
      "recommends strategies and tactics on bills and positions",
      "assigns legislative staff areas of responsibility",
      "trains and supervises legislative staff",
      "schedules and directs legislative staff meetings",
      "meets with groups of key constituents or other office visitors, as necessary",
      "recommends co-sponsorships of legislation to the Member",
      "writes and reviews legislative memos",
      "hires legislative staff, with approval of the Chief of Staff and the Member, when necessary",
      "oversees legislative activities of the office in the absence of the Chief of Staff",
      "maintains up-to-date status reports on all legislation affecting the district, legislation in which the Member is a principal sponsor, or legislation which the Member is a cosponsor",
      "monitors and reports on floor action to the Member and the Chief of Staff/Administrative Assistant",
      "coordinates responses to all legislative mail",
      "staff the member at meeting an events connected to legislative priorities",
      "assists organizations and constituents in the district with federal matters",
      "performs other duties as assigned"
    ],
    "qualifications": [
      "at least 3 years of legislative experience",
      "at least 2 years of management experience",
      "strong academic credentials",
      "strong leadership and organizational skills",
      "excellent oral and written communication skills",
      "ability to work well under pressure",
      "thorough knowledge of the legislative process",
      "availability to work long hours and at night"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter and resume to TX29SG.Resumes@mail.house.gov with “TX-29 Legislative Director” in the subject line.",
    "salary_info": null,
    "contact": "TX29SG.Resumes@mail.house.gov",
    "equal_opportunity": "Female, minority, and LGBTQ+ candidates are strongly encouraged to apply. No phone calls or drop-ins please."
  },
  {
    "id": "MEM-046-19",
    "position_title": "Press/Digital Assistant",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "Progressive Democrat and Senior Member of the House Judiciary Committee is seeking a Press/Digital Assistant to work closely with the Communications Director to elevate the Member’s communications operation. Duties will include monitoring and maintenance of the Member’s social media accounts, drafting and posting content for social media, producing graphics and videos, maintaining the website, compiling daily press clips, meticulously proofreading and fact-checking written materials (including letters, social media posts, press releases, newsletters, talking points, and more), creating e-newsletters and franked mailings, creating targeted mailing lists for mass outreach campaigns, and other responsibilities assigned. The ideal candidate will be organized, detailoriented, tech-savvy, able to work long hours in a fast-paced environment, have superior writing and proofreading skills and the ability to work closely with a communications and legislative team. Ties to Tennessee’s 9th District, previous congressional or campaign experience, and photography/videography/graphic design skills strongly preferred.",
    "responsibilities": [
      "Monitoring and maintenance of the Member’s social media accounts",
      "Drafting and posting content for social media",
      "Producing graphics and videos",
      "Maintaining the website",
      "Compiling daily press clips",
      "Meticulously proofreading and fact-checking written materials (including letters, social media posts, press releases, newsletters, talking points, and more)",
      "Creating e-newsletters and franked mailings",
      "Creating targeted mailing lists for mass outreach campaigns",
      "Other responsibilities assigned"
    ],
    "qualifications": [
      "Organized",
      "Detail-oriented",
      "Tech-savvy",
      "Able to work long hours in a fast-paced environment",
      "Superior writing and proofreading skills",
      "Ability to work closely with a communications and legislative team",
      "Ties to Tennessee’s 9th District (strongly preferred)",
      "Previous congressional or campaign experience (strongly preferred)",
      "Photography/videography/graphic design skills (strongly preferred)"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, 2 writing samples, an original graphic and/or video, and sample tweets to tn09jobs18@mail.house.gov. Please write “Press/Digital Assistant” in the subject line. Please be aware this office has a dog. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "tn09jobs18@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-043-19",
    "position_title": "Staff Assistant",
    "office": "Veterans Committee Majority",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "The Democratic staff of the U.S. House of Representatives Committee on Veterans’ Affairs seeks a Staff Assistant to handle administrative tasks, event coordination, workflow tracking, constituent communication, research, and other tasks as needed. A qualified candidate has a Bachelors’ degree, Hill or political experience, and knowledge of military and veterans issues. He or she should be extremely organized, hardworking, creative and willing to handle any task necessary get the job done. Perfect job for organized, self-starter looking to work in a fast-paced environment and gain Hill experience.",
    "responsibilities": [
      "handle administrative tasks",
      "event coordination",
      "workflow tracking",
      "constituent communication",
      "research",
      "other tasks as needed"
    ],
    "qualifications": [
      "Bachelors’ degree",
      "Hill or political experience",
      "knowledge of military and veterans issues",
      "extremely organized",
      "hardworking",
      "creative",
      "willing to handle any task necessary to get the job done"
    ],
    "how_to_apply": "Please submit cover letter and resume to hvactransition@gmail.com with Staff Assistant in the subject line.",
    "salary_info": null,
    "contact": "hvactransition@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages women, minorities, and LGBTQ candidates to apply. Veterans are also strongly encouraged to apply."
  },
  {
    "id": "MEM-042-19",
    "position_title": "Staff Assistant",
    "office": "Congressman Ed Case (HI-01)",
    "location": "DC",
    "posting_date": "2019-01-28",
    "description": "The Office of Congressman Ed Case (HI-01) seeks a hardworking and detailed-oriented Staff Assistant in DC. Responsibilities include answering the phone, greeting visitors, leading tours, processing flag requests, and handling other administrative tasks as assigned. Applicants will also perform some legislative-related work, such as writing letters and evaluating bills for cosponsorship. Hawai'i ties and previous Hill experience strongly preferred. Please send a resume, cover letter, and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls or drop-ins.",
    "responsibilities": [
      "Answering the phone",
      "Greeting visitors",
      "Leading tours",
      "Processing flag requests",
      "Handling other administrative tasks as assigned",
      "Writing letters",
      "Evaluating bills for cosponsorship"
    ],
    "qualifications": [
      "Hawai'i ties strongly preferred",
      "Previous Hill experience strongly preferred"
    ],
    "how_to_apply": "Please send a resume, cover letter, and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-039-19",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Sylvia R. Garcia",
    "location": "Hill",
    "posting_date": "2019-01-28",
    "description": "The Office of Congresswoman Sylvia R. Garcia seeks an experienced Communications Director to lead her media team. Ideal candidates will possess a strong network of press and Hill contacts, and will have experience creating dynamic communications strategies. Responsibilities include planning and managing all aspects of the Congresswoman’s digital media; writing press releases, op-eds, and talking points; pitching stories; developing messaging; and conveying complex issues to a broad audience.",
    "responsibilities": [
      "Planning and managing all aspects of the Congresswoman’s digital media",
      "Writing press releases, op-eds, and talking points",
      "Pitching stories",
      "Developing messaging",
      "Conveying complex issues to a broad audience"
    ],
    "qualifications": [
      "A qualified candidate will have a minimum of 4 years of experience in communications.",
      "Hill or other political experience is strongly preferred.",
      "Spanish language proficiency is required."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter and resume to TX29SG.Resumes@mail.house.gov with “TX-29 Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "TX29SG.Resumes@mail.house.gov",
    "equal_opportunity": "Female, minority, and LGBTQ+ candidates are strongly encouraged to apply. No phone calls or drop-ins please."
  },
  {
    "id": "MEM-038-19",
    "position_title": "Legislative Aide",
    "office": "A Texas Democrat",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "A Texas Democrat seeks a hardworking Legislative Aide to oversee the mail program and handle a small policy portfolio. Responsibilities include managing a high-volume mail program, researching legislative issues, and drafting timely responses. Ideal candidates will have excellent research and writing skills, and the ability to work under pressure and meet deadlines. Women and minorities are encouraged to apply. Texas ties, knowledge of Fireside 21, and Spanish fluency are a plus, but not required.",
    "responsibilities": [
      "Managing a high-volume mail program",
      "Researching legislative issues",
      "Drafting timely responses"
    ],
    "qualifications": [
      "Excellent research and writing skills",
      "The ability to work under pressure and meet deadlines",
      "Texas ties, knowledge of Fireside 21, and Spanish fluency are a plus, but not required."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to TX16Resumes@gmail.com and write “Legislative Aide” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "TX16Resumes@gmail.com",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-037-19",
    "position_title": "Communications Director",
    "office": "Midwestern Democratic Representative",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-28",
    "description": "This position will manage all communications and social media functions of the office, including developing communications plans, maintaining relationships with both national and district media, responding to daily media inquiries, and preparing written materials, including speeches, talking points, newsletters, op-eds, and direct mail.",
    "responsibilities": [
      "Manage all communications and social media functions of the office",
      "Developing communications plans",
      "Maintaining relationships with both national and district media",
      "Responding to daily media inquiries",
      "Preparing written materials, including speeches, talking points, newsletters, op-eds, and direct mail"
    ],
    "qualifications": [
      "At least three years of experience on the Hill or in an aggressive, proactive media environment",
      "Extensive on-the-record experience",
      "Creativity with the full range of social media platforms",
      "Ability to handle multiple projects simultaneously",
      "Excellent oral and written communications skills",
      "Knowledge of Congressional process and public policy is highly desirable"
    ],
    "how_to_apply": "Please submit resume and two writing samples to press.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "press.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-036-19",
    "position_title": "Senior Legislative Assistant or Legislative Director",
    "office": "Democrat",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "Democrat seeks Senior Legislative Assistant or Legislative Director depending on qualifications to handle financial services, tax, economic issues, and other domestic policy issues. Candidate must have substantial Congressional experience and understand the legislative process. A successful applicant will possess strong writing and verbal communication skills, work well with others, and be comfortable in a fast-paced environment.",
    "responsibilities": [],
    "qualifications": [
      "Substantial Congressional experience",
      "Understand the legislative process",
      "Strong writing and verbal communication skills",
      "Ability to work well with others",
      "Comfortable in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please e-mail a resume and cover letter to financeservicesla@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "financeservicesla@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-035-19",
    "position_title": "Communications Director",
    "office": "PA House Republican member",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "PA House Republican member seeks a pro-active, experienced communications director to implement strategic media plan in a fast-paced and results-driven environment. Successful candidates will be comfortable multi-tasking and managing deadlines. Must have proven track-record, and ability to manage website, social media platforms, and experience managing a robust constituent outreach program. Outstanding writing skills and strong managerial skills are required. This is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit resume and cover letter to pa01communication@gmail.com",
    "salary_info": null,
    "contact": "pa01communication@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-029-19",
    "position_title": "Legislative Director",
    "office": "Northeast Democrat",
    "location": "Hill",
    "posting_date": "2019-01-28",
    "description": "Northeast Democrat seeks enthusiastic Legislative Director to coordinate and oversee the Member's legislative agenda, along with advising the Member on legislative activities and leading legislative staff. This is not an entry-level position. An ideal candidate will have at least 3 years of legislative experience on the Hill. Successful applicants must have a demonstrated ability to manage and mentor staff, think strategically, and have experience in formulating strategic plans for advancing legislation.",
    "responsibilities": [
      "Coordinate and oversee the Member's legislative agenda",
      "Advise the Member on legislative activities",
      "Lead legislative staff"
    ],
    "qualifications": [
      "At least 3 years of legislative experience on the Hill",
      "Demonstrated ability to manage and mentor staff",
      "Think strategically",
      "Experience in formulating strategic plans for advancing legislation",
      "Expert knowledge of House legislative processes and procedures",
      "Excellent organization and communication skills",
      "Ability to work under pressure and meet deadlines",
      "New Jersey ties are a plus but not required"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to NJ10resumes@gmail.com with the following subject line: First name Last Name - Legislative Director. Applications received by January 16, 2019 will receive priority. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "NJ10resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-027-19",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT",
    "office": "House Committee on Transportation & Infrastructure",
    "location": "Washington, DC",
    "posting_date": "2019-01-28",
    "description": "Senior Member on the House Committee on Transportation & Infrastructure is seeking qualified candidates to staff the Member’s committee assignment in addition to managing a diverse legislative issue portfolio. Candidates should be accomplished at drafting, advancing, and analyzing legislation, monitoring legislative developments, conducting research, and drafting vote recommendations. Ideal candidates will have strong organizational and time management skills, excellent written and verbal communication skills, and a positive attitude. Paramount is a solid knowledge of the legislative process as well as an ability to work under pressure and meet deadlines in an unpredictable work environment, all while keeping a sense of humor. This is not an entry-level legislative position. 2-3 years of Hill experience strongly preferred. Mid-South ties are a plus but not required. Women and minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "Staff the Member’s committee assignment",
      "Manage a diverse legislative issue portfolio",
      "Drafting, advancing, and analyzing legislation",
      "Monitoring legislative developments",
      "Conducting research",
      "Drafting vote recommendations"
    ],
    "qualifications": [
      "Strong organizational and time management skills",
      "Excellent written and verbal communication skills",
      "Positive attitude",
      "Solid knowledge of the legislative process",
      "Ability to work under pressure and meet deadlines in an unpredictable work environment",
      "2-3 years of Hill experience strongly preferred",
      "Mid-South ties are a plus but not required"
    ],
    "how_to_apply": "Interested individuals should e-mail a resume and 2 recent writing samples (no longer than 2 pages each) to tn09jobs18@mail.house.gov with the following subject line: [First name] [Last Name] – Senior Legislative Assistant. Please be aware this office has a dog. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "tn09jobs18@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-025-19",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-01-28",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate sensitive matters",
      "Experience in one or more of the following areas is desirable:",
      "Government ethics",
      "Criminal law",
      "Employment law, including the laws governing sexual harassment in the workplace",
      "Civil litigation",
      "Administrative investigations and adjudications",
      "Depositions",
      "Financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-19",
    "position_title": "Communications Director",
    "office": "Democratic House member from California",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "Democratic House member from California seeks pro-active, experienced communications director to develop and implement strategic media plan in a fast-paced and results -driven environment. Must have proven track-record, and ability to manage website and social media tools. Outstanding writing skills and strong pitching skills are required. This is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit resume and cover letter to commstaffer@gmail.com.",
    "salary_info": null,
    "contact": "commstaffer@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-19",
    "position_title": "Staff Assistant",
    "office": "U.S. Congress Joint Economic Committee",
    "location": "Washington, DC",
    "posting_date": "2019-01-28",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nStaff Assistant to handle administrative tasks, event coordination, workflow\ntracking, research and other tasks as needed. He or she will work directly with\nthe Staff Director.\nA qualified candidate has a bachelors’ degree and Hill experience or\nknowledge of American politics. He or she should be extremely organized,\nhardworking, creative and willing to handle any task necessary get the job\ndone. A degree in economics, political science or a related field is helpful but\nnot required. Perfect job for organized, self-starter looking to work in a fastpaced environment and gain Hill experience.",
    "responsibilities": [
      "Handle administrative tasks",
      "Event coordination",
      "Workflow tracking",
      "Research",
      "Other tasks as needed"
    ],
    "qualifications": [
      "Bachelors’ degree",
      "Hill experience or knowledge of American politics",
      "Extremely organized",
      "Hardworking",
      "Creative",
      "Willing to handle any task necessary to get the job done",
      "A degree in economics, political science or a related field is helpful but not required"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to\nsenate_employment@saa.senate.gov indicating the job title and referral\nnumber 224743 in the subject line. All application materials must be\nsubmitted by 5:00 pm EST on February 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, genetic information, national\norigin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-011-19",
    "position_title": "District Director",
    "office": "Congresswoman Diana DeGette",
    "location": "Denver office",
    "posting_date": "2019-01-28",
    "description": "The District Director manages all aspects of district office operations including community outreach, casework, and staff oversight and represents the Congresswoman at events and meetings throughout the community.",
    "responsibilities": [
      "Manages district office staff; including planning, assigning and directing work. addressing complaints; and resolving problems.",
      "Manages district office budget and finances.",
      "Manages the Congresswoman’s schedule in coordination with the district scheduler.",
      "Manages staff outreach to the local community with the assistance of the outreach coordinator.",
      "Oversees the management of constituent casework with the Deputy District Director coordinator.",
      "Ensures clear communication with the DC office and regular reporting of district office activities to the Congresswoman.",
      "Coordinates closely with DC staff to develop and implement the overall strategic plan for the Congresswoman’s staff.",
      "Initiates and maintains key relationships with elected and non-elected leaders in the congressional district.",
      "Develops a keen understanding of the local political climate and the needs and concerns of all the constituencies within the congressional district.",
      "Actively promotes the Congresswoman’s legislative goals and accomplishments in the local community.",
      "Maintains direct outreach connections with specific constituencies as assigned based on experience and the needs of the office.",
      "Represents the Congresswoman and/or assigns appropriate staff to do so in meetings and at events with elected officials and local groups in the district.",
      "Works a flexible schedule including long hours, nights and weekends.",
      "Assists constituents as needed.",
      "Performs other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should send a resume and cover letter to degettedistrictdirectorsearch@gmail.com.",
    "salary_info": null,
    "contact": "degettedistrictdirectorsearch@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-009-19",
    "position_title": "Clerk",
    "office": "House Committee on Science, Space, and Technology",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "Democratic Chair-elect of the House Committee on Science, Space, and Technology seeks to fill a Clerk opening on the Full Committee staff. Duties include assisting with the preparation and conduct of markups, assisting with hearing preparation, maintaining and archiving Committee records, assisting with the printing of Committee documents, and executing other administrative duties as needed.",
    "responsibilities": [
      "Assisting with the preparation and conduct of markups",
      "Assisting with hearing preparation",
      "Maintaining and archiving Committee records",
      "Assisting with the printing of Committee documents",
      "Executing other administrative duties as needed"
    ],
    "qualifications": [
      "Strong organizational and communication skills",
      "The ability to work under tight deadlines",
      "Able to multi-task effectively",
      "Hill experience is required",
      "Previous clerking experience is strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-19",
    "position_title": "Press Secretary",
    "office": "Committee on Oversight and Government Reform",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-28",
    "description": "Rep. Elijah E. Cummings is seeking a detail-oriented communications\nprofessional to join the staff of the Committee on Oversight and Government\nReform as Press Secretary. The ideal candidate should be a strong writer, a\nproactive team player, have experience with rapid responses, and be able to\nmulti-task in a fast-paced environment. This position reports directly to the\nCommunications Director.",
    "responsibilities": [
      "Develop day-to-day press materials, including press releases, talking points,\nstatements, and media advisories.",
      "Field and respond to media inquiries.",
      "Seek to correct inaccurate reporting.",
      "Strategize with the Communications Director on interview requests.",
      "Staff the congressman at interviews and press events.",
      "Physically manage the press at Committee hearings.",
      "Work closely with member relations Committee staff to achieve goals for\nCommittee Members.",
      "Liaison with committee member and other congressional offices.",
      "Organize press conferences.",
      "Assist with overall communications strategy.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "A Bachelor’s degree in Journalism, English, Public Relations, or a closely\nrelated field preferred.",
      "A minimum of four years of media relations and/or social media\ncoordination experience.",
      "Experience with rapid responses.",
      "A strong ability to perform multiple tasks accurately and efficiently in a fastpaced environment.",
      "Previous campaign experience a plus.",
      "Previous Hill experience a plus."
    ],
    "how_to_apply": "Submit a cover letter and resume to oversightpress@mail.house.gov with\n“Press Secretary Application” in the subject line. Applications will be\naccepted until January 18. Please no drop-by applications, phone calls, or\nseparate emails.",
    "salary_info": null,
    "contact": "oversightpress@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-006-19",
    "position_title": "Senior Health LA",
    "office": "U.S. Rep. Lloyd Doggett (D)",
    "location": "Washington office",
    "posting_date": "2019-01-28",
    "description": "Not an entry level job. Law degree a plus.",
    "responsibilities": [],
    "qualifications": [
      "Not an entry level job.",
      "Law degree a plus."
    ],
    "how_to_apply": "Email cover letter, resume, and three references to: DoggettJobs@mail.house.gov. (No calls or drop-ins please) Reply with subject line, Senior Health LA.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-005-19",
    "position_title": "Scheduler",
    "office": "Senior California Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-01-28",
    "description": "Senior California Democrat seeks a motivated, energetic, and detail-oriented Scheduler for the Washington, DC office. Responsibilities include coordinating and maintaining the Member’s schedule, drafting personal correspondence, and occasionally driving the member. Qualified applicants must be personable, dependable, and able to juggle multiple tasks with competing priorities. California ties preferred. Sense of humor required.",
    "responsibilities": [
      "coordinating and maintaining the Member’s schedule",
      "drafting personal correspondence",
      "occasionally driving the member"
    ],
    "qualifications": [
      "personable",
      "dependable",
      "able to juggle multiple tasks with competing priorities",
      "California ties preferred",
      "Sense of humor required"
    ],
    "how_to_apply": "To apply, please submit resume, cover letter, and a short writing sample to CADemOfficeJob@gmail.com",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-510-18",
    "position_title": "Digital Specialist and Press Aide",
    "office": "Rep. Ro Khanna",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "Rep. Ro Khanna, a very active leader of the Progressive Caucus, seeks a\nDigital Specialist and Press Aide to create original content in videos, social\nmedia and other messaging vehicles to expand the reach of the Member's\nvision and priorities. This individual will work collaboratively with the\nCommunications Director in managing the Member's social media channels\n(Facebook, Twitter and Instagram) and using the platforms to frequently share\ncontent and elevate the Member's online presence.\n\nThe Digital Specialist and Press Aide will work the Communications Director\nto design and implement a robust communications/digital/social media plan.\nThis individual will be proficient in video/audio production, graphic design\nand editing. Audio and video clips of various topics and events attended by\nthe Member will be used to develop creative content for use within videos and\nonline communications distributed by the office.\n\nSuccessful candidates will possess at least two years of relevant video\nexperience in a legislative office, political organization or progressive\nadvocacy group; proficiency in video filming, editing and graphic design\nsoftware; knowledge of live-streaming platforms, digital trends and\ndevelopments in media; and strong organizational, time-management,\nproblem-solving and story-telling skills. After hours and weekend\nresponsiveness will be required.",
    "responsibilities": [],
    "qualifications": [
      "At least two years of relevant video experience in a legislative office, political organization or progressive advocacy group",
      "Proficiency in video filming, editing and graphic design software",
      "Knowledge of live-streaming platforms, digital trends and developments in media",
      "Strong organizational, time-management, problem-solving and story-telling skills",
      "After hours and weekend responsiveness will be required"
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter,\ntwo writing samples, three graphic design samples and links to three samples\nof video work. Please apply to RepRoKhannaCA17@gmail.com, applications\nwill be accepted on a rolling basis.",
    "salary_info": null,
    "contact": "RepRoKhannaCA17@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-456-18",
    "position_title": "Deputy Clerk",
    "office": "Committee on Education and the Workforce, Democratic Staff",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "The Committee on Education and the Workforce, Democratic Staff is\r\ncurrently seeking a Deputy Clerk to assist the Chief Clerk in the 116th\r\nCongress. Duties include, but are not limited to archiving and records\r\nkeeping, notices and circulations, official filings, editing letters and reports,\r\nhearing, markup and conference logistics and proceeding, bill drops and floor\r\nlogistics, redlines, updates to the website, managing intern and fellowship\r\nprogram, maintaining the documents room, updating and maintaining the\r\nCommittee Calendar and all other duties as assigned. Candidates should\r\npossess exceptional organizational skills, be comfortable with public\r\nspeaking, and have excellent writing and research skills. The Deputy clerk\r\nwill be required to assume all clerking duties in the absence of the Chief\r\nClerk. Previous congressional experience is highly encouraged.",
    "responsibilities": [
      "Archiving and records keeping",
      "Notices and circulations",
      "Official filings",
      "Editing letters and reports",
      "Hearing, markup and conference logistics and proceeding",
      "Bill drops and floor logistics",
      "Redlines",
      "Updates to the website",
      "Managing intern and fellowship program",
      "Maintaining the documents room",
      "Updating and maintaining the Committee Calendar",
      "All other duties as assigned"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Comfortable with public speaking",
      "Excellent writing and research skills",
      "Previous congressional experience highly encouraged"
    ],
    "how_to_apply": "Interested applicants should email their cover letter, resume and writing sample to jobs_ewdems@mail.house.gov. To ensure proper identification, please put “DEPUTY CLERK APPLICATION” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "jobs_ewdems@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-411-18",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2019-01-28",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives. Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff.\n\nThe ideal candidate will be an attorney with several years of investigative or litigation experience.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line. No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  }
]