[
  {
    "id": "MEM-255-20",
    "position_title": "Staff Assistant",
    "office": "Republican Congressman from Ohio",
    "location": "Washington, DC",
    "posting_date": "2020-10-19",
    "description": "Republican Congressman from Ohio seeks a staff assistant for\nthe Washington, DC office.\nCandidates should have good communication skills and perform well in a\nfast-paced work environment.",
    "responsibilities": [
      "Answering phones",
      "Managing the front office",
      "Organizing and writing constituent correspondence",
      "Managing the internship program",
      "Scheduling tours",
      "Processing flag requests",
      "Additional tasks to assist the Congressman’s staff"
    ],
    "qualifications": [
      "Good communication skills",
      "Ability to perform well in a fast-paced work environment",
      "Previous Hill experience (a plus)",
      "Ohio ties (a plus)"
    ],
    "how_to_apply": "Interested candidates should submit writing samples and resume to: midwestern.job@mail.house.gov",
    "salary_info": null,
    "contact": "midwestern.job@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-253-20",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2020-10-19",
    "description": "Duties include assisting the technology needs of Committee staff; editing and\nmaintaining the Committee’s website; answering telephones; assisting with\nthe tracking and processing of committee correspondence; providing\nadministrative support in setting up committee meetings; and entering data\nand navigating databases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members\nof Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee’s website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance are strongly encouraged to apply"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line\nto ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$38,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-251-20",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2020-10-19",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Office of Advice and Education.\n\nThe Committee’s Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.\n\nCandidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product."
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:",
      "Government ethics",
      "Ethics counseling and training",
      "Employment law, including the laws governing sexual harassment in the workplace",
      "Criminal law"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov.\nPlease include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-249-20",
    "position_title": "Constituent Services Coordinator",
    "office": "Rep. Katie Porter",
    "location": "District Office",
    "posting_date": "2020-10-19",
    "description": "Rep. Katie Porter seeks a highly motivated, resourceful, and organized individual with strong interpersonal skills to serve as the Constituent Services Coordinator in the District Office. The ideal candidate will be able to manage multiple tasks, meet deadlines, and work well in a fast-paced environment.\n\nThe Constituent Services Coordinator will work directly with constituents and federal agencies, create and implement strategic casework and outreach goals, and assist with other District Office functions as assigned.",
    "responsibilities": [
      "Serve as the Congresswoman’s in-district liaison for a limited portfolio of issue areas, while working under the leadership of the Director of Constituent Services and Outreach",
      "Act as the representative for the Congresswoman, which includes answering casework correspondence, meeting with constituents, and communicating with constituents both verbally and in writing",
      "Follow casework procedures and meet casework expectations as set by the Director of Constituent Services and Outreach",
      "Coordinate and handle a diverse portfolio of federal agency cases through intake, agency correspondence, constituent correspondence, and resolution",
      "Screen active cases and liaise with constituents to ensure their cases are handled in a responsive manner",
      "Organize and monitor casework data to assist the Director of Constituent Services and Outreach with reporting on casework trends and issues",
      "Assist the Director of Constituent Services and Outreach with establishing and promoting casework policies and procedures",
      "Provide constituents with referrals and references, and ensure that other offices respond to referred constituents in a timely manner",
      "Correspond with constituents seeking to register opinions or understand policy",
      "Maintain up-to-date files on all cases and office resources",
      "Plan and execute outreach events to serve constituents, create more casework, and interact with the community",
      "Work with legislative team to increase knowledge on issue area assignments and to communicate in- district developments and notable meeting developments",
      "Work with the Director of Constituent Services and Outreach to compile and publicize success stories and constituent testimonials",
      "Perform administrative and organizational tasks related to casework or outreach as assigned by the Director of Constituent Services and Outreach"
    ],
    "qualifications": [],
    "how_to_apply": "To apply please email resumesCA45@mail.house.gov with the title of position as the email subject line.",
    "salary_info": null,
    "contact": "resumesCA45@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees."
  },
  {
    "id": "MEM-247-20",
    "position_title": "Legislative Assistant",
    "office": "Senior progressive appropriator",
    "location": "Hill",
    "posting_date": "2020-10-19",
    "description": "Senior progressive appropriator seeks a legislative assistant to cover a broad portfolio of issues including criminal justice reform, civil and voting rights, transportation, housing, small/minority businesses, and technology.\n\nIdeal candidates will be outstanding writers, thrive in a fast-paced environment, and enjoy working with a variety of stakeholders to advance a robust policy agenda.\n\nPrevious Hill experience is required.",
    "responsibilities": [
      "Handling appropriations requests and staffing full committee markups",
      "Developing and advancing a proactive legislative agenda on racial equity and housing policy",
      "Drafting, analyzing legislation",
      "Writing policy memos and talking points",
      "Working with outside stakeholders",
      "Meeting with constituents"
    ],
    "qualifications": [
      "Outstanding writers",
      "Thrive in a fast-paced environment",
      "Enjoy working with a variety of stakeholders to advance a robust policy agenda",
      "Previous Hill experience is required"
    ],
    "how_to_apply": "To apply, send a cover letter, resume and short writing sample to lee.resumes@mail.house.gov with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees."
  },
  {
    "id": "MEM-246-20",
    "position_title": "Counsel",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2020-10-19",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks\ncounsel to assist with oversight and investigations on the Education team.\nApplicants who are not attorneys but who have at least three years of\nexperience conducting investigations are also encouraged to apply.\nExperience in education policy is not a requirement.",
    "responsibilities": [
      "Assist with oversight",
      "Assist with investigations on the Education team"
    ],
    "qualifications": [
      "Applicants who are not attorneys but who have at least three years of experience conducting investigations are also encouraged to apply.",
      "Experience in education policy is not a requirement."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, a pre-prepared writing sample (510 pages), and a writing sample describing an investigation the applicant would like to pursue.\nThis second writing sample must include a hyperlink to a current news item from any source (newspapers, blogs, or other websites) and two paragraphs\ndetailing why the Committee should investigate the issue presented and the\nsteps the applicant would take to begin an investigation.",
    "salary_info": null,
    "contact": "Please email resume and both writing samples\nto E&L.Jobs@mail.house.gov with “Education Oversight” in the subject line.",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates of\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-245-20",
    "position_title": "Deputy Communications Director",
    "office": "House Financial Services Committee Majority",
    "location": "Capitol Hill",
    "posting_date": "2020-10-19",
    "description": "The House Financial Services Committee Majority staff seeks a creative and detail-oriented Deputy Communications Director with strong strategic communications, media relations and writing skills to be a core part of a fiveperson communications team carrying out the Committee's communications strategy on behalf of the Chairwoman.\n\nThis is not an entry-level position.\n\nIdeal candidates will have prior Capitol Hill or advocacy experience and knowledge of the legislative process; strong oral, writing and proofreading skills; and a positive approach to a busy and fast-paced work environment. Evening and weekend work is expected.\n\nThe Committee is an equal opportunity employer. Women and minority candidates are encouraged to apply.",
    "responsibilities": [
      "working with the Communications Director to develop strategic messaging for the Committee",
      "developing press releases, talking points and written materials",
      "developing content for the Committee's website and digital platforms",
      "developing and maintaining relationships with national, local, political and minority-focused media",
      "proactively pitching members of the press on Committee initiatives"
    ],
    "qualifications": [
      "prior Capitol Hill or advocacy experience and knowledge of the legislative process",
      "strong oral, writing and proofreading skills",
      "positive approach to a busy and fast-paced work environment"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and two writing samples to fscdemresumes@mail.house.gov",
    "salary_info": null,
    "contact": "fscdemresumes@mail.house.gov",
    "equal_opportunity": "The Committee is an equal opportunity employer. Women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-241-20",
    "position_title": "Staff Assistant",
    "office": "CA-based Democratic Representative",
    "location": "Washington, D.C.",
    "posting_date": "2020-10-19",
    "description": "CA-based Democratic Representative is seeking a motivated and organized\nStaff Assistant with excellent oral and written communication skills for the\nWashington, D.C. office.",
    "responsibilities": [
      "Managing front desk operations",
      "Answering telephones",
      "Greeting visitors",
      "Coordinating tours for visiting guests",
      "Processing flag requests",
      "Addressing constituent matters",
      "Assisting the Member and legislative staff as needed",
      "Managing the intern program",
      "Special projects, as assigned"
    ],
    "qualifications": [
      "Hill experience and California state ties are a plus",
      "Prior work experience with Microsoft Office Suite and IConstituent."
    ],
    "how_to_apply": "To apply, please send your cover letter, resume, and two 1-2 page writing samples to sajob2408@gmail.com and put “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "sajob2408@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-240-20",
    "position_title": "Staff Assistant /District Field Representative",
    "office": "Congressman Frank Pallone, Jr.",
    "location": "New Jersey",
    "posting_date": "2020-10-19",
    "description": "This position primarily entails constituent casework and community outreach. Other responsibilities include meeting with local community officials, representing the Congressman at community and governmental events, special projects, as well as general office work.",
    "responsibilities": [
      "Constituent casework",
      "Community outreach",
      "Meeting with local community officials",
      "Representing the Congressman at community and governmental events",
      "Special projects",
      "General office work"
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Must enjoy working with the public",
      "Prior experience in government, the non-profit sector, community and grassroots organizing is preferred"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, writing sample, and references by email to NJ06.Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "NJ06.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-206-20",
    "position_title": "Research and Data Analyst",
    "office": "House Office of Diversity and Inclusion",
    "location": null,
    "posting_date": "2020-10-19",
    "description": "In this capacity the Analyst will be responsible for leading data and research collection and analysis for the Office of Diversity and Inclusion. This individual will lead the development of the required diversity report, maintain key metrics and key performance indicators for the Office, and serve as a resource for external and internal diversity best practices.\n\nThis individual will also serve as the project manager for any consultants and/or contractors with whom the Office may engage to support the completion of the diversity report and to develop relevant diversity and inclusion-based training, in collaboration with the Congressional Staff Academy.",
    "responsibilities": [
      "This staffer will assist in the translation of research findings into materials that staff can effectively utilize in their engagements with Members and Member offices.",
      "Provide research support on diversity and inclusion studies, techniques and tools.",
      "Serve as project manager for the diversity report and, where necessary, direct and coordinate activities of external consultants.",
      "Research and study best practices for retention and growth in House employing offices.",
      "Lead data tracking and reporting with a focus on performance and results.",
      "Prepare regular updates and briefing documents on research that is relevant to House employing offices.",
      "Assist with the development and delivery of training sessions and, as needed, conduct presentations at professional conferences and meetings."
    ],
    "qualifications": [
      "Master’s degree in social or behavioral sciences or related field; or equivalent level of experience providing technical assistance, data collections and/or research.",
      "Must have knowledge and experience in diversity, equity, and inclusion research efforts, ideally with a strong background in curriculum development.",
      "Current working knowledge of coalition functioning, evaluation and research.",
      "Quantitative and qualitative evaluation and research skills.",
      "Expertise using relevant software.",
      "Customer-service orientation and ability to work harmoniously with a diverse team.",
      "Ability to work under deadline pressure and extra hours if needed on assignment.",
      "Demonstrated ability to self-motivate, initiate project activities, and work on multiple assignments simultaneously.",
      "Extensive computer skills, including data input."
    ],
    "how_to_apply": "Interested candidates should apply by following the instructions here:\nhttps://house.csod.com/ux/ats/careersite/1/home/requisition/86?c=house\nCandidates will be asked to upload a cover letter, resume, and two writing samples.",
    "salary_info": "Salary commensurate with experience.",
    "contact": null,
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please."
  }
]