[
  {
    "id": "MEM-269-16",
    "position_title": "Staff Assistant/Caseworker",
    "office": "Congressman Joaquin Castro",
    "location": "San Antonio District Office",
    "posting_date": "2016-08-29",
    "description": "This entry-level position will provide coverage for the front desk and include responsibilities such as: Answer and screen telephone calls and visitors; Respond to constituent requests for flags, tours and other information; Maintain office supplies and equipment; Handle casework assignments, serving as a liaison with constituents, federal, district, and local agencies; Act as the representative for the Congressman within his or her area of responsibility; Staff Congressman at community events and meetings, as needed; Assist to train interns to handle office matters; Perform other duties as assigned.",
    "responsibilities": [
      "Answer and screen telephone calls and visitors",
      "Respond to constituent requests for flags, tours and other information",
      "Maintain office supplies and equipment",
      "Handle casework assignments, serving as a liaison with constituents, federal, district, and local agencies",
      "Act as the representative for the Congressman within his or her area of responsibility",
      "Staff Congressman at community events and meetings, as needed",
      "Assist to train interns to handle office matters",
      "Perform other duties as assigned"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Maintain a good working relationship with the Congressman, staff, and constituents",
      "Accept performance-based criticism and direction",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Work a flexible schedule including long hours, nights, and weekends",
      "Strong verbal and written communication skills, with Spanish skills preferred",
      "Thoroughness and careful attention to detail",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities",
      "Ability to use in-house data system, Intranet Quorum (IQ)",
      "Ability to use and troubleshoot photocopier, facsimile machine, telephone, and other office equipment",
      "Thorough knowledge of local, state and federal agencies and departments",
      "4-year degree preferred."
    ],
    "how_to_apply": "Please submit a cover letter with your resume and email to District Director, Toni Serna, at toni.serna@mail.house.gov.",
    "salary_info": null,
    "contact": "Toni Serna, toni.serna@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-268-16",
    "position_title": "Communications Director",
    "office": "Senior Democratic House member from CA",
    "location": null,
    "posting_date": "2016-08-29",
    "description": "Seeks proactive, experienced communications director to develop and implement strategic media plan in a fast-paced and results-driven environment.",
    "responsibilities": [],
    "qualifications": [
      "Must have proven track-record",
      "Ability to manage website and social media tools",
      "Outstanding writing skills and strong pitching skills are required",
      "Southern California ties are preferred but not necessary",
      "This is not an entry level position"
    ],
    "how_to_apply": "Qualified candidates should submit resume, cover letter to commstafferCA2016@gmail.com.",
    "salary_info": null,
    "contact": "commstafferCA2016@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-267-16",
    "position_title": "Press Secretary",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington",
    "posting_date": "2016-08-29",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a press secretary for his Washington office. Spanish skills and Hill experience a plus.",
    "responsibilities": [],
    "qualifications": [
      "Spanish skills a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-256-16",
    "position_title": "District Scheduler/Office Manager",
    "office": "North Bay legislative office",
    "location": "California",
    "posting_date": "2016-08-29",
    "description": "Responsibilities include coordinating the legislator’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans; working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters.\n\nAlso responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties. Opportunities for additional responsibilities commensurate with skills and abilities.",
    "responsibilities": [
      "Coordinating the legislator’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans",
      "Working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters",
      "Assisting the Capitol office and District Director on maintaining financial and expense records",
      "Various administrative duties"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Have experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov with the subject line “CA02 District Scheduler/Office Manager.”",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-253-16",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space, and Technology, Environment Subcommittee",
    "location": null,
    "posting_date": "2016-08-29",
    "description": "Duties include staffing hearings; preparing memos, statements, and speeches; outreach to stakeholder groups; and drafting legislation and conducting oversight. Applicant should have familiarity and experience with environmental policy issues. Knowledge of the programs and activities of the National Oceanic and Atmospheric Administration is desirable. Applicant should possess strong writing, organizational, and communications skills, including the ability to articulate technical and policy issues clearly and concisely; the ability to be responsive to and work with Members of the Committee; and the ability to meet tight deadlines. The ideal candidate will have congressional and/or relevant government or industry experience. No calls or drop-ins please. This is not an entry-level position.",
    "responsibilities": [
      "Staffing hearings",
      "Preparing memos, statements, and speeches",
      "Outreach to stakeholder groups",
      "Drafting legislation",
      "Conducting oversight"
    ],
    "qualifications": [
      "Familiarity and experience with environmental policy issues",
      "Knowledge of the programs and activities of the National Oceanic and Atmospheric Administration is desirable",
      "Strong writing, organizational, and communications skills, including the ability to articulate technical and policy issues clearly and concisely",
      "Ability to be responsive to and work with Members of the Committee",
      "Ability to meet tight deadlines",
      "Congressional and/or relevant government or industry experience (ideal)"
    ],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-240-16",
    "position_title": "Legislative Fellow",
    "office": "Congressman Keith Ellison (D-MN)",
    "location": "Washington, DC",
    "posting_date": "2016-08-29",
    "description": "Congressman Keith Ellison (D-MN) seeks a Legislative Fellow for a fastpaced and busy Washington, DC congressional office. The fellow will work\non financial services issues including banking and capital markets, energy and\nenvironment, small business, Native American, arts and humanities, and other\nissues.",
    "responsibilities": [],
    "qualifications": [
      "Ideal candidates must have strong writing and verbal briefing skills",
      "Analytical skills and a proactive approach to current issues",
      "The fellow should be punctual, responsible and trust-worthy",
      "Candidates should have sharp attention to detail, good time management skills, a positive attitude and commitment to inclusive prosperity and environmental sustainability"
    ],
    "how_to_apply": "Please send cover letter, resume and writing sample by August 12, to MN05fellow@mail.house.gov. Please no phone calls or dropins.",
    "salary_info": "This is an unpaid fellowship although we will work with programs which provide stipends for fellows. The position begins in August/September and runs through December.",
    "contact": "MN05fellow@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-238-16",
    "position_title": "Legislative Assistant",
    "office": "Texas Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2016-08-29",
    "description": "Active Texas Democrat seeking enthusiastic, well-organized Legislative Assistant in a fast-paced team-oriented office. Portfolio includes but is not limited to: energy, transportation, veterans affairs and armed services. Applicant must be able to multi-task, have strong work ethic and the ability to work flexible hours. Ideal candidate should have at least 2-3 years of Hill legislative experience. This is NOT an entry-level position. Individual interested in this position must have strong written and oral communication skills and the ability to work under pressure to meet deadlines. Willingness to also serve as driver to Member a major plus.",
    "responsibilities": [
      "Energy",
      "Transportation",
      "Veterans Affairs",
      "Armed Services"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Strong work ethic",
      "Ability to work flexible hours",
      "2-3 years of Hill legislative experience",
      "Strong written and oral communication skills",
      "Ability to work under pressure to meet deadlines",
      "Willingness to serve as driver to Member"
    ],
    "how_to_apply": "Please e-mail resume and cover letter to TXLegislativeAssistant@Mail.House.Gov. NO PHONE CALLS OR DROP-BYS PLEASE.",
    "salary_info": null,
    "contact": "TXLegislativeAssistant@Mail.House.Gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-234-16",
    "position_title": "Field Representative",
    "office": "Maryland Democrat District Office",
    "location": "District Office",
    "posting_date": "2016-08-29",
    "description": "A Maryland Democrat is seeking a high energy, highly-organized, and detail oriented Field Representative for his District Office.",
    "responsibilities": [
      "Serve as the official representative for the Member in the local community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Directors on district and local issues of importance.",
      "Staff and provide logistical support for scheduled district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Directors and Chief of Staff.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Train and supervise a staff of Interns to handle routine office matters, such as incoming correspondence, visitors, telephone calls, and other issues that may arise."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "A working knowledge of the VA and military issues is a plus, but not required.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis until the position is filled. To apply, please email a resume and cover letter to MD06.Jobs@mail.house.gov. No phone calls or walk-ins please",
    "salary_info": null,
    "contact": "MD06.Jobs@mail.house.gov",
    "equal_opportunity": null
  }
]