[
  {
    "id": "MEM-224-19",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-05-28",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is desirable: government ethics; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-223-19",
    "position_title": "Scheduler/Office Manager",
    "office": "Senior Georgia member",
    "location": "Washington, D.C.",
    "posting_date": "2019-05-28",
    "description": "Responsibilities include managing and maintaining the Member's daily and long-term calendar in D.C., working with a variety of stakeholders to balance the Member's time between commitments, ensure the Member is provided with briefing materials for each event and meeting, and performing other duties as required. Responsibilities also include office management. This includes making sure supplies are ordered, being point person for vouchers, invoices, payments, disclosures, travel and ethics documents. Capitol Hill and/or executive assistant experience preferred.\nGeorgia ties ae a plus.\nThe ideal candidate would be detail-oriented, able to juggle multiple tasks at once, have excellent interpersonal skills, be a problem solver, and have a sense of humor when the entire day's work goes up in smoke on a moment's notice! Position can involve long hours and availability by phone on weekends and evenings.",
    "responsibilities": [
      "Managing and maintaining the Member's daily and long-term calendar in D.C.",
      "Working with a variety of stakeholders to balance the Member's time between commitments",
      "Ensure the Member is provided with briefing materials for each event and meeting",
      "Performing other duties as required",
      "Office management",
      "Making sure supplies are ordered",
      "Being point person for vouchers, invoices, payments, disclosures, travel and ethics documents"
    ],
    "qualifications": [
      "Detail-oriented",
      "Able to juggle multiple tasks at once",
      "Excellent interpersonal skills",
      "Problem solver",
      "Sense of humor",
      "Capitol Hill and/or executive assistant experience preferred",
      "Georgia ties a plus"
    ],
    "how_to_apply": "Interested candidates should email a cover letter and resume to costochj@gmail.com. No drop-ins or phone calls please.",
    "salary_info": null,
    "contact": "costochj@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-221-19",
    "position_title": "Staff Assistant",
    "office": "Rep. Justin Amash (MI-03)",
    "location": "Washington, DC",
    "posting_date": "2019-05-28",
    "description": "The Office of Rep. Justin Amash (MI-03) is seeking a bright, creative, and hardworking Staff Assistant to join our Washington, DC-based team.\n\nThe staff assistant will be responsible for answering phones, processing mail, assisting with constituent requests for information, coordinating tours, drafting correspondence, and other administrative duties and projects as needed. The person also will handle some light press assistant duties, including compiling press clips, monitoring media, drafting e-newsletters and press releases, updating the website, and fielding some media inquiries.",
    "responsibilities": [
      "Answering phones",
      "Processing mail",
      "Assisting with constituent requests for information",
      "Coordinating tours",
      "Drafting correspondence",
      "Other administrative duties and projects as needed",
      "Compiling press clips",
      "Monitoring media",
      "Drafting e-newsletters and press releases",
      "Updating the website",
      "Fielding some media inquiries"
    ],
    "qualifications": [
      "Personable, organized, and committed to individual liberty, economic freedom, the Rule of Law, and the Constitution.",
      "Excellent communication and time-management skills",
      "The ability to exercise sound, independent judgment",
      "The ability to work cooperatively and courteously with others.",
      "Applicants must have a BA or equivalent.",
      "Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"staff assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-220-19",
    "position_title": "Senior Legislative Assistant",
    "office": "Texas Republican",
    "location": "Washington",
    "posting_date": "2019-05-28",
    "description": "Senior Texas Republican is seeking a Senior Legislative Assistant for their\nWashington office. Ideal candidates will have 2-3 years of legislative\nexperience, excellent writing and organizational skills, strong attention to\ndetail, and familiarity with the appropriations process. Among other things,\nresponsibilities will include briefing the representative, tracking\nlegislation/monitoring the floor, collaborating with the rest of the legislative\nstaff on policy ideas, staffing the representative at meetings and events, and\nmeeting with outside groups and constituents. Texas ties are preferred.",
    "responsibilities": [
      "Briefing the representative",
      "Tracking legislation/monitoring the floor",
      "Collaborating with the rest of the legislative staff on policy ideas",
      "Staffing the representative at meetings and events",
      "Meeting with outside groups and constituents"
    ],
    "qualifications": [
      "2-3 years of legislative experience",
      "Excellent writing and organizational skills",
      "Strong attention to detail",
      "Familiarity with the appropriations process",
      "Texas ties are preferred"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, writing sample, and references to TX.JobListing@mail.house.gov",
    "salary_info": null,
    "contact": "TX.JobListing@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-218-19",
    "position_title": "Communications Director",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C. and Seattle, WA",
    "posting_date": "2019-05-28",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced, creative and highly motivated Communications Director to lead media and outreach efforts in her Washington, D.C. and Seattle, WA offices.",
    "responsibilities": [
      "Serve as the primary spokesperson for the Congresswoman;",
      "Develop strong relationships with local and national reporters, editors, producers, bookers, and social media influencers;",
      "Proactively engage in media outreach, including pitching and fielding press inquiries;",
      "Manage the development of press releases, speeches and op-eds;",
      "Oversee a robust and aggressive online communications program;",
      "Supervise a Press Secretary and Digital Specialist;",
      "Prepare and staff the Congresswoman for district press events and media interviews; and",
      "Work collaboratively with the District Office to ensure a strong local/state media presence."
    ],
    "qualifications": [
      "Work collaboratively with the Congresswoman and her senior leadership team;",
      "Possess strong written and oral communications skills and the ability to work effectively in a fast-paced setting under tight deadlines;",
      "Understand the digital media landscape and current digital trends, with experience overseeing a digital/social media program;",
      "Think strategically and creatively;",
      "Have a strong record of advocating for progressive values;",
      "Be willing to work weekends and irregular hours.",
      "This is a very senior level position, and a minimum of two years of communications experience as a press secretary or communications director is required."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, three writing samples (including one speech) and three references.\nPlease send applications to jobs.pramila@mail.house.gov with “Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-217-19",
    "position_title": "Communications Director",
    "office": "Congresswoman Yvette D. Clarke",
    "location": "Washington, D.C.",
    "posting_date": "2019-05-28",
    "description": "Responsibilities include communications planning and press strategy for D.C. and the district; drafting press materials including: remarks, talking points, newsletters, statements, press releases, and media advisories; pitching media events; assisting with the management of the Congresswoman’s social media accounts; interview preparation; and overseeing the office’s franked mail and digital programs.\n\nThe ideal candidate is a strong writer, politically savvy, detail-oriented, flexible, creative, and a self-starter. Occasional travel to the district and nontraditional hours - including night and weekend work - should be expected. Strong ties to New York press preferred.",
    "responsibilities": [
      "Communications planning and press strategy for D.C. and the district",
      "Drafting press materials including: remarks, talking points, newsletters, statements, press releases, and media advisories",
      "Pitching media events",
      "Assisting with the management of the Congresswoman’s social media accounts",
      "Interview preparation",
      "Overseeing the office’s franked mail and digital programs"
    ],
    "qualifications": [
      "Strong writer",
      "Politically savvy",
      "Detail-oriented",
      "Flexible",
      "Creative",
      "Self-starter",
      "Strong ties to New York press preferred",
      "Occasional travel to the district and nontraditional hours - including night and weekend work - should be expected."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three writing samples to ResumeNY@mail.house.gov and include “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-216-19",
    "position_title": "Caseworker/Field Representative",
    "office": "Congresswoman Jackie Speier",
    "location": "San Mateo district office",
    "posting_date": "2019-05-28",
    "description": "Congresswoman Jackie Speier seeks a proactive, strategic, and communityoriented individual with casework and outreach experience for the position of\nCaseworker/Field Representative in her San Mateo district office.",
    "responsibilities": [
      "Handle constituent requests and casework on behalf of constituents with applicable federal agencies.",
      "Work closely with other caseworkers and legislative staff on constituent services and outreach efforts.",
      "Establish and maintain relationships with local organizations, community leaders, and elected officials in the district.",
      "Keep track of key issues in the communities and develop outreach efforts and course of action to Member relative to issue work.",
      "Assist with events and other activities.",
      "Staff the Member at meetings and events or attend on behalf of the Congresswoman.",
      "Conduct research, draft memos and letters for constituent outreach and Member support.",
      "Availability to work night and/or weekends as necessary to attend events and community meetings.",
      "Provide administrative assistance as needed, including answering phones, writing correspondence, and greeting constituents."
    ],
    "qualifications": [
      "B.A. or equivalent degree.",
      "Experience working in a fast-paced environment.",
      "Excellent verbal and written communication skills.",
      "Must have car and valid driver’s license; you will receive mileage reimbursement for travel to and from work-related events and meetings.",
      "Familiarity with 14th Congressional District.",
      "Experience working for an elected official in a fast-paced environment.",
      "Ability to multi-task various projects that require attention to detail and work well with others under pressure.",
      "Proficient in a second language, preferably Chinese or Spanish."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume and writing sample (2-3 pages) to: CA14Jobs@mail.house.gov",
    "salary_info": "Pay is commensurate with experience.",
    "contact": "CA14Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-215-19",
    "position_title": "Communications Director",
    "office": "Senior Republican Member on Appropriations",
    "location": null,
    "posting_date": "2019-05-28",
    "description": "Candidates should have Hill experience, strong writing skills and experience working with the media.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience",
      "Strong writing skills",
      "Experience working with the media"
    ],
    "how_to_apply": "Interested applicants should send their cover letter, resume and writing samples to TX.JobListing@mail.house.gov.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "TX.JobListing@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-213-19",
    "position_title": "Communications Director",
    "office": "Ways and Means Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-05-28",
    "description": "Active Ways and Means Democrat seeks an experienced Communications\nDirector to lead national and local media and outreach efforts. This position\nwill be based in the Washington, DC office. Responsibilities include writing a\nbroad array of speeches, drafting press releases and op-eds, and maintaining\nrelationships with local and national press. The Communications Director is\nalso responsible for producing a weekly newsletter and managing all digital\naccounts.\nThis is not an entry level position and qualified candidates must have at least\ntwo years of relevant experience. Applicants must demonstrate an ability to\nwork well with a team in a small, fast-paced environment while maintaining a\nsense of humor.",
    "responsibilities": [
      "Writing a broad array of speeches",
      "Drafting press releases and op-eds",
      "Maintaining relationships with local and national press",
      "Producing a weekly newsletter",
      "Managing all digital accounts"
    ],
    "qualifications": [
      "At least two years of relevant experience",
      "Ability to work well with a team in a small, fast-paced environment",
      "Sense of humor"
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and three\nwriting samples to CADemOfficeJob@gmail.com. No calls or drop-ins,\nplease.",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-212-19",
    "position_title": "Investigative Counsel",
    "office": "Committee on Oversight and Reform",
    "location": "U.S. House of Representatives",
    "posting_date": "2019-05-28",
    "description": "The ideal candidate will be an attorney with several years of litigation experience, a demonstrated commitment to civil rights and social justice, and a background in anti- discrimination employment, whistleblower protection, and retaliation laws.\nCandidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Whistleblower interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Investigative Counsel” in the subject line. No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-211-19",
    "position_title": "District Director",
    "office": "Southern California Democrat",
    "location": "District Offices",
    "posting_date": "2019-05-28",
    "description": "Southern California Democrat seeks District Director to oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans, as well as direct all activities and staff of the district offices. This position is responsible for recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures; represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.\n\nResponsibilities include strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management. This individual also serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district; and, acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region.",
    "responsibilities": [
      "Oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans.",
      "Direct all activities and staff of the district offices.",
      "Recruit, hire, train, and manage district staff and ensures that district staff complies with office policies, practices, and procedures.",
      "Represent the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.",
      "Strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management.",
      "Serve as the primary liaison between the Congresswoman and constituents and special interest groups in the district.",
      "Act as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region."
    ],
    "qualifications": [
      "Minimum of 3-5 years of management experience",
      "Strong ability to provide necessary organization, leadership and motivation to manage a Congressional office",
      "Excellent oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "Energetic",
      "Detail-oriented",
      "Able to multi-task",
      "Politically astute",
      "Willing to work long hours (including evenings and weekends) in a fast-paced and demanding setting",
      "Spanish fluency and Southern California ties are a plus"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing samples to CA26Resumes@gmail.com with just “District Director” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-210-19",
    "position_title": "Scheduler/Executive Assistant",
    "office": "New York Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2019-05-28",
    "description": "Responsibilities include managing and maintaining the Member’s daily and long term calendar in D.C., working with other team members to balance the Member’s time between commitments, ensure the Member is provided with briefing materials for each event/meeting, and performing other duties as necessary. Responsibilities also include reviewing meeting requests, arranging travel to/from Washington, DC, general administrative tasks and assisting on some legislative issues.\nCapitol Hill and/or executive assistant experience for an elected official preferred. New York ties are a plus.\nThe ideal candidate would be a proactive self-starter, detail-oriented, able to juggle multiple tasks at once, have excellent oral, written and interpersonal skills, be a problem solver, and most importantly have a sense of humor. Position can involve work at night and on weekends.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long term calendar in D.C.",
      "Working with other team members to balance the Member’s time between commitments",
      "Ensuring the Member is provided with briefing materials for each event/meeting",
      "Performing other duties as necessary",
      "Reviewing meeting requests",
      "Arranging travel to/from Washington, DC",
      "General administrative tasks",
      "Assisting on some legislative issues"
    ],
    "qualifications": [
      "Capitol Hill and/or executive assistant experience for an elected official preferred.",
      "New York ties are a plus.",
      "Proactive self-starter",
      "Detail-oriented",
      "Able to juggle multiple tasks at once",
      "Excellent oral, written and interpersonal skills",
      "Problem solver",
      "Sense of humor"
    ],
    "how_to_apply": "Interested candidates should email a cover letter and resume to ny03.resumes@gmail.com and list “Scheduler” in the subject.",
    "salary_info": null,
    "contact": "ny03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-209-19",
    "position_title": "Legislative Director",
    "office": "Congressman G. K. Butterfield (D-NC)",
    "location": "Washington, DC",
    "posting_date": "2019-05-28",
    "description": "The Legislative Director is responsible for managing the legislative team, advancing the Member’s legislative agenda and monitoring legislative developments.\n\nAdditional responsibilities include staffing the Member to issue-related events, representing the Member on their behalf, and other committee-related duties. This position also assists with miscellaneous administrative and legislative tasks at the request of the Chief of Staff or the Congressman.",
    "responsibilities": [
      "Managing the legislative team",
      "Advancing the Member’s legislative agenda",
      "Monitoring legislative developments",
      "Staffing the Member to issue-related events",
      "Representing the Member on their behalf",
      "Other committee-related duties",
      "Assisting with miscellaneous administrative and legislative tasks at the request of the Chief of Staff or the Congressman"
    ],
    "qualifications": [
      "Excellent writer",
      "Strong leader",
      "Detail-oriented",
      "Politically savvy",
      "Demonstrated interest in legislative issues",
      "Ability to manage multiple and competing tasks",
      "Excellent organizational and proofreading skills",
      "North Carolina ties (preferred)",
      "Capitol Hill experience (preferred)",
      "Experience using Intranet Quorum (IQ) (preferred)",
      "Team player"
    ],
    "how_to_apply": "Applicants should submit their resume, cover letter and two work product samples here. (https://airtable.com/shrQ5JXSksDZcCk5Z)",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-208-19",
    "position_title": "Legislative Director",
    "office": "Republican Member of Congress",
    "location": "Washington, DC",
    "posting_date": "2019-05-28",
    "description": "Multi-term Republican Member of Congress seeks an experienced Legislative Director to manage a legislative team in developing, implementing, and advancing all aspects of a congressional legislative agenda.\n\nNew staffers and entry-level job seekers should not apply this is a seniorlevel position with a minimum of 3-5 years of Hill experience required for consideration. The Member is searching for a professional go-getter with demonstrable experience in developing and managing a legislative agenda and achieving results in the Congress.",
    "responsibilities": [],
    "qualifications": [
      "Previous leadership/management experience",
      "Knowledge of the House legislative rules and procedures",
      "Skillset to succinctly summarize complex issues and make vote recommendations",
      "Excellent organization and communication skills",
      "The ability to work under pressure and meet deadlines",
      "Flexibility with priorities"
    ],
    "how_to_apply": "For consideration, send a cover letter and resume to goplegdirectoropportunity@gmail.com",
    "salary_info": null,
    "contact": "goplegdirectoropportunity@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-207-19",
    "position_title": "District Director",
    "office": "Congressman Chuck Fleischmann",
    "location": "Chattanooga, TN",
    "posting_date": "2019-05-28",
    "description": "The District Director will oversee the management and operation of the district office, serve as a key liaison to local organizations and elected officials, develop and implement long-term strategic outreach plans, and manage and participate in the office's constituent services efforts.\n\nQualified candidates will demonstrate management experience, a deep understanding of how to create and maintain a culture of exceptional service, strong oral and written communications skills, and strategic planning abilities.\n\nThe position requires the ability to multi-task, work well under pressure, and the flexibility to work long hours, including nights and weekends. Ties to the 3rd Congressional District and Tennessee are preferred but not essential.",
    "responsibilities": [
      "Oversee the management and operation of the district office",
      "Serve as a key liaison to local organizations and elected officials",
      "Develop and implement long-term strategic outreach plans",
      "Manage and participate in the office's constituent services efforts"
    ],
    "qualifications": [
      "Management experience",
      "A deep understanding of how to create and maintain a culture of exceptional service",
      "Strong oral and written communications skills",
      "Strategic planning abilities",
      "Ability to multi-task",
      "Ability to work well under pressure",
      "Flexibility to work long hours, including nights and weekends",
      "Ties to the 3rd Congressional District and Tennessee are preferred but not essential"
    ],
    "how_to_apply": "To apply for the District Director position, please send cover letter and resume to tngopapplications@gmail.com with “District Director” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "tngopapplications@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-204-19",
    "position_title": "Communications Director",
    "office": "Southern California Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-05-28",
    "description": "Southern California Democrat seeks experienced Communications Director for Washington, DC office to plan and execute a proactive and aggressive earned media and digital media outreach strategy.",
    "responsibilities": [
      "Maintaining relationships with reporters",
      "Organizing and replying to inquiries",
      "Proactively pitching stories",
      "Drafting and editing press releases, social media, op-eds, talking points, newsletters, mailers, and speeches",
      "Overseeing digital outreach, including social media, videos, e-newsletters, and the website",
      "Managing and collaborating with the current digital press secretary"
    ],
    "qualifications": [
      "Minimum of 3-5 years of political communications experience",
      "A strong history of drafting all forms of communications materials",
      "A track record of successfully pitching both national and local media outlets",
      "The ideal candidate is creative, energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours in a fast-paced and demanding setting",
      "Spanish fluency and Southern California ties are a plus"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing samples to CA26Resumes@gmail.com with just “Communications Director” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-203-19",
    "position_title": "Communications Director",
    "office": "Democratic House member",
    "location": null,
    "posting_date": "2019-05-28",
    "description": "Seeks pro-active, experienced Communications Director to develop and implement strategic media plan in a fast-paced and results -driven environment.",
    "responsibilities": [],
    "qualifications": [
      "Must have proven track-record, and ability to manage website and social media tools.",
      "Outstanding writing skills and strong pitching skills are required.",
      "This is not an entry level position."
    ],
    "how_to_apply": "Qualified candidates should submit resume and cover letter to commstaffer@gmail.com",
    "salary_info": null,
    "contact": "commstaffer@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-199-19",
    "position_title": "Operations Manager/Executive Assistant",
    "office": "New York Democrat",
    "location": "Brooklyn, NY",
    "posting_date": "2019-05-28",
    "description": "Responsibilities include managing the Member's schedule, travel plans and related events in the district. Duties also include managing the internship program and other office operations including office equipment and supplies, required reporting, and assisting with personnel tracking, as well as fielding requests of the Member with staff and the public.\n\nThis is an entry to mid-level position in a fast-paced office that frequently requires non-traditional work hours. Ties to Brooklyn is a plus. This position is based in the local Brooklyn, NY office.\n\nThis is a permanent, full-time position.",
    "responsibilities": [
      "Managing the Member's schedule, travel plans and related events in the district.",
      "Managing the internship program.",
      "Managing other office operations including office equipment and supplies.",
      "Required reporting.",
      "Assisting with personnel tracking.",
      "Fielding requests of the Member with staff and the public."
    ],
    "qualifications": [
      "Prior professional office experience.",
      "Ties to Brooklyn is a plus."
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place OPERATIONS MANAGER/EXECUTIVE ASSISTANT in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-198-19",
    "position_title": "Director of Outreach and Community Engagement",
    "office": "New York Democrat",
    "location": "Brooklyn, NY",
    "posting_date": "2019-05-28",
    "description": "Responsibilities include building strategic relationships with community leaders and constituent groups, executing various outreach activities, and recruiting volunteers for events and outreach programs in the district. Duties also include coordinating initiatives designed to promote the office and services to the community, managing an outreach and organizing plan for the team, and any other assigned duties.\nCandidates should possess excellent organization, leadership, teamwork, and management skills, as well as verbal and written communication skills. The Director of Outreach and Community Engagement will report to the Chief of Staff and District Director. Ties to Brooklyn, a proven management record, and a minimum of three years of related experience are required.\nThis is a permanent, full-time position.",
    "responsibilities": [
      "Building strategic relationships with community leaders and constituent groups",
      "Executing various outreach activities",
      "Recruiting volunteers for events and outreach programs in the district",
      "Coordinating initiatives designed to promote the office and services to the community",
      "Managing an outreach and organizing plan for the team",
      "Any other assigned duties"
    ],
    "qualifications": [
      "Excellent organization, leadership, teamwork, and management skills",
      "Verbal and written communication skills",
      "Ties to Brooklyn",
      "Proven management record",
      "Minimum of three years of related experience"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place DIRECTOR OF OUTREACH AND COMMUNITY ENGAGEMENT in the subject line.\nNO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-196-19",
    "position_title": "Professional Staff Member, Subcommittee on Oversight and Investigations",
    "office": "House Committee on Veterans’ Affairs, Subcommittee on Oversight and Investigations (Democratic Staff)",
    "location": null,
    "posting_date": "2019-05-28",
    "description": "House Committee on Veterans’ Affairs, Subcommittee on Oversight and Investigations (Democratic Staff) seeks a Professional Staff Member to join a small team of oversight and investigative staff. This is not an entry level position.\n\nQualified candidates will have strong research, writing, and communications skills with a demonstrated ability to work on a team, generate ideas, and develop an investigation strategy. Candidates will have experience in congressional investigations/oversight, relevant legal experience, or investigative journalism.\n\nExceptional candidates will have strong knowledge, experience, and skills with any of the following (though not necessarily all):",
    "responsibilities": [],
    "qualifications": [
      "Department of Veterans Affairs policies, operations, and benefits programs",
      "Congressional oversight of federal programs",
      "Investigations of waste, fraud, and abuse",
      "Data analysis, especially ability to manipulate and examine financial data",
      "Working with whistleblowers",
      "Questioning and deposing witnesses",
      "Subpoena of agency documents."
    ],
    "how_to_apply": "Interested candidates should submit a resume and a writing sample of no more than three pages to hvactransition@gmail.com",
    "salary_info": "Salary will be commensurate with experience, and likely within the range of $90,000 - $110,000.",
    "contact": "hvactransition@gmail.com",
    "equal_opportunity": "Diverse candidates and veterans are highly encouraged to apply. This job description accurately reflects the job duties of the employee who has been determined to be of an exempt status in compliance with the Fair Labor Standards Act."
  },
  {
    "id": "MEM-195-19",
    "position_title": "DC Scheduler",
    "office": "Congresswoman Tulsi Gabbard",
    "location": "Washington D.C.",
    "posting_date": "2019-05-28",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a DC Scheduler with strong organizational and communication skills.\n\nThis is not an entry level position. The selected applicant will be expected to operate in a fast-paced office and require dedication, close attention to detail, and the ability to think outside the box. Non-traditional work hours, occasional travel are required. Veteran applications are welcome!",
    "responsibilities": [
      "Maintaining the Member’s schedule for the Washington D.C. office",
      "Organizing, evaluating and tracking invitations and scheduling requests",
      "Coordinating some travel arrangements",
      "Coordinating the Member’s personal correspondence",
      "Arranging and/or providing surface transportation for the Member in DC",
      "Communicating key information regarding the Member’s schedule to staff",
      "Other tasks as assigned by the Chief of Staff/Legislative Director"
    ],
    "qualifications": [
      "Possess a can-do attitude",
      "Be process and solution oriented",
      "Be an independent worker",
      "Be a self-starter",
      "Possess the capacity to produce high quality work on short deadlines",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment"
    ],
    "how_to_apply": "Please do not call or drop in to the office, qualified applicants may email a cover letter, resume and two writing samples with “Scheduler” in the email title to:",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  }
]