[
  {
    "id": "MEM-189-16",
    "position_title": null,
    "office": "Rules Committee Ranking Member Louise Slaughter (NY-25)",
    "location": "Capitol Hill",
    "posting_date": "2016-06-27",
    "description": "The press office of Rules Committee Ranking Member Louise Slaughter (NY-25) is looking for talented candidates with a passion for public policy messaging, strong writing and communications skills, and the ability to work collaboratively.",
    "responsibilities": [],
    "qualifications": [
      "Has Capitol Hill and campaign experience",
      "Writes beautiful speeches with historical references",
      "Is an expert social media manager with attention to detail",
      "Enjoys making info graphics during lunch breaks",
      "Does not offend easily during the editing process",
      "Likes staying up late and waking up early",
      "Loves Rochester, NY and the Rules Committee"
    ],
    "how_to_apply": "Applicants should submit a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-184-16",
    "position_title": "Legislative Assistant",
    "office": "House Foreign Affairs Committee",
    "location": "Capitol Hill",
    "posting_date": "2016-06-27",
    "description": "A Senior Member of the House Foreign Affairs Committee is seeking a skilled and experienced Legislative Assistant to handle foreign policy and related issues.",
    "responsibilities": [],
    "qualifications": [
      "Relevant Capitol Hill experience",
      "Excellent communications skills",
      "Background in foreign policy and/or an advanced degree"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to ForeignAffairsLA@gmail.com.",
    "salary_info": null,
    "contact": "ForeignAffairsLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-183-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "California Republican",
    "location": "Washington, DC",
    "posting_date": "2016-06-27",
    "description": "Duties include management of constituent correspondence program, flag requests, tour coordinating, and general administrative duties. Applicants must demonstrate excellent writing and research ability, be self-starters, energetic, and have strong organizational and time management skills.",
    "responsibilities": [
      "Management of constituent correspondence program",
      "Flag requests",
      "Tour coordinating",
      "General administrative duties"
    ],
    "qualifications": [
      "Excellent writing ability",
      "Research ability",
      "Self-starter",
      "Energetic",
      "Strong organizational skills",
      "Time management skills"
    ],
    "how_to_apply": "Please send resume, cover letter, and short writing sample to CARepublicanjobs@gmail.com.",
    "salary_info": null,
    "contact": "CARepublicanjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-182-16",
    "position_title": "Scheduler",
    "office": "Senior House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-27",
    "description": "Senior House Democrat seeks experienced individual to handle all facets of the member's Washington, D.C. schedule as well as staffing the reception area.\n\nScheduler responsibilities include managing heavy volume of meeting, speaking and traveling requests, provide transportation (which can include late evenings), manage personal correspondence, greeting visitors and answering phones.",
    "responsibilities": [
      "Managing heavy volume of meeting, speaking and traveling requests",
      "Provide transportation (which can include late evenings)",
      "Manage personal correspondence",
      "Greeting visitors",
      "Answering phones"
    ],
    "qualifications": [
      "Detail oriented",
      "Able to work in a fast-paced environment",
      "Excellent oral and written communication skills",
      "Spanish fluency a plus"
    ],
    "how_to_apply": "Please send cover letter and resume to:",
    "salary_info": "Salary commensurate with experience.",
    "contact": "one_vacancy@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-179-16",
    "position_title": "Communications Director",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2016-06-27",
    "description": "The office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and hard-working communications director to join our Washington, DC-based team.\n\nThe communications director will be responsible for coordinating with the legislative team and member to develop and implement all communications activities for the office, including acting as the member's spokesperson and drafting op-eds, speeches, press releases, and newsletters.\n\nThe successful applicant will be an excellent writer and editor, clear thinker, and persuasive advocate for individual liberty, economic freedom, and the Constitution. He or she must demonstrate a breadth of policy knowledge, familiarity with the legislative process, and the ability to exercise sound, independent judgment. Individuals who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Coordinating with the legislative team and member to develop and implement all communications activities for the office",
      "Acting as the member's spokesperson",
      "Drafting op-eds, speeches, press releases, and newsletters"
    ],
    "qualifications": [
      "Libertarian (classical liberal and constitutional conservative)",
      "BA or equivalent",
      "At least two years of professional experience",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to mi03.apply@gmail.com. Please include \"communications director applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-175-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Progressive Democrat",
    "location": null,
    "posting_date": "2016-06-27",
    "description": "Duties include greeting visitors, processing flag and tour requests, and management of an active constituent correspondence program with short turnaround times.",
    "responsibilities": [
      "Greeting visitors",
      "Processing flag and tour requests",
      "Management of an active constituent correspondence program with short turnaround times"
    ],
    "qualifications": [
      "Excellent writing and research skills",
      "Self-starters",
      "Energetic",
      "Strong organizational and time management skills"
    ],
    "how_to_apply": "Please send resume, cover letter, and short writing sample to ProgressiveHouseDemocrat@gmail.com.",
    "salary_info": null,
    "contact": "ProgressiveHouseDemocrat@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-168-16",
    "position_title": "Scheduler",
    "office": "California Democrat",
    "location": "DC and district",
    "posting_date": "2016-06-27",
    "description": "California Democrat is seeking an exceptionally organized and hard-working scheduler to develop and maintain Member’s DC and district schedule.\n\nThe ideal candidate will have excellent attention to detail while working in a fast-paced environment, exhibit good judgement, have a positive attitude, and work well in a team environment.",
    "responsibilities": [
      "planning domestic and international travel logistics",
      "assisting with the Member’s personal correspondence",
      "maintaining office records",
      "other projects as assigned by the Member and/or Chief of Staff"
    ],
    "qualifications": [
      "This is not an entry level position and previous scheduling experience is preferred."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter and resume to ca07jobs@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-167-16",
    "position_title": "Communications Director",
    "office": null,
    "location": null,
    "posting_date": "2016-06-27",
    "description": "Seeking a Communications Director to develop and implement aggressive communications strategy with local and national media. Ideal applicant is a quick and clean writer, detail-oriented, able to juggle numerous tasks successfully and best under tight deadlines. Responsibilities include writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters; coordinating interviews with reporters, setting up press events and press conferences, developing relationships with the media; implementing district outreach activities (as it relates to press); responding to media inquiries and coordinating the office’s online and social media operations. Requires strong written and oral communication skills, creativity, and the ability to work well with legislative and district office staff. An ideal candidate will possess a minimum of 3-5 years of communications experience, a demonstrated understanding of federal politics and policy and a desire to work in a fast-paced and fluid environment. Bilingual a plus. Valid driver’s license desired. Availability for Evening and Weekend assignments is required.",
    "responsibilities": [
      "Writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters",
      "Coordinating interviews with reporters",
      "Setting up press events and press conferences",
      "Developing relationships with the media",
      "Implementing district outreach activities (as it relates to press)",
      "Responding to media inquiries",
      "Coordinating the office’s online and social media operations"
    ],
    "qualifications": [
      "Strong written and oral communication skills",
      "Creativity",
      "Ability to work well with legislative and district office staff",
      "Minimum of 3-5 years of communications experience",
      "Demonstrated understanding of federal politics and policy",
      "Desire to work in a fast-paced and fluid environment",
      "Bilingual a plus",
      "Valid driver’s license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume and three writing samples to ResumeNY@mail.house.gov.\nPlease be sure to put COMMUNICATIONS DIRECTOR in the subject line.\nPLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-166-16",
    "position_title": "District Scheduler / Office Manager",
    "office": "Bay Area legislative office",
    "location": "California",
    "posting_date": "2016-06-27",
    "description": "Responsibilities include coordinating the legislator's California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans; working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters. Also responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties. Opportunities for additional responsibilities commensurate with skills and abilities.",
    "responsibilities": [
      "Coordinating the legislator's California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans",
      "Working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters",
      "Assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Have experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov.",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-164-16",
    "position_title": "Legislative Assistant",
    "office": "House Veterans' Affairs Committee",
    "location": "Washington",
    "posting_date": "2016-06-27",
    "description": "New England Democrat and member of the House Veterans' Affairs Committee seeks legislative assistant for Washington office. Applicants should possess excellent writing skills, energy, enthusiasm, attention to detail, the ability to work in a fast-paced team environment, and a good sense of humor. Legislative portfolio includes, but is not limited to, work on Veterans' Affairs Committee issues, healthcare, and defense. Previous experience in veterans or health care policy is required. Responsibilities include developing proactive legislative initiatives, tracking legislation, drafting correspondence and statements, and representing the Member in meetings. New England ties preferred and veterans strongly encouraged to apply.",
    "responsibilities": [
      "Developing proactive legislative initiatives",
      "Tracking legislation",
      "Drafting correspondence and statements",
      "Representing the Member in meetings"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Energy",
      "Enthusiasm",
      "Attention to detail",
      "Ability to work in a fast-paced team environment",
      "Good sense of humor",
      "Previous experience in veterans or health care policy is required",
      "New England ties preferred",
      "Veterans strongly encouraged to apply"
    ],
    "how_to_apply": "Applicants should send cover letter, resume, and two writing samples to hill.jobs@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-162-16",
    "position_title": "Veteran Affairs Caseworker/Field Representative",
    "office": "Congresswoman Dina Titus of Nevada",
    "location": "Las Vegas District Office",
    "posting_date": "2016-06-27",
    "description": "Successful candidates will have previous experience in social work, familiarity with federal agencies, excellent written and oral communication skills, be team-oriented, and comfortable working both independently and as part of a team. Strong knowledge or connection with Nevada's First Congressional District is a plus. Availability for evening and weekend assignments is required.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send their resume and cover letter to Mike.Naft@mail.house.gov. Please write “Caseworker” in the subject line of your email message.",
    "salary_info": null,
    "contact": "Mike.Naft@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-161-16",
    "position_title": "Executive Assistant/Scheduler",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2016-06-27",
    "description": "California Democrat is seeking a highly organized, hard-working executive assistant/scheduler to develop and maintain Member's official schedule both short and long term, and to organize domestic and international travel logistics. This position also works closely with the chief of staff on administrative duties.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communications skills and attention to detail",
      "Exhibit good judgement",
      "Efficiently problem solve",
      "Possess a positive attitude",
      "Work well in a team environment",
      "Have a good sense of humor",
      "Previous scheduling experience preferred"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume and writing sample",
    "salary_info": "Salary commensurate with experience.",
    "contact": "cademocrat.scheduler@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer."
  },
  {
    "id": "MEM-157-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Senior Democratic Member",
    "location": "Washington office",
    "posting_date": "2016-06-27",
    "description": "Senior Democratic Member seeks an energetic, detail-oriented individual with excellent oral and written communication skills for the position of Staff Assistant/Legislative Correspondent in his busy Washington office. Daily tasks include greeting visitors, processing flag and tour requests, training and supervising interns, and providing support to the congressman and legislative staff. Legislative Correspondent responsibilities include management of an active constituent correspondence program, which includes monitoring the flow of incoming and outgoing mail and responding to mail and email in both form and individual letters in a timely manner. Candidates should have excellent writing, editing and multi-tasking skills, possess patience and a good sense of humor, strong communication skills, sharp attention to detail, the ability to work well with others, and good time management skills. Experience with the Intranet Quorum database and Microsoft Office desired. Knowledge of or ties to Georgia are a plus but not required.",
    "responsibilities": [
      "Greeting visitors",
      "Processing flag and tour requests",
      "Training and supervising interns",
      "Providing support to the congressman and legislative staff",
      "Management of an active constituent correspondence program, which includes monitoring the flow of incoming and outgoing mail and responding to mail and email in both form and individual letters in a timely manner"
    ],
    "qualifications": [
      "Excellent writing, editing and multi-tasking skills",
      "Patience and a good sense of humor",
      "Strong communication skills",
      "Sharp attention to detail",
      "Ability to work well with others",
      "Good time management skills",
      "Experience with the Intranet Quorum database and Microsoft Office desired",
      "Knowledge of or ties to Georgia are a plus but not required"
    ],
    "how_to_apply": "Please send resume and cover letter to COStoCHJ@gmail.com. Please absolutely no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "COStoCHJ@gmail.com",
    "equal_opportunity": null
  }
]