[
  {
    "id": "MEM-425-24",
    "position_title": "Legislative Correspondent",
    "office": "Rep. Greg Landsman",
    "location": "DC",
    "posting_date": "2024-10-14",
    "description": "The office of Rep. Greg Landsman seeks a highly motivated, energetic, and organized individual to serve as a Legislative Correspondent, based in our DC office.\n\nThe LC reports to the Legislative Director and works in close collaboration with the Member, Chief of Staff, and communications and district teams. The LC will manage the Congressman’s constituent mail program and provide support to the full legislative team.",
    "responsibilities": [
      "Drafting tailored letters in response to constituent inquiries",
      "Maintain and update current response letter library",
      "Sorts/batches incoming constituent mail by issue area",
      "Ensures accurate batching and a timely response to all constituents",
      "Meeting with constituents, stakeholders, and advocacy groups as needed",
      "Communicating clearly and consistently with the Legislative Director, Chief of Staff, and Member"
    ],
    "qualifications": [
      "Strong verbal and written communications skills and ability to communicate both up and down within the team",
      "Excellent organizational skills and ability to prioritize assignments",
      "Ability to work in a fast-paced environment and quickly respond to requests from the Member and the team",
      "Commitment to a collaborative work environment",
      "Ability to quickly learn and adapt to the Congressman’s voice, style, and legislative priorities",
      "Comfort with receiving and delivering feedback",
      "Attention to detail, creativity, and most of all, hustle."
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis. To apply, please email jobs.landsman@mail.house.gov with “Legislative Correspondent” in the subject line and the following application materials attached as one combined PDF:\n\n* Cover letter\n* Resume\n* Brief writing sample\n* Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\n\nNo phone calls or drop bys, please.",
    "salary_info": "Salary range is $50,000 - $55,000, commensurate with experience. Title commensurate with experience.",
    "contact": "jobs.landsman@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. Ohio ties are a plus. The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-424-24",
    "position_title": "Legislative Aide",
    "office": "Rep. Greg Landsman",
    "location": "DC",
    "posting_date": "2024-10-14",
    "description": "The office of Rep. Greg Landsman seeks a highly motivated, energetic, and detail-oriented individual to serve as a Legislative Aide, based in our DC office.\n\nThe Legislative Aide reports to the Legislative Director and works in close collaboration with the Member, Chief of Staff, and communications and district teams. Exact issue area portfolio is flexible, and applicants with backgrounds in any issue area are encouraged to apply.",
    "responsibilities": [
      "Preparing and staffing the Member for meetings",
      "Working with committee staff, external stakeholders, Legislative Counsel, and the Congressional Research Service to draft legislation based on the Member’s priorities",
      "Creating vote recommendations on legislation coming to the Floor within a given issue area",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas",
      "Communicating clearly and consistently with the Member, Chief of Staff, and legislative, communications, and district teams on legislative updates",
      "Overseeing special projects, that may include drafting letters of support, and researching and advising local stakeholders on federal funding/grant opportunities"
    ],
    "qualifications": [
      "Strong verbal and written communications skills and ability to communicate both up and down within the team",
      "Ability to work in a fast-paced environment and quickly respond to requests from the Member and the team",
      "Commitment to a collaborative work environment",
      "Ability to quickly learn and adapt to the Congressman’s voice, style, and legislative priorities",
      "Comfort with receiving and delivering feedback",
      "Attention to detail, creativity, and most of all, hustle"
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis. To apply, please email jobs.landsman@mail.house.gov with “Legislative Aide” in the subject line and attach the following application materials as one combined PDF:\n• Cover letter\n• Resume\n• Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\nNo phone calls or drop bys, please.",
    "salary_info": "$65,000",
    "contact": "jobs.landsman@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. Ohio ties are a plus. The office is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-422-24",
    "position_title": "Legislative Correspondent",
    "office": "U.S. Rep. Max Miller (OH-07)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Legislative Correspondent will research legislative issues and draft correspondence to explain the Member’s position to constituents and other stakeholders on a variety of public policy matters. The Legislative Correspondent will also attend meetings with constituents and provide support for Committee hearings and markups.",
    "responsibilities": [
      "Research legislative issues and draft correspondence to explain the Member's position on public policy matters to constituents and other stakeholders",
      "Collaborate with the legislative staff to design and implement the Member's legislative strategy",
      "Consult with the Legislative Director and Legislative Assistants to ensure the Member's library of legislative letters are accurate, up to date, and reflective of the Member's policy positions",
      "Create and maintain a collection of prepared responses to address general legislative inquiries",
      "Draft and edit tailored responses to answer constituent inquiries",
      "Ensure that legislative responses are completed timely to maintain outstanding constituent relations",
      "Attend legislative meetings with constituents to assist with Committee hearings and markups",
      "Organize workload to prioritize tasks and ensure work is completed in an efficient and effective manner",
      "Track legislation through committees, House floor, Senate, and conference committee processes",
      "Coordinate with the legislative staff to act as a liaison with constituents, interest groups, committees, and agency staff.",
      "Complete special projects as assigned by senior staff"
    ],
    "qualifications": [
      "Adaptability: Adapts quickly to change or unexpected obstacles; easily considers new approaches.",
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Constituent / Stakeholder Service Driven: Anticipates and meets the needs of constituents. Delivers high-quality products and services.",
      "Interpersonal Skills: Develops and maintains effective relationships with others from diverse backgrounds and in different situations. Shows understanding, courtesy, tact, empathy, and politeness.",
      "Verbal Communication: Makes clear and convincing oral presentations that are appropriate to listeners and situations. Listens effectively, attends to nonverbal cues, and responds appropriately.",
      "Written Communication: Writes cogently and succinctly to convey information in the most efficient and effective manner possible for use by the Member, other staff, and stakeholders"
    ],
    "how_to_apply": "Interested applicants should e-mail a resume and cover letter to MaxMillerOhioResumes@gmail.com with the specific subject line: “[Applicant name] – Legislative Correspondent Application.” Resumes submitted by other means will not be considered. Applicants who advance during the recruitment process will be required to submit a writing sample, the topic of which will be provided by the office.",
    "salary_info": "Dependent upon skills and experience.",
    "contact": "MaxMillerOhioResumes@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin.",
    "preferences": [
      "Bachelor's degree",
      "Demonstrated interest in public service",
      "Tie to Ohio"
    ]
  },
  {
    "id": "MEM-419-24",
    "position_title": "Staff Assistant",
    "office": "U.S. Rep. Max Miller (OH-07)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Staff Assistant will be expected to manage the front office during office hours, respond to Capitol and White House tour requests, arrange and conduct tours, fulfill requests for flags, support the district office with administrative office needs, and assist the D.C. office staff with work as assigned. Additionally, the Staff Assistant will manage the D.C. office intern program, including providing direct supervision of interns.",
    "responsibilities": [
      "Greet constituents and office visitors to provide a welcoming environment and a positive first impression of the office",
      "Field incoming calls and capture constituent requests to ensure consideration by the Member office",
      "Maintain literature regarding the district and House offices to distribute to visitors",
      "Work closely with the Member's Scheduler to ensure smooth execution of calendared events",
      "Monitor and organize requests for assistance to ensure that they are directed to the appropriate staff member in a timely manner",
      "Sign for deliveries and forward all materials delivered to ensure timely and appropriate handling",
      "Assist with constituent flag requests, tours of the Capitol, and arranging visits to other national landmarks to assist with constituent relations",
      "Assist the office systems manager to process constituent mail",
      "Purchase supplies for the office from the House Office Supply store to maintain office equipment",
      "Complete special projects as assigned by senior staff",
      "Perform general administrative assignments as assigned to assist the office staff with work"
    ],
    "qualifications": [
      "Adaptability: Adapts quickly to change or unexpected obstacles; easily considers new approaches.",
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Constituent / Stakeholder Service Driven: Anticipates and meets the needs of constituents. Delivers high-quality products and services.",
      "Interpersonal Skills: Develops and maintains effective relationships with others from diverse backgrounds and in different situations. Shows understanding, courtesy, tact, empathy, and politeness.",
      "Verbal Communication: Makes clear and convincing oral presentations that are appropriate to listeners and situations. Listens effectively, attends to nonverbal cues, and responds appropriately.",
      "Written Communication: Writes cogently and succinctly to convey information in the most efficient and effective manner possible for use by the Member, other staff, and stakeholders"
    ],
    "how_to_apply": "Interested applicants should e-mail a resume and cover letter to MaxMillerOhioResumes@gmail.com with the specific subject line: “[Applicant name] – Staff Assistant Application.” Resumes submitted by other means will not be considered. Applicants who advance during the recruitment process will be required to submit a writing sample, the topic of which will be provided by the office.",
    "salary_info": "$45,000 or commensurate with skills and experience.",
    "contact": "MaxMillerOhioResumes@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-415-24",
    "position_title": "Communications Director",
    "office": "Rep. Maxine Waters (D-CA-43)",
    "location": null,
    "posting_date": "2024-10-14",
    "description": "The Office of Rep. Maxine Waters (D-CA-43) seeks a dynamic and experienced Communications Director to lead the development and implementation of communication strategies that promote the Member's priorities and initiatives.\nThe ideal candidate will have a strong background in media relations, public affairs, and strategic messaging, as well as the ability to work collaboratively with legislative and district teams.",
    "responsibilities": [
      "Develop and implement comprehensive communication strategies for the Member.",
      "Oversee media relations, including drafting press releases and managing inquiries.",
      "Coordinate communications efforts with legislative initiatives.",
      "Craft speeches, op-eds, and other written materials.",
      "Manage social media presence and digital communications.",
      "Work closely with the Chief of Staff and Legislative Director to align messaging.",
      "Monitor and analyze media coverage of the Member and relevant issues.",
      "Serve as the primary spokesperson for the Member.",
      "Train and prepare the Member for public appearances and interviews."
    ],
    "qualifications": [
      "Bachelor’s degree in Communications, Public Relations, or a related field.",
      "5+ years of experience in communications, media relations, or public affairs.",
      "Strong writing and editing skills with attention to detail.",
      "Experience working in a fast-paced political environment.",
      "Familiarity with social media platforms and digital communication strategies.",
      "Ability to manage multiple projects and deadlines effectively.",
      "Strong interpersonal and team collaboration skills.",
      "Knowledge of current legislative issues and their impact on constituents.",
      "Familiarity with California and/or District 43 preferred."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter, and at least 3 references to ellis.mcginnis@mail.house.gov with “Communications Director” in the subject line. Applications will be accepted until the position is filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "ellis.mcginnis@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer."
  },
  {
    "id": "MEM-411-24",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Office of Congressman John Garamendi",
    "location": null,
    "posting_date": "2024-10-14",
    "description": "The Communications Director will design and execute a communications plan to elevate the Representative and better connect him with his constituents.\n\nThis will include but is not exclusive to drafting press releases, authoring opeds, pitching and coordinating earned media, overseeing social media content and strategy, creating direct constituent mail, and telephone town halls. The role will also directly manage and mentor two other communications staff members.",
    "responsibilities": [
      "Design and execute a communications plan to elevate the Representative and better connect him with his constituents.",
      "Drafting press releases",
      "Authoring opeds",
      "Pitching and coordinating earned media",
      "Overseeing social media content and strategy",
      "Creating direct constituent mail",
      "Telephone town halls",
      "Directly manage and mentor two other communications staff members."
    ],
    "qualifications": [
      "A strong background in communications is required.",
      "Significant earned media experience",
      "Management experience",
      "Writing in with a strong prospective."
    ],
    "how_to_apply": "To apply, please email ca08.jobs@mail.house.gov with Communications Director Applicant in the subject line and the following application materials attached as one combined PDF: 1. Cover letter; 2. Resume; and 3. Two writing samples, preferably a press release and an op-ed.",
    "salary_info": "Salary will depend on experience, but is expected to align with the median salary of communications directors in personal offices in the House of Representatives.",
    "contact": "ca08.jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply. Our office is a tightknit community, and we are also looking for someone who can continue to foster that environment and encourage cross-talent collaboration."
  },
  {
    "id": "MEM-410-24",
    "position_title": "Constituent Services Representative",
    "office": "Congressional Staff",
    "location": null,
    "posting_date": "2024-10-14",
    "description": "The Constituent Services Representative position acts as a liaison to federal, district, and local agencies for the Member/constituents and answers casework correspondence and verbal communications with constituents. Candidates must be a self-starter, excited to problem solve, hardworking, dependable, and organized as well as possess strong oral and written communication skills. This position requires the ability to work well under pressure, good judgment, strong customer service skills, and a commitment to public service. Availability to work some evenings and weekends is required. Ability to communicate in multiple languages is also highly desirable. A vehicle to travel to evening and weekend events is also recommended.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Handles casework assignments and special projects at the direction of the Director of Constituent Services;",
      "Continually screens active cases/ constituent service requests and acts as a liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Attends and monitors scheduled district meetings on behalf of the Member with constituents and groups during regular office hours, some evenings and weekends;",
      "Logging incoming and outgoing correspondence, handling visitors & telephone calls;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework and constituent concerns in Congressional Management System Database;",
      "Performs cross functional tasks with other departments, as needed.",
      "Meets attendance requirements as established by the office; Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;"
    ],
    "qualifications": [
      "Strong customer service, oral and written communication skills;",
      "Familiarity with local, state and federal agencies; Strong knowledge of issues and events in the district in which the Member is involved;",
      "Professional telephone manner and excellent customer and client service skills;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge and proficiency in Microsoft office suite and other office computer applications."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter and resume to ny08team@gmail.com with the Subject Line: Constituent Services Representative Position.",
    "salary_info": null,
    "contact": "ny08team@gmail.com",
    "equal_opportunity": "Women, people of color, and LGBTQ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-402-24",
    "position_title": "Constituent Advocate (District ODice)",
    "office": "Office of Congresswoman Jill Tokuda",
    "location": "Honolulu",
    "posting_date": "2024-10-14",
    "description": "Rep. Jill Tokuda is looking for an enthusiastic and highly motivated individual to join her district stag in her Honolulu Ogice. This position works with constituents who request assistance and acts as a liaison to federal, state, and local agencies. The ideal candidate would have strong customer service skills and the ability to write quickly and egectively. Attention to detail and the ability to work in a fast-paced environment is required.",
    "responsibilities": [
      "Works with constituents who request assistance and maintains up-to-date files on all cases.",
      "Manages casework through a constituent management system and handles cases in a timely and responsible manner, which includes working with federal, state, and local agencies.",
      "Answers phones, checks voicemail, and responds to calls or refers calls to appropriate stag. Greets and assists visitors.",
      "Reviews, processes, and distributes mail.",
      "Prepares written responses to constituent inquiries and congratulatory messages."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates are requested to submit a cover letter and resume to hawaii02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-392-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Emilia Sykes",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "Congresswoman Emilia Sykes seeks a Communications Director to serve in their Washington, D.C. ogice. Candidates must be proactive, possess superior written and oral communication skills, and be able to execute a robust communications strategy. This is not an entry-level position. Only candidates with prior political or legislative communications experience will be considered.",
    "responsibilities": [
      "Creating and executing a robust communications plan",
      "Establishing and maintaining relationships with Ohio, national, and D.C.-based media",
      "Advancing press events and staging the Member as needed, including occasional night and weekend commitments",
      "Drafting and distributing press releases, statements, and media advisories",
      "Creating, editing, and strategically placing op-eds",
      "Overseeing the development of social media content creation, including rapid response",
      "Managing a franked communications plan including text messages, e-newsletters, digital ads, radio ads, 499s, mailers, etc",
      "Pitching to reporters and producers, responding to press inquiries, and serving as the main point-of-contact for media",
      "Updating the website as needed",
      "Managing the Press Secretary",
      "Performing other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, three references, and two writing samples in one pdf to JoinTeamSykes@mail.house.gov with the following subject line: Full Name – Communications Director.",
    "salary_info": "$90,000-$100,000 based on experience",
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The ogice is an equalopportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-387-24",
    "position_title": "District Liaison",
    "office": "Congresswoman Alma S. Adams, Ph.D. (NC-12)",
    "location": "Charlotte District Office, NC",
    "posting_date": "2024-10-14",
    "description": "Congresswoman Alma S. Adams, Ph.D. (NC-12) is seeking an organized, detail-oriented individual to serve in the position of District Liaison in a fast-paced and highly collaborative Charlotte District Office. Successful candidates will have familiarity with Federal agencies, excellent written and oral communication skills, the ability to exercise discretion and independent judgement, and will be team oriented. Additionally, a strong knowledge and/or connection to Mecklenburg and Cabarrus Counties is preferred, but not required. This is a full-time and in-person position.",
    "responsibilities": [
      "To act as a liaison with federal, district, and local agencies on behalf of the Member and constituents.",
      "Managing and navigating constituents’ casework through federal agencies to ensure fair and timely responses to their problems.",
      "Referring constituents to appropriate state or local agencies for non-federal issues.",
      "Assessing casework and community activities for matters warranting legislative action.",
      "Acts as a liaison to local, state, and federal officials and other persons or groups to form effective relationships for the Member/Office.",
      "Works well under pressure and handles stress.",
      "Meeting with constituents and answering casework correspondence.",
      "Continually screening active cases to ensure they are handled in a timely manner.",
      "Maintaining up-to-date files on all cases.",
      "Providing periodic updates to the Manager of Constituent Services and District Director on pending cases.",
      "Maintaining a good relationship with the Member, staff, and constituents.",
      "Accepts performance-based criticism and directions.",
      "Stakeholder engagement.",
      "Event planning and staging.",
      "Administrative support for office operations.",
      "Greeting visitors.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Telephone calls and logging incoming and outgoing correspondence."
    ],
    "qualifications": [
      "Bachelor’s Degree.",
      "Background in Social Work preferred, but not required.",
      "Background in Customer Service preferred, but not required.",
      "Ability to communicate with diverse populations of individuals.",
      "Prior experience working for/with an elected official is preferred.",
      "Demonstrate a strong commitment to public service.",
      "Microsoft proficiency.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "Ability to work as a part of a dynamic team.",
      "Be creative in problem solving.",
      "Have excellent oral/verbal and written communication skills.",
      "Thoroughness and careful attention to detail.",
      "Ability to exercise discretion and independent judgment.",
      "Ability to work cooperatively and courteously with others in a fast-paced office.",
      "Have basic knowledge of federal agencies and the political process.",
      "Have knowledge of the Twelfth Congressional District.",
      "All applicants must be able to work a flexible work schedule; be available some nights (after work hours), weekends and holidays.",
      "We prefer applicants live in the 12th congressional district (but not required)."
    ],
    "how_to_apply": "If interested in applying, send resume and cover letter directly to the Deputy Chief of Staff and District Director, Sandra A. Brown",
    "salary_info": null,
    "contact": "Sandra.Brown@mail.house.gov. Closing date for this position is October 18, 2024.",
    "equal_opportunity": null
  },
  {
    "id": "MEM-382-24",
    "position_title": "Military and Veterans Affairs Liaison",
    "office": null,
    "location": "District Offices of Congressman Max Miller (Medina and Parma, Ohio)",
    "posting_date": "2024-10-14",
    "description": "The Military and Veterans Affairs Liaison is responsible for maintaining relationships with veterans, military members, military installations and organizations, veterans organizations and offices, and other like entities within the district. Additionally, the liaison will be responsible for all military and veterans related casework and lead the office’s service academy nomination process.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents, organizations, etc;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Acts as a liaison to and notifies the appropriate media when the Member will be in the liaison’s area and works with the Member’s Scheduler and Press Secretary to ensure appropriate media participation;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Director of Constituent Services;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Assists with the handling of office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Bachelor's degree or equivalent combination of education and experience preferred;",
      "Previous office experience is preferred;",
      "Previous experience working for a Member of Congress, elected official, or government agency preferred;",
      "Meets attendance requirements as established by the office;",
      "Accepts performance based criticism and directions;",
      "Strong oral and written communication skills;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including some nights and weekends;",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume to Raymond.Paoletta@mail.house.gov.",
    "salary_info": null,
    "contact": "Raymond.Paoletta@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-135-24",
    "position_title": "PRESS SECRETARY",
    "office": "Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Ogice of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. ogice. Candidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\n\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staff the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the office’s larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-10-14",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented.\n\nThis is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to ellis.mcginnis@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled.",
    "salary_info": "Commensurate with experience.",
    "contact": "ellis.mcginnis@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-423-24",
    "position_title": "Spring 2025 Internship",
    "office": "Representative Donald Norcross (NJ-01)",
    "location": null,
    "posting_date": "2024-10-14",
    "description": "The Office of Representative Donald Norcross (NJ-01) is seeking motivated candidates for the Spring 2025 Internship program. Applications are considered on a rolling basis.\n\nIntern responsibilities will include but are not limited to assisting staff with legislative, administrative, constituent relations, scheduling, and communications activities. Interns will answer phones; sort, distribute, and respond to constituent mail; attend hearings and briefings; assist with legislative research; compile daily clips; and participate in professional development activities.\n\nSuccessful candidates will demonstrate that they are organized, detailoriented, and professional. Strong written and oral communication skills are essential.",
    "responsibilities": [
      "Assisting staff with legislative activities",
      "Assisting staff with administrative activities",
      "Assisting staff with constituent relations",
      "Assisting staff with scheduling",
      "Assisting staff with communications activities",
      "Answer phones",
      "Sort, distribute, and respond to constituent mail",
      "Attend hearings and briefings",
      "Assist with legislative research",
      "Compile daily clips",
      "Participate in professional development activities"
    ],
    "qualifications": [
      "Organized",
      "Detail-oriented",
      "Professional",
      "Strong written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume, cover letter, three professional references and a brief writing sample to andrew.skurnik@mail.house.gov. No phone calls or drop-ins, please. Applications will be reviewed on a rolling basis and applicants are encouraged to apply early. Incomplete applications will not be reviewed.\n\nWhen emailing over your completed application materials, please include a resume, cover letter. And 2-3 references in one combined PDF.",
    "salary_info": "Interns receive a stipend. The spring internship will span early January to early May, but start/end dates are flexible based on semester schedule.",
    "contact": "andrew.skurnik@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-421-24",
    "position_title": "Legislative Intern Spring 2025",
    "office": "Democratic Stag of the Committee on Rules",
    "location": "House Rules Committee",
    "posting_date": "2024-10-14",
    "description": "The Democratic Stag of the Committee on Rules is seeking full- and part-time, energetic interns for the spring (January - May). Our interns work closely with Committee stag to prepare materials for Committee meetings, conduct research projects, learn about the Rules of the House and the various procedures for legislation to reach the House Floor, and complete a variety of other administrative tasks. Ideal candidates have strong writing skills, a good work ethic, an interest in learning about House floor procedures, and are detail-oriented. Interns will gain experience in legislative analysis, political communications, and institutional processes.",
    "responsibilities": [
      "Prepare materials for Committee meetings",
      "Conduct research projects",
      "Learn about the Rules of the House and the various procedures for legislation to reach the House Floor",
      "Complete a variety of other administrative tasks"
    ],
    "qualifications": [
      "Strong writing skills",
      "Good work ethic",
      "Interest in learning about House floor procedures",
      "Detail-oriented",
      "Massachusetts ties are a plus"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume with the subject line: \"Legislative Intern Spring 2025 – Last Name, First Name\" explaining why you want to join the Democratic stag of the House Rules Committee to RulesInternDem.Application@mail.house.gov. Please apply by November 8, 2024.\n\nNote: Students on quarter systems or with unusual schedules are still encouraged to apply—please detail your particular situation in your cover letter.",
    "salary_info": "A stipend will be available for qualified candidates.",
    "contact": "RulesInternDem.Application@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds or with untraditional experience to apply."
  },
  {
    "id": "MEM-420-24",
    "position_title": "Fall 2024 Internship Program",
    "office": "Congresswoman Rosa L. DeLauro (CT-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The office of Congresswoman DeLauro runs an internship program intended for current undergraduate students, recent college graduates, and students currently enrolled in graduate school. Internships in Congresswoman DeLauro's office combine administrative and legislative work.\n\nInterns are involved in all aspects of the office including constituent services, correspondence, and legislative research, in addition to providing general staff support.",
    "responsibilities": [
      "Constituent services",
      "Correspondence",
      "Legislative research",
      "Providing general staff support"
    ],
    "qualifications": [
      "Ability to work in a fast-paced environment",
      "Excellent writing skills",
      "Enthusiastic attitude"
    ],
    "how_to_apply": "Please email your completed intern application form (also located on delauro.house.gov/services/internships), cover letter, resume, brief writing sample (1-2 pages), and two reference contacts in a single PDF file to Lydia.McCarty@mail.house.gov with the subject line “Spring 2024 Internship” by November 15.",
    "salary_info": null,
    "contact": "Lydia.McCarty@mail.house.gov",
    "equal_opportunity": "Applicants and employees shall not be discriminated against with respect to compensation, terms, conditions, or privileges of employment, because of such person’s race, color, religion, sex, age, national origin, service in the military, disability, or sexual orientation."
  },
  {
    "id": "MEM-418-24",
    "position_title": "Intern",
    "office": "Congressman Rob Menendez (NJ-08)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "Congressman Rob Menendez (NJ-08) seeks interns for his Washington, D.C. ogice for Spring 2024.\n\nIdeal candidates are organized and passionate undergraduate students, graduate students, or recent graduates with an interest in public service. They should be self-starters with excellent writing and organizational skills.",
    "responsibilities": [
      "Greeting guests and assisting with front ogice operations",
      "Answering phones, recording constituent opinions, and correctly processing other inquiries",
      "Legislative work: attending hearing and brieﬁngs, writing memos, composing cosponsor recommendations, and drafting letters to be sent to constituents",
      "Organizing incoming mail",
      "Assisting with press clips and communications tasks"
    ],
    "qualifications": [
      "Organized and passionate undergraduate students, graduate students, or recent graduates with an interest in public service.",
      "Self-starters with excellent writing and organizational skills."
    ],
    "how_to_apply": "To apply, please ﬁll out the application and submit a resume and cover letter through this link: menendez.house.gov/services/internships. Please indicate your availability in your cover letter and format the ﬁles [LastName_CoverLetter] and [LastName_Resume].",
    "salary_info": "A stipend will be provided.",
    "contact": null,
    "equal_opportunity": "Our ogice is an equal opportunity employer, and we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, military status, sexual orientation, or gender identity or expression. Special consideration will be given to candidates with New Jersey ties and to those from backgrounds that are traditionally underrepresented in Congress."
  },
  {
    "id": "MEM-417-24",
    "position_title": "Legislative and Press Interns for Spring 2025",
    "office": "Rep. Troy Nehls (TX-22)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "Congressman Troy E. Nehls’ (TX-22) Washington, D.C ogice is currently seeking qualiﬁed individuals who have a passion for federal policy and America First priorities to serve in his Washington, D.C. ogice for the Spring of 2025. This internship provides students with a ﬁrsthand understanding of our nation’s legislative process. Interns will contribute to the daily operations of the ogice.",
    "responsibilities": [
      "greeting visitors",
      "answering phones",
      "leading tours of the Capitol",
      "attending brieﬁngs and hearings",
      "performing legislative research",
      "assisting both legislative and communications stag"
    ],
    "qualifications": [],
    "how_to_apply": "Those interested should send their resume and cover letter to jacqueline.camuy@mail.house.gov with \"Spring 2025 Internship\" in the subject line. Applications are reviewed on a rolling basis until November 2nd. Texas ties are preferred.",
    "salary_info": "This is a paid internship. Please include availability, previous experience and information about yourself and your education. Texas ties preferred.",
    "contact": "jacqueline.camuy@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-416-24",
    "position_title": "Congressional Internship",
    "office": "Office of Congresswoman Summer Lee",
    "location": "Washington, DC, and District Office",
    "posting_date": "2024-10-14",
    "description": "The Office of Congresswoman Summer Lee is committed to investing in the next generation of public leaders and citizen activists. Congressional internships offer a comprehensive learning opportunity to understand better how congressional offices and the legislative process work. Both in the Washington, DC, and District Office, the internship program is designed to be a learning experience in which students are exposed to various areas including constituent services, scheduling, office administration, press and communications, and legislative policy.\n\nThe ideal candidate for this paid, part-time internship will be team-oriented and have strong written and verbal communication skills.\n\nStudents and recent graduates who are interested in the legislative process are highly encouraged to apply. The Congresswoman is on the Oversight and Accountability Committee and the Space, Science, and Technology Committee. Ties to Pennsylvania’s 12th Congressional District are preferred, but not necessary.",
    "responsibilities": [
      "Answering phones",
      "Leading Capitol tours (Washington, D.C.-based)",
      "Researching legislation for the Member and legislative staff",
      "Attending hearings and briefings",
      "Answering constituent letters on a variety of issues"
    ],
    "qualifications": [
      "Team-oriented",
      "Strong written and verbal communication skills",
      "Interested in the legislative process",
      "Ties to Pennsylvania’s 12th Congressional District are preferred, but not necessary."
    ],
    "how_to_apply": "All applicants should apply by November 15, 2024, at: https://summerlee.house.gov/internships.",
    "salary_info": "paid, part-time internship",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-414-24",
    "position_title": "Intern",
    "office": "The Ogice of Congresswoman Sydney Kamlager-Dove (CA-37)",
    "location": "Washington, D.C. and Los Angeles ogices",
    "posting_date": "2024-10-14",
    "description": "The Ogice of Congresswoman Sydney Kamlager-Dove (CA-37) is seeking interns for our\nWashington, D.C. and Los Angeles ogices for the Spring 2025 term.\n\nOur ogice values open communication, hard work, and creating a collegial environment.\nWe are looking for interns with a can-do attitude who are eager to grow. Interns will have\ngreat opportunities to learn from ogice stag and network with others to make the most of\ntheir time with our ogice!",
    "responsibilities": [
      "Answer phones and assist in correspondence with constituents",
      "Greet constituents and ogice visitors",
      "Process tour requests and lead Capitol tours",
      "Handle mail",
      "Assist in processing casework",
      "Perform legislative research",
      "Work on other administrative tasks as directed",
      "Assist the Communications Director and Press Assistant in drafting social media content and other materials like press releases, website content, and newsletters",
      "Create graphic design posts for social media",
      "Compile daily press clips",
      "Edit video clips",
      "Maintain press lists",
      "Answer phones and assist in correspondence as needed."
    ],
    "qualifications": [
      "Candidates should have an interest in the legislative process and civic service; possess excellent writing, research, organization, time management, and communication skills; work well in a team environment; and have a general understanding of the US political system."
    ],
    "how_to_apply": "Interested applicants should send their resume and a brief cover letter (in one\ndocument) to:\n\n*   CA37.internships@mail.house.gov for DC ogice internship.\n    *   Use the subject line “First name Last name [legislative] OR [press] – Spring 2025\n        internship”\n*   ca37.DOinternships@mail.house.gov for Los Angeles ogice internship\n    *   Use the subject line “First name Last name – Spring 2025 Internship” in your email.",
    "salary_info": null,
    "contact": "Please reach out our intern coordinator, Madilyn Brandon, with any questions\nat Madilyn.Brandon@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-413-24",
    "position_title": "Communications Intern",
    "office": "Congresswoman's Office",
    "location": "DC",
    "posting_date": "2024-10-14",
    "description": "Communications Interns assist the communications stag by compiling media clips, drafting social media posts and press releases, creating digital content, answering phones, inputting casework inquiries, and aiding the Congresswoman’s communications egorts.\n\nExperience working in communications is a plus.\n\nIdeal candidates for this internship are diligent, detail-oriented, and can excel in a fastpaced environment. Applicants should possess strong written and verbal communication skills, an eye for and ability to create engaging digital content, and a good sense of humor.\n\nTies to Washington State are preferred, but not required. Applicants are encouraged to include any previous customer service experience (retail, food service, hospitality, etc.) on their resumes.",
    "responsibilities": [
      "Compiling media clips",
      "Drafting social media posts and press releases",
      "Creating digital content",
      "Answering phones",
      "Inputting casework inquiries",
      "Aiding the Congresswoman’s communications egorts"
    ],
    "qualifications": [
      "Diligent",
      "Detail-oriented",
      "Ability to excel in a fast-paced environment",
      "Strong written and verbal communication skills",
      "Eye for and ability to create engaging digital content",
      "Good sense of humor",
      "Ties to Washington State are preferred"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, a one-page writing sample, and a sample social media post with relevant written and visual components in a single PDF document to WA10resumes@gmail.com with “DC Spring Communications Internship[LAST NAME]” in the subject line. Please indicate in the cover letter which internship you are applying for and your dates of availability.",
    "salary_info": null,
    "contact": "WA10resumes@gmail.com",
    "equal_opportunity": "This ogice is an Equal Employment Opportunity Ogice and does not discriminate in employment based on race, color, religion, sex, gender identity, national origin, sexual orientation, marital status, disability, genetic information, age, military service, or other non-merit factors. Individuals from underrepresented communities are encouraged to apply. Please no unsolicited phone calls or drop-ins."
  },
  {
    "id": "MEM-412-24",
    "position_title": "Legislative Intern",
    "office": "Congresswoman's Office",
    "location": "DC",
    "posting_date": "2024-10-14",
    "description": "Legislative Interns assist the legislative stag by preparing briefing notes and memos, researching legislation, tracking legislative activity, providing mail program support, answering phones, inputting casework inquiries, attending hearings, and advancing the Congresswoman's legislative agenda.\n\nIdeal candidates for this internship are diligent, detail-oriented, and can excel in a fastpaced environment. Applicants should possess strong written and verbal communication skills, an ability to manage multiple short-term and stretch assignments, and a good sense of humor. Ties to Washington State are preferred, but not required. Applicants are encouraged to include any previous customer service experience (retail, food service, hospitality, etc.) on their resumes.",
    "responsibilities": [
      "Preparing briefing notes and memos",
      "Researching legislation",
      "Tracking legislative activity",
      "Providing mail program support",
      "Answering phones",
      "Inputting casework inquiries",
      "Attending hearings",
      "Advancing the Congresswoman's legislative agenda"
    ],
    "qualifications": [
      "Diligent",
      "Detail-oriented",
      "Ability to excel in a fast-paced environment",
      "Strong written and verbal communication skills",
      "Ability to manage multiple short-term and stretch assignments",
      "Good sense of humor",
      "Ties to Washington State are preferred, but not required",
      "Previous customer service experience (retail, food service, hospitality, etc.)"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and a writing sample not to exceed one page in length in a single PDF document to WA10resumes@gmail.com with “DC Spring Legislative Internship-[LAST NAME]” in the subject line. Please indicate in the cover letter which internship you are applying for and your dates of availability.",
    "salary_info": null,
    "contact": "WA10resumes@gmail.com",
    "equal_opportunity": "This ogice is an Equal Employment Opportunity Ogice and does not discriminate in employment based on race, color, religion, sex, gender identity, national origin, sexual orientation, marital status, disability, genetic information, age, military service, or other non-merit factors. Individuals from underrepresented communities are encouraged to apply. Please no unsolicited phone calls or drop-ins."
  },
  {
    "id": "MEM-409-24",
    "position_title": "Intern",
    "office": "Congresswoman Suzan DelBene, representing the 1st Congressional District of Washington state",
    "location": "Washington, D.C. and District (Kirkland) offices",
    "posting_date": "2024-10-14",
    "description": "Interns will work in a fast-paced congressional office, gaining valuable experience and knowledge of the United States Congress.\n\nIntern responsibilities include greeting constituents and handling constituent phone calls, assisting staff with administrative tasks, conducting research, and assisting with constituent correspondence. Kirkland, WA interns will have the opportunity to attend community events and tours with the Congresswoman and staff. Washington, D.C. interns will have the opportunity to lead tours of the U.S. Capitol as well as attend hearings and briefings for the legislative staff.",
    "responsibilities": [
      "Greeting constituents and handling constituent phone calls",
      "Assisting staff with administrative tasks",
      "Conducting research",
      "Assisting with constituent correspondence",
      "Kirkland, WA interns: attend community events and tours with the Congresswoman and staff",
      "Washington, D.C. interns: lead tours of the U.S. Capitol as well as attend hearings and briefings for the legislative staff"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a cover letter, resume, and short writing sample (1 to 2 pages) through our web form here: https://airtable.com/appNK10LkiweHjE79/shrKQyVOSs0khwKCp. The deadline for Spring 2025 internship applications is Friday, November 8th at 11:59 PM.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-408-24",
    "position_title": "Intern",
    "office": "Congressman Gabe Amo’s (RI-01) Washington, D.C. office",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "Interns would be expected to start in January and stay through May or June. These internships provide students with an opportunity to learn more about the workings of a congressional office and to see the legislative process first-hand. Interns will be expected to answer phones, sort mail, research legislation, attend hearings and briefings, write memos, give tours of the Capitol, and draft constituent letters on various issues and other matters as assigned.",
    "responsibilities": [
      "Answer phones",
      "Sort mail",
      "Research legislation",
      "Attend hearings and briefings",
      "Write memos",
      "Give tours of the Capitol",
      "Draft constituent letters on various issues",
      "Other matters as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply please send a copy of your resume, cover letter, and a 1-2 page writing sample to alex.nelson@mail.house.gov by 10am on Friday, October 18th with the subject line “DC Intern Application - Full Name.” Please no phone calls or walk-ins regarding the status of your application.",
    "salary_info": null,
    "contact": "alex.nelson@mail.house.gov",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-407-24",
    "position_title": "Spring DC Fellowship",
    "office": "Congressman Shri Thanedar",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Washington, D.C. Office of Congressman Shri Thanedar (MI-13) is now accepting applications for a legislative fellowship during the Spring 2025 term. This fellowship is a great opportunity for individuals in professional programs who seek to gain an in-depth legislative experience. This is a full-time, in-person position.\n\nFellows assist the legislative team with drafting legislation, assisting with stakeholder meetings, and helping with committee assignments.",
    "responsibilities": [
      "Performing Research (CRS, the Library of Congress, MIN, or other available resources)",
      "Attending meetings on behalf of the office",
      "Drafting talking points, proclamations, and various briefings",
      "Staffing the Congressman at various events",
      "Tracking and responding to constituent requests and letters",
      "Helping find legislative opportunities for sponsorship and co-sponsorship",
      "Performing tasks and duties as needed to help day to day activities of the office",
      "Other duties will be based on the fellow's interests."
    ],
    "qualifications": [
      "We are looking for candidates with an eagerness to learn, research skills, and strong writing skills.",
      "MI-13 ties and research experience are pluses.",
      "Must be in a program that sponsors your fellowship."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and a 1-3 page writing sample in one combined document to HR.Thanedar@mail.house.gov with the subject line “Last Name Spring DC Fellow Application.” The application deadline is November 15, 2024. No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "HR.Thanedar@mail.house.gov",
    "equal_opportunity": "This office is an Equal Opportunity Employment Office and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, or age. We strongly encourage BIPOC-identifying individuals and members of other underrepresented communities to apply."
  },
  {
    "id": "MEM-406-24",
    "position_title": "Spring DC Internship",
    "office": "Congressman Shri Thanedar",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Washington, D.C. Office of Congressman Shri Thanedar (MI-13) is now accepting applications for press and legislative internships during the Spring 2025 term. This internship is a great opportunity for individuals who seek to gain public service experience and insight into Capitol Hill. This is a full-time, in-person position.",
    "responsibilities": [
      "Answering phone calls",
      "Greeting office visitors",
      "Drafting constituent correspondence",
      "Coordinating tour requests and leading tours of the Capitol",
      "Attending congressional briefings, hearings and other professional development events",
      "Drafting press releases to be posted on the website and social media accounts",
      "Researching legislation and writing cosponsor memos for the legislative team",
      "Assisting operations, communications, and legislative staffers with various tasks"
    ],
    "qualifications": [
      "An eagerness to learn",
      "Customer service skills",
      "Strong writing skills",
      "MI-13 ties and service industry experience are pluses."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and a 1-3 page writing sample in one combined document to HR.Thanedar@mail.house.gov with the subject line “Last Name Spring DC Press or Legislative Intern Application.” The application deadline is November 15, 2024. No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "HR.Thanedar@mail.house.gov",
    "equal_opportunity": "This office is an Equal Opportunity Employment Office and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, or age. We strongly encourage BIPOC-identifying individuals and members of other underrepresented communities to apply."
  },
  {
    "id": "MEM-405-24",
    "position_title": "Intern",
    "office": "Congressman Gabe Amo’s (RI-01) Pawtucket office",
    "location": "Pawtucket",
    "posting_date": "2024-10-14",
    "description": "Interns would be expected to start in early to midJanuary. These internships provide students with an opportunity to learn more about the workings of a congressional district office and to see the constituent service process first-hand. Interns will be expected to answer phones, sort mail, assist constituents, conduct research, write memos, and draft constituent letters on various issues and other matters as assigned.",
    "responsibilities": [
      "Answer phones",
      "Sort mail",
      "Assist constituents",
      "Conduct research",
      "Write memos",
      "Draft constituent letters on various issues and other matters as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply please send a copy of your resume, cover letter, and a writing sample to sara.terrien@mail.house.gov by 10:00am on Friday, October 18 with the subject line “Intern Application - Full Name.” Please no phone calls or walk-ins regarding the status of your application.",
    "salary_info": null,
    "contact": "sara.terrien@mail.house.gov",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-403-24",
    "position_title": "Intern",
    "office": "House Natural Resources Committee Democrats",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The House Natural Resources Committee Democrats seek full-time interns for Spring 2025 (beginning of February – end of May). Applicants must be organized, detail oriented, and dependable. Above all, we seek candidates who are passionate about issues within the Natural Resources Committee’s jurisdiction, demonstrate exceptional interpersonal skills, and are eager to learn about committee process. Interns will conduct legislative research, prepare for hearings, assist with administrative duties, perform outreach, and aid communications.",
    "responsibilities": [
      "Conduct legislative research",
      "Prepare for hearings",
      "Assist with administrative duties",
      "Perform outreach",
      "Aid communications"
    ],
    "qualifications": [
      "Demonstrates an awareness of and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.",
      "Understands how HNRC issues intersect with racism, economic and social inequality in the United States, and has a passion for working to dismantle these systems."
    ],
    "how_to_apply": "Interested candidates should apply by visiting the House Natural Resources Committee Democrats website at https://democratsnaturalresources.house.gov/internships.",
    "salary_info": "$3,200 monthly stipend plus transit benefits",
    "contact": null,
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law.\nApplicants with disabilities who require reasonable accommodation to participate in the application or hiring process are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-401-24",
    "position_title": "Intern",
    "office": "Congressman Kevin Kiley",
    "location": "Capitol",
    "posting_date": "2024-10-14",
    "description": "The office of Congressman Kevin Kiley is seeking full or part-time interns for the FALL 2024 term. Position duties include attending Congressional hearings, scheduling/leading Capitol tours, answering phones, sorting mail, and assisting legislative staff with research.\n\nApplicants should possess conservative values and hold strong written and verbal communication skills. Recent graduates are welcome to apply.",
    "responsibilities": [
      "Attending Congressional hearings",
      "Scheduling/leading Capitol tours",
      "Answering phones",
      "Sorting mail",
      "Assisting legislative staff with research"
    ],
    "qualifications": [
      "Conservative values",
      "Strong written and verbal communication skills",
      "Recent graduates are welcome to apply"
    ],
    "how_to_apply": "Interested applicants should send their resume and availability. Please use “Kevin Kiley Internship” in the subject line. Please send resumes to Anthony.euceda@mail.house.gov",
    "salary_info": null,
    "contact": "Anthony.euceda@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-400-24",
    "position_title": "In-Person Internship",
    "office": "Representative Brad Sherman CA-32",
    "location": "Washington D.C.",
    "posting_date": "2024-10-14",
    "description": "The Washington D.C. Ogice of Representative Brad Sherman CA-32 will be accepting applications for an in-person internship during the Spring Semester 2025.\n\nAs a result, interns will learn about the functions of a congressional ogice, congressional communications, and the legislative process.",
    "responsibilities": [
      "Greeting guests and assisting with front ogice operations;",
      "Answering phones, recording constituent opinions, and correctly processing other inquiries;",
      "Conducting Capitol tours for constituents and other guests;",
      "Day-to-day ogice work to assist with the functioning of the congressional ogice and other duties as delegated by members of the stag;",
      "Supporting the Legislative Correspondent with sorting mail and drafting constituent letters;",
      "Attending hearings and brieﬁngs, as requested by senior stag;",
      "Researching legislation for the Member and legislative team;",
      "Other administrative tasks as assigned"
    ],
    "qualifications": [
      "Ideal candidates should be a self-starter with strong attention to detail, the ability to work in a fast-paced environment, and a good sense of humor.",
      "CA-32 ties are preferred but not required."
    ],
    "how_to_apply": "Interested applicants should submit the following in one PDF document:\n• Resume\n• Cover letter\n• One-page writing sample\n• Dates of availability\n\nApplications should be sent in PDF format to brads.interns@mail.house.gov with “CA-32 Spring 2025 Internship” in the subject line.",
    "salary_info": null,
    "contact": "brads.interns@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-399-24",
    "position_title": "Intern",
    "office": "Congresswoman Lois Frankel’s (FL-22)",
    "location": "D.C.",
    "posting_date": "2024-10-14",
    "description": "Congresswoman Lois Frankel’s (FL-22) D.C. office seeks interns for the upcoming Spring 2025 semester. The ideal candidate possesses a high degree of professionalism and maturity, is committed and diligent, and is a team player with a positive attitude. This position demands the ability to multi-task, strong organizational skills and must work cooperatively and courteously with others in a shared space.\n\n",
    "responsibilities": [
      "Attending hearings and briefings on behalf of the Congresswoman and legislative staffers",
      "Working directly with the communications team on press strategies",
      "Answering telephones",
      "Compiling daily press clips relevant to the office’s priorities",
      "Assisting with constituent correspondence",
      "Providing administrative assistance to the D.C. staff"
    ],
    "qualifications": [
      "Undergraduate students and recent college graduates preferred",
      "South Florida ties a plus"
    ],
    "how_to_apply": "Interested applicants should submit the below application with a resume and cover letter in a single PDF file. Cover letter should detail reasons for applying to the position.",
    "salary_info": "A stipend will be given to accepted applicants.",
    "contact": "amaris.graham@mail.house.gov",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-398-24",
    "position_title": "Intern",
    "office": "Congressman Mike Levin (CA-49)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "Congressman Mike Levin (CA-49) seeks interns for his Washington, D.C., ogice for the Winter/Spring 2025 term.\n\nThese internships provide an opportunity for undergraduate students, graduate students, and recent graduates to learn more about the workings of a Congressional ogice and the legislative process. Interns should have a general understanding of the U.S. political system, value open communication, be eager to grow, and bring a can-do attitude.\n\nInternships last approximately three to four months and are intended to be an educational experience. Internships are ogered for either academic credit or a stipend. Internship applicants must be high school graduates. Current students and recent graduates will be given ﬁrst priority for the internship program.",
    "responsibilities": [
      "Attending committee hearings and congressional brieﬁngs",
      "Conducting policy research and drafting legislative materials",
      "Authoring constituent correspondence on a range of policy issues",
      "Answering phones and processing mail",
      "Leading constituents on tours of the Capitol",
      "Working on other administrative and legislative tasks, as directed"
    ],
    "qualifications": [
      "Press interns should have strong social media skills and basic familiarity with graphic design and video editing.",
      "Submission of a sample graphic or similar communications work with your application is strongly encouraged.",
      "Interns should have a general understanding of the U.S. political system, value open communication, be eager to grow, and bring a can-do attitude.",
      "Internship applicants must be high school graduates.",
      "Current students and recent graduates will be given ﬁrst priority for the internship program."
    ],
    "how_to_apply": "To apply for an internship with Representative Levin, please email a cover letter, resume, three references, and a brief writing sample all in one pdf ﬁle, with the ﬁle name including internship class, year, last name, and ﬁrst name (i.e. Spring2025.Doe.Jane.pdf) to CA49.DCInternships@mail.house.gov by November 15, 2024.\nPlease specify whether you are applying for the press internship or the legislative internship. Applicants with strong ties to the 49th District are given preference.",
    "salary_info": null,
    "contact": "CA49.DCInternships@mail.house.gov",
    "equal_opportunity": "This ogice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-397-24",
    "position_title": "Internships",
    "office": "Office of Congressman Tim Kennedy",
    "location": "Washington, D.C. and the Bugalo District Office",
    "posting_date": "2024-10-14",
    "description": "Internships in the Ogice of Congressman Tim Kennedy are available for the fall, spring, and summer sessions for college students and recent graduates.\n\nStudents will gain invaluable experience working for a member of Congress alongside congressional stag. Hours can be ﬂexible to accommodate academic schedules.\n\nIn Washington, D.C. and the Bugalo District Ogice, intern responsibilities vary, but typically include answering phones, administrative duties, legislative research, attending hearings, meetings, and brieﬁngs, drafting correspondence, letters, and Congressional Extensions of Remarks, and assisting with media monitoring. In addition, interns may be assigned to assist in various constituent casework or assist with district-based projects.\n\nAs a result, interns learn about the legislative process and the many other functions of a congressional ogice.",
    "responsibilities": [
      "Answering phones",
      "Administrative duties",
      "Legislative research",
      "Attending hearings, meetings, and brieﬁngs",
      "Drafting correspondence, letters, and Congressional Extensions of Remarks",
      "Assisting with media monitoring",
      "Assist in various constituent casework",
      "Assist with district-based projects"
    ],
    "qualifications": [
      "College students and recent graduates"
    ],
    "how_to_apply": "To apply for an internship, please email <<ny26internapplication@kennedyny26.com>> with the subject line [Name], [DC or District Intern], and [Session (Spring, Summer, Fall)]. Please include a resume, cover letter, and three references as attachments. Applications will be reviewed on a rolling basis, and you will be notiﬁed if and when the position has been ﬁlled.",
    "salary_info": null,
    "contact": "ny26internapplication@kennedyny26.com",
    "equal_opportunity": "We do not discriminate based on race, ethnicity, gender, sexual orientation, religion, national origin, age, or socioeconomic status. All are welcome and encouraged to apply."
  },
  {
    "id": "MEM-396-24",
    "position_title": "Intern",
    "office": "Office of Congressman Kevin Hern (OK-01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The ogice of Congressman Kevin Hern (OK-01) seeks motivated and teamoriented Interns to assist with various ogice duties based in his Washington, D.C. ogice for the 2025 Spring Term (January – April/May). Internships are intended to current undergraduate students, recent college graduates, and students currently enrolled in graduate school.",
    "responsibilities": [
      "Answering constituent phone calls",
      "Taking notes at brieﬁngs and hearings",
      "Conducting tours of the Capitol",
      "Drafting correspondence letters",
      "Assembling press and news clips",
      "Assisting stag with other research and administrative duties"
    ],
    "qualifications": [
      "Strong interest in public policy",
      "Demonstrated responsibility",
      "Respectable personal conduct",
      "Committed to serving the constituents of Oklahoma’s 1st Congressional District with the utmost diligence"
    ],
    "how_to_apply": "Interested candidates should visit https://hern.house.gov/services/internship.htm for application instructions.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-395-24",
    "position_title": "Intern",
    "office": "Representative Joe Morelle",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Washington, D.C. Ogice of Representative Joe Morelle is now accepting applications for an internship during the 2025 Spring term. Applicants must be based in Washington, D.C. for the duration of the spring internship (mid-January to mid-May, subject to change).\n\nThe hours are ﬂexible to accommodate students' course schedules, but generally run from 9:00 a.m. to 6:00 p.m. when Congress is in session, and 9:00 a.m. to 5:00 p.m. when not in session (refer to the House Calendar).\n\nAs a result, interns will learn about the operations of a congressional ogice, congressional communications, and the legislative process. Ideal candidates should possess excellent written and verbal communications skills, a strong attention to detail, the ability to succeed in a fast-paced work environment, and a good sense of humor. New York State ties are preferred but not required.\n\nInternships are intended for current undergraduate students, current graduate students, and recent college graduates.",
    "responsibilities": [
      "Greeting guests and assisting with front ogice operations",
      "Answering phones, recording constituent opinions, and correctly processing other inquiries",
      "Conducting Capitol tours for constituents and other guests",
      "Day-to-day ogice work to assist with the functioning of the congressional ogice and other duties as delegated by members of the stag",
      "Supporting the Legislative Correspondent with sorting mail and drafting constituent letters",
      "Attending hearings and brieﬁngs, as requested by senior stag",
      "Researching legislation for the Member and legislative team",
      "Interacting with members of stag in the D.C. ogice and virtually with the Rochester ogice",
      "Other administrative tasks as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should submit the following:\n• Resume\n• Cover letter\n• Writing sample (ex. policy memo, short essay, etc.) (max. 2 pages)\n• Dates of availability\n\nApplications should be sent in PDF format to Savannah.Chadwick@mail.house.gov with “NY-25 Spring 2025 DC Internship” in the subject line. The deadline for this internship application has been extended to October 18th at 11:59pm EST. Applicants are encouraged to submit their application early. Interview requests will be sent out following the October 18th deadline.\nFor more information on the Washington D.C. internship please visit: https://morelle.house.gov/congressional-internships.",
    "salary_info": "Interns receive a stipend distributed based on total hours worked.",
    "contact": "Savannah.Chadwick@mail.house.gov",
    "equal_opportunity": "The ogice is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-394-24",
    "position_title": "In-Person Internship",
    "office": "Representative Joseph Morelle, NY-25",
    "location": "Rochester, NY",
    "posting_date": "2024-10-14",
    "description": "The District Office of Representative Joseph Morelle, NY-25 in Rochester, NY, will be accepting applications for an in-person internship during the Spring Semester 2025.\n\nAs a result, interns will learn about the functions of a congressional office, congressional communications, and the legislative process.\n\nIdeal candidates should possess excellent communication skills, strong attention to detail, the ability to work in a fast-paced environment, and a good sense of humor. New York State ties are preferred but not required.",
    "responsibilities": [
      "Completing constituent calls",
      "Writing letters, certificates, and proclamations",
      "Day-to-day office work",
      "Interacting with members of staff in the Rochester office and virtually in the D.C. office",
      "Other duties delegated by members of staff including various constituent case work or work on District-based projects of importance"
    ],
    "qualifications": [
      "Excellent communication skills",
      "Strong attention to detail",
      "Ability to work in a fast-paced environment",
      "Good sense of humor",
      "New York State ties are preferred but not required"
    ],
    "how_to_apply": "Interested applicants should submit the following in one PDF document:\n\nResume\n\nCover letter\n\nOne-page writing sample\n\nDates of availability\n\nApplications should be sent in PDF format to Eric.Gros@mail.house.gov with “NY-25 Spring 2025 District Internship” in the subject line.\n\nThe deadline for this internship application is November 1st, 2024, but applicants are encouraged to submit their application early. Interview requests will be sent out following the November 1st deadline.\n\nFor more information on the district internship please visit: https://morelle.house.gov/congressional-internships",
    "salary_info": null,
    "contact": "Eric.Gros@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-393-24",
    "position_title": "Intern",
    "office": "Office of Congresswoman Kim Schrier (WA-08)",
    "location": "Issaquah and Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Ogice of Congresswoman Kim Schrier (WA-08) is seeking interns in its Issaquah and Washington, D.C. ogices for spring 2025.\n\nApplicants should be eager to learn more about the legislative process and want to be part of a hardworking team dedicated to serving Washington’s 8th Congressional District. Interns will work in a fast-paced Congressional ogice, gaining valuable experience and knowledge of the United States Congress.\n\nIn Washington, D.C., intern responsibilities will include greeting constituents, answering constituent phone calls, supporting stag with administrative tasks, conducting legislative research, assisting with constituent correspondence, and other miscellaneous tasks as assigned. Interns in Washington, D.C. also have the opportunity to lead tours of the U.S. Capitol, as well as attend brieﬁngs for the legislative stag.\n\nIn the District ogice, interns will assist with a variety of tasks, including dayto-day ogice work such as answering phones, writing letters, and assisting with media clips. District ogice interns may also help with constituent casework or other District-based projects of importance.\n\nCongressional internships are open to all majors and designed for undergraduate and graduate students, as well as recent graduates with an interest in public service. Stipends or academic credit are available.",
    "responsibilities": [
      "Greeting constituents",
      "Answering constituent phone calls",
      "Supporting stag with administrative tasks",
      "Conducting legislative research",
      "Assisting with constituent correspondence",
      "Other miscellaneous tasks as assigned",
      "Lead tours of the U.S. Capitol (Washington, D.C.)",
      "Attend brieﬁngs for the legislative stag (Washington, D.C.)",
      "Answering phones (District)",
      "Writing letters (District)",
      "Assisting with media clips (District)",
      "Assist with constituent casework (District)",
      "Help with other District-based projects of importance (District)"
    ],
    "qualifications": [
      "Exceptional written and oral communication skills",
      "A high degree of professionalism",
      "A strong interest in public service",
      "The ability to multi-task and work with a team are a plus",
      "Washington state ties are a plus, but not required"
    ],
    "how_to_apply": "Please apply by November 15, 2024, at 11:59 p.m. ET.\nPlease be prepared to submit a cover letter, resume, three references and relevant information at https://schrier.house.gov/services/internships. If you have issues with this form, please email relevant application materials to DistrictInternshipsWA08@mail.house.gov.",
    "salary_info": "Stipends or academic credit are available.",
    "contact": "DistrictInternshipsWA08@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-391-24",
    "position_title": "Intern",
    "office": "Representative Jim Baird (IN-4)",
    "location": "Washington, DC",
    "posting_date": "2024-10-14",
    "description": "Representative Jim Baird (IN-4) is seeking internship applicants for Spring 2025 in his Washington, DC ogice. This is a paid, in-person, invaluable opportunity to experience the legislative process hands-on through a wide range of tasks and responsibilities providing support with ogice administration, communications, and legislative work.",
    "responsibilities": [
      "Answering phones",
      "Greeting ogice visitors",
      "Sorting mail",
      "Conducting legislative research",
      "Attending hearings and brieﬁngs",
      "Giving tours of the U.S. Capitol",
      "Assisting communications stag with press releases and social media",
      "Drafting constituent letters"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Detail oriented, motivated, and ﬂexible",
      "Address all work with a positive attitude",
      "Prior constituent or customer service experience, a demonstrated interest in public service, and District/Indiana ties are preferred."
    ],
    "how_to_apply": "Interested applicants should apply and upload a resume through the website at: https://baird.house.gov/services/internships.htm.",
    "salary_info": "paid",
    "contact": "baird.intern@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-390-24",
    "position_title": "Internship",
    "office": "Congressman Moulton",
    "location": "Salem and Washington D.C.",
    "posting_date": "2024-10-14",
    "description": "Congressman Moulton is seeking hard-working individuals who are passionate, driven, and committed to public service for an internship in his Salem office and Washington D.C. office. Internships are intended for current undergraduate students, current graduate students, and recent college graduates. Interns receive a stipend distributed based on total hours worked.",
    "responsibilities": [
      "Answering constituent phone calls and greeting constituents at the front desk.",
      "Categorizing and responding to constituent mail.",
      "Drafting form letters and cosponsor requests for the Congressman.",
      "Taking notes at briefings and hearings.",
      "Conducting tours of the Capitol for constituents.",
      "Assembling press and news clips.",
      "Performing a variety of other duties as assigned, such as conducting legislative research.",
      "Answering constituent phone calls and greeting constituents at the front desk.",
      "Assisting the Casework Team on a variety of casework requests involving federal agencies.",
      "Taking notes at briefings and hearings.",
      "Assembling press and news clips.",
      "Performing a variety of other duties as assigned, such as conducting legislative research and attending community events."
    ],
    "qualifications": [
      "current undergraduate students",
      "current graduate students",
      "recent college graduates"
    ],
    "how_to_apply": "Applicants can find more information on the internship portal at moulton.house.gov under the ‘Services’ tab. All applications are due on November 10th, 2024, and will be reviewed after the application period closes.",
    "salary_info": "Interns receive a stipend distributed based on total hours worked.",
    "contact": "Emerson Jacobson (Emerson.Jacobson@mail.house.gov)",
    "equal_opportunity": null
  },
  {
    "id": "MEM-388-24",
    "position_title": "Intern",
    "office": "Congressman Tom McClintock",
    "location": "Capitol",
    "posting_date": "2024-10-14",
    "description": "The ogice of Congressman Tom McClintock is seeking full or part-time interns. Position duties include: attending Congressional hearings, scheduling/leading Capitol tours, answering phones, sorting mail, and assisting legislative stag with research.",
    "responsibilities": [
      "Attending Congressional hearings",
      "Scheduling/leading Capitol tours",
      "Answering phones",
      "Sorting mail",
      "Assisting legislative stag with research"
    ],
    "qualifications": [
      "Applicants should possess conservative values",
      "Hold strong written and verbal communication skills",
      "Recent graduates are welcome to apply"
    ],
    "how_to_apply": "Interested applicants should send their resume, availability, and a brief cover letter to gopwestcoastjobs@gmail.com. Please use “McClintock Internship” in the subject line. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "gopwestcoastjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-384-24",
    "position_title": "Intern",
    "office": "Congressman Steve Cohen (D-TN-09)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Washington, D.C. Ogice of Congressman Steve Cohen (D-TN-09) is seeking interns for the spring of 2025. This is an in-person opportunity with limited hybrid hours possible. A majority of the program is spent in the ogice.\n\nThis position ogers an opportunity to learn about the U.S. House of Representatives and gain substantive work experience in an exciting and fast-paced ogice. Internships are ogered on a full-time and part-time basis, and stipends are ogered based on need. Full-time availability is preferred. Ties to Tennessee’s 9th District are preferred but not required. Start dates are ﬂexible. Applications are reviewed on a rolling basis.",
    "responsibilities": [
      "Assist with constituent correspondence and draft email blasts and other forms of outreach.",
      "Attend virtual brieﬁngs and track virtual hearings.",
      "Conduct weekly legislative assignments.",
      "Conduct legislative research on an as-needed basis."
    ],
    "qualifications": [
      "Demonstrated interest in politics, policy and/or public service.",
      "Strong communications and writing skills.",
      "Hard-working, dependable, detail-oriented and professional.",
      "Self-motivated (especially given that all work is remote).",
      "Ties to Tennessee’s 9th District are a bonus, but not required."
    ],
    "how_to_apply": "To apply, applicants must complete the form and submit the following materials on https://cohen.house.gov/services/internships:\n\n· Resume.\n· Cover letter.\n· Three references.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-383-24",
    "position_title": "Full-Time Paid Internship Spring and Summer 2025 (Flexible Dates)",
    "office": "Rep. Josh Brecheen (OK-02)",
    "location": "DC Office",
    "posting_date": "2024-10-14",
    "description": "Congressman Josh Brecheen's DC office is currently accepting applications for a paid internship for the Spring 2025 semester, beginning as early as January 2nd. Intern responsibilities include, but are not limited to, answering and logging constituent phone calls, sorting mail, drafting constituent letters, assisting with legislative research, leading Capitol tours, and assisting with public communications tasks.\n\nThe internship provides a valuable opportunity to contribute to the daily operations of a congressional office and gain first-hand experience with the legislative process. Ideal candidates will be motivated team-players who have a strong work ethic, good written and verbal communication skills, and the ability to problem-solve with the aim of providing excellent constituent service. Oklahoma ties are preferred but not required.",
    "responsibilities": [
      "Answering and logging constituent phone calls",
      "Sorting mail",
      "Drafting constituent letters",
      "Assisting with legislative research",
      "Leading Capitol tours",
      "Assisting with public communications tasks"
    ],
    "qualifications": [
      "Motivated team-players",
      "Strong work ethic",
      "Good written and verbal communication skills",
      "Ability to problem-solve with the aim of providing excellent constituent service",
      "Oklahoma ties are preferred but not required"
    ],
    "how_to_apply": "Interested candidates should submit their resume to admin.brecheen@mail.house.gov and fill out an online application at https://brecheen.house.gov/services/internships.htm",
    "salary_info": null,
    "contact": "admin.brecheen@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-380-24",
    "position_title": "Press Intern",
    "office": "Office of Representative Chrissy Houlahan (D-PA-06)",
    "location": "Washington, D.C., Reading, and West Chester offices",
    "posting_date": "2024-10-14",
    "description": "The Office of Representative Chrissy Houlahan (D-PA-06) is accepting applications for Spring 2025 Press Interns in our Washington, D.C., Reading, and West Chester offices. This internship will run from early January through late May.\n\nWe offer needs-based stipends to students who are Pell Grant eligible. Our internship program has returned to in-person work with flexible telework options.\n\nIdeal applicants are adaptable and proactive self-starters who have experience in a faced-paced, deadline-oriented work environment.\n\nApplicants must be independent problem-solvers, have strong writing skills, and be comfortable communicating to both internal and external audiences.\n\nTechnical experience with graphic design tools (Canva, InDesign, Illustrator), photo editing programs (Photoshop, Lightroom), or video editing software (Premiere, Headliner) a major plus.\n\nPress interns will be responsible for compiling and distributing press clips, helping draft copy for press and digital materials, and developing digital content. Press interns will have the opportunity to stag the congresswoman to capture videos and photos of events. We offer interns the opportunity to see Congress up close and from the inside. Prior volunteer, leadership, and work experience are a plus. Ties to PA-06 are also a plus.",
    "responsibilities": [
      "Compiling and distributing press clips",
      "Helping draft copy for press and digital materials",
      "Developing digital content",
      "Opportunity to stag the congresswoman to capture videos and photos of events"
    ],
    "qualifications": [
      "Adaptable and proactive self-starters",
      "Experience in a faced-paced, deadline-oriented work environment",
      "Independent problem-solvers",
      "Strong writing skills",
      "Comfortable communicating to both internal and external audiences",
      "Technical experience with graphic design tools (Canva, InDesign, Illustrator), photo editing programs (Photoshop, Lightroom), or video editing software (Premiere, Headliner) a major plus",
      "Prior volunteer, leadership, and work experience are a plus",
      "Ties to PA-06 are also a plus"
    ],
    "how_to_apply": "To apply, please send 1) a resume, 2) ONE brief paragraph about yourself and why you’re interested in interning in our office, 3) a writing sample, and 4) one example of digital work (video, graphic or photo) to PA06Press.Interships@mail.house.gov.",
    "salary_info": null,
    "contact": "PA06Press.Interships@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-379-24",
    "position_title": "Legislative Intern",
    "office": "Office of Representative Chrissy Houlahan (D-PA-06)",
    "location": "West Chester, Reading, and Washington, D.C.",
    "posting_date": "2024-10-14",
    "description": "The Ogice of Representative Chrissy Houlahan (D-PA-06) is accepting applications for Spring 2025 legislative interns in our West Chester, Reading, and Washington, D.C. ogices. This internship will run from early January through late May.\n\nBoth full and part time internships are available, and we oger needs-based stipends to students who are Pell Grant eligible. Our internship program has returned to in-person work with ﬂexible telework options.\n\nIdeal applicants are self-starters who bring a customer service mindset and a passion for community service. Applicants must be intellectually curious, willing to spend a lot of time on the phone and write well.",
    "responsibilities": [
      "Helping constituents",
      "Doing research and drafting memos for our legislative stag",
      "Staging the Congresswoman in hearings or meetings"
    ],
    "qualifications": [
      "Prior volunteer, leadership, and work experience are a plus.",
      "Ties to PA-06 are also a plus."
    ],
    "how_to_apply": "Please submit applications through the “Legislative Internship” form our website, Houlahan.house.gov.",
    "salary_info": "needs-based stipends to students who are Pell Grant eligible",
    "contact": null,
    "equal_opportunity": "This ogice is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identiﬁcation, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  }
]