[
  {
    "id": "MEM-449-23",
    "position_title": "STAFF ASSISTANT",
    "office": "Representative Anna G. Eshoo (D-CA-16)",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "Representative Anna G. Eshoo (D-CA-16) seeks a\nStaff Assistant to serve in her Washington, D.C. office. Candidates should be detail-oriented professionals with strong\norganizational skills and writing abilities, have a positive attitude, take pride\nin their work product, and thrive in a fast-paced environment. Applicants\nmust also have a car and a valid driver's license.",
    "responsibilities": [
      "Answering telephones",
      "Greeting visitors",
      "Processing flag and tour requests",
      "Drafting correspondence",
      "Driving the Member",
      "Serving as Intern Coordinator"
    ],
    "qualifications": [
      "detail-oriented professionals with strong organizational skills and writing abilities",
      "positive attitude",
      "take pride in their work product",
      "thrive in a fast-paced environment",
      "have a car and a valid driver's license"
    ],
    "how_to_apply": "To apply, please email a cover letter and resume\nto CA16Resumes@gmail.com no later than September 1, 2023. No phone calls or\nwalk-ins, please.",
    "salary_info": null,
    "contact": "CA16Resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity, national\norigin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-448-23",
    "position_title": "Professional Staff Member",
    "office": "House Armed Services Committee Democrats",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "The House Armed Services Committee Democrats are seeking a Professional Staff Member for the Military Personnel Subcommittee.\n\nThe Military Personnel Subcommittee jurisdiction includes: policy and programs and accounts related to military personnel and their families, Reserve Component integration and employment, military health care, military education, dependent schools, POW/MIA issues, Morale, Welfare and Recreation, commissaries, cemeteries under the jurisdiction of the Department of Defense, the Uniform Code of Military Justice, military retirement issues, and the civilian and contract workforce.\n\nThis is not an entry level position. Candidates with a law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred. The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees. A successful candidate will be required to obtain and maintain a security clearance.",
    "responsibilities": [
      "Advising Members of Congress on military justice and other military personnel policy matters",
      "Evaluating budget requests and legislative proposals",
      "Preparing for committee hearings and briefings",
      "Developing and drafting proposal for inclusion in the annual National Defense Authorization Act"
    ],
    "qualifications": [
      "Law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred",
      "Successful candidate will be required to obtain and maintain a security clearance"
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, to hasc.dememployment@mail.house.gov with the subject line: “Full Name – PSM – Military Personnel.” We will accept applications until the position is filled.",
    "salary_info": null,
    "contact": "hasc.dememployment@mail.house.gov",
    "equal_opportunity": "The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees."
  },
  {
    "id": "MEM-447-23",
    "position_title": "Press Assistant",
    "office": "Pennsylvania Republican",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "The Press Assistant will report directly to the Communications Director. The ideal candidate should be hardworking, able to juggle multiple projects at once, and demonstrate a proficiency in writing, editing, and digital/social media content creation. Pennsylvania ties preferred but not required.",
    "responsibilities": [
      "Assisting the Communications Director in drafting and editing written materials such as the press releases, statements, Floor speeches, op-eds, and e-mailers",
      "Managing the Member’s social media pages and drafting content for those platforms",
      "Updating the Member’s official website",
      "Working with the Communications Director to execute short and long-term communications strategies."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, email cover letter, resume, and two writing samples to PaPressAssistantJob@gmail.com.",
    "salary_info": null,
    "contact": "PaPressAssistantJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-446-23",
    "position_title": "Military Legislative Assistant",
    "office": "Office of Congressman Frank J. Mrvan",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "The Military Legislative Assistant (MLA) is responsible in the personal office for\nmanaging the Congressman's responsibilities as a Member of the House\nCommittee on Veterans' Affairs and the Ranking Member of the Subcommittee\non Oversight and Investigations. The MLA is also responsible for legislative\nissues related to national security, foreign affairs, and other assigned issue areas,\nincluding the drafting of prep material, constituent correspondence, and meeting\nwith constituent and special interest groups under these issue areas on behalf of\nthe Member.\n\nCandidate must be highly dependable, detail-focused, value responsiveness to\nconstituents, and have superior organizational and writing skills. Knowledge of\nthe legislative process and Indiana ties are a plus. Minority and veteran\ncandidates are encouraged to apply.",
    "responsibilities": [
      "In a timely fashion, completes research and draft responses to constituents letters on federal matters;",
      "Formulates legislative initiatives for assigned issue areas including deceiving legislative plans, drafting the plan into legislative form, coordinating the support and advancement of the plan with personal office, Committee office, other Member offices and outside stakeholders.",
      "Tracks legislation and other developments in his or her assigned issue areas and briefs the Member for floor work, committee work, and work in the district,",
      "Plans and coordinates co-sponsorship and support of other legislation recommendations in coordination with the Legislative Director;",
      "Monitors legislation on the House floor and makes vote recommendations in coordination with the Legislative Director;",
      "Ability to work cooperatively and courteously with others;",
      "Maintains a good working relationship with the Congressman, staff and constituents;",
      "Accepts performance based criticism and direction;",
      "Meets attendance requirements as established by the office;",
      "Works well under pressure and handles stress; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Excellent organizational and proofreading skills;",
      "Ability to perform essential job functions above;",
      "Professional telephone manner;",
      "Ability to work cooperatively and courteously with others;",
      "Knowledge of office policies, practices, and procedures; and",
      "Knowledge of office computer applications."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and two writing samples\nto Kevin.Spicer@mail.house.gov with “Military Legislative Assistant” in the\nsubject line.",
    "salary_info": null,
    "contact": "Kevin.Spicer@mail.house.gov",
    "equal_opportunity": "Minority and veteran candidates are encouraged to apply."
  },
  {
    "id": "MEM-445-23",
    "position_title": "Press Assistant/Digital Specialist",
    "office": "Rep. Jonathan L. Jackson (D-IL-01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "The Office of U.S. Representative Jonathan L. Jackson (D-IL-01) has an immediate need to hire an experienced full-time Press Assistant/Digital Specialist in the Washington, D.C., office. Interested candidates are encouraged to submit a cover letter, a writing sample, a list of three references, and a resume by Thursday, August 31, 2023. Applications will be considered on a rolling basis.\n\nThe Press Assistant/Digital Specialist develops media advisories, press releases, speeches, talking points, op-eds, digital content, and other materials for the Member. The Press Assistant/Digital Specialist also responds to inquiries from the local and national media for background purposes and to provide official statements from the Member. This position also assists the Communications Director with development and implementation of the Member’s communications and media strategy.",
    "responsibilities": [
      "Works with key staff to develop and implement a comprehensive communications and media strategy that promotes the Member’s policies and priorities",
      "Manages all social media channels and web content to ensure all platforms are adequately maintained and up to date",
      "Drafts news releases, advisories, talking points, op-eds, and other materials",
      "Stays informed on the current issues impacting the Member and their district and anticipates any inquiries from the press",
      "Monitors news to determine how the Member and their agenda is portrayed by the media",
      "Prepares the Member for all interviews, including TV, radio, print, and other public appearances",
      "Builds relationships with local and national reporters to book the member for media spots",
      "Oversees the creation of the Member’s newsletters and questionnaires to ensure materials are distributed as planned"
    ],
    "qualifications": [
      "Experience producing communications for social media and evaluating message effectiveness",
      "Able to manage varying priorities and balance multiple deadlines",
      "Able to work in a fast-paced environment under tight timelines",
      "Experience managing relationships with members of the media",
      "Experience developing a communications strategy for a Member of Congress, or a public, private, or non-profit organization",
      "Strong written and verbal communication skills",
      "Ability to develop and apply creative solutions to enhance messaging strategies",
      "Attention to detail"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, a writing sample, a list of three references, and a resume by Thursday, August 31, 2023, to LaTreshia Hamilton at LaTreshia.Hamilton01@mail.house.gov. Incomplete applications will not be considered.",
    "salary_info": "$50,000 to $60,000",
    "contact": "LaTreshia.Hamilton01@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-444-23",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space, and Technology",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "Ranking Member Zoe Lofgren of the House Committee on Science, Space, and Technology seeks to fill Professional Staff Member position on the Committee.\n\nDuties include oversight of the Department of Energy (DOE) and other agencies within the Committee's jurisdiction, outreach to stakeholder groups, researching and drafting legislation, staffing hearings, and preparing memoranda, statements, and speeches for Democratic Members. Applicants should have experience in at least one or both of the following subject matter areas: 1) science and energy research and technology development activities carried out by DOE, 2) energy and related environmental policy.\n\nAll applicants should possess strong writing, organizational, and communication skills; the capacity to articulate technical and policy issues clearly and concisely; and the ability to meet tight deadlines. The ideal candidate will have significant Capitol Hill or relevant government or industry experience. An advanced degree or technical background is a plus, but not required.",
    "responsibilities": [
      "Oversight of the Department of Energy (DOE) and other agencies within the Committee’s jurisdiction",
      "Outreach to stakeholder groups",
      "Researching and drafting legislation",
      "Staffing hearings",
      "Preparing memoranda, statements, and speeches for Democratic Members"
    ],
    "qualifications": [
      "Experience in at least one or both of the following subject matter areas: 1) science and energy research and technology development activities carried out by DOE, 2) energy and related environmental policy.",
      "Strong writing, organizational, and communication skills",
      "Capacity to articulate technical and policy issues clearly and concisely",
      "Ability to meet tight deadlines",
      "Significant Capitol Hill or relevant government or industry experience (ideal)",
      "Advanced degree or technical background (a plus)"
    ],
    "how_to_apply": "Please send a cover letter and resume to SciResumes@mail.house.gov. This not an entry-level position.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-443-23",
    "position_title": "Special Assistant",
    "office": "Representative Elissa Slotkin",
    "location": "Lansing, Michigan",
    "posting_date": "2023-08-21",
    "description": "The Special Assistant will report to the District Director.",
    "responsibilities": [
      "Managing all Michigan scheduling for Representative Slotkin, coordinating closely with the Washington, DC-based Director of Operations;",
      "Staffing Representative Slotkin as appropriate;",
      "Assisting the District Office leadership team with general office management and special projects;",
      "Representing the Office of Representative Slotkin at some community events in the Lansing area;",
      "Additional projects as assigned by the District Office leadership team."
    ],
    "qualifications": [
      "Candidates should be college graduates and have a strong desire to learn how Congress works by joining a dynamic office. Ideal candidates are:",
      "Experienced in scheduling and/or directly supporting a senior leader;",
      "Hardworking and detail-oriented self-starters;",
      "Team players, able to work both collaboratively and individually;",
      "Excellent oral and written communicators;",
      "Able to produce high quality work in a fast-paced environment under tight deadlines;",
      "Enthusiastic, collegial, and professional."
    ],
    "how_to_apply": "Interested candidates should submit a resume with two professional references, a cover letter, and one writing sample of 1,000 words to “jobs.mi07@mail.house.gov”.",
    "salary_info": null,
    "contact": "jobs.mi07@mail.house.gov",
    "equal_opportunity": "The Office of U.S. Representative Elissa Slotkin is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-442-23",
    "position_title": "Chief of Staff",
    "office": "Southern California Democrat",
    "location": "Washington DC",
    "posting_date": "2023-08-21",
    "description": "The Chief of Staff will work with the Member to determine the overall strategies of the office. This includes, but is not limited to, formulating policy positions, overseeing the office’s legislative and media relations strategies, and collaborating with District staff on important local outreach and communication efforts.\n\nIn addition, the Chief of Staff will provide leadership and guidance to structure the office to provide outstanding constituent relations.\n\nThe Chief of Staff will also oversee all recruiting and hiring efforts, the establishment of office policies and procedures, and perform other critical functions to support legislative and administrative operations and advocacies.\n\nFinally, the Chief of Staff will have direct supervision over the Legislative Director, Communications Director, District Director, and Scheduler.\n\nThe position requires the ability to multi-task, work well under pressure and the flexibility to work long hours, including nights and weekends. Strong managerial skills, strategic thinking, mission driven passion, and ties to Southern California are preferred.\n\nThis is NOT an entry-level position.",
    "responsibilities": [
      "Determine the overall strategies of the office",
      "Formulating policy positions",
      "Overseeing the office’s legislative and media relations strategies",
      "Collaborating with District staff on important local outreach and communication efforts",
      "Provide leadership and guidance to structure the office to provide outstanding constituent relations",
      "Oversee all recruiting and hiring efforts",
      "Establishment of office policies and procedures",
      "Perform other critical functions to support legislative and administrative operations and advocacies",
      "Direct supervision over the Legislative Director, Communications Director, District Director, and Scheduler"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Work well under pressure",
      "Flexibility to work long hours, including nights and weekends",
      "Strong managerial skills preferred",
      "Strategic thinking preferred",
      "Mission driven passion preferred",
      "Ties to Southern California are preferred"
    ],
    "how_to_apply": "To apply for the Chief of Staff position, please send cover letter and resume to CARuizJobs@mail.house.gov with “Chief of Staff” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "CARuizJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-441-23",
    "position_title": "Civil Rights Counsel",
    "office": "House Committee on Education and the Workforce (Democratic staff)",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "Candidates should have familiarity with employment federal civil rights laws, such as Title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act, the Equal Pay Act of 1963 and Title 42, Chapter 21 of the U.S. Code. Knowledge of the EEOC, OFCCP and federal statutes and policies and how they impact civil rights in employment and health care is preferred.\n\nApplicants should have a law degree and experience working with an organization, Congress, or government agency addressing civil rights.\n\nDuties will include supporting the development of legislation, providing technical assistance to the Committee and Member offices, researching pertinent issues, preparing written materials and legislative analyses, and supporting the execution of committee proceedings and events related to civil rights. Salary commensurate with experience.",
    "responsibilities": [
      "supporting the development of legislation",
      "providing technical assistance to the Committee and Member offices",
      "researching pertinent issues",
      "preparing written materials and legislative analyses",
      "supporting the execution of committee proceedings and events related to civil rights"
    ],
    "qualifications": [
      "familiarity with employment federal civil rights laws, such as Title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act, the Equal Pay Act of 1963 and Title 42, Chapter 21 of the U.S. Code",
      "Knowledge of the EEOC, OFCCP and federal statutes and policies and how they impact civil rights in employment and health care is preferred",
      "law degree and experience working with an organization, Congress, or government agency addressing civil rights"
    ],
    "how_to_apply": "To apply, applicants must submit a resume and two short writing samples demonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with \"Civil Rights Counsel Position\" in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-439-23",
    "position_title": "Communications Director",
    "office": "Democratic Staff of the House Committee on Budget",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "The Democratic Staff of the House Committee on Budget is seeking a highly experienced, motivated, and creative Communications Director to lead its fastpaced communications shop. Strong relationships with national press, producers and bookers, and stakeholders, as well as meaningful management experience is necessary. Prior knowledge of the budget and appropriations process is a plus. This is not an entry-level position.\n\nThe individual selected will have exceptional writing and editing skills, a keen attention to detail, and the ability to translate complex issues and topics for various audiences across platforms and medias. The ideal candidate will have at least 5 years of communications work experience including time on Capitol Hill, with a non-profit, government agency, or in the private sector.",
    "responsibilities": [
      "Develop strategic communications plans for the committee, leading the communications team and working closely with the Ranking Member’s personal office, committee professional staff, and across offices to implement successful media strategies to roll out reports, commentary, legislation, send letters, and make other major announcements;",
      "Manage, mentor, and grow the Committee’s communications team, focusing on staff professional development, skill building, and efficient workflows;",
      "Build and sustain strong relationships with local, national, and budget-specific print, radio, and broadcast media (reporters, producers, editors, columnists, etc), and remain ready to identify creative ways to pitch the Ranking Member and garner media attention for Committee work;",
      "Lead the communications team in drafting messaging resources and toolkits on committee work and accomplishments for Committee Members and the Caucus;",
      "Assist with planning and staffing D.C.- and district-based events related to committee work, such as press conferences and roundtables;",
      "Prepare, brief, and staff the Ranking Member for media interviews, press conferences, roundtables, and other engagements;",
      "Draft and edit committee materials, talking points, speeches, press releases, opeds, and other materials as necessary; and",
      "Speak on background or on the record with reporters when necessary and act as a media liaison for the Ranking Member."
    ],
    "qualifications": [
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Experience managing others and promoting professional development;",
      "Deep understanding of print, broadcast, and online media and how to successfully create and leverage opportunities in each;",
      "Expertise in advising others on a communication strategy and ability to collaborate well with issue experts and other coworkers;",
      "Strategic thinker, politically savvy, and ability to manage competing priorities and develop solutions under tight deadlines;",
      "Ability to work well with others, willingness to take initiative, manage competing priorities, and turn around high-quality products under tight deadlines are a must; and",
      "Works a flexible schedule, including long hours on nights and weekends."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter describing their fit for the role, a resume, and three writing samples to budgetdemocrat.jobs@mail.house.gov with “[NAME] – HBC Communications Director” in the subject line. Please apply no later than Friday, August 25, 2023. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "budgetdemocrat.jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer with a team that highly values mentorship and professional development; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status.\n\nCandidates with diverse backgrounds, women, people of color, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-438-23",
    "position_title": "Legislative Correspondent",
    "office": "Office of Congresswoman Katie Porter",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "The Office of Congresswoman Katie Porter seeks a legislative correspondent to respond to constituent inquiries, provide constituents with written updates on policy developments, administer the office’s legislative systems and processes, and develop original legislative and oversight work.\n\nThe ideal candidate will have at least two years of relevant professional experience, a strong understanding of congressional processes and procedures, and a sharp attention to detail. The salary for this position is $55,000 to $60,000.",
    "responsibilities": [
      "Organize incoming and outgoing mail and communicate progress in responding to messages through regular reports to the Member of Congress and staff.",
      "Organize and distribute messages to legislative and district staff to complete personal responses to individual constituents when appropriate.",
      "Draft and edit form letters to respond to constituent concerns and respond personally to constituent messages when appropriate.",
      "Develop proactive correspondence to communicate policy developments to constituents.",
      "Track all legislative requests and accomplishments and organize legislative systems and processes.",
      "Take in person and virtual meetings with constituents and stakeholder groups.",
      "Support the office with drafting and editing memos, oversight letters, op-eds, talking points, speeches, and legislation.",
      "Provide other legislative and administrative support and complete duties as assigned by the Deputy Chief of Staff & Legislative Director and Chief of Staff."
    ],
    "qualifications": [
      "At least two years of relevant professional experience",
      "A strong understanding of congressional processes and procedures",
      "A sharp attention to detail"
    ],
    "how_to_apply": "To apply, send a resume and a short writing sample to CA47.Resumes@mail.house.gov with “Legislative Correspondent” in the subject line. Applications will be accepted until the position is filled.",
    "salary_info": "$55,000 to $60,000",
    "contact": "CA47.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, ethnicity, color, religion, sex, national origin, age, family status, military status, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-436-23",
    "position_title": "Staff Assistant",
    "office": "Senior Republican Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "Primary responsibilities include answering phones, processing mail, meeting and greeting visitors to the office, processing flag and tour requests, and supporting staff with a variety of tasks, including driving the Member to appointments.\n\nIdeal candidates must have excellent organizational, time management and problem-solving skills. Must be comfortable working in a fast-paced environment both independently and as part of a team. Pennsylvania ties and a sense of humor are preferred, but not required.",
    "responsibilities": [
      "Answering phones",
      "Processing mail",
      "Meeting and greeting visitors to the office",
      "Processing flag and tour requests",
      "Supporting staff with a variety of tasks, including driving the Member to appointments"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Excellent time management skills",
      "Excellent problem-solving skills",
      "Comfortable working in a fast-paced environment both independently and as part of a team",
      "Pennsylvania ties (preferred)",
      "Sense of humor (preferred)"
    ],
    "how_to_apply": "Send resumes to Renee.Gamela@mail.house.gov with the subject line: PA Staff Assistant. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "Renee.Gamela@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-435-23",
    "position_title": "Senior Legislative Assistant",
    "office": "The Office of Congresswoman Barbara Lee",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "The Office of Congresswoman Barbara Lee - a senior progressive appropriator and member of House leadership - seeks an experienced, highly-motivated Senior Legislative Assistant.\n\nThe Senior LA will be responsible for handling the following issues areas and caucuses, with some flexibility: LHHSED Approps Subcommittee and issues (Health, Labor, Education), Ag Approps Subcommittee and issues,CAPAC Health Task Force, Health Equity and Accountability Act, HIV Caucus, CBC Domestic Health Task Force, Sickle Cell Caucus, Poverty Task Force\n\nThe Senior Legislative Assistant will be responsible for jumping in to handle Farm Bill priorities amid ongoing negotiations and will ideally overlap with the outgoing Sr. Legislative Assistant for 1-2 weeks in late August/early September.",
    "responsibilities": [
      "Drafting and advancing legislative proposals",
      "Preparing the Member for hearings and markups",
      "Meeting with stakeholders and constituents",
      "Providing vote recommendations",
      "Performing additional tasks as assigned"
    ],
    "qualifications": [
      "Experience in health policy",
      "Hill experience",
      "Strong writing and analytical skills",
      "Ability to operate with grace and humor in a fast-paced environment",
      "Experience in an Appropriator office (advantage)",
      "Ties to California (advantage)",
      "Advanced education (advantage)"
    ],
    "how_to_apply": "Applicants should email a cover letter, resume, one writing sample, and three references to Lee.resumes@mail.house.gov with “Sr. Legislative Assistant – [Last Name]” as the subject line.",
    "salary_info": "Starting salary is $85,000 for Senior Legislative Assistants; prior experience as a Legislative Assistant is required for the Senior title.",
    "contact": "Lee.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal-opportunity employer. We do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-434-23",
    "position_title": "Communications Director",
    "office": "Congresswoman Lois Frankel (FL-22)",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "Congresswoman Lois Frankel (FL-22) is hiring a Communications Director to lead, manage, and execute a fast-paced and proactive communications operation.\n\nThe Communications Director will work closely with the Member and staff and manage a Press Secretary. Occasional travel to the District will be necessary.\n\nThis is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [
      "Strong writing and editing skills",
      "High proficiency with social media platforms",
      "Creativity",
      "An understanding of local and national issues",
      "Experience communicating with local and national press",
      "Experience managing press events"
    ],
    "how_to_apply": "Please complete the google form at tinyurl.com/FL22CD Monday, August 28th at 5:00 PM. Applications will be reviewed on a rolling basis.",
    "salary_info": "$85,000 - $95,000 depending on experience, and includes health insurance, student loan repayment, and other competitive benefits",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-433-23",
    "position_title": "Scheduler",
    "office": "Rep. Josh Gottheimer",
    "location": "DC",
    "posting_date": "2023-08-21",
    "description": "Rep. Josh Gottheimer seeks qualified candidates for the position of Scheduler in his DC office.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term District schedule.",
      "Supporting the operations team across DC and District needs.",
      "Working with a variety of stakeholders to balance the Member’s time between commitments.",
      "Working with the scheduling team to evaluate incoming requests and invitations.",
      "Working with the operations team to ensure that briefing materials are provided for each event and meeting.",
      "Coordinating travel arrangements.",
      "Assisting with office management responsibilities, and performing other duties as required."
    ],
    "qualifications": [
      "Experience in a Congressional office, on a political campaign, or in another fastpaced administrative environment, with a strong preference for past Congressional experience.",
      "Excellent attention to detail, and strong organizational skills.",
      "Sound judgment.",
      "Strong communication skills.",
      "The ability to anticipate challenges and proactively offer solutions.",
      "The ability to thrive in a fast-paced environment.",
      "The ability to work flexible hours including weekends and evenings."
    ],
    "how_to_apply": "Please send a resume and cover letter with “Scheduler - Last Name” as the subject line to NJ5Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, and LGBTQ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-431-23",
    "position_title": "Scheduler",
    "office": "Congresswoman Bonamici",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "Main responsibilities will include organizing and tracking invitations, speaking engagements, and scheduling requests for the Member and staff, booking travel reservations, reserving briefing rooms, managing White House tour requests using TourTrackr, drafting correspondence for member, and coordinating closely with district office team.\n\nAdditionally, the scheduler will work closely with the chief of staff to ensure smooth overall D.C. office/staff operations. Ideal candidates will remain flexible and calm under pressure, have excellent written and verbal communications skills, strong interpersonal skills, and must be able to navigate competing demands while anticipating the Member's needs.\n\nThis position will include driving the member in D.C. in the member's car, a valid driver's license is required. Some non-traditional hours are needed when booking last-minute travel.",
    "responsibilities": [
      "Organizing and tracking invitations, speaking engagements, and scheduling requests for the Member and staff",
      "Booking travel reservations",
      "Reserving briefing rooms",
      "Managing White House tour requests using TourTrackr",
      "Drafting correspondence for member",
      "Coordinating closely with district office team",
      "Working closely with the chief of staff to ensure smooth overall D.C. office/staff operations"
    ],
    "qualifications": [
      "Remain flexible and calm under pressure",
      "Excellent written and verbal communications skills",
      "Strong interpersonal skills",
      "Able to navigate competing demands while anticipating the Member's needs",
      "Valid driver's license"
    ],
    "how_to_apply": "Please email resume and cover letter to Rachael.Bornstein@mail.house.gov.",
    "salary_info": "$55-$58K + annual bonus, commuter/parking benefits, health insurance benefits, student loan reimbursement",
    "contact": "Rachael.Bornstein@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQIA+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Oregon ties are a plus."
  },
  {
    "id": "MEM-430-23",
    "position_title": "Legislative Director",
    "office": "Congresswoman Summer Lee (D-Pittsburgh)",
    "location": "Washington D.C.",
    "posting_date": "2023-08-21",
    "description": "The Legislative Director plays an essential leadership role in the office by working closely with the Chief of Staff in assisting with the formulation of the Member’s policy and legislative strategy. The Legislative Director will maintain status reports on all legislation affecting the district and legislation in which the Member is a principal sponsor or cosponsor. The Legislative Director may also manage and oversee the performance of the legislative team (e.g., legislative assistant, legislative correspondent). Congresswoman Lee currently sits on the House Committee on Oversight and Accountability and the House Committee on Science, Space, and Technology and has a long-term interest to join the House Judiciary Committee and the House Committee on Energy and Commerce.",
    "responsibilities": [
      "Advises the Member on all legislative policy areas",
      "Assists in the development of policy positions and legislative initiatives",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation in which the member is a principal sponsor, or legislation which the Member is a cosponsor",
      "Monitors and reports floor action to the Member and the Chief of Staff",
      "Manages and supervises the Member’s legislative staff",
      "Coordinates responses to all legislative mail"
    ],
    "qualifications": [
      "Experience researching public policy and preparing legislative recommendations for a Member of Congress required",
      "Deep understanding of House floor and committee procedures",
      "Strong written and verbal communication skills",
      "Politically savvy and able to navigate challenging situations",
      "Experience collaborating and forming partnerships to advance legislative agendas",
      "Comfortable making swift decisions and advising a Member of Congress on important issues",
      "Able to manage a team of staff members and accomplish desired outcomes",
      "Strong time management and organization skills"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume by 8/22 to Wasi.Mohamed@mail.house.gov. Please add PA-12 Legislative Director to the subject line.",
    "salary_info": "Commensurate with Experience",
    "contact": "Wasi.Mohamed@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-424-23",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "The Legislative Assistant will help implement the Member’s agenda within the Appropriations Committee and across authorizing committees and manage a portfolio including, but not limited to, health care, financial services, transportation, and infrastructure issues.\n\nThis is not an entry-level position and sound policy judgement is required.\n\nCandidate should have a strong track record of translating policy priorities into successful legislative outcomes and developing proactive relationships with onand off-Hill stakeholders.\n\nCandidate will be expected to frequently brief and staff the Member and demonstrate strong verbal communication skills. Candidate should also be coachable, responsive to feedback, and enjoy working in a team-first, collaborative work environment. Candidate will work directly with the Congresswoman, Chief of Staff, Legislative Director, and intra- and interdepartmental peers to advance the Congresswoman’s authorizing and appropriations priorities. Nevada ties are a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, send in a single PDF a resume, cover letter, writing sample of 1,000 words or fewer, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to nv03resumes@gmail.com with the following subject line: “Full Name – Legislative Assistant.”",
    "salary_info": null,
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-422-23",
    "position_title": "Digital Director / Press Secretary",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": "Capitol Hill",
    "posting_date": "2023-08-21",
    "description": "Congressman Mark Pocan (WI-02), member the House Appropriations Committee, is seeking a highly motivated, detail-orientated, and energetic individual with experience in digital media strategy and video editing for a Digital Director / Press Secretary position.\n\nDaily tasks include managing and creating a steady stream of digital content for member’s social media platforms and website; graphic design; video filming and editing; daily press clips; managing in-district media relations; drafting releases, newsletters and advisories; and organizing press events. The ideal candidate will be creative, have a strong proficiency in crafting digital content, experience coordinating with media, and be a detail-oriented team player able to handle multiple tasks at once.\n\nExcellent writing and strong organizational skills are essential, along with the ability to be a self-starter while working in a fast-paced environment. Capitol Hill experience is a plus, but not required. A sense of humor is greatly appreciated, and the position reports to the Communications Director.",
    "responsibilities": [
      "Managing and creating a steady stream of digital content for member’s social media platforms and website",
      "Graphic design",
      "Video filming and editing",
      "Daily press clips",
      "Managing in-district media relations",
      "Drafting releases, newsletters and advisories",
      "Organizing press events"
    ],
    "qualifications": [
      "Creative",
      "Strong proficiency in crafting digital content",
      "Experience coordinating with media",
      "Detail-oriented team player",
      "Ability to handle multiple tasks at once",
      "Excellent writing and strong organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast-paced environment",
      "Capitol Hill experience is a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples, and an example of previous digital media or graphic design projects to WI02JobOpening@gmail.com with “Digital Director / Press Secretary” in the subject line. Job opening closes COB on Friday, August 25th. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-419-23",
    "position_title": "Digital Assistant",
    "office": "Office of Congresswoman Summer Lee",
    "location": "Washington, D.C",
    "posting_date": "2023-08-21",
    "description": "The Office of Congresswoman Summer Lee seeks a highly motivated digital assistant to support the Communications Director in all aspects of the office’s fast-paced and dynamic communications operation, including executing day to day social media and rapid response, helping develop social media strategy, designing social media and digital content for the Congresswoman, and media monitoring. This role reports to the Communications Director. Progressive values, creativity, and ability to respond rapidly are a must.",
    "responsibilities": [
      "Support implementation of digital communications and public relations strategies for the Congresswoman;",
      "Compile daily press clips and stay informed about current events in the district and across the country for their impact on the Congresswoman;",
      "Draft social media content and other written materials, and manage all of the Congresswoman’s social media accounts (twitter, Instagram, FB, Tiktok)",
      "Develop branding guide, create graphics, film and edit photos and videos, including clipping, captioning and branding;",
      "Manage the Congresswoman’s website and set up robust digital archives and analytics trackers for the Congresswoman;",
      "Staff digital events and video recordings with the Congresswoman;",
      "Support with logistics for town halls, press conferences, and other public-facing engagements, both virtual and in-person;",
      "Remain abreast of current legislative and non-legislative issues about which the Congresswoman may be questioned;",
      "Support on administrative functions of the office as needed, such as constituent calls and data entry;",
      "Maintain a good working relationship with the Congresswoman, staff, and constituents;",
      "Work well under pressure, handle stress, and accept performance-based criticism and direction;",
      "Work flexible schedule including long hours, nights and weekends, and perform other duties as assigned."
    ],
    "qualifications": [
      "Strong sense of virality on social media; narrative voice",
      "Ability to perform rapid response based on breaking news, memes and trends",
      "Proven track record developing and executing multi-platform communications and digital campaigns",
      "Writing, editing, and proofreading - especially social media posts",
      "Experience creating content using Adobe Suite (Illustrator, Photoshop and Premiere or Premiere Rush) – or equivalent tools",
      "Strong organizational skills, and ability to manage multiple tasks at once;",
      "Knowledge of news cycle and current issues and events in which the Congresswoman is involved;",
      "Ability to work cooperatively and courteously with others."
    ],
    "how_to_apply": "Please submit your resume, cover letter expanding on how your unique set of experiences suits you to excel in this role, 3 digital/creative samples and 3 references to SummerLeeJobs@mail.house.gov with the subject line “Digital/Press Associate” Digital portfolios or websites also accepted for creative samples.",
    "salary_info": "commensurate with experience, along with a competitive benefits package that includes health insurance, dental, federal student loan payments (terms apply)",
    "contact": "SummerLeeJobs@mail.house.gov",
    "equal_opportunity": "Our office prioritizes building a diverse team committed to advocating for the residents of PA-12. 1-3 years of digital, graphic design, press, organizing, or advocacy experience is strongly recommended. Candidates from BIPOC, LGBTQ+, working class, military, and/or other underrepresented communities are strongly encouraged to apply. As a practice as an office we do not require any pre-requisite degrees. Ties to Pennsylvania preferred, but not required."
  },
  {
    "id": "MEM-405-23",
    "position_title": "Legislative Assistant or Senior Legislative Assistant",
    "office": "Representative Mike Levin (CA-49)",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "Representative Mike Levin (CA-49) seeks a Legislative Assistant or Senior Legislative Assistant for a policy portfolio that includes energy, environment, and climate change issues. The policy portfolio includes his work on the House Natural Resources Committee, and key priorities including climate action, clean energy, spent nuclear fuel, and clean transportation. The portfolio will also include other policy issues as needed.\n\nThis legislative staffer will work with the Legislative Director and Chief of Staff to advance and execute the Congressman’s legislative agenda both on and off committee. Responsibilities include staffing the Congressman at hearings and markups; developing and analyzing legislation and policy; drafting remarks, hearing questions, talking points, and memos; maintaining strong relationships with constituent and stakeholder groups; drafting letters to stakeholders, the Administration, and other Members; and staffing the Congressman in meetings and at other events.",
    "responsibilities": [
      "Staffing the Congressman at hearings and markups",
      "Developing and analyzing legislation and policy",
      "Drafting remarks, hearing questions, talking points, and memos",
      "Maintaining strong relationships with constituent and stakeholder groups",
      "Drafting letters to stakeholders, the Administration, and other Members",
      "Staffing the Congressman in meetings and at other events"
    ],
    "qualifications": [
      "Experience working on environment policy issues",
      "Strong written and verbal communications skills",
      "Knowledge of House legislative processes",
      "Sound political judgment",
      "Willing team member",
      "State or district ties and prior legislative experience in a House or Senate office are a plus"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two writing samples, and a list of three references to ca49.applications@mail.house.gov with “Environment Legislative Assistant” in the subject line. Please send all materials in one PDF document. Incomplete applications will not be considered.",
    "salary_info": "$60,000-$75,000, commensurate with experience.",
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-402-23",
    "position_title": "Communications Director",
    "office": null,
    "location": null,
    "posting_date": "2023-08-21",
    "description": "DUTIES:\n•develops and implements media and communications strategy for the Member;\n•tracks current legislative and non-legislative issues about which the Member\nmay be questioned;\n•evaluates current events and media reports in the district and the nation for their\nimpact on the Member;\n•provides ideas and advice on the effect in the media of the Member's actions and\nlegislative activities;\n•writes remarks for the Member; and\n•performs other duties as assigned.\nApplicants should send a cover letter and resume with “Communications\nDirector” in the subject line to resume.JeffJackson@mail.house.gov.",
    "responsibilities": [
      "to manage and coordinate communications activities, including pitching media contacts, for the Member and the office",
      "to help lead a robust franking program"
    ],
    "qualifications": [
      "at least one year of congressional experience",
      "strong writing, editing, and proofreading skills",
      "strong relationships with reporters and ability to regularly pitch stories",
      "understanding of print, digital, and broadcast media",
      "knowledge of current issues and events in which the Member is involved",
      "ability to work well under pressure and to work cooperatively and courteously with others"
    ],
    "how_to_apply": "Applicants should send a cover letter and resume with “Communications Director” in the subject line to resume.JeffJackson@mail.house.gov.",
    "salary_info": null,
    "contact": "resume.JeffJackson@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-401-23",
    "position_title": "Staff Assistant",
    "office": "Representative Mike Levin (CA-49)",
    "location": "Washington, DC",
    "posting_date": "2023-08-21",
    "description": "This position is responsible for managing the front desk, answering the DC office phones, operating the DC office internship program, coordinating constituents’ tour and flag requests, planning and drafting basic correspondence, and handling additional administrative duties of the office as needed.\n\nThe staff member in this role interacts regularly with constituents and should have a friendly, helpful demeanor. The ideal candidate should have strong written and verbal communications skills, extreme attention to detail, and a positive attitude.\n\nThis staff member should also be a self-starter who likes to solve problems and works well with a team. Strong organizational skills and a passion for helping others are essential to this role.",
    "responsibilities": [
      "Managing the front desk",
      "Answering the DC office phones",
      "Operating the DC office internship program",
      "Coordinating constituents’ tour and flag requests",
      "Planning and drafting basic correspondence",
      "Handling additional administrative duties of the office as needed"
    ],
    "qualifications": [
      "Friendly, helpful demeanor",
      "Strong written and verbal communications skills",
      "Extreme attention to detail",
      "Positive attitude",
      "Working knowledge of legislative issues is a plus",
      "Self-starter who likes to solve problems",
      "Works well with a team",
      "Strong organizational skills",
      "Passion for helping others"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two writing samples, and a list of three references to ca49.applications@mail.house.gov with “Staff Assistant” in the subject line. Please send all materials in one PDF document. Incomplete applications will not be considered.",
    "salary_info": "$45,000-$50,000, commensurate with experience",
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-394-23",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee (MI-08)",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "The legislative assistant will be responsible for important issues areas such as worker and family support, education, labor, transportation, among other issues, in a fast-paced congressional office for a member of House Democratic Leadership on the Ways and Means Committee and Budget Committee.",
    "responsibilities": [
      "Drafting bills and amendments",
      "Developing strategic plans to advance legislation through Congress",
      "Staffing committee meetings",
      "Interacting with constituents and district stakeholders, committee/leadership committee staff and federal agencies",
      "Writing policy briefing memos and talking points"
    ],
    "qualifications": [
      "Self-starting personality",
      "Passion for public service",
      "Strong written and verbal communication skills",
      "Eagerness to work on a team in a collaborative office environment",
      "A minimum three years of relevant work experience is required",
      "Michigan ties preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to kildeejobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "kildeejobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-390-23",
    "position_title": "Assistant General Counsel",
    "office": "Office of General Counsel",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "The Office of General Counsel (\"OGC\"), which provides legal advice and representation to Members, committees, officers, and employees of the House on matters related to their official duties without regard to political affiliation, is accepting applications for the position of Assistant General Counsel.\n\nCore responsibilities include: drafting district court pleadings and appellate briefs; appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest; analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions; advising and counseling House Members, committees, officers, and employees on a wide range of legal issues; gathering facts necessary to permit OGC to provide sound legal advice; interacting with House leadership, committees, and other House offices; interacting with opposing counsel (both government and private); representing witnesses in connection with investigative proceedings; performing legal research on issues of constitutional, statutory, and common law; and working closely with other OGC attorneys and support staff in performing these functions.",
    "responsibilities": [
      "drafting district court pleadings and appellate briefs",
      "appearing in court in litigation matters in which the House or individual Members, officers, or employees have an official interest",
      "analyzing legal problems presented by House Members, committees, officers, and employees, and formulating recommended solutions",
      "advising and counseling House Members, committees, officers, and employees on a wide range of legal issues",
      "gathering facts necessary to permit OGC to provide sound legal advice",
      "interacting with House leadership, committees, and other House offices",
      "interacting with opposing counsel (both government and private)",
      "representing witnesses in connection with investigative proceedings",
      "performing legal research on issues of constitutional, statutory, and common law",
      "working closely with other OGC attorneys and support staff in performing these functions"
    ],
    "qualifications": [
      "excellent academic credentials",
      "at least one year of experience as a practicing attorney",
      "excellent writing, analytical, and people skills",
      "excellent judgment",
      "ability to work with, and to provide high quality legal advice and representation to, House Members, committees, officers, and employees, without regard to political affiliation",
      "appreciation of--or at least the desire to learn about and understand--the role and functioning of the Legislative Branch"
    ],
    "how_to_apply": "Email cover letter, resume, transcript, list of references, and writing sample to OGC.Employment@mail.house.gov. Application deadline, August 24, 2023.\nPlease include in the email subject line “Assistant General Counsel Vacancy.”",
    "salary_info": null,
    "contact": "OGC.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-360-23",
    "position_title": "Speechwriter",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "Congressman Glenn Ivey (MD-04) seeks a gifted writer with a strong sense of history and a knowledge of and familiarity with the great orators and speeches of our time.\n\nThe ideal candidate is a self-starter aware of the major issues and debates dominating the floor and capturing the public imagination. We are seeking someone who can generate ideas and develop clean, quality, and prompt drafts for One Minutes on a weekly basis, as well as delve into longer-form remarks out in the district that eschew platitudes but are strengthened by data and detailed policy solutions.\n\nA successful candidate need not have a depth of expertise in any one area but a working knowledge of many areas, a well-informed student of current events who is naturally curious and constantly learning. The position would additionally involve working on a portfolio of issues – meeting with advocacy groups in those areas and assisting the legislative team as projects come up – but an applicant should consider themself a writer first and foremost. Knowledge of the district is a plus.\n\nWorking for this freshman office represents an opportunity to build something dynamic and enduring from the ground up, particularly for a Member of Congress who is a great communicator and cares deeply about the well-being and professional development of his staff.",
    "responsibilities": [
      "Drafting remarks for events and the floor",
      "Drafting and editing correspondence to constituents and federal agencies",
      "Drafting statements for social media and press, including Op-Eds"
    ],
    "qualifications": [],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, and a writing portfolio (as many samples as you are proud to showcase) to md04resumes@gmail.com with the subject line: “Full Name – Speechwriter.” We will accept applications until the position is filled.",
    "salary_info": "Job title and pay will be commensurate with work experience. We are open to negotiation on whether the role can be full time or part time; whether it can be remote or in person.",
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an equal-opportunity employer that does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-359-23",
    "position_title": "Legislative Assistant/Counsel",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-08-21",
    "description": "Congressman Glenn Ivey (MD-04) seeks a seasoned legislative staffer for the Washington, D.C., office with a background in matters before the House Homeland Security and Judiciary Committees, preferably with a knowledge base in oversight and investigations. Candidates with a J.D. degree are strongly encouraged to apply, and experience working on legislation as a permanent staffer for a minimum of two years is required.\n\nThe ideal candidate is a student of politics and government who is well-versed in current events and possesses a working knowledge of a diverse array of issues. We are seeking a strong writer, particularly one adept at drafting powerful remarks for the floor, with a track record of successfully developing and advancing legislation, preparing and staffing the Member for committee hearings and markups, and managing a broad policy portfolio.",
    "responsibilities": [
      "Developing and drafting bills, amendments, letters, policy statements, talking points, op-eds, memos, and reports",
      "Planning and organizing briefings and other events",
      "Managing relationships with local, state, and national stakeholders",
      "Tracking legislation",
      "Handling vote recommendations",
      "Building coalitions of diverse, bipartisan stakeholders to advance legislative priorities",
      "Assisting organizations and constituents in the district with federal matters"
    ],
    "qualifications": [
      "Background in matters before the House Homeland Security and Judiciary Committees, preferably with a knowledge base in oversight and investigations",
      "J.D. degree strongly encouraged",
      "Experience working on legislation as a permanent staffer for a minimum of two years is required",
      "Well-versed in current events and possesses a working knowledge of a diverse array of issues",
      "Strong writer, particularly one adept at drafting powerful remarks for the floor",
      "Track record of successfully developing and advancing legislation",
      "Experience preparing and staffing the Member for committee hearings and markups",
      "Experience managing a broad policy portfolio"
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, and a writing sample to md04resumes@gmail.com with the subject line: “Full Name – Legislative Assistant / Counsel.” We will accept applications until the position is filled.",
    "salary_info": "Job title and pay will be commensurate with work experience.",
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an equal-opportunity employer that does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-354-23",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "Capitol Hill",
    "posting_date": "2023-08-21",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public. The Policy Director’s responsibilities will include:",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-323-23",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2023-08-21",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work. In addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful. The ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Helping with neighborhood events",
      "Resolving problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Ensuring agencies respond in a timely manner",
      "Responding to constituent requests and concerns",
      "Meeting deadlines"
    ],
    "qualifications": [
      "Ability to work independently",
      "Ability to think outside the box about various constituent issues and community events",
      "Prior community or casework experience helpful",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": null,
    "position_title": null,
    "office": null,
    "location": null,
    "posting_date": "2023-08-21",
    "description": null,
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-305-23",
    "position_title": "DPCC COMMUNICATIONS DIRECTOR",
    "office": "House Democratic Policy and Communications Committee",
    "location": "Capitol Hill",
    "posting_date": "2023-08-21",
    "description": "The House Democratic Policy and Communications Committee seeks an experienced Communications Director.\n\nThe Communications Director will work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats; create messaging guidance, event suggestions, sample releases, and other communications tools; help Democratic offices pitch stories, hold strong local press events, and position Members in the media; and assist in bolstering paid communications programs in Democratic offices.\n\nThe Communications Director is also expected to assist with the planning and execution of regular DPCC message meetings and policy dinners; support DPCC outreach initiatives; and assist with daily tasks and long-term planning. Spanish language fluency and experience with constituency media is strongly preferred.\n\nThis is not an entry-level position; a strong background in communications on Capitol Hill is required. DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply.",
    "responsibilities": [
      "Work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats",
      "Create messaging guidance, event suggestions, sample releases, and other communications tools",
      "Help Democratic offices pitch stories, hold strong local press events, and position Members in the media",
      "Assist in bolstering paid communications programs in Democratic offices",
      "Assist with the planning and execution of regular DPCC message meetings and policy dinners",
      "Support DPCC outreach initiatives",
      "Assist with daily tasks and long-term planning"
    ],
    "qualifications": [
      "A strong background in communications on Capitol Hill is required",
      "Spanish language fluency and experience with constituency media is strongly preferred"
    ],
    "how_to_apply": "To apply, please email jobs.DPCC@mail.house.gov with the following application materials attached as one combined PDF: 1. Cover letter; 2. Resume; 3. Two writing samples, with one coming from work on Capitol Hill; and 4. Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without contacting you first).",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-300-23",
    "position_title": "Legislative Director",
    "office": "Congressman Steven Horsford (NV-O4)",
    "location": "Capitol Hill",
    "posting_date": "2023-08-21",
    "description": "Congressman Steven Horsford (NV-O4) seeks a highly motivated, hard-working, skilled and experienced Legislative Director to help shape and manage a robust legislative portfolio.\n\nCongressman Horsford is a member of the Armed Services and Financial Services Committees, Chair of the Congressional Black Caucus, and an active frontline member. Previous legislative experience on Capitol Hill is required, and Nevada ties are a plus. Ideal candidates will have experience managing and mentoring staff, thinking strategically and will possess a sophisticated understanding of the legislative process, along with excellent writing, organizational and time management skills. The ideal candidate will primarily be responsible for managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues.\n\nCandidates should be creative, proactive and self-motivated, and have an ability to operate effectively under pressure and work closely in a team atmosphere in this fast-moving, dynamic office.",
    "responsibilities": [
      "Managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues."
    ],
    "qualifications": [
      "Previous legislative experience on Capitol Hill is required",
      "Nevada ties are a plus",
      "Experience managing and mentoring staff",
      "Ability to think strategically",
      "Sophisticated understanding of the legislative process",
      "Excellent writing skills",
      "Excellent organizational skills",
      "Excellent time management skills",
      "Creative",
      "Proactive",
      "Self-motivated",
      "Ability to operate effectively under pressure",
      "Ability to work closely in a team atmosphere"
    ],
    "how_to_apply": "Interested candidates must include a cover letter, resume, two page max writing sample and three professional references in a single PDF file.\nEmail submissions to the Director of Administration, Selena Harvey at nv04resumes@mail.house.gov. Subject line must read \"Legislative Director Application.\"",
    "salary_info": "Salary is competitive and commensurate with experience, along with generous benefits and professional development opportunities.",
    "contact": {
      "name": "Selena Harvey",
      "title": "Director of Administration",
      "email": "nv04resumes@mail.house.gov"
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color and LGBTQAI+ candidates are strongly encouraged to apply, as are candidates with Nevada ties."
  },
  {
    "id": "MEM-NV04-23",
    "position_title": "Legislative Director",
    "office": "MEM-NV04",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "last name\". No calls please. Individuals selected for an interview will be contacted.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-276-23",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Majority Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-08-21",
    "description": "Provides administrative, legislative, and research support to Subcommittee staff, and assists with duties as assigned.",
    "responsibilities": [
      "Answering the telephone and responding to caller inquiries",
      "Reviewing incoming mail and preparation of correspondence",
      "Maintaining Subcommittee archive, activities report, and relevant publications",
      "Assisting with full Committee hearings on matters within Subcommittee jurisdiction",
      "Maintaining the Subcommittee’s outstanding deliverable requests made to the Department of Veterans Affairs (VA)",
      "Determining and tracking the status of pending legislation",
      "Reviewing the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to subcommittee Members and staff",
      "Participating in staff-level negotiations, to include knowledge of background information on legislation being considered",
      "Assisting Subcommittee staff in organization of, and preparation for, hearings, to include determination of Majority agenda, briefing of Members, and development of questions",
      "Conducting meetings with VA, veteran service organizations or other scheduled parties",
      "Drafting remarks for Chairman and suggested questions for hearings",
      "Preparation of memorandums for the full Committee and Subcommittee Chairman on matters under the jurisdiction of the Subcommittee",
      "Research preparation of hearings by reviewing previous hearing transcripts, relevant statutes, and VA policy",
      "Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; and assist other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "Work, internship, or other experience in a professional environment"
    ],
    "how_to_apply": "Qualified candidates please send their cover letter, resume, and three writing samples to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-259-23",
    "position_title": "Communications Assistant",
    "office": "Office of a conservative, mid-western Member of Congress",
    "location": "DC",
    "posting_date": "2023-08-21",
    "description": "The office of a conservative, mid-western Member of Congress seeks a Communications Assistant to work in the DC office and help develop and execute an effective communications strategy.\n\nThis position is for someone early in their career with one to four years of experience working in a professional setting with at least some exposure to communications-related work.\n\nApplicants must complete a writing sample as part of the interview process.",
    "responsibilities": [
      "compiling and distributing daily press clips",
      "producing content for social media and the official website",
      "writing speeches, opinion editorials, talking points, press releases, and similar content",
      "preparing the Member for media opportunities and public appearances",
      "photographing events, hearings, and other public functions",
      "research to support communications activities",
      "monitoring national, state, and local news for stories relevant for the office",
      "assisting with all other communications-related tasks that are necessary to execute a communications strategy"
    ],
    "qualifications": [
      "innovative, confident, and detail-oriented",
      "a strong and effective verbal and written communicator",
      "capable of consistently producing high-quality work product",
      "able to effectively communicate with a variety of audiences using social media and other platforms",
      "willing to work long hours, including some time on weekends, and under tight deadlines",
      "able to react to unanticipated circumstances requiring fast and effective response",
      "interested in political and government topics and news from a variety of sources",
      "committed to contributing to a team dynamic based on respect, collaboration, and transparency"
    ],
    "how_to_apply": "Interested applicants should email CommsApplicants@gmail.com with:\n\n* a cover letter,\n* resume,\n* at least three professional references, and\n* any relevant work samples (e.g. - writing, video, creative)",
    "salary_info": null,
    "contact": "CommsApplicants@gmail.com",
    "equal_opportunity": null
  }
]