[
  {
    "id": "MEM-405-23",
    "position_title": "Legislative Assistant or Senior Legislative Assistant",
    "office": "Representative Mike Levin (CA-49)",
    "location": null,
    "posting_date": "2023-08-28",
    "description": "Representative Mike Levin (CA-49) seeks a Legislative Assistant or Senior Legislative Assistant for a policy portfolio that includes energy, environment, and climate change issues. The policy portfolio includes his work on the House Natural Resources Committee, and key priorities including climate action, clean energy, spent nuclear fuel, and clean transportation. The portfolio will also include other policy issues as needed.\n\nThis legislative staffer will work with the Legislative Director and Chief of Staff to advance and execute the Congressman’s legislative agenda both on and off committee. ",
    "responsibilities": [
      "Staffing the Congressman at hearings and markups",
      "Developing and analyzing legislation and policy",
      "Drafting remarks, hearing questions, talking points, and memos",
      "Maintaining strong relationships with constituent and stakeholder groups",
      "Drafting letters to stakeholders, the Administration, and other Members",
      "Staffing the Congressman in meetings and at other events"
    ],
    "qualifications": [
      "Experience working on environment policy issues",
      "Strong written and verbal communications skills",
      "A knowledge of House legislative processes",
      "Sound political judgment",
      "Willing team member",
      "State or district ties and prior legislative experience in a House or Senate office are a plus"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two writing samples, and a list of three references to ca49.applications@mail.house.gov with “Environment Legislative Assistant” in the subject line. Please send all materials in one PDF document. Incomplete applications will not be considered.",
    "salary_info": "$60,000-$75,000, commensurate with experience.",
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  }
]