[
  {
    "id": "MEM-143-21",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Midwest conservative Republican",
    "location": null,
    "posting_date": "2021-05-03",
    "description": "Midwest conservative Republican seeks a motivated and experienced communications professional to lead development and execution of all official messaging.",
    "responsibilities": [
      "Responsibilities include writing press releases, media advisories, and newsletters, crafting content for social media channels, developing graphics and videos, assisting with media monitoring and pitching press, overseeing clips collection and distribution, and working with the Communications team to identify new ways to engage with press and digital audiences",
      "acts as the formal spokesperson and media liaison for the Member",
      "develops and implements media and communications strategy for the Member",
      "remains abreast of current legislative and non-legislative issues about which the Member may be questioned",
      "evaluates current events and media reports in the district and the nation for their impact on the Member",
      "provides ideas and advice on the effect in the media of the Member's actions and legislative activities",
      "writes speeches for the Member",
      "performs other duties as assigned."
    ],
    "qualifications": [
      "minimum of 4-6 years of congressional experience",
      "strong writing, editing, and proofreading skills",
      "strong oral communication skills",
      "understanding of print and broadcast media; existing media relationships a plus.",
      "thorough knowledge of legislative process",
      "knowledge of current issues and events in which the Member is involved",
      "ability to exercise discretion and independent judgment in the representation of the Member's positions on policy issues",
      "availability to work long hours",
      "ability to work collaboratively with district office."
    ],
    "how_to_apply": "Interested candidates should email an resume, cover letter and writing sample to: indianagopjobs@gmail.com",
    "salary_info": null,
    "contact": "indianagopjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-142-21",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2021-05-03",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines. A successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Helping with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines",
      "Working independently and think outside the box about various constituent issues and community events"
    ],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "A working knowledge or strong interest in the District of Columbia and its local government",
      "Possess a bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-141-21",
    "position_title": "Legislative Assistant",
    "office": "Senior Democrat",
    "location": "District of Columbia",
    "posting_date": "2021-05-03",
    "description": "Senior Democrat is seeking a highly energetic, motivated and organized lawyer with strong interpersonal, legal and writing skills. The ideal candidate will be able to manage multiple tasks and work well under pressure.\n\nThe Legislative Assistant works with the Chief Counsel/Legislative Director and with the Chief of Staff to develop and implement the Member's legislative strategy in his/her issue areas; prepares materials for hearings; drafts legislation, amendments, and congressional record statements; and conducts research. The ability to write well under tight deadlines is essential.\n\nCandidate must be able to handle multiple tasks and issues effectively while meeting deadlines. A successful candidate will be a results-oriented, problem solving lawyer and motivated self-starter who can think outside the box. Prior Hill, law firm or similar experience is preferred but not always required.\n\nCandidate must possess a law degree and be, or be willing to become, a resident of the District of Columbia. Salary based on skill and experience level.",
    "responsibilities": [
      "Develop and implement the Member's legislative strategy in his/her issue areas",
      "Prepare materials for hearings",
      "Draft legislation, amendments, and congressional record statements",
      "Conduct research"
    ],
    "qualifications": [
      "Law degree required",
      "Must be, or be willing to become, a resident of the District of Columbia",
      "Strong interpersonal, legal and writing skills",
      "Ability to manage multiple tasks and work well under pressure",
      "Ability to write well under tight deadlines",
      "Results-oriented, problem solving lawyer and motivated self-starter",
      "Ability to think outside the box",
      "Prior Hill, law firm or similar experience is preferred but not always required"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-140-21",
    "position_title": "Communications Director",
    "office": "Rep. Peter Welch",
    "location": "Capitol Hill",
    "posting_date": "2021-05-03",
    "description": "Rep. Peter Welch is hiring a communications director to manage a busy press shop. Successful candidates will be excellent writers, highly creative, skilled at pitching Capitol Hill and local reporters, experienced with booking national news hits, highly organized, and able to prioritize and publicize Rep. Welch's strategic goals across social media platforms. A successful candidate will join a tight-knit team, so a collaborative mindset is essential and a sharp sense of humor is appreciated.\n\nRep. Welch is a busy Member, so you will be too. In addition to being a chief deputy whip, he is a Member of three very active, high profile committees: Energy and Commerce, Intelligence, and Oversight.\n\nCapitol Hill relationships and Vermont ties are pluses.",
    "responsibilities": [],
    "qualifications": [
      "Excellent writers",
      "Highly creative",
      "Skilled at pitching Capitol Hill and local reporters",
      "Experienced with booking national news hits",
      "Highly organized",
      "Able to prioritize and publicize Rep. Welch's strategic goals across social media platforms",
      "Collaborative mindset",
      "Sharp sense of humor"
    ],
    "how_to_apply": "Interested and qualified candidates should submit their resume, cover letter, and two writing samples to vermontcommsjob@gmail.com.",
    "salary_info": null,
    "contact": "vermontcommsjob@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer, and applications by members of underrepresented groups are strongly encouraged."
  },
  {
    "id": "MEM-138-21",
    "position_title": "Constituent Services Liaison/District Representative",
    "office": "U.S. Member of Congress in New York",
    "location": "Brooklyn, NY",
    "posting_date": "2021-05-03",
    "description": "New York Democrat seeks Fast-paced, high profile New York City Congressional Member office seeks Constituent Services Liaison/District Representative to manage the Constituent Services activities. Responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents and serving as a liaison with federal, district, and local agencies and community organizations.\nThis is a permanent, full-time position. and mid-entry-level position in a fastpaced office that frequently requires non-traditional work hours, Fluency in other language other than English (Creole, Arabic, Russian) highly preferred.",
    "responsibilities": [
      "Answering casework correspondence",
      "Meeting with constituents",
      "Verbal communications with constituents",
      "Serving as a liaison with federal, district, and local agencies and community organizations"
    ],
    "qualifications": [
      "Ties to Brooklyn",
      "A proven record",
      "A minimum of three years of related experience are required",
      "Fluency in other language other than English (Creole, Arabic, Russian) highly preferred"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov\nPlease place Constituent Services/District Representative in the subject line.\nNO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-137-21",
    "position_title": "Office Manager/Executive Assistant",
    "office": "New York Democrat",
    "location": "District Office",
    "posting_date": "2021-05-03",
    "description": "New York Democrat seeks an Operations Manager/Executive Assistant for their district office. Responsibilities include answers and screens telephone calls for Member and staff, takes and transmits messages; Maintains office answering machine or voice mail managing the Member’s schedule, travel plans and related events in the district.\n\nDuties also include managing the internship program and other office operations including office equipment and supplies, required reporting, and assisting with personnel tracking, as well as fielding requests of the Member with staff and the public. This is an entry-level position in a fast-paced office that frequently requires non-traditional work hours.",
    "responsibilities": [
      "Answers and screens telephone calls for Member and staff",
      "Takes and transmits messages",
      "Maintains office answering machine or voice mail managing the Member’s schedule, travel plans and related events in the district",
      "Managing the internship program",
      "Other office operations including office equipment and supplies",
      "Required reporting",
      "Assisting with personnel tracking",
      "Fielding requests of the Member with staff and the public"
    ],
    "qualifications": [
      "Prior professional office experience",
      "Ties to Brooklyn is a plus",
      "Fluency in other language other than English (Creole, Arabic, Russian) highly preferred"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place OFFICE MANAGER/EXECUTIVE ASSISTANT in the subject line.\n\nNO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-136-21",
    "position_title": "Director of Outreach and Community Engagement",
    "office": "New York Democrat",
    "location": "Brooklyn, NY",
    "posting_date": "2021-05-03",
    "description": "Responsibilities include building strategic relationships with community leaders and constituent groups, executing various outreach activities, and recruiting volunteers for events and outreach programs in the district.\n\nDuties also include coordinating initiatives designed to promote the office and services to the community, managing an outreach and organizing plan for the team, and any other assigned duties. Candidates should possess excellent organization, leadership, teamwork, and management skills, as well as verbal and written communication skills.\n\nThe Director of Outreach and Community Engagement will report to the District Director. Ties to Brooklyn, a proven management record, and a minimum of three years of related experience are required. This position is based in the local Brooklyn, NY office. This is a permanent, full-time position and a senior-level position in a fast-paced office that frequently requires non-traditional work hours. Fluency in other language other than English (Creole, Arabic, Russian) highly preferred.",
    "responsibilities": [
      "Building strategic relationships with community leaders and constituent groups",
      "Executing various outreach activities",
      "Recruiting volunteers for events and outreach programs in the district",
      "Coordinating initiatives designed to promote the office and services to the community",
      "Managing an outreach and organizing plan for the team",
      "Any other assigned duties"
    ],
    "qualifications": [
      "Excellent organization, leadership, teamwork, and management skills",
      "Verbal and written communication skills",
      "Ties to Brooklyn",
      "Proven management record",
      "Minimum of three years of related experience",
      "Fluency in other language other than English (Creole, Arabic, Russian) highly preferred"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov.\nPlease place DIRECTOR OF OUTREACH AND COMMUNITY ENGAGEMENT in the subject line.\nNO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-132-21",
    "position_title": "Senior Advisor/Counsel",
    "office": "Congressman Tom McClintock (R-CA)",
    "location": "Washington, D.C.",
    "posting_date": "2021-05-03",
    "description": "The Office of Congressman Tom McClintock (R-CA) seeks applications for a Senior Advisor/Counsel to handle the Judiciary portfolio with an emphasis on immigration in the Washington, D.C. office.",
    "responsibilities": [
      "Advising the Member on all legislative areas within their portfolio",
      "Prepare and staff the Member in committee hearings and markups",
      "Draft and advance legislation",
      "Represent the Member in meetings with constituents and stakeholders concerning policy matters in their portfolio"
    ],
    "qualifications": [
      "Strong conservative credentials",
      "Effective writing and research skills",
      "Strong attention to detail",
      "The ability to manage multiple tasks at once",
      "Previous Capitol Hill experience and JD preferred"
    ],
    "how_to_apply": "To apply, please email resume and cover letter to gopwestcoastjobs@gmail.com with Subject: Senior Advisor/Counsel_LastName.FirstName",
    "salary_info": null,
    "contact": "gopwestcoastjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-127-21",
    "position_title": "Counsel or Professional Staffer",
    "office": "House Committee on Energy and Commerce, Subcommittee on Oversight & Investigations",
    "location": null,
    "posting_date": "2021-05-03",
    "description": "House Committee on Energy and Commerce, Subcommittee on Oversight & Investigations is seeking a counsel or professional staffer to work on environment and energy oversight for the Committee’s Majority staff. Experience with congressional oversight, investigations, or issues within the Committee’s jurisdiction is a plus.",
    "responsibilities": [
      "Staffing congressional hearings",
      "Conducting investigations",
      "Research",
      "Document review and analysis",
      "Writing and editing"
    ],
    "qualifications": [
      "Detail oriented",
      "Possessing strong communication and writing skills",
      "J.D. preferred but not required, as experience within the areas of the Committee’s environment and energy jurisdiction may be equally relevant."
    ],
    "how_to_apply": "Please send resume, cover letter, writing sample, and at least two professional references to ecdjobs@mail.house.gov.",
    "salary_info": "Salary commensurate with skills and experience.",
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-126-21",
    "position_title": "Field Representative/Travel Aide",
    "office": "Congresswoman Vicky Hartzler",
    "location": "Missouri",
    "posting_date": "2021-05-03",
    "description": "The Field Representative/Travel Aide for Congresswoman Vicky Hartzler\nliaises with fellow Missourians to assist with carrying out her duties as a\ngovernment official. This individual also travels with her when she visits cities,\ntowns, and rural communities to meet with old and new friends.",
    "responsibilities": [
      "Attend community meetings, network with locally elected officials, and update\nthe Congresswoman on issues of importance within the service area which\nincludes the Counties of Benton, Henry, Hickory, Johnson, Pettis, and St. Clair.",
      "Travel with the Congresswoman as she visits with constituents at various events.",
      "Serve as an advocate for constituents and a conduit between them and the\nCongresswoman while she works on their behalf in Washington, DC.",
      "Stop by local businesses to meet with the owners and employees, learn about\ntheir products being sold, and connect them with federal resources.",
      "Contact a federal or state agency to learn about how a policy issue is being\nimplemented.",
      "Assist a local nonprofit with finding federal and state resources to solve an issue.",
      "Provide feedback to supervisors on concerns raised by constituents on issues of\nthe day.",
      "Handle meeting requests and serve in stead of the Congresswoman when she is\nin DC.",
      "Spend time in the Harrisonville office taking calls, returning messages, and\nfiling reports."
    ],
    "qualifications": [
      "Bachelor’s degree or equivalent professional experience.",
      "A current driver’s license, clean (or mostly clean) driving record, and\nfunctioning vehicle.",
      "Interest, familiarity, or prior experience in the federal and/or state government.",
      "A passion for working with Missourians to help find solutions and resources for\nthem."
    ],
    "how_to_apply": "Interested applicants should email their resumes\nto Austin.Kramer@mail.house.gov.",
    "salary_info": null,
    "contact": "Austin.Kramer@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-118-21",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-05-03",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Office of Advice and Education. The Committee’s Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [],
    "qualifications": [
      "Experience in one or more of the following areas is desirable: government ethics; ethics counseling and training; and criminal law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  }
]