[
  {
    "id": "MEM-172-21",
    "position_title": "Field Representative/Caseworker",
    "office": "Rural Oregon Congressman",
    "location": "Oregon",
    "posting_date": "2021-05-24",
    "description": "Rural Oregon Congressman seeks a driven and organized individual to serve as a Field Representative/Caseworker in the Representative’s district office in Oregon. Ideal candidates will have a bachelor’s degree, excellent written and verbal communication skills, impeccable time management skills, and an ability to meet deadlines in a fast-paced environment.",
    "responsibilities": [
      "Acts as the grass roots representative for the Member within his or her area of responsibility including answering casework correspondence, verbal communications with constituents, and acting as liaison with federal, district, and local agencies. The individual will also engage with city, county, district, the chamber of commerce, and other groups to form effective relationships with the Member;",
      "Assesses casework for issues requiring legislative action and makes recommendations to the District Director and/or Chief of Staff;",
      "Maintains up-to-date files on all cases and categories of information significant to the office;",
      "Prepares reports for the Congressman and Chief of Staff on district activities in his or her assigned issue areas; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "bachelor’s degree",
      "excellent written and verbal communication skills",
      "impeccable time management skills",
      "ability to meet deadlines in a fast-paced environment"
    ],
    "how_to_apply": "Interested candidates should email a cover letter and resume to ResumesOR@mail.house.gov.",
    "salary_info": null,
    "contact": "ResumesOR@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-171-21",
    "position_title": "Press Secretary",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2021-05-24",
    "description": "The press secretary will help manage communications in a fast-paced congressional office for a member of House Democratic leadership.\n\nResponsibilities are wide-ranging and include responding to daily media inquiries, building relationships with national, state and local reporters, pitching and booking frequent national cable interviews, writing press releases, statements and media advisories, creating and managing social media content, including graphics and videos, drafting speeches, talking points and op-eds, and creating franked communications, including mailers and telephone townhalls. The press secretary will also be responsible for managing a full-time press assistant and press interns.",
    "responsibilities": [
      "Responding to daily media inquiries",
      "Building relationships with national, state and local reporters",
      "Pitching and booking frequent national cable interviews",
      "Writing press releases, statements and media advisories",
      "Creating and managing social media content, including graphics and videos",
      "Drafting speeches, talking points and op-eds",
      "Creating franked communications, including mailers and telephone townhalls",
      "Managing a full-time press assistant and press interns"
    ],
    "qualifications": [
      "Strong written and verbal communication skills",
      "A self-starting personality",
      "A desire to continually learn in political communications",
      "An eagerness to work in a collaborative office environment",
      "Not an entry-level position",
      "Michigan ties preferred",
      "Adobe Creative Suite skills preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter to Michigan05jobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-170-21",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-05-24",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nProfessional Staff member responsible for early childhood education and child\nwelfare legislation.\n\nCandidates should have familiarity with federal early childhood education\nprograms, including the Child Care and Development Block Grant and Head\nStart, as well as child welfare legislation, including the Child Abuse Prevention\nand Treatment Act. Knowledge of other federal statutes and policies and how\nthey impact early childhood education and child welfare policy is preferred.\n\nApplicants should have at least two years of prior experience in Congress, federal\ngovernment or advocacy organization is strongly preferred. Duties will include\nsupporting the development of legislation, providing technical assistance to the\nCommittee and Member offices, researching pertinent issues, preparing written\nmaterials and legislative analyses, and supporting the execution of committee\nproceedings and events related to early childhood education and child welfare.",
    "responsibilities": [
      "supporting the development of legislation",
      "providing technical assistance to the Committee and Member offices",
      "researching pertinent issues",
      "preparing written materials and legislative analyses",
      "supporting the execution of committee proceedings and events related to early childhood education and child welfare"
    ],
    "qualifications": [
      "familiarity with federal early childhood education programs, including the Child Care and Development Block Grant and Head Start, as well as child welfare legislation, including the Child Abuse Prevention and Treatment Act.",
      "Knowledge of other federal statutes and policies and how they impact early childhood education and child welfare policy is preferred.",
      "at least two years of prior experience in Congress, federal government or advocacy organization is strongly preferred."
    ],
    "how_to_apply": "To apply, applicants must submit a resume and two short writing samples\ndemonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with\n\"Early Childhood Professional Staff Position\" in the subject line. Please apply no\nlater than June 4, 2021.",
    "salary_info": "$65,000 and $80,000",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are encouraged to\napply."
  },
  {
    "id": "MEM-169-21",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Katie Porter (CA-45)",
    "location": "Washington, DC",
    "posting_date": "2021-05-24",
    "description": "Congresswoman Katie Porter (CA-45) seeks a Staff Assistant to serve in her\nWashington, DC office. The ideal candidate will have the creativity, drive, and\ninterest in supporting the constituent outreach work of the office.\n\nThe position will be responsible for welcoming office visitors; processing\nconstituent casework; drafting constituent correspondence, processing flag and\ntour requests; managing a DC based intern; logging constituent mail; and other\nadministrative duties as assigned. Additional responsibilities may include drafting\nmeeting memos, conducting research for staff reports and policy memos, and\nassisting the scheduler.",
    "responsibilities": [
      "Welcoming office visitors",
      "Processing constituent casework",
      "Drafting constituent correspondence",
      "Processing flag and tour requests",
      "Managing a DC based intern",
      "Logging constituent mail",
      "Other administrative duties as assigned",
      "Drafting meeting memos",
      "Conducting research for staff reports and policy memos",
      "Assisting the scheduler"
    ],
    "qualifications": [
      "Solution-oriented personality",
      "Ability to work in a fast-paced environment",
      "Highly organized",
      "Detail-oriented",
      "Excellent writer",
      "Familiarity with a second-language, Intranet Quorum (IQ), and ties to CA45 or Orange County are preferred."
    ],
    "how_to_apply": "To apply, send a cover letter and resume to ResumesCA45@mail.house.gov with “Staff Assistant” in the subject line.",
    "salary_info": "$40,000",
    "contact": "ResumesCA45@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees."
  },
  {
    "id": "MEM-168-21",
    "position_title": "Press Secretary|Digital Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Southern California|Los Angeles",
    "posting_date": "2021-05-24",
    "description": "Representative Nanette Diaz Barragan (CA-44) is seeking a talented and highly motivated individual to assume the role of Press Secretary|Digital Director. The person chosen for the position will work closely with the Communications Director to develop and execute the Congresswoman’s long-term communications plan. They will be charged with overseeing the communications schedule; managing the Member’s digital media accounts, and working with local and national reporters.\n\nThe Press Secretary|Digital Director will be responsible for a wide range of critical functions, including developing original social media content, designing graphics, editing and posting videos, maintaining the office’s website, and managing media lists. Additionally, they will assist the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics",
      "Editing and posting videos",
      "Maintaining the office’s website",
      "Managing media lists",
      "Assisting the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials"
    ],
    "qualifications": [
      "Must have strong writing, editing, proofreading skills",
      "Must be proficient in photography, video recording and editing",
      "Must be detail-oriented, news savvy and able to work in a fast-paced, demanding work setting",
      "A sense of humor and ability to be a team player is a must",
      "Previous experience in press or relevant social media experience is required",
      "Southern California|Los Angeles ties and Spanish fluency are a plus",
      "Experience with Adobe Creative Cloud Products are a plus"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples with “Press Secretary” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-167-21",
    "position_title": "Analyst for Congressional Committee",
    "office": "House Budget Committee",
    "location": null,
    "posting_date": "2021-05-24",
    "description": "The House Budget Committee seeks an experienced budget analyst for income security, commerce, and housing policy portfolios.\n\nThe job requires strong skills in written and oral communication, policy analysis, and quantitative analysis, as well as the ability to work effectively under tight deadlines. The ideal candidate will have several years of experience in federal budgeting, familiarity with the legislative process, background in income security (e.g. unemployment insurance, nutrition assistance, and rental assistance), commerce (e.g. small business support), or federal housing programs, and a master’s degree in public policy or related field.\n\nExperience at OMB, CBO, or an agency budget office is a plus. The ability to be a quick learner and be adaptable as circumstances change is at least as important as depth of subject matter expertise.",
    "responsibilities": [],
    "qualifications": [
      "Strong skills in written and oral communication",
      "Policy analysis skills",
      "Quantitative analysis skills",
      "Ability to work effectively under tight deadlines",
      "Several years of experience in federal budgeting",
      "Familiarity with the legislative process",
      "Background in income security (e.g. unemployment insurance, nutrition assistance, and rental assistance), commerce (e.g. small business support), or federal housing programs",
      "Master’s degree in public policy or related field",
      "Experience at OMB, CBO, or an agency budget office is a plus",
      "Ability to be a quick learner and be adaptable as circumstances change"
    ],
    "how_to_apply": "Email resume, two BRIEF writing samples (2 to 4 pages each), and cover letter with subject line “analyst position” to Budget-Democrat.Jobs@mail.house.gov– no phone calls or walk-ins.",
    "salary_info": null,
    "contact": "Budget-Democrat.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-166-21",
    "position_title": "Senior Legislative Assistant",
    "office": "Congressman Brendan F. Boyle",
    "location": "Washington, DC",
    "posting_date": "2021-05-24",
    "description": "The Senior Legislative Assistant will support the Congressman with his work on the Ways and Means Committee and other issues. This position will prepare the Congressman for committee hearings and markups, floor debate and other speeches and closely track legislative activity included in the portfolio. The LA will also be responsible for taking meetings with constituents and stakeholders and developing and advancing legislation and amendments relevant to the Congressman. A successful candidate will be extremely organized, an excellent writer, a proactive self-starter, a strategic thinker and able to work collaboratively as a part of a close-knit team.\nThe ideal candidate will have ties to Philadelphia or Pennsylvania and previous experience with a policy portfolio.",
    "responsibilities": [
      "Prepare the Congressman for committee hearings and markups",
      "Prepare the Congressman for floor debate and other speeches",
      "Closely track legislative activity included in the portfolio",
      "Take meetings with constituents and stakeholders",
      "Develop and advance legislation and amendments relevant to the Congressman"
    ],
    "qualifications": [
      "Extremely organized",
      "Excellent writer",
      "Proactive self-starter",
      "Strategic thinker",
      "Able to work collaboratively as a part of a close-knit team",
      "Ties to Philadelphia or Pennsylvania",
      "Previous experience with a policy portfolio"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume and a writing sample to PA02.Jobs@mail.house.gov with “Senior Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "PA02.Jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-165-21",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2021-05-24",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include\nassisting the technology needs of Committee staff; editing and maintaining the\nCommittee’s website; answering telephones; assisting with the tracking and\nprocessing of committee correspondence; providing administrative support in\nsetting up committee meetings; and entering data and navigating databases with\naccuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of\nCongress equally and refrain from political or partisan activity. Applicants must\nhave excellent organizational skills and a professional telephone manner; good\ncomputer skills; proficiency in Microsoft Word and Excel; ability to work\ncooperatively and courteously with others; ability to use good judgment in\nresponding to inquiries and requests; and flexibility in assisting with daily tasks\nand projects.\n\nApplicants with experience or interest in learning information technology\nassistance are strongly encouraged to apply. This is an entry level position with a\nstarting salary of $38,000 per year.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee’s website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov",
    "salary_info": "$38,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-164-21",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Democratic Member",
    "location": "Washington, DC",
    "posting_date": "2021-05-24",
    "description": "This position is responsible for managing the front desk, processing incoming constituent mail, and handling administrative duties of the office. The staff member in this role interacts regularly with constituents and should have a friendly, helpful demeanor.",
    "responsibilities": [
      "Managing the front desk",
      "Processing incoming constituent mail",
      "Handling administrative duties of the office"
    ],
    "qualifications": [
      "Working knowledge of legislative issues",
      "Strong writing skills",
      "Extreme attention to detail",
      "Positive attitude",
      "Self-starter",
      "Ability to solve problems",
      "Ability to work well with others",
      "Strong communications skills",
      "Passion for helping others"
    ],
    "how_to_apply": "Interested applicants should send resume, cover letter, two writing samples, and a list of three references to ca49.applications@mail.house.gov.\nIncomplete applications will not be considered.",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-163-21",
    "position_title": "District Coordinator",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-05-24",
    "description": "The Office of Representative Spanberger seeks\na motivated, creative, self-starter to join the district constituent services staff as a\nDistrict Coordinator in the Glen Allen, VA office.\n\nAdditional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal,\ncustomer service, time-management, and organizational skills and have\nsignificant experience interacting with the public. Additionally, successful\ncandidates will have a positive, solution-driven personality, demonstrate excellent\noral and written communication skills, and show keen attention to detail and an\nability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references\nto spanberger.inquiries@mail.house.gov with “District Coordinator” in the\nsubject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s\noffice is an equal opportunity employer. The office does not discriminate on the\nbasis of race, color, religion, gender, sexual orientation, gender identify, national\norigin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-162-21",
    "position_title": "STAFF ASSISTANT",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA office",
    "posting_date": "2021-05-24",
    "description": "Responsibilities include managing the front office, answering phones, processing and logging constituent mail, greeting visitors, monitoring office deliveries, scheduling assistance, responding to inquiries, assisting with constituent casework, and other duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills. Additionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "managing the front office",
      "answering phones",
      "processing and logging constituent mail",
      "greeting visitors",
      "monitoring office deliveries",
      "scheduling assistance",
      "responding to inquiries",
      "assisting with constituent casework",
      "other duties as assigned"
    ],
    "qualifications": [
      "motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "positive, solution-driven personality",
      "excellent oral and written communication skills",
      "keen attention to detail",
      "ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume, writing sample, and cover letter (3 pages or less) to spanberger.inquiries@mail.house.gov with “District Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-160-21",
    "position_title": "Field Representative/Caseworker",
    "office": "North Coast Democratic Member of Congress",
    "location": "Representative’s district office",
    "posting_date": "2021-05-24",
    "description": "This position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents.\nCandidates must be comfortable working with the public, have excellent oral and written communication skills, problem solving abilities, and have completed a bachelor’s degree or equivalent. Work experience is preferred and strong academic credentials are required.",
    "responsibilities": [
      "Acts as the representative for the Congressman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Congressman and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Handles casework assignments;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Congressman;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Scheduler;",
      "Monitors scheduled district meetings for the Congressman with constituents;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Full-time experience preferred; strong academic credentials required; extensive community relationships desired.",
      "Bilingual: English/ Spanish is preferred but not required",
      "Strong oral and written communication skills;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Congressman is involved;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, procedures, and computer applications."
    ],
    "how_to_apply": "E-mail a resume and cover letter to CA02.Requests@mail.house.gov with the subject line “CA02 Field Representative/Caseworker.”",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-158-21",
    "position_title": "Legislative Director",
    "office": "Office of Congressman Alma S. Adams, Ph.D.",
    "location": "DC",
    "posting_date": "2021-05-24",
    "description": "The LD will help drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the\nCongresswoman’s legislative portfolio, and manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects.\nThis is not an entry level position; extensive Hill experience and knowledge of the legislative process are required. The successful applicant will have crisp and thorough written and oral communications skills, an entrepreneurial and selfstarting attitude, strong attention to detail, creativity, and be a team player. Supervisory experience and expertise on healthcare policy is strongly preferred.",
    "responsibilities": [
      "Drive the proactive legislative agenda for the office.",
      "Develop and implement the strategy to push policy priorities and legislative goals.",
      "Supervise and mentor the legislative staff.",
      "Advise on the Congresswoman’s legislative portfolio.",
      "Manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.",
      "Work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations.",
      "Help ensure coordination between DC and district offices on important legislative updates and district-based events and projects."
    ],
    "qualifications": [
      "Extensive Hill experience and knowledge of the legislative process are required.",
      "Crisp and thorough written and oral communications skills.",
      "An entrepreneurial and self-starting attitude.",
      "Strong attention to detail.",
      "Creativity.",
      "Be a team player.",
      "Supervisory experience and expertise on healthcare policy is strongly preferred."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to john.christie@mail.house.gov.\nPlease no calls, direct emails, or walk-ins.",
    "salary_info": null,
    "contact": "john.christie@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with North Carolina ties. Due to the volume of applications we receive, we will only contact you if we decide to move forward with your application."
  },
  {
    "id": "MEM-156-21",
    "position_title": "Communications Director",
    "office": "Congresswoman Marcy Kaptur (OH-9)",
    "location": "Washington, D.C.",
    "posting_date": "2021-05-24",
    "description": "Responsibilities include creating and implementing a proactive communications strategy; handling daily media inquiries; writing press releases, opinion pieces, speeches, and talking points; managing the Congresswoman's social media; building relationships with local and national media contacts; as well as working closely with legislative staff to effectively message policy issues.\nQualified candidates must have excellent communication skills, impeccable writing, experience speaking on-the-record, and the ability to be a self-starter while working in a fast-paced environment. Ohio ties are a plus.\nThis is not an entry-level position. The office is committed to building a diverse and inclusive team and is an equal opportunity employer.",
    "responsibilities": [
      "Creating and implementing a proactive communications strategy",
      "Handling daily media inquiries",
      "Writing press releases, opinion pieces, speeches, and talking points",
      "Managing the Congresswoman's social media",
      "Building relationships with local and national media contacts",
      "Working closely with legislative staff to effectively message policy issues"
    ],
    "qualifications": [
      "Excellent communication skills",
      "Impeccable writing",
      "Experience speaking on-the-record",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Ohio ties are a plus"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and writing sample to Midwestern.Resume@mail.house.gov with the subject line “Communications Director.”\nPlease no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": "The office is committed to building a diverse and inclusive team and is an equal opportunity employer."
  },
  {
    "id": "MEM-155-21",
    "position_title": "General Counsel",
    "office": "House Budget Committee",
    "location": null,
    "posting_date": "2021-05-24",
    "description": "The House Budget Committee seeks an experienced lawyer to serve as General Counsel to advise and provide legal counsel to the Chair, staff director, and committee staff on a range of matters, including the budget resolution and reconciliation process, fiscal law, legislative drafting and development, oversight, and parliamentary procedures. The General Counsel’s responsibilities include leading the committee’s legal team through the committee’s reconciliation, legislative, budget enforcement, and oversight activities.\n\nThe position requires the ability to work effectively under tight deadlines, collaboratively with colleagues throughout the House, and quickly to provide legal advice and counsel related to budget considerations for a wide range of federal programs and legislation. The position requires a law degree.",
    "responsibilities": [
      "Leading the committee’s legal team through the committee’s reconciliation, legislative, budget enforcement, and oversight activities."
    ],
    "qualifications": [
      "A record of being in a management or leadership position",
      "Several years of legal experience in the federal government",
      "Familiarity with parliamentary procedure",
      "Experience in fiscal law and legislative drafting",
      "Prior committee experience and legal experience at OMB, CBO, or GAO are a plus",
      "Law degree required"
    ],
    "how_to_apply": "Interested candidates should email their resume, cover letter, and a short writing sample (2 to 4 pages) with the subject line “General Counsel position” to BudgetDemocrat.Jobs@mail.house.gov – no phone calls or walk-ins.",
    "salary_info": null,
    "contact": "BudgetDemocrat.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-154-21",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Katie Porter (CA-45)",
    "location": "Washington, DC",
    "posting_date": "2021-05-24",
    "description": "Congresswoman Katie Porter (CA-45) seeks a Legislative Assistant to handle environmental issues and support her work on the Natural Resources Committee.\nThe portfolio will also include energy, transportation, infrastructure, emergency management, tribal affairs, agriculture, and other issue areas as assigned by the office.\nThis is not an entry level position.",
    "responsibilities": [
      "Preparing and staffing the Member for committee hearings and markups",
      "Developing and advancing legislation and other policy priorities",
      "Representing the Member in meetings",
      "Building and maintaining positive relationships with congressional staff, advocacy groups and key stakeholders (both DC and CA based)",
      "Drafting constituent correspondence and press materials"
    ],
    "qualifications": [
      "2-4 years of Hill or comparable advocacy experience working on environmental policy or issues relevant to the legislative portfolio",
      "Familiarity with congressional process and procedure",
      "Demonstrated ability to design and execute legislative projects",
      "The ideal candidate will have the creativity, drive, and confidence to propose original and compelling oversight work, including drafting hearing questions, oversight letters, and staff reports that resonate with our ideologically diverse constituents."
    ],
    "how_to_apply": "To apply, send a resume and a short writing sample to ResumesCA45@mail.house.gov with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "ResumesCA45@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-151-21",
    "position_title": "Press Assistant",
    "office": "Office of Rep. Don Beyer",
    "location": "Capitol Hill",
    "posting_date": "2021-05-24",
    "description": "The position reports to the Deputy Chief of Staff and will be responsible for drafting press releases and newsletters, creating content for social media platforms, recording and editing video, updating the Congressman's website, and supporting an active press shop.",
    "responsibilities": [
      "Drafting press releases and newsletters",
      "Creating content for social media platforms",
      "Recording and editing video",
      "Updating the Congressman's website",
      "Supporting an active press shop"
    ],
    "qualifications": [
      "Good writers with digital media experience",
      "Previous experience on Capitol Hill, a campaign, or at a communications firm is required"
    ],
    "how_to_apply": "Qualified candidates should submit a brief cover letter, resume, a writing sample, and two examples of graphics or other digital communications work to beyerstaff@gmail.com and include “Press Assistant” in the subject line. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "beyerstaff@gmail.com",
    "equal_opportunity": "Women, LGBTQ candidates, minority candidates, and candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-149-21",
    "position_title": "Communications Director",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2021-05-24",
    "description": "Democratic staff of the House Judiciary Committee seeks experienced, hardworking, and creative Communications Director to lead the press operation for both the Committee and Chairman Nadler’s personal office.\n\nThis is a senior position in a fast-paced office that requires a strong work ethic and close attention to detail. Candidates must be proactive and have the vision to develop a long-term communications blueprint that advances key objectives. On-the-record experience, exceptional writing skills, sound political judgment, and the ability to work independently and collaboratively, are essential.\n\nAn understanding of key policy areas, including constitutional, immigration, surveillance, and criminal justice issues is desired. The ideal candidate will have Congressional communications experience and NY ties. This is not an entry level position.",
    "responsibilities": [
      "Serving as an on-the-record spokesperson",
      "Working with national and local media to highlight committee activities and advance the committee’s agenda",
      "Writing press releases, op-eds, talking points, and briefing materials",
      "Booking and preparing the Chairman for interviews",
      "Engaging key stakeholders",
      "Organizing press conferences",
      "Managing a team of digital and press staff"
    ],
    "qualifications": [
      "On-the-record experience",
      "Exceptional writing skills",
      "Sound political judgment",
      "Ability to work independently and collaboratively",
      "Understanding of key policy areas, including constitutional, immigration, surveillance, and criminal justice issues",
      "Congressional communications experience and NY ties (desired)"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and two writing samples to JDEM.Job@mail.house.gov.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-148-21",
    "position_title": "Caseworker",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Waterbury, CT",
    "posting_date": "2021-05-24",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks a Caseworker to join her team in\nWaterbury, CT. Ideal candidates will have prior knowledge of federal agencies;\nexcellent written and verbal communication skills; strong organizational and time\nmanagement skills; a positive attitude; and an ability to work under pressure and\nmeet deadlines in an fast-paced work environment. Bilingual applicants are\npreferred.",
    "responsibilities": [
      "Acting as the representative for the Congresswoman within their area of\nresponsibility including answering casework correspondence, meeting with\nconstituents, verbal communications with constituents, and serving as a liaison\nwith federal, district, and local agencies, persons or groups for effective\nrelationships for the Congresswoman;",
      "Informing the Congresswoman and the District Director of all happenings in\ntheir assigned issue areas by screening district media sources and interacting with\nconstituents;",
      "Handling casework assignments and assesses casework for problems requiring\nlegislative action and makes recommendations to the District Director and Chief\nof Staff;",
      "Monitor scheduled district meetings for the Congresswoman with constituents;",
      "Logging incoming and outgoing mail and incoming telephone calls relating to\ncasework;",
      "Preparing periodic reports for the Congresswoman and District Director on\npending cases and district activities in his or her assigned issue areas;",
      "Continually screening active cases and acts as liaison with constituents to ensure\nthat their cases are handled in a responsive manner;",
      "Maintaining up-to-date files on all cases and categories of information of\nimportance to the office; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Prior knowledge of federal agencies",
      "Excellent written and verbal communication skills",
      "Strong organizational and time management skills",
      "Positive attitude",
      "Ability to work under pressure and meet deadlines in a fast-paced work environment",
      "Bilingual applicants are preferred"
    ],
    "how_to_apply": "Interested\nparties should e-mail a concise cover letter including salary requirements and\nresume to CT05jobs@mail.house.gov with the following subject line: First Name\nLast Name - Caseworker. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-146-21",
    "position_title": "Staff Assistant",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2021-05-24",
    "description": "The Democratic staff of the House Judiciary Committee seeks a Staff Assistant.\nCandidates should have excellent organizational skills and strong research, writing, and communication skills.\nResponsibilities include overseeing Committee hearing and markup logistics -which often include being physically present; serving as assistant clerk during markups; providing administrative and research support to the Chief of Staff and Staff Director/Chief Counsel; coordinating the Chief of Staff, Staff Director/Chief Counsel, and the Committee's calendars; co-managing the intern program; and managing Committee administrative needs.",
    "responsibilities": [
      "Overseeing Committee hearing and markup logistics -which often include being physically present",
      "Serving as assistant clerk during markups",
      "Providing administrative and research support to the Chief of Staff and Staff Director/Chief Counsel",
      "Coordinating the Chief of Staff, Staff Director/Chief Counsel, and the Committee's calendars",
      "Co-managing the intern program",
      "Managing Committee administrative needs"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Strong research, writing, and communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to JDEM.job@mail.house.gov and include “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-143-21",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Midwest conservative Republican",
    "location": null,
    "posting_date": "2021-05-24",
    "description": "Midwest conservative Republican seeks a motivated and experienced communications professional to lead development and execution of all official messaging.",
    "responsibilities": [
      "Responsibilities include writing press releases, media advisories, and newsletters, crafting content for social media channels, developing graphics and videos, assisting with media monitoring and pitching press, overseeing clips collection and distribution, and working with the Communications team to identify new ways to engage with press and digital audiences",
      "acts as the formal spokesperson and media liaison for the Member",
      "develops and implements media and communications strategy for the Member",
      "remains abreast of current legislative and non-legislative issues about which the Member may be questioned",
      "evaluates current events and media reports in the district and the nation for their impact on the Member",
      "provides ideas and advice on the effect in the media of the Member's actions and legislative activities",
      "writes speeches for the Member",
      "performs other duties as assigned."
    ],
    "qualifications": [
      "minimum of 4-6 years of congressional experience",
      "strong writing, editing, and proofreading skills",
      "strong oral communication skills",
      "understanding of print and broadcast media; existing media relationships a plus.",
      "thorough knowledge of legislative process",
      "knowledge of current issues and events in which the Member is involved",
      "ability to exercise discretion and independent judgment in the representation of the Member's positions on policy issues",
      "availability to work long hours",
      "ability to work collaboratively with district office."
    ],
    "how_to_apply": "Interested candidates should email an resume, cover letter and writing sample to:",
    "salary_info": null,
    "contact": "indianagopjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-142-21",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2021-05-24",
    "description": "Constituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines. A successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.",
    "responsibilities": [],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Possess a bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-141-21",
    "position_title": "Legislative Assistant",
    "office": "Senior Democrat",
    "location": "District of Columbia",
    "posting_date": "2021-05-24",
    "description": "Senior Democrat is seeking a highly energetic, motivated and organized lawyer with strong interpersonal, legal and writing skills. The ideal candidate will be able to manage multiple tasks and work well under pressure.\n\nThe Legislative Assistant works with the Chief Counsel/Legislative Director and with the Chief of Staff to develop and implement the Member's legislative strategy in his/her issue areas; prepares materials for hearings; drafts legislation, amendments, and congressional record statements; and conducts research. The ability to write well under tight deadlines is essential.\n\nCandidate must be able to handle multiple tasks and issues effectively while meeting deadlines. A successful candidate will be a results-oriented, problem solving lawyer and motivated self-starter who can think outside the box. Prior Hill, law firm or similar experience is preferred but not always required.\n\nCandidate must possess a law degree and be, or be willing to become, a resident of the District of Columbia. Salary based on skill and experience level.",
    "responsibilities": [
      "Develop and implement the Member's legislative strategy in his/her issue areas",
      "Prepare materials for hearings",
      "Draft legislation, amendments, and congressional record statements",
      "Conduct research"
    ],
    "qualifications": [
      "Law degree",
      "Be, or be willing to become, a resident of the District of Columbia",
      "Strong interpersonal, legal, and writing skills",
      "Ability to manage multiple tasks and work well under pressure",
      "Results-oriented and problem solving",
      "Motivated self-starter who can think outside the box",
      "Ability to write well under tight deadlines is essential",
      "Prior Hill, law firm or similar experience is preferred but not always required"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-140-21",
    "position_title": "Communications Director",
    "office": "Rep. Peter Welch",
    "location": "Capitol Hill",
    "posting_date": "2021-05-24",
    "description": "Rep. Peter Welch is hiring a communications director to manage a busy press shop. Successful candidates will be excellent writers, highly creative, skilled at pitching Capitol Hill and local reporters, experienced with booking national news hits, highly organized, and able to prioritize and publicize Rep. Welch’s strategic goals across social media platforms. A successful candidate will join a tight-knit team, so a collaborative mindset is essential and a sharp sense of humor is appreciated.\n\nRep. Welch is a busy Member, so you will be too. In addition to being a chief deputy whip, he is a Member of three very active, high profile committees: Energy and Commerce, Intelligence, and Oversight.\n\nCapitol Hill relationships and Vermont ties are pluses.",
    "responsibilities": [],
    "qualifications": [
      "Excellent writers",
      "Highly creative",
      "Skilled at pitching Capitol Hill and local reporters",
      "Experienced with booking national news hits",
      "Highly organized",
      "Able to prioritize and publicize Rep. Welch’s strategic goals across social media platforms",
      "Collaborative mindset",
      "Sharp sense of humor is appreciated"
    ],
    "how_to_apply": "Interested and qualified candidates should submit their resume, cover letter, and two writing samples to vermontcommsjob@gmail.com.",
    "salary_info": null,
    "contact": "vermontcommsjob@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer, and applications by members of underrepresented groups are strongly encouraged."
  },
  {
    "id": "MEM-139-21",
    "position_title": "Communications Director/Press Secretary",
    "office": "Senior House Appropriator",
    "location": "Washington, D.C.",
    "posting_date": "2021-05-24",
    "description": "Responsibilities include communications planning and press strategy for D.C. and the district; drafting press materials including: remarks, talking points, statements, op-eds, press releases, and media advisories; assisting with the management of the Congressman's social media accounts; interview preparation; and fielding media inquiries.",
    "responsibilities": [
      "Communications planning and press strategy for D.C. and the district",
      "Drafting press materials including: remarks, talking points, statements, op-eds, press releases, and media advisories",
      "Assisting with the management of the Congressman's social media accounts",
      "Interview preparation",
      "Fielding media inquiries"
    ],
    "qualifications": [
      "Strong writer",
      "Politically savvy",
      "Detail-oriented",
      "Flexible",
      "Creative",
      "Self-starter"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and two writing samples to GA02.Resume@mail.house.gov.",
    "salary_info": null,
    "contact": "GA02.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-138-21",
    "position_title": "Constituent Services Liaison/District Representative",
    "office": "U.S. Member of Congress in New York",
    "location": "Brooklyn, NY",
    "posting_date": "2021-05-24",
    "description": "Fast-paced, high profile New York City Congressional Member office seeks Constituent Services Liaison/District Representative to manage the Constituent Services activities. Responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents and serving as a liaison with federal, district, and local agencies and community organizations.\nThis is a permanent, full-time position. and mid-entry-level position in a fastpaced office that frequently requires non-traditional work hours, Fluency in other language other than English (Creole, Arabic, Russian) highly preferred.",
    "responsibilities": [
      "Answering casework correspondence",
      "Meeting with constituents",
      "Verbal communications with constituents",
      "Serving as a liaison with federal, district, and local agencies and community organizations"
    ],
    "qualifications": [
      "Ties to Brooklyn",
      "Proven record",
      "Minimum of three years of related experience"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov\nPlease place Constituent Services/District Representative in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-137-21",
    "position_title": "Office Manager/Executive Assistant",
    "office": "New York Democrat",
    "location": "District Office",
    "posting_date": "2021-05-24",
    "description": "Responsibilities include answers and screens telephone calls for\nMember and staff, takes and transmits messages; Maintains office answering\nmachine or voice mail managing the Member’s schedule, travel plans and related\nevents in the district.\n\nDuties also include managing the internship program and other office operations\nincluding office equipment and supplies, required reporting, and assisting with\npersonnel tracking, as well as fielding requests of the Member with staff and the\npublic. This is an entry-level position in a fast-paced office that frequently\nrequires non-traditional work hours.",
    "responsibilities": [
      "Answers and screens telephone calls for Member and staff",
      "Takes and transmits messages",
      "Maintains office answering machine or voice mail managing the Member’s schedule, travel plans and related events in the district",
      "Manages the internship program",
      "Manages other office operations including office equipment and supplies, required reporting, and assisting with personnel tracking",
      "Fields requests of the Member with staff and the public"
    ],
    "qualifications": [
      "Prior professional office experience",
      "Ties to Brooklyn is a plus",
      "Fluency in other language other than English (Creole, Arabic, Russian) highly preferred"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place OFFICE MANAGER/EXECUTIVE ASSISTANT in the subject line.\nNO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-136-21",
    "position_title": "Director of Outreach and Community Engagement",
    "office": "New York Democrat",
    "location": "Brooklyn, NY",
    "posting_date": "2021-05-24",
    "description": "Responsibilities include building strategic relationships with community leaders and constituent groups, executing various outreach activities, and recruiting volunteers for events and outreach programs in the district.\n\nDuties also include coordinating initiatives designed to promote the office and services to the community, managing an outreach and organizing plan for the team, and any other assigned duties. Candidates should possess excellent organization, leadership, teamwork, and management skills, as well as verbal and written communication skills.\n\nThe Director of Outreach and Community Engagement will report to the District Director. Ties to Brooklyn, a proven management record, and a minimum of three years of related experience are required. This position is based in the local Brooklyn, NY office. This is a permanent, full-time position and a senior-level position in a fast-paced office that frequently requires non-traditional work hours. Fluency in other language other than English (Creole, Arabic, Russian) highly preferred.",
    "responsibilities": [
      "Building strategic relationships with community leaders and constituent groups",
      "Executing various outreach activities",
      "Recruiting volunteers for events and outreach programs in the district",
      "Coordinating initiatives designed to promote the office and services to the community",
      "Managing an outreach and organizing plan for the team",
      "Any other assigned duties"
    ],
    "qualifications": [
      "Excellent organization, leadership, teamwork, and management skills",
      "Verbal and written communication skills",
      "Ties to Brooklyn",
      "Proven management record",
      "Minimum of three years of related experience",
      "Fluency in other language other than English (Creole, Arabic, Russian) highly preferred"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov. Please place DIRECTOR OF OUTREACH AND COMMUNITY ENGAGEMENT in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-132-21",
    "position_title": "Senior Advisor/Counsel",
    "office": "Congressman Tom McClintock (R-CA)",
    "location": "Washington, D.C.",
    "posting_date": "2021-05-24",
    "description": "The Office of Congressman Tom McClintock (R-CA) seeks applications for a Senior Advisor/Counsel to handle the Judiciary portfolio with an emphasis on immigration in the Washington, D.C. office.",
    "responsibilities": [
      "Advising the Member on all legislative areas within their portfolio",
      "Prepare and staff the Member in committee hearings and markups",
      "Draft and advance legislation",
      "Represent the Member in meetings with constituents and stakeholders concerning policy matters in their portfolio"
    ],
    "qualifications": [
      "Strong conservative credentials",
      "Effective writing and research skills",
      "Strong attention to detail",
      "The ability to manage multiple tasks at once",
      "Previous Capitol Hill experience and JD preferred"
    ],
    "how_to_apply": "To apply, please email resume and cover letter to gopwestcoastjobs@gmail.com with Subject: Senior Advisor/Counsel_LastName.FirstName",
    "salary_info": null,
    "contact": "gopwestcoastjobs@gmail.com",
    "equal_opportunity": null
  }
]