[
  {
    "id": "MEM-592-19",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Abby Finkenauer (IA-01)",
    "location": "Washington DC or Iowa",
    "posting_date": "2019-11-12",
    "description": "The Office of Congresswoman Abby Finkenauer (IA-01) seeks an experienced, creative, and motivated Communications Director to be a senior member of the team. The ideal candidate will possess excellent written and verbal communication skills, the ability to work in a fast-paced environment, experience developing and pitching stories, and the ability to execute a communications plan encompassing DC and in Iowa activities. The candidate will also have congressional and/or campaign experience, a good sense of humor, be able to foster a positive work environment, and have Iowa ties.\n\nThis position would be based out of Washington DC or Iowa, with associated travel as needed. The Communications Director will be expected to, among other duties: act as the primary spokesperson for the Member; develop and maintain relationships with media outlets in Iowa and nationally; implement a communications plan in-district and in DC; develop and successfully pitch press stories; oversee digital operations; mentor the Press Secretary; develop talking points, speeches, and press releases; hold regular media preparation sessions; work collaboratively with Iowa and national team members on all aspects of the office; and facilitate successful events and earned media in the district.",
    "responsibilities": [
      "act as the primary spokesperson for the Member",
      "develop and maintain relationships with media outlets in Iowa and nationally",
      "implement a communications plan in-district and in DC",
      "develop and successfully pitch press stories",
      "oversee digital operations",
      "mentor the Press Secretary",
      "develop talking points, speeches, and press releases",
      "hold regular media preparation sessions",
      "work collaboratively with Iowa and national team members on all aspects of the office",
      "facilitate successful events and earned media in the district"
    ],
    "qualifications": [
      "excellent written and verbal communication skills",
      "the ability to work in a fast-paced environment",
      "experience developing and pitching stories",
      "the ability to execute a communications plan encompassing DC and in Iowa activities",
      "congressional and/or campaign experience",
      "a good sense of humor",
      "be able to foster a positive work environment",
      "have Iowa ties"
    ],
    "how_to_apply": "Please e-mail a detailed resume and two writing samples to IA01Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "IA01Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-587-19",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Senior House Member",
    "location": null,
    "posting_date": "2019-11-12",
    "description": "Senior House Member seeks an experienced communications director to develop and execute press, media, and communications operations. This is not an entry-level position.",
    "responsibilities": [
      "cultivating and maintaining relationships with local and national outlets and reporters",
      "confidentiality, thoughtful discretion, and independent judgement in representing the Member’s position on policy issues",
      "writing speeches, opinions, press releases, statements, book forwards, and other public documents"
    ],
    "qualifications": [
      "exceptional communications (written, verbal, and listening) skills",
      "expertise in all aspects of media standards and relations, including on- and off-record press management",
      "digital media and newsroom experience",
      "a proven attention to detail",
      "the capacity to work under short deadlines in a high profile office",
      "knowledge of the legislative process and current events"
    ],
    "how_to_apply": "To apply, please e-mail a resume, cover letter and two writing samples in a single combined PDF file to NewJobOpening@mail.house.gov with “Communications Director” in the subject line. Drop-ins, phone calls, correspondence, and inquiries sent anywhere other than to the above e-mail address will not be considered.",
    "salary_info": null,
    "contact": "NewJobOpening@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer committed to and benefitting from an inclusive and diverse work environment."
  },
  {
    "id": "MEM-568-19",
    "position_title": "Counsel",
    "office": "House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law",
    "location": null,
    "posting_date": "2019-11-12",
    "description": "The House Judiciary Subcommittee on Antitrust, Commercial, and Administrative Law seeks a hard-working lawyer with significant legal experience to serve as counsel.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Subcommittee on matters of law and policy",
      "Drafting legislation",
      "Reviewing documents submitted in response to Committee information requests",
      "Coordinating hearings and witnesses",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to offices both on and off the Subcommittee on matters of antitrust law"
    ],
    "qualifications": [
      "A strong background in antitrust is required.",
      "Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are also strongly preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Antitrust Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-567-19",
    "position_title": "Counsel",
    "office": "Subcommittee on Oversight and Investigations of the Committee on Energy and Commerce Majority",
    "location": null,
    "posting_date": "2019-11-12",
    "description": "The Subcommittee on Oversight and Investigations of the Committee on Energy and Commerce Majority, seeks a counsel to work on investigative issues related to federal departments and agencies, especially those associated with the committee’s broad jurisdiction. Experience with federal agencies under the committee’s jurisdiction, including environment, energy, public health, communications, or consumer protection, is a plus. Desired skills include experience in congressional oversight and investigations and related processes and procedures.\n\nThis position includes responsibilities in planning and conducting congressional hearings, overseeing federal agencies, conducting research and investigations, writing and editing, and conducting document review and analysis. Successful candidate will be detail-oriented and possess strong communication and writing skills. Applicants should have a record of professional experience; J.D. required unless applicant has significant experience in the areas described for this position.",
    "responsibilities": [
      "Planning and conducting congressional hearings",
      "Overseeing federal agencies",
      "Conducting research and investigations",
      "Writing and editing",
      "Conducting document review and analysis"
    ],
    "qualifications": [
      "Detail-oriented",
      "Strong communication and writing skills",
      "Record of professional experience",
      "J.D. required unless applicant has significant experience in the areas described for this position."
    ],
    "how_to_apply": "Please send resume, cover letter, writing sample, and at least two professional references to ecdjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-566-19",
    "position_title": "Legislative Assistant",
    "office": "Rep. Paul Cook’s office",
    "location": "Washington, D.C.",
    "posting_date": "2019-11-12",
    "description": "Rep. Paul Cook’s office seeks a Legislative Assistant to cover Native\nAmerican, public lands, environmental, and agricultural issues, among others.\nExperience with House Natural Resources Committee, House Appropriations\nInterior Subcommittee, and/or the Department of the Interior preferred.\nCalifornia or Western state ties preferred. Strong writing proficiency required.\nCandidate will be expected to prepare materials for committee hearings and\nvote recommendations for markups in the House Natural Resources\nCommittee.\nThis person will also be responsible for drafting, introducing, and managing\nlegislation related to his/her issue areas. Additionally, this person will work\nwith fellow staffers to prepare vote recommendations for legislation before\nthe House. This person will work with the Communications Director to draft\npress releases, editorials, and social media posts related to the aforementioned\npolicy areas.",
    "responsibilities": [
      "Prepare materials for committee hearings",
      "Prepare vote recommendations for markups in the House Natural Resources Committee.",
      "Draft, introducing, and managing legislation related to his/her issue areas.",
      "Prepare vote recommendations for legislation before the House.",
      "Draft press releases, editorials, and social media posts related to the aforementioned policy areas."
    ],
    "qualifications": [
      "Minimum of 1-2 years legislative-branch, executive-branch, or relevant experience."
    ],
    "how_to_apply": "Please send a resume and cover letter to anna.dove2@mail.house.gov.",
    "salary_info": null,
    "contact": "anna.dove2@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-555-19",
    "position_title": "Press Assistant",
    "office": "Democratic Staff of the Committee on Science, Space and Technology",
    "location": null,
    "posting_date": "2019-11-12",
    "description": "The Democratic Staff of the Committee on Science, Space and Technology\nseeks a Press Assistant. The ideal candidate will be detail-oriented, have\nstrong writing skills, and a strong work ethic.\n\nDuties will include, but are not limited to, drafting press releases, statements,\nand op-eds; staffing Committee hearings and markups; and assisting with\nmaintenance of the official website and social media platforms. Hill\nexperience and an interest in science policy is a plus.",
    "responsibilities": [
      "Drafting press releases, statements, and op-eds",
      "Staffing Committee hearings and markups",
      "Assisting with maintenance of the official website and social media platforms"
    ],
    "qualifications": [
      "Detail-oriented",
      "Strong writing skills",
      "Strong work ethic",
      "Hill experience (a plus)",
      "Interest in science policy (a plus)"
    ],
    "how_to_apply": "Qualified applicants should email a resume, cover letter, writing sample, and\nsample social media graphic to sciresumes@mail.house.gov with “Press\nAssistant” in the subject line.",
    "salary_info": null,
    "contact": "sciresumes@mail.house.gov",
    "equal_opportunity": "We are equal opportunity employers; we do not\ndiscriminate on the basis of race, sex, color, age, religion, disability, national\norigin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-541-19",
    "position_title": "Press/Digital Assistant",
    "office": "Congressman Harley Rouda (CA-48)",
    "location": "Orange County office",
    "posting_date": "2019-12-11",
    "description": "The Office of Congressman Harley Rouda (CA-48) is seeking a Press/Digital Assistant in his Orange County office.\nQualified candidates will have strong writing, editing, and social media skills, as well as basic familiarity with graphic design/video editing software. One to two years of experience in a press or digital media role (including internships) preferred.\nThis position requires the ability to thrive under pressure, multi-task, and work in a team environment.",
    "responsibilities": [
      "Drafting social posts + press releases",
      "Compiling daily press clips",
      "Assisting with speechwriting",
      "Maintaining/updating website",
      "Filming speeches + events",
      "Designing graphics + editing photos/videos"
    ],
    "qualifications": [
      "Strong writing, editing, and social media skills",
      "Basic familiarity with graphic design/video editing software",
      "One to two years of experience in a press or digital media role (including internships) preferred.",
      "Ability to thrive under pressure, multi-task, and work in a team environment"
    ],
    "how_to_apply": "Interested applicants should email a cover letter, resume, and a short writing sample/portfolio to ca48resumes@gmail.com with \"Orange County Press/Digital Assistant\" in the subject line.",
    "salary_info": null,
    "contact": "ca48resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-539-19",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-11-12",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office. The Committee's financial disclosure counsel are responsible for reviewing and providing guidance on a high volume of financial disclosure issues, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Reviewing and providing guidance on a high volume of financial disclosure issues",
      "Education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, corporate finance, securities law, and criminal law.",
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-533-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Washington, DC",
    "posting_date": "2019-11-12",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to work on a broad range of portfolio issues. The ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position. Excellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. North Carolina ties preferred. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-532-19",
    "position_title": "Press Assistant",
    "office": "Southern Republican",
    "location": null,
    "posting_date": "2019-12-11",
    "description": "Southern Republican seeks an energetic Press Assistant to support\nCommunications Director. The ideal candidate will have experience in social\nmedia management and communications. Excellent writing, verbal and\norganizational skills are essential along with the ability to efficiently\ncommunicate while working in a fast-paced environment.",
    "responsibilities": [
      "Maintaining social media accounts",
      "Consistent communication with media networks."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should include in their application a resume and\nprofessional references. Please send applications to\ncongressionaljobs2805@gmail.com with “Press Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-531-19",
    "position_title": "Communications Director",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2019-12-11",
    "description": "Southern Republican seeks an experienced and enthusiastic Communications Director. The ideal candidate will have 2-3 years of member experience on the Hill. This is not an entry level position. Excellent writing, verbal and organizational skills are essential along with the ability to create and produce in a timely fashion while working in a fast-paced environment.",
    "responsibilities": [
      "Management of social media accounts to maintaining active and consistent engagement on various media networks."
    ],
    "qualifications": [
      "2-3 years of member experience on the Hill.",
      "Excellent writing, verbal and organizational skills",
      "Ability to create and produce in a timely fashion while working in a fast-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-519-19",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2019-11-12",
    "description": "Duties include assisting the technology needs of Committee staff; editing and maintaining the Committee's website; answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee's website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance are strongly encouraged to apply"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov",
    "salary_info": "$38,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Washington, D.C.",
    "posting_date": "2019-12-11",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others. The ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position. Excellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-462-19",
    "position_title": "Attorney",
    "office": "Office of the Law Revision Counsel",
    "location": "U.S. House of Representatives",
    "posting_date": "2019-11-12",
    "description": "The Office of the Law Revision Counsel-a small, nonpartisan office within the U.S. House of Representatives-seeks an attorney to assist in the editing and publishing of the United States Code, the codification of general and permanent Federal statutory law.\n\nIn addition to the basic tasks required to integrate new laws into the Code, other duties may be required, such as reviewing drafts of bills to enact titles as positive law, doing extensive research and editorial work to improve the organization of existing provisions in the Code, and assisting in the continuing modernization of the Office, including support of online and machine readable versions of the Code.\n\nPlease be aware that this is a long-term career position with the Office, not a stepping stone to another position within Congress or the Federal Government.",
    "responsibilities": [
      "reading new laws to determine which provisions should appear in the Code and where",
      "updating the Code to reflect new law and amendments to existing law",
      "writing concise editorial notes to explain amendments, effective dates, references within the text to other laws, and a variety of other legislative concepts",
      "preparing statutory citations and tables",
      "identifying errors in grammar and spelling",
      "conforming to very strict style guidelines"
    ],
    "qualifications": [
      "J.D. degree and attorney license in any U.S. jurisdiction or intention to obtain license within one year.",
      "At least one year of professional experience in editing or publishing, preferably in the legal field.",
      "Meticulous attention to detail and dedication to accuracy.",
      "Excellent verbal and written communication skills.",
      "Absolute proficiency in grammar, spelling, and usage.",
      "Ability to analyze and summarize complex legal issues.",
      "Ability to identify issues affecting Federal statutes and explain them clearly and concisely within firmly established parameters.",
      "Familiarity with Federal or State statutory law is highly desirable.",
      "This position is better suited to someone able to engage in extended periods of solitary work, often involving tedious and repetitive tasks.",
      "The ability to adhere to, and function comfortably within, established styles and practices is essential."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter with salary requirements to:\nuscodeapplicant@mail.house.gov\n\nApplicants will be evaluated based on the ability to meet the qualifications stated above. Significant weight will be given to the applicant's cover letter. If chosen for an interview, an applicant will be requested to submit a writing sample.",
    "salary_info": null,
    "contact": "uscodeapplicant@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2019-12-11",
    "description": "Qualified candidates should have a minimum of 2 years’ experience\nmanaging a team, possess excellent oral and written communications skills,\nhighly organized, meet deadlines, and manage multiple projects. A flexible\nschedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Meet deadlines",
      "Manage multiple projects",
      "Flexible schedule",
      "Ability to travel throughout the district"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample\nto cademhouseoffice@gmail.com please include Senior Staff in the subject\nline.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]