[
  {
    "id": "MEM-165-22",
    "position_title": "Senior Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2022-03-21",
    "description": "The Committee on Oversight and Government Reform is the principal\ninvestigative body for the U.S. House of Representatives. Chairwoman Carolyn\nMaloney (D-NY) seeks to fill a Senior Counsel position on the Democratic staff.\nSeveral years of investigative or litigation experience is required. Responsibilities\ninclude depositions, transcribed interviews, briefings, and managing\ncongressional investigations and hearings. Candidates with diverse backgrounds\nand experiences are strongly encouraged to apply. Candidates must have superior\nattention to detail, work well under pressure, be self-motivated, and possess\nexcellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Managing congressional investigations and hearings"
    ],
    "qualifications": [
      "Several years of investigative or litigation experience is required.",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with\n“Senior Counsel” in the subject line. Please attach the resume and cover letter\nwith the file name using the following format: “LastName.FirstName.Resume”\nand “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or dropins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-164-22",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Reform",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) seeks an attorney with several years of investigative or litigation experience for a Counsel position on the Democratic staff.\n\nIn this role, you will work with a team of energetic and supportive colleagues and manage all aspects of high-profile congressional investigations. Potential day-to-day work includes drafting letters, negotiating with counsel, conducting depositions and transcribed interviews, preparing reports and memoranda, briefing the Chairwoman and other Committee Members, and organizing congressional hearings.",
    "responsibilities": [
      "Drafting letters",
      "Negotiating with counsel",
      "Conducting depositions and transcribed interviews",
      "Preparing reports and memoranda",
      "Briefing the Chairwoman and other Committee Members",
      "Organizing congressional hearings"
    ],
    "qualifications": [
      "Previous Hill experience helpful but not required",
      "Candidates must have superior attention to detail",
      "Candidates must work well under pressure",
      "Candidates must be self-motivated",
      "Candidates must possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-163-22",
    "position_title": "Press Assistant/Digital Manager",
    "office": "Congressman Tony Cardenas (CA-29)",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "Congressman Tony Cardenas (CA-29) seeks an enthusiastic and hard-working\nPress Assistant/Digital Manager to join his Washington, D.C. office.\nThe ideal candidate is team-oriented, self-motivated and resourceful. Successful\napplicants will have strong writing and communication skills, work quickly under\npressure, be creative, proactive and strategic, work well with others and have a\nkeen sense of visual and graphic design.",
    "responsibilities": [
      "managing and creating content for social media platforms",
      "drafting press materials and e-newsletters",
      "maintaining the office's website",
      "leading photography and video production"
    ],
    "qualifications": [
      "1+ years of political, Capitol Hill or other government communications experience."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two writing samples and a digital\nportfolio to CA29Jobs@mail.house.gov by March 31, 2022.",
    "salary_info": null,
    "contact": "CA29Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages women, people of\ncolor, veterans and LGBTQIA+ candidates to apply."
  },
  {
    "id": "MEM-162-22",
    "position_title": "Staff Assistant",
    "office": "Representative Mike Levin (CA-49)",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "This position is responsible for managing the front desk, answering the DC office phones, operating the DC office internship program, coordinating constituents’ tour and flag requests, and handling other administrative duties of the office as needed.\n\nThe staff member in this role interacts regularly with constituents and should have a friendly, helpful demeanor. The ideal candidate should have strong written and verbal communications skills, extreme attention to detail, and a positive attitude.\n\nThis staff member should also be a self-starter who likes to solve problems and works well with a team. Strong organizational skills and a passion for helping others are essential to this role.",
    "responsibilities": [
      "Managing the front desk",
      "Answering the DC office phones",
      "Operating the DC office internship program",
      "Coordinating constituents’ tour and flag requests",
      "Handling other administrative duties of the office as needed"
    ],
    "qualifications": [
      "Friendly, helpful demeanor",
      "Strong written and verbal communications skills",
      "Extreme attention to detail",
      "Positive attitude",
      "Working knowledge of legislative issues is a plus",
      "Self-starter who likes to solve problems",
      "Works well with a team",
      "Strong organizational skills",
      "Passion for helping others"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, two writing samples, and a list of three references to ca49.applications@mail.house.gov. Please send all materials in one PDF document. Incomplete applications will not be considered.",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-161-22",
    "position_title": "Legislative Counsel",
    "office": "House Judiciary Subcommittee on Immigration and Citizenship",
    "location": "Capitol Hill",
    "posting_date": "2022-03-21",
    "description": "The House Judiciary Subcommittee on Immigration and Citizenship seeks a hardworking lawyer with significant experience in immigration and nationality law to\nserve as legislative counsel.\n\nA strong background in immigration law and policy is required. Exceptional\nwriting skills, sound political judgment, and the ability to work closely and\ncollaboratively with other congressional offices and advocacy organizations are\nessential. The ideal candidate will have Capitol Hill experience and a minimum\nof five years of experience in immigration law.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the\nJudiciary Committee on matters involving immigration law and policy",
      "Drafting legislation",
      "Coordinating hearings and witnesses",
      "Preparing Members for hearings\nand markups",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to other offices within the Democratic Caucus on immigration-related\nmatters"
    ],
    "qualifications": [
      "Strong background in immigration law and policy is required.",
      "Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are essential.",
      "The ideal candidate will have Capitol Hill experience and a minimum of five years of experience in immigration law."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample\nto JDEM.Job@mail.house.gov. Please include “Immigration Counsel” in the\nsubject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-160-22",
    "position_title": "District Director",
    "office": "North Carolina Democrat",
    "location": "North Carolina",
    "posting_date": "2022-03-21",
    "description": "North Carolina Democrat seeks District Director to oversee all operations of the district office, including the development and implementation of policy objectives, strategies, and operating plans, as well as direct all activities and staff of the district office.\n\nThis position is responsible for recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures; represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.\n\nResponsibilities include strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management. This individual also serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district, and acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region.",
    "responsibilities": [
      "Oversee all operations of the district office, including the development and implementation of policy objectives, strategies, and operating plans, as well as direct all activities and staff of the district office.",
      "Recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures.",
      "Represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.",
      "Strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management.",
      "Serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district, and acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region."
    ],
    "qualifications": [
      "Candidates must possess a bachelor’s degree preferably: business management, public administration, public policy and/or political science",
      "Have a minimum of 3-5 years of management experience",
      "A strong ability to provide necessary organization, leadership and motivation to manage a Congressional office",
      "Excellent oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "The ideal candidate is energetic, detail-oriented, able to multi-task, politically astute, and willing to work evenings and weekends in a fast-paced and demanding setting",
      "North Carolina ties are a plus."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing samples to nc12.resume@mail.house.gov , with “District Director” in the subject line, by Thursday March 31, 2022. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply. Consistent with applicable law, the Office requires all staff to be fully vaccinated against COVID-19 as a term and condition of employment."
  },
  {
    "id": "MEM-158-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks a Legislative Assistant to join her team in Washington, DC.\n\nIdeal candidates will have prior Hill experience; excellent written and verbal communication skills; strong organizational and time management skills; a positive attitude; solid knowledge of the legislative process; and an ability to work under pressure and meet deadlines in an fast-paced work environment. Experience with Intranet Quorum (IQ) is preferred.",
    "responsibilities": [
      "Formulating legislative initiatives for assigned issue areas;",
      "Tracking legislation and other developments in assigned issue areas and briefing the Congresswoman for floor work, committee work, work in the district, and outside House-related activities;",
      "Monitoring legislative developments within relevant committees;",
      "Planning and coordinating cosponsorship and support of legislation;",
      "Writing floor speeches for the Congresswoman;",
      "Acting as liaison with committee and agency staffs;",
      "Performing special projects assigned by the Congresswoman or Chief of Staff;",
      "Meeting with constituents and interest groups;",
      "Assisting with the preparation of weekly reports for the Congresswoman and staff on legislative activities in assigned issue areas;",
      "Performing other duties as assigned."
    ],
    "qualifications": [
      "Prior Hill experience",
      "Excellent written and verbal communication skills",
      "Strong organizational and time management skills",
      "A positive attitude",
      "Solid knowledge of the legislative process",
      "Ability to work under pressure and meet deadlines in a fast-paced work environment",
      "Experience with Intranet Quorum (IQ) is preferred",
      "Connecticut ties are a plus, but not required"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter, resume, two writing samples and two references in a single PDF to CT05jobs@mail.house.gov with the following subject line: Full name - Legislative Assistant. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-157-22",
    "position_title": "Director of Operations and Scheduler",
    "office": "Congressman Wittman",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "The Director of Operations position will guarantee continued excellence in constituent services through overseeing a collaborative and strategic scheduling operation, ensuring a one-stop-shop model for all DC constituent interactions, maximizing each dollar of the Members Representational Allowance (MRA) in serving the constituents of the First District, and through taking a larger role overall in office strategy and goalsetting.\n\nThe Director of Operations maintains the Congressman's schedule, travel plans, and related records. This position acts as a liaison for the Congressman with the staff, public, industry, Members of Congress, and Administration officials.\n\nThe Director of Operations is also the financial point of contact for the office responsible for: tracking bills and vendor contracts, creating vouchers for payment by the Finance office, tracking and submitted Member and staff reimbursements, keeping equipment inventory current and well documented, recommending year end equipment and supply purchases to the Chief and Member, maintaining and submitting all travel and purchase card statements, and making sure the office complies with all ethics criteria.\n\nThis position also supervises the staff assistant and front office operations and coordinates with the Staff Assistant on the hiring, training, and maintenance of the intern program. This is not an entry level position and previous Capitol Hill, or executive assistant experience is strongly preferred.",
    "responsibilities": [
      "Overseeing a collaborative and strategic scheduling operation",
      "Ensuring a one-stop-shop model for all DC constituent interactions",
      "Maximizing each dollar of the Members Representational Allowance (MRA) in serving the constituents of the First District",
      "Taking a larger role overall in office strategy and goalsetting",
      "Maintaining the Congressman's schedule, travel plans, and related records",
      "Acting as a liaison for the Congressman with the staff, public, industry, Members of Congress, and Administration officials",
      "Tracking bills and vendor contracts",
      "Creating vouchers for payment by the Finance office",
      "Tracking and submitted Member and staff reimbursements",
      "Keeping equipment inventory current and well documented",
      "Recommending year end equipment and supply purchases to the Chief and Member",
      "Maintaining and submitting all travel and purchase card statements",
      "Making sure the office complies with all ethics criteria",
      "Supervising the staff assistant and front office operations",
      "Coordinating with the Staff Assistant on the hiring, training, and maintenance of the intern program"
    ],
    "qualifications": [
      "Organized with an exceptional attention to detail",
      "Able to handle a fast-paced and demanding work environment",
      "Possess strong people skills with the temperament to communicate with a variety of personalities in a pleasant and professional manner",
      "Previous Capitol Hill, or executive assistant experience is strongly preferred",
      "Virginia ties a plus"
    ],
    "how_to_apply": "Email resume and cover letter to with “Wittman Director of Operations” in the subject line to Carolyn.King@mail.house.gov.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-155-22",
    "position_title": "Scheduler",
    "office": "Congressman Emanuel Cleaver",
    "location": "DC",
    "posting_date": "2022-03-21",
    "description": "The Office of Congressman Emanuel Cleaver is seeking a Scheduler for his DC office. This is not an entry-level position. Candidates must have exceptional organizational skills, meticulous attention to detail, the ability to prioritize and manage multiple tasks under tight deadlines and the ability to work under pressure in a fast-paced environment.\n\nThe DC Scheduler serves in an important advisory capacity for the Member and works closely with the Chief of Staff, District Scheduler, communications, and policy teams to coordinate the Member’s official schedule and arrange travel plans. This position is responsible for managing the Member’s daily and long-term DC schedule; evaluating, organizing and responding to all incoming DC meeting requests; creating and booking complex travel arrangements; coordinating with the campaign staff on political scheduling requests; and occasionally spearheading other projects as assigned.\n\nThe successful candidate will have strong written and verbal communication skills, be a proactive self-starter, and be someone who enjoys and can successfully work collaboratively as part of a close-knit team. The ideal candidate will have Congressional work experience and prior scheduling experience.",
    "responsibilities": [
      "Managing the Member’s daily and long-term DC schedule",
      "Evaluating, organizing and responding to all incoming DC meeting requests",
      "Creating and booking complex travel arrangements",
      "Coordinating with the campaign staff on political scheduling requests",
      "Occasionally spearheading other projects as assigned"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Meticulous attention to detail",
      "The ability to prioritize and manage multiple tasks under tight deadlines",
      "The ability to work under pressure in a fast-paced environment",
      "Strong written and verbal communication skills",
      "Be a proactive self-starter",
      "Ability to work collaboratively as part of a close-knit team",
      "Congressional work experience and prior scheduling experience (ideal)"
    ],
    "how_to_apply": "Please submit your resume and cover letter to midwest.jobs@mail.house.gov with Scheduler in the title. Applications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "midwest.jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply. Consistent with applicable law, this office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment."
  },
  {
    "id": "MEM-154-22",
    "position_title": "Communications Director",
    "office": "Congresswoman Rosa DeLauro (CT-03)",
    "location": "DC and the district",
    "posting_date": "2022-03-21",
    "description": "Responsibilities include planning and implementing a communications strategy across a broad portfolio, working closely with legislative, district, and appropriations staff to effectively communicate her message, handling daily media inquiries, maintaining relationships with national and local reporters, writing talking points and press releases, pitching op-eds, managing the website, producing videos and social media content, planning and pitching press events in DC and the district, overseeing daily clips, and keeping press lists up-to-date.\nIdeal applicants will have Hill press experience, strong writing and oral communication skills, the ability to multitask and prioritize under pressure, and a good sense of humor. Connecticut ties are a plus.\nThis office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment.",
    "responsibilities": [
      "Planning and implementing a communications strategy across a broad portfolio",
      "Working closely with legislative, district, and appropriations staff to effectively communicate her message",
      "Handling daily media inquiries",
      "Maintaining relationships with national and local reporters",
      "Writing talking points and press releases",
      "Pitching op-eds",
      "Managing the website",
      "Producing videos and social media content",
      "Planning and pitching press events in DC and the district",
      "Overseeing daily clips",
      "Keeping press lists up-to-date"
    ],
    "qualifications": [
      "Hill press experience",
      "Strong writing and oral communication skills",
      "The ability to multitask and prioritize under pressure",
      "A good sense of humor",
      "Connecticut ties are a plus"
    ],
    "how_to_apply": "Please send cover letter, resume, and a writing sample as one attachment to CTCommsJob@gmail.com.",
    "salary_info": null,
    "contact": "CTCommsJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-152-22",
    "position_title": "Legislative Correspondent",
    "office": "Congressman Kurt Schrader (OR-05)",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "Congressman Kurt Schrader (OR-05), a member of the House Committee on Energy and Commerce and senior member of the Blue Dog Coalition, is seeking a Legislative Correspondent in his Washington, DC office.\nIdeal candidates must be highly motivated self-starters with excellent writing and research skills and an ability to work under tight deadlines in a dynamic work environment. Oregon ties and experience with moderate Democratic messaging is a plus.",
    "responsibilities": [
      "Manages and maintains a high-volume constituent correspondence system;",
      "Ensures that responses to constituent letters are completed in a timely manner;",
      "Conducts any research necessary to formulate response to letters;",
      "Creates and maintains a collection of prepared responses for use in responding to constituent mail;",
      "Works with members of the Legislative staff to ensure correspondence is up to date;",
      "Manages the approval chain from legislative staff to the Member of Congress;",
      "Supervises the printing and proofreading of form letters;",
      "Assists Communications team with 499 strategy and implementation;",
      "Drafts responses to constituent mail that cannot be answered with a form letter;",
      "Organizes incoming correspondence and maintains Fireside system;",
      "Compiles weekly mail reports for the Member and legislative staff including mail volume, processing statistics, and policy issues raised in incoming constituent mail;",
      "Assists with answering phones as needed;",
      "Reports to the Legislative Director;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Excellent research, writing and communication skills;",
      "Knowledge of the legislative process;",
      "Strong organizational skills;",
      "Ability to exercise discretion, use independent judgement, and work cooperatively and courteously with others;",
      "Thoroughness and attention to detail;",
      "Fireside experience strongly preferred;",
      "Availability to work long hours and at night."
    ],
    "how_to_apply": "Please email your resume, cover letter, and a writing sample to: OR05KS.resumes@mail.house.gov with subject line: Legislative Correspondent.",
    "salary_info": "$48,000-58,000 plus full federal health and retirement benefits and student loan reimbursement (terms apply)",
    "contact": "OR05KS.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and as such is committed to building and maintaining an inclusive and diverse work environment. All qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-151-22",
    "position_title": "Press Secretary/Deputy Communications Director",
    "office": "Congressman Kurt Schrader (OR-05)",
    "location": "Oregon",
    "posting_date": "2022-03-21",
    "description": "The staff member in this position will assist with all aspects of strategic communications including press, social media, mass communications and constituent correspondence.",
    "responsibilities": [
      "Work with the Communications Director based in DC to execute comprehensive national and district media outreach, public relations and communication strategies;",
      "Act as Member’s primary spokesperson;",
      "Provide logistical and technical support to Congressman Schrader for radio and television interviews;",
      "Proactively seek media opportunities and work with the Communications Director to manage and catalogue incoming media requests",
      "Assist in managing the official website, crafting social media posts including Facebook and Twitter posts, designing graphics, monitoring social channels, and shooting and editing professional videos using office technology and Adobe Creative Suite;",
      "In coordination with the Communications Director, draft press releases, talking points, speeches, op-eds, newsletters, questionnaires, and other written materials;",
      "Maintain and update both national and district press lists and drafting and distributing media advisories",
      "Manage logistics for town halls, Oregon press conferences, and other publicfacing events, both virtual and in-person;",
      "Support on administrative functions of the office as needed such as constituent calls and data entry",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Qualifications include a working knowledge of Oregon’s 5th Congressional District and understanding of Oregon’s print, broadcast, and online media landscape.",
      "Strong written and oral, and organization skills, and a capacity to work both independently and as part of a team.",
      "2 to 3 years of experience.",
      "Spanish language proficiency is a plus."
    ],
    "how_to_apply": "Please email your resume and cover letter to: OR05KS.resumes@mail.house.gov with subject line: Press Secretary.",
    "salary_info": "$55,000-75,000 plus full federal health and retirement benefits and student loan reimbursement (terms apply).",
    "contact": "OR05KS.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and as such is committed to building and maintaining an inclusive and diverse work environment. All qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-149-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-03-21",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks)",
      "Intern coordinator by recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing, and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to:",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-148-22",
    "position_title": "Staff Director/Chief Counsel",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "The subcommittee’s jurisdiction comprises a diverse set of issues, including consumer affairs and consumer protection, tech accountability, consumer privacy and data security, auto safety, consumer product safety, regulation of commercial practices, including sports-related matters, among other issues.",
    "responsibilities": [
      "Managing a team to prepare and staff hearings and markups, draft legislation, and advise staff and Members of Congress on legislative and non-legislative matters – this includes review and approval of all written materials;",
      "Working with the Chairman, Subcommittee Chair, and Senior Committee Staff to set and implement Subcommittee priorities, strategy, and messaging; and",
      "Advising Members of Congress and their staffs on the issues before the Subcommittee."
    ],
    "qualifications": [
      "Minimum of 6 years of Congressional experience or other relevant experience, including experience developing and managing a team;",
      "Strong background and knowledge of issues within the Subcommittee’s jurisdiction, including current legislative and non-legislative issues before the Subcommittee;",
      "Thorough understanding of the legislative process and the organization and procedures of the House of Representatives;",
      "Superior writing, analytical, and legislative skills, including explaining policy issues in ways that people can easily understand;",
      "Sound political judgment and the ability to think creatively to design and implement Subcommittee priorities and strategies;",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities and excellent organizational and time management skills;",
      "Willingness to work long hours and weekends; and",
      "Experience working with relevant public interest groups, agencies, Members of Congress and their staffs, and industry stakeholders"
    ],
    "how_to_apply": "Please submit a cover letter, resume, short writing sample, and at least three professional references to ecdjobs@mail.house.gov using the subject line: Consumer Protection Staff Director Candidate [Your Name].",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age."
  },
  {
    "id": "MEM-146-22",
    "position_title": "Scheduler",
    "office": "Rep. Judy Chu (CA-27)",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "This individual will be responsible for the Member’s daily and long-term schedule in D.C. and work in close coordination with the district scheduler.\n\nThis individual must be a good writer, politically savvy, able to multi-task, meticulously organized, and able to quickly solve problems in a fast-paced work environment. Candidate should be comfortable dealing with a wide variety of people and stakeholders.\n\nPrevious Capitol Hill scheduling or other scheduling experience is preferred. A good sense of humor is a must.\n\nConsistent with applicable law, this office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment.",
    "responsibilities": [
      "Managing invitations and scheduling requests",
      "Travel and logistical details",
      "Acting as a liaison to constituent groups",
      "Handling the member’s correspondence",
      "Various additional administrative duties"
    ],
    "qualifications": [
      "Good writer",
      "Politically savvy",
      "Able to multi-task",
      "Meticulously organized",
      "Able to quickly solve problems in a fast-paced work environment",
      "Comfortable dealing with a wide variety of people and stakeholders",
      "Previous Capitol Hill scheduling or other scheduling experience is preferred",
      "A good sense of humor is a must"
    ],
    "how_to_apply": "To apply, please email cover letter and resume in one PDF document to ca27jobs@gmail.com. Please include Scheduler in the subject line. No phone calls or drop-ins please!",
    "salary_info": null,
    "contact": "ca27jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-140-22",
    "position_title": "Legislative Correspondent",
    "office": "Office of Congresswoman Elissa Slotkin (D-MI)",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "The Office of Congresswoman Elissa Slotkin (D-MI) seeks a motivated, organized, and detail-oriented Legislative Correspondent with exceptional written and oral communication skills to join the team.\n\nProfessional development and advancement opportunities are a priority for Congresswoman Slotkin, so the position also presents opportunities to take on legislative or communications work, as the candidate grows in the job.",
    "responsibilities": [
      "Managing and organizing incoming communications from constituents, and drafting substantive written responses in a timely manner.",
      "Engaging with constituents directly to provide more specific responses when appropriate, and working with both the legislative and communications teams to manage a robust, proactive constituent outreach operation.",
      "Managing and recruiting the office’s interns."
    ],
    "qualifications": [
      "This office has a fast-paced, collegial environment and places an emphasis on ensuring that staff have a direct line of communication with the Congresswoman.",
      "Candidates must be able to work both collaboratively and individually, and be able to produce high quality work in a fast-paced environment. Must be self-motivated.",
      "Responsiveness and engagement with constituents are a top priority for this office, so applicants should be prepared to manage an expansive mail program.",
      "Previous Capitol Hill experience and knowledge of Internet Quorum are preferred.",
      "Ties to Michigan are preferred."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and two writing samples to jobs.mi08@mail.house.gov. Please include “Legislative Correspondent, [YOUR NAME]” in the subject line.",
    "salary_info": "Salary will be between $43,500 and $50,000 per year, pursuant to candidates’ previous experience.\nBenefits package through the U.S. House of Representatives includes health insurance, retirement matching, student loan repayment, and transit benefits. 15 days of paid leave per year, plus sick leave.\nFlexible teleworking options.",
    "contact": "jobs.mi08@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Elissa Slotkin is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status. Women, people of color, veterans, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-139-22",
    "position_title": "Scheduler/Director of Scheduling (exact title dependent on experience)",
    "office": "Congresswoman Mary Gay Scanlon (PA-05)",
    "location": "DC and District",
    "posting_date": "2022-03-21",
    "description": "Congresswoman Mary Gay Scanlon (PA-05) is hiring a scheduler who will take responsibility for maintaining the Congresswoman's DC and District schedule, travel plans, and related records and acts as a liaison for the Congresswoman with the staff, public, and other Members of Congress.\nCome join the office awarded “Best Workplace Environment” by the Congressional Management Foundation!\nThis is a position of great trust in the office and the successful candidate should have experience as a Scheduler in the House or Senate. We are particularly looking for candidates who want to pursue scheduling and operations as a career.\nA candidate with significant (2+ years) of experience with Congressional scheduling will be considered for a position on the Senior Staff.",
    "responsibilities": [
      "Maintaining the Congresswoman's DC and District schedule",
      "Maintaining travel plans",
      "Maintaining related records",
      "Acting as a liaison for the Congresswoman with the staff, public, and other Members of Congress"
    ],
    "qualifications": [
      "Experience as a Scheduler in the House or Senate",
      "2+ years of experience with Congressional scheduling (for Senior Staff consideration)"
    ],
    "how_to_apply": "Interested candidates should submit a one-page cover letter and resume in a single PDF to employment.scanlon@mail.house.gov with the subject line “FIRST AND LAST NAME - Scheduling” by Friday, March 25.",
    "salary_info": null,
    "contact": "employment.scanlon@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Diverse candidates are encouraged to apply. Absolutely no calls or drop-ins."
  },
  {
    "id": "MEM-134-22",
    "position_title": "Press Secretary|Digital Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Southern California|Los Angeles",
    "posting_date": "2022-03-21",
    "description": "Representative Nanette Diaz Barragan (CA-44) is seeking a talented and highly motivated individual to assume the role of Press Secretary|Digital Director. The person chosen for the position will work closely with the Communications Director to develop and execute the Congresswoman’s long-term communications plan. They will be charged with overseeing the communications schedule, managing the Member’s digital media accounts, and working with local and national reporters.\n\nThe Press Secretary|Digital Director will be responsible for a wide range of critical functions, including developing original social media content, designing graphics, editing and posting videos, maintaining the office’s website, and managing media lists. Additionally, they will assist the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics",
      "Editing and posting videos",
      "Maintaining the office’s website",
      "Managing media lists",
      "Assisting the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials."
    ],
    "qualifications": [
      "Must have strong writing, editing, proofreading skills",
      "Be proficient in photography, video recording and editing",
      "Must be detail-oriented, news savvy and able to work in a fast-paced, demanding work setting",
      "A sense of humor and ability to be a team player is a must",
      "Spanish fluency preferred",
      "This is not an entry-level position. Previous experience in press or relevant social media experience is required.",
      "Experience with Adobe Creative Cloud Products are a plus.",
      "Southern California|Los Angeles ties are a plus."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples with “Press Secretary” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-133-22",
    "position_title": "Legislative Assistant|CHC Liaison",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC House office",
    "posting_date": "2022-03-21",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks a highly talented and motivated individual to serve as a Legislative Assistant|CHC Liaison in Washington, DC House office - with the primary responsibilities of handling the Member’s immigration, foreign affairs, military, and criminal justice, Homeland Security Committee work, and serve as Member’s liaison to the Congressional Hispanic Caucus (CHC). Candidates must have a proven record of proposing legislation, developing amendments, and leading on letters.",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various legislative vehicles;",
      "Preparing hearing binders and questions for witnesses for Homeland Security Committee hearings;",
      "Drafting talking points, vote recommendations and other materials;",
      "Monitoring and analyzing legislative developments, committee proceedings, news stories and other relevant info; and",
      "Representing the Member in meetings with constituents and stakeholders."
    ],
    "qualifications": [
      "Candidates must have an ability to work under pressure and meet deadlines in a fast-paced work environment.",
      "Strong organizational and time management skills, excellent written and verbal communication skills, and a keen attention to detail are required.",
      "Spanish language skills preferred.",
      "Southern California ties a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-132-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "Representative Nanette Diaz Barragán (CA-44) seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, and energetic.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
    "responsibilities": [
      "Oversee day-to-day press operations, including coordinating and managing the press team",
      "Responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member’s social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters and franked mailings",
      "Working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging",
      "Maintaining the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base"
    ],
    "qualifications": [
      "NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill.",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political judgment and instincts",
      "Possess superior writing, editing, and proofreading skills",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Fluency in Spanish is a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus.",
      "Willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-131-22",
    "position_title": "Scheduler",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "DC and the District",
    "posting_date": "2022-03-21",
    "description": "Main responsibilities include maintaining the Member's daily and long-term schedules for both DC and the District; organizing and evaluating all incoming meeting requests and invitations; keeping the Member on schedule throughout the day; working with legislative and communications staff to ensure the Member is prepared for events/meetings; coordinating travel arrangements; processing and managing expenses and reimbursements for the Member; and communicating with constituents by phone and email to address requests, concerns, and questions.\n\nAdditional responsibilities include other administrative tasks.",
    "responsibilities": [
      "Maintaining the Member's daily and long-term schedules for both DC and the District",
      "Organizing and evaluating all incoming meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Coordinating travel arrangements",
      "Processing and managing expenses and reimbursements for the Member",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented and able to multi-task",
      "Resourceful",
      "Team-oriented",
      "Positive attitude",
      "Availability outside of regular business hours including some weekend availability as needed",
      "Previous scheduling experience (at least one year in a similar position)",
      "Southern California | Los Angeles Metro area ties and Spanish fluency are a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three references with “SCHEDULER” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-127-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee (MI-05)",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "The legislative assistant will be responsible for important issues areas such as worker and family support, education, labor, transportation, among other issues, in a fast-paced congressional office for a member of House Democratic Leadership on the Ways and Means, Budget, and Science, Space and Technology Committees.",
    "responsibilities": [
      "Drafting bills and amendments",
      "Developing strategic plans to advance legislation through Congress",
      "Staffing committee meetings",
      "Interacting with constituents, district stakeholders, committee/leadership committee staff and federal agencies",
      "Writing policy briefing memos and talking points"
    ],
    "qualifications": [
      "Self-starting personality",
      "Strong written and verbal communication skills",
      "A desire to continually learn and grow",
      "An eagerness to work on a team in a collaborative office environment",
      "A minimum two years of relevant experience is required",
      "Michigan ties preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to Michigan05jobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-118-22",
    "position_title": "Communications Director",
    "office": "Rep. Dina Titus",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "Rep. Dina Titus seeks an organized and detail-oriented Communications Director with strong written and verbal communication skills for her Washington, D.C. office.\n\nThe Communications Director is expected to develop and execute a coordinated press strategy, in conjunction with the Policy Team and District staff, to inform constituents and the media on issues that are important to Nevada’s 1st District.\n\nThe Communications Director will review, draft, and finalize all statements, press releases, media advisories, and manage a robust social media portfolio.\n\nFinally, the Communications Director will have direct supervision over other staff working on press related issues.",
    "responsibilities": [],
    "qualifications": [
      "Candidates should have previous experience developing a communications strategy for a Member of Congress, elected official, Federal agency, private, and/or non-profit organization and the ability to make split-second decisions and develop communications under tight deadlines.",
      "Qualified candidates should be comfortable navigating difficult situations with press and have experience building and maintaining relationships with members of local and national press.",
      "Candidates should have strong time management skills, the ability to work under pressure, and be comfortable balancing multiple responsibilities at once."
    ],
    "how_to_apply": "Those interested in applying should e-mail a cover letter, resume, and two writing samples to NV01Jobs@gmail.com subject: “Communications Director.”",
    "salary_info": null,
    "contact": "NV01Jobs@gmail.com",
    "equal_opportunity": "Rep. Titus is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-115-22",
    "position_title": "Body Person/District Scheduler",
    "office": "Office of Congresswoman Sara Jacobs (CA-53)",
    "location": "San Diego",
    "posting_date": "2022-03-21",
    "description": "The Office of Congresswoman Sara Jacobs (CA-53) is looking for a calm, quickthinking, and detail-oriented Body Person/District Scheduler for the San Diego office.\n\nOther responsibilities will include assisting the Director of Scheduling and Operations with scheduling events in San Diego, helping to manage the Congresswoman’s calendar, event planning, relaying necessary information from events to the district team, and other administrative duties as assigned.",
    "responsibilities": [
      "Driving and staffing the Congresswoman while she is in San Diego.",
      "Assisting the Director of Scheduling and Operations with scheduling events in San Diego.",
      "Helping to manage the Congresswoman’s calendar.",
      "Event planning.",
      "Relaying necessary information from events to the district team.",
      "Other administrative duties as assigned."
    ],
    "qualifications": [
      "Good judgment",
      "Common sense",
      "An eye for detail",
      "A good sense of humor",
      "Able to anticipate the needs of the principal",
      "Problem-solve on their feet",
      "Calm under pressure",
      "Closely follow San Diego government and politics",
      "Valid driver’s license",
      "Daily access to a vehicle",
      "A good driving record",
      "Bilingual skills are preferred"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume with “Jacobs - Body Person” in the subject line to SaraJacobs.Resumes@mail.house.gov. Applications will be considered on a rolling basis, with priority given to earlier applicants.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Jacobs is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-109-22",
    "position_title": "Scheduler/Administrative Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "U.S. Congressman Ed Case (Hawai'i - 01) is seeking a Scheduler/Administrative Assistant for his Washington, D.C. office.\n\nScheduling duties include but are not limited to managing all aspects of the Congressman's daily and long-term schedule in D.C., Hawai'i and elsewhere. Other duties include coordinating and implementing administrative functions of the D.C. office, including constituent mail, tours requests, inventory management and records management. Direct report is to the Chief of Staff, although the individual will work closely with the Deputy Chief of Staff and the Congressman is routinely involved in all aspects of his office operations.\n\nPreference given to (1) prior Capitol Hill experience, (2) prior scheduling experience and (3) Hawai'i background. Applicants are asked to detail these attributes in their application package.\n\nThe position also requires initiative, strong interpersonal skills, multitasking, the ability to work independently and effectively under pressure, make decisions and solve problems, orientation to detail, excellent verbal communication and writing skills, and long hours especially adjusting to changing time zones.",
    "responsibilities": [
      "Managing all aspects of the Congressman's daily and long-term schedule in D.C., Hawai'i and elsewhere.",
      "Coordinating and implementing administrative functions of the D.C. office, including constituent mail, tours requests, inventory management and records management."
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Prior scheduling experience",
      "Hawai'i background",
      "Initiative",
      "Strong interpersonal skills",
      "Multitasking",
      "The ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours, especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Scheduler/Administrative Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-108-22",
    "position_title": "Legislative Assistant",
    "office": "Representative Kilmer",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "Representative Kilmer seeks a Legislative Assistant to support his work on\ninterior, environment, and related issues, including his work on the\nAppropriations Subcommittee on Interior and Environment.\nThe portfolio will also include managing an active and diverse policy portfolio\nthat includes Energy, Environment, Fisheries/Oceans, Natural Resources/ Public\nLands, and Native American issues.\nThis is not an entry-level position and prior Hill experience is strongly preferred.\nCandidates must have excellent written and verbal communication skills, be\nentrepreneurial and adept at multitasking, and enjoy working as part of a\ncollaborative team in an active and fast-paced office. The ideal candidate will\nhave experience working on natural resource and tribal issues in the Pacific\nNorthwest and a clear understanding of the appropriations process.\nDiverse candidates, women, and LGBTQ persons are strongly encouraged to\napply. This office is an equal opportunity employer and does not discriminate on\nthe basis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. Washington state ties are a plus but not required.",
    "responsibilities": [
      "managing appropriations requests",
      "staffing committee hearings and markups",
      "developing and advancing legislative priorities",
      "drafting cosponsor and vote recommendations",
      "writing policy memos and talking points",
      "working directly with stakeholders and constituents"
    ],
    "qualifications": [
      "prior Hill experience is strongly preferred",
      "excellent written and verbal communication skills",
      "entrepreneurial and adept at multitasking",
      "experience working on natural resource and tribal issues in the Pacific Northwest",
      "understanding of the appropriations process",
      "ability to work as part of a collaborative team in an active and fast-paced office"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two short writing samples, three\nreferences, and if willing your best joke, to Kilmer.Resumes@mail.house.gov with the subject line “LAST NAME Natural Resources LA.”",
    "salary_info": null,
    "contact": "Kilmer.Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on\nthe basis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status."
  },
  {
    "id": "MEM-105-22",
    "position_title": "Staff Assistant",
    "office": "California Democratic Congressman",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "Responsibilities include driving the Congressman to official business, managing the front office, answering phones, processing flag and tour requests, and additional administrative duties as required.\n\nCandidates should be dependable, hardworking, and resourceful. This position requires excellent interpersonal and time management skills, as well as the ability to work in a fast-paced environment. California ties are preferred. Candidates must possess a car and driver's license in good standing.",
    "responsibilities": [
      "Driving the Congressman to official business",
      "Managing the front office",
      "Answering phones",
      "Processing flag and tour requests",
      "Additional administrative duties as required"
    ],
    "qualifications": [
      "Dependable",
      "Hardworking",
      "Resourceful",
      "Excellent interpersonal and time management skills",
      "Ability to work in a fast-paced environment",
      "California ties are preferred",
      "Must possess a car and driver's license in good standing"
    ],
    "how_to_apply": "Qualified candidates should send a resume, cover letter, and 1-2 page writing sample to CAHouseJob@mail.house.gov and include “Staff Assistant” in the subject line. Applications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "CAHouseJob@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-102-22",
    "position_title": "Scheduler/Office Manager",
    "office": "Senior Democratic Congresswoman",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "Responsibilities include managing office calendars and visitor access to Member, organizing and tracking meeting and event invitations, speaking engagements, travel reservations and other requests for the Member, coordinating with district staff, and managing administrative matters for office operation. The position also manages the office's intern program.\n\nThe Scheduler/Office Manager will work closely with other staff members, particularly senior staff, to ensure efficient and seamless office operations. Ideal candidates are flexible, responsive, collaborative, work well under pressure and on short deadlines, and are able to balance competing demands.\n\nCandidates must be available to assist the Member outside of regular business hours. Applicants should also have a positive attitude, excellent organizational skills, strong written and verbal communication and interpersonal skills, political instincts and an ability to thrive in a fast-paced environment.\n\nThis is not an entry-level position. Previous Capitol Hill operational and/or scheduling experience is required, 3+ years of experience a plus. Ohio ties a plus.\n\nNo phone calls, emails, or drop-bys.",
    "responsibilities": [
      "managing office calendars and visitor access to Member",
      "organizing and tracking meeting and event invitations",
      "speaking engagements",
      "travel reservations and other requests for the Member",
      "coordinating with district staff",
      "managing administrative matters for office operation",
      "managing the office's intern program"
    ],
    "qualifications": [
      "flexible",
      "responsive",
      "collaborative",
      "work well under pressure and on short deadlines",
      "able to balance competing demands",
      "positive attitude",
      "excellent organizational skills",
      "strong written and verbal communication and interpersonal skills",
      "political instincts",
      "ability to thrive in a fast-paced environment",
      "Previous Capitol Hill operational and/or scheduling experience is required",
      "3+ years of experience a plus",
      "Ohio ties a plus"
    ],
    "how_to_apply": "Please submit cover letter, and resume to Midwestern.Resume@mail.house.gov.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-101-22",
    "position_title": "Deputy Chief of Staff",
    "office": "Midwest Republican Member",
    "location": "Capitol Hill",
    "posting_date": "2022-03-21",
    "description": "Midwest Republican Member looking to add Deputy Chief of Staff to growing team.",
    "responsibilities": [
      "Assisting Chief of Staff with day-to-day operations.",
      "Engaged in legislative activities and works with the Legislative Director on oversight of the policy team.",
      "Works closely with the district operation to create a consistent communication for the whole team."
    ],
    "qualifications": [
      "Ideal candidates have operations and/or legislative experience.",
      "Candidates must have prior Capitol Hill or relevant policy experience, be highly motivated, detail-oriented professionals with strong organizational and time-management skills."
    ],
    "how_to_apply": "Interested candidates should end a resume to: midwestgopmember@gmail.com",
    "salary_info": null,
    "contact": "midwestgopmember@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-100-22",
    "position_title": "Press Secretary/Digital Director",
    "office": "House Republican",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "Candidates must excel in a fast-paced existing press operation. Familiarity or existing contacts with conservative media outlets a major plus. Position based in Washington, DC office. Must work well under pressure.",
    "responsibilities": [
      "Successfully pitch and book the Member on national tv and radio",
      "Develop and assist with press releases, talking points, op-eds, and other materials",
      "Grow and manage a national press list",
      "Create compelling social media content",
      "Assist with maintaining office's website and social media accounts",
      "Create and edit videos and graphics",
      "Monitor the Congressman's presence and interactions on social media, keeping Communications Director and Chief of Staff up to date on emerging trends and important conversations happening online",
      "Take photos/video at events",
      "Compile daily clips"
    ],
    "qualifications": [
      "Video filming and editing skills",
      "Excellent research skills",
      "Above-average writing ability"
    ],
    "how_to_apply": "Please submit your resume to Midwestern.Job@mail.house.gov with “Press Secretary/Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "Midwestern.Job@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-098-22",
    "position_title": "Constituent Services Representative",
    "office": "Office of Congressman Tom Malinowski",
    "location": "Somerville, NJ",
    "posting_date": "2022-03-21",
    "description": "The Office of Congressman Tom Malinowski seeks a Constituent Services\nRepresentative based in his Somerville, NJ office to advocate on behalf of\nconstituents seeking assistance with federal agencies or accessing federal benefits\nor resources.\n\nThis is a public-facing position, directly assisting constituents of New Jersey’s\n7th Congressional District. Applicants must possess the temperament to\ncommunicate in a tactful, pleasant, and professional manner at all times.",
    "responsibilities": [
      "Advocate on behalf of constituents seeking assistance with matters before\nfederal agencies; this could include but is not limited to assistance with the IRS,\ntravel and immigration, social security, medicare, and veterans benefits.",
      "Acts as the representative for the Congressman within their areas of\nresponsibility, including answering casework correspondence, meeting with\nconstituents, and serving as a liaison with federal, state, and local authorities;",
      "Prepares periodic reports for the Congressman on pending cases and district\nactivities in their assigned issue areas;",
      "Continually screens active cases and provides regular status updates to\nconstituents;",
      "Maintains up-to-date files on all cases;",
      "Assesses casework for problems requiring intervention from the Congressman.",
      "Screens and refers cases, when appropriate, to other federal or state legislative\noffices;",
      "Provides logistical support to the Congressman at events he attends in the district\nand serves as support staff for events hosted by the office.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Ability to learn quickly and develop a thorough knowledge of local, state, and\nfederal agency processes.",
      "Professional telephone and email demeanor;",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of\ncasework responsibilities."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and short writing sample\nto NJ07Resumes@mail.house.gov with the subject line “NJ07 Constituent\nServices Representative.”",
    "salary_info": "Starting salary for this position is $40,000 to $45,000 a year commensurate\nwith experience.",
    "contact": "NJ07Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis\nof race, color, religion, national origin or citizenship status, sex, gender identity\nor expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-082-22",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2022-03-21",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include assisting the technology needs of Committee staff; editing and maintaining the Committee's website; answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Applicants must have excellent organizational skills and a professional telephone manner; good computer skills; proficiency in Microsoft Word and Excel; ability to work cooperatively and courteously with others; ability to use good judgment in responding to inquiries and requests; and flexibility in assisting with daily tasks and projects.\n\nApplicants with experience or interest in learning information technology assistance are strongly encouraged to apply. This is an entry level position with a starting salary of $41,000 per year.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee's website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$41,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-081-22",
    "position_title": "Senior Legislative Assistant",
    "office": "Representative Chrissy Houlahan (PA-06)",
    "location": "Washington, DC",
    "posting_date": "2022-03-21",
    "description": "This individual is responsible for working with the Legislative Director to formulate and advance the member's policy priorities, working closely with the district team to integrate local stakeholder input into the legislative process, briefing the member before hearings and meetings, helping draft releases, speeches, and letters, and generally working with other members of a highlycollaborative, high-performing staff to help deliver for our constituents and our community (which is our #1 priority). This is not an entry-level position.\n\nThe ideal candidate writes well, is good at solving problems, is intellectually curious, is responsive to internal and external stakeholders, is good at building relationships within the Democratic caucus and across the aisle, can long-term plan even when the Hill is chaos, can manage the chaos that is working in the House, and has a sense of humor.",
    "responsibilities": [
      "Working with the Legislative Director to formulate and advance the member's policy priorities",
      "Working closely with the district team to integrate local stakeholder input into the legislative process",
      "Briefing the member before hearings and meetings",
      "Helping draft releases, speeches, and letters",
      "Working with other members of a highly-collaborative, high-performing staff to help deliver for our constituents and our community"
    ],
    "qualifications": [
      "Writes well",
      "Good at solving problems",
      "Intellectually curious",
      "Responsive to internal and external stakeholders",
      "Good at building relationships within the Democratic caucus and across the aisle",
      "Can long-term plan even when the Hill is chaos",
      "Can manage the chaos that is working in the House",
      "Has a sense of humor",
      "Prior healthcare or appropriations legislative experience desired but not required"
    ],
    "how_to_apply": "Interested applicants should e-mail 1) a resume, 2) a cover letter, and 3) two writing samples to PA06HoulahanJobs@gmail.com with the subject “Senior LA: LAST NAME.”",
    "salary_info": "The base salary is $65,000. Benefits include health insurance, a retirement plan, four weeks of paid time off plus one additional week of paid time off for community service, transit benefits, student loan repayment, flexible teleworking options, and more.",
    "contact": "PA06HoulahanJobs@gmail.com",
    "equal_opportunity": "The office strives to have an office that reflects the diversity of our country so members of historically underrepresented communities are encouraged to apply.\nApplicants with disabilities who require reasonable accommodation to participate effectively in the application or hiring processes are encouraged to request an accommodation at any time during those processes. Requests for accommodation should be directed to PA06HoulahanJobs@gmail.com."
  },
  {
    "id": "MEM-080-22",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "bipartisan Problem Solvers Caucus (PSC)",
    "location": "Washington, D.C.",
    "posting_date": "2022-03-21",
    "description": "The bipartisan Problem Solvers Caucus (PSC) seeks an innovative, strategic, and experienced communications director based in Washington, D.C. The staff member in this position proactively promotes and helps build the Caucus’s national image and manage its press, social media, website, and communications operations.\n\nThe communications director works closely with the executive director, PSC cochairs, and member office staff to carry out assigned duties. This position is responsible for helping plan, draft, and coordinate communications activities to advance caucus priorities, including pitching stories, developing social media content, writing press releases, and maintaining positive working relationships with members of the media. The communications director organizes Caucus press conferences, coordinates outside speaking requests, produces caucus-oriented talking points, and works collaboratively with member offices.\n\nThis is not an entry-level position. Candidates should have at least two years of previous communications experience, including Capitol Hill experience and relationships with the congressional press corps. A disposition aligned with the caucus mission of breaking the gridlock in Congress by promoting bipartisan, bicameral collaboration and policies is essential.\n\nCandidates must possess strong writing, communication, and organizational skills, digital and social media savviness, creativity, and the ability to work with members and their staff under tight deadlines. Candidates should also be familiar with graphic design, website and social media design, videography, and constructing and conveying messages to a national audience through print, television, and digital media.",
    "responsibilities": [
      "helping plan, draft, and coordinate communications activities to advance caucus priorities",
      "pitching stories",
      "developing social media content",
      "writing press releases",
      "maintaining positive working relationships with members of the media",
      "organizes Caucus press conferences",
      "coordinates outside speaking requests",
      "produces caucus-oriented talking points",
      "works collaboratively with member offices"
    ],
    "qualifications": [
      "at least two years of previous communications experience",
      "Capitol Hill experience",
      "relationships with the congressional press corps",
      "strong writing, communication, and organizational skills",
      "digital and social media savviness",
      "creativity",
      "ability to work with members and their staff under tight deadlines",
      "familiar with graphic design, website and social media design, videography",
      "constructing and conveying messages to a national audience through print, television, and digital media",
      "A disposition aligned with the caucus mission of breaking the gridlock in Congress by promoting bipartisan, bicameral collaboration and policies is essential."
    ],
    "how_to_apply": "Please submit a cover letter, resume, and at least two professional references to Jaclyn.ODay@mail.house.gov, with the subject line “PSC Communications Director.”",
    "salary_info": "$50,000 to $58,000 plus benefits",
    "contact": "Jaclyn.ODay@mail.house.gov",
    "equal_opportunity": "The Problem Solvers Caucus is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex, sexual orientation, gender identity, disability, age, national origin, or military status."
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-03-21",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media\nSecretary based in the DC office to work closely with the Communications\nDirector, based in the district office to develop and execute the Congressman’s\ncommunications strategy as a member of the House Ways and Means, Armed\nServices, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital,\ntechnical, and social media trends. Able to express the Congressman's voice\ncreatively and promote social media presence, ensuring high web traffic and\nconstituent engagement.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours\nand producing high-quality work under tight deadlines. This position serves as a\npart of the Communications team and reports directly to the Director of\nCommunications based in the district, however, this person will be the main point\nof contact in the D.C. office.\n\nThe candidate will report to the Communications Director and work closely with\nlegislative and district staff. The ideal candidate will have experience in or\ninterest in learning about aspects of the office’s traditional press operations,\nincluding writing press releases, drafting talking points and speeches, forming\nrelationships with members of the media, and pitching stories.\n\nThis is an ideal position for someone with 1-2 years of communications or digital\nexperience. Applicants must be passionate about public service, well-organized,\nand have the ability to work on weekends and holidays when necessary.\n",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman’s social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman’s website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman’s media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada’s Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford’s digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus.",
      "Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-594-21",
    "position_title": "Field Representative",
    "office": "Southern California Republican Member of the House",
    "location": "Southern California",
    "posting_date": "2022-03-21",
    "description": "Are you looking for an exciting and fast-paced career in public service? A Southern California Republican has an immediate need to hire a full-time Field Representative. We are looking for an enthusiastic and motivated individual to join our high-energy team.\n\nBasic Functions\n\nThe Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.\n\nDuties\n\nUnder the supervision of the Chief of Staff and the District Director, the Field Representative briefs the Member in preparation for district meetings with constituents and acts as the representative for the Member by attending events and meetings. This includes public speaking and certificate presentations. The Field Representative will:",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfort navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including nights and weekends",
      "Constituent service oriented; patient empathetic, with a desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director\nStephanie.Hu@mail.house.gov",
    "salary_info": "Salary starts at $3,500 per month. Salary commensurate with experience.",
    "contact": {
      "name": "Stephanie Hu",
      "title": "District Director",
      "email": "Stephanie.Hu@mail.house.gov"
    },
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-539-21",
    "position_title": "Staff Assistant",
    "office": "Nevada’s 4th District Democratic Member of Congress",
    "location": "North Las Vegas, Nevada District office",
    "posting_date": "2022-03-21",
    "description": "Nevada’s 4th District Democratic Member of Congress seeks a highly organized, passionate, team-oriented Staff Assistant for a position in our North Las Vegas, Nevada District office. Candidates must be comfortable working with the public, have excellent oral and written communication skills, problem solving abilities.",
    "responsibilities": [
      "Managing the front desk, greeting visitors, processing flag requests, answering phones, conducting tours, overseeing an active mail program;",
      "Sorting/batching correspondence, drafting correspondence and ensuring a swift turnaround time;",
      "Responding to constituent mail, keeping abreast of legislative developments, and meeting with constituent groups;",
      "Assisting District Representatives as needed, and",
      "Perform all other duties as assigned and required"
    ],
    "qualifications": [
      "Passionate about public service and committed to democratic values;",
      "Strong writing, communication skills and be detail-oriented;",
      "Have advanced experience with spreadsheets and forms,",
      "A poised, confident, self-starter, and team-player with a sense of humor; and",
      "The ability to work in a high-paced environment.",
      "The ability work weekends and holidays",
      "Have reliable transportation, auto insurance and a clean driving record",
      "Currently enrolled in an ungraduated degree program at a college or university or have a minimum of a bachelor’s degree in the related fields of human services or social work, and a minimum of one-year relevant experience in community or human services."
    ],
    "how_to_apply": "Qualified candidates must include a cover letter, resume, one writing sample and three professional references in a single PDF file. Email submissions to the Director of Administration, nv04resume@mail.house.gov. Subject line must read \"",
    "salary_info": null,
    "contact": "Director of Administration, nv04resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Spanish language skills and District ties are a plus."
  },
  {
    "id": "MEM-NV04-02",
    "position_title": "__last name, First name",
    "office": "MEM-NV04-DSA-2",
    "location": null,
    "posting_date": "2022-03-21",
    "description": "Page 28 of 28",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  }
]