[
  {
    "id": "MEM-236-18",
    "position_title": "Press Assistant",
    "office": "Office of Congresswoman Frederica S. Wilson (D-FL)",
    "location": "Washington, DC",
    "posting_date": "2018-07-23",
    "description": "The office of Congresswoman Frederica S. Wilson (D-FL) seeks a dynamic press assistant with strong digital media skills to join our team. Press assistant tasks include helping to compile daily clips, drafting social media content, creating graphics, and assisting in any other aspects of the team's fast-paced media operation.",
    "responsibilities": [
      "Helping to compile daily clips",
      "Drafting social media content",
      "Creating graphics",
      "Assisting in any other aspects of the team's fast-paced media operation"
    ],
    "qualifications": [
      "Strong writing skills",
      "Expertise in and a passion for digital media and politics are required",
      "Hill experience and Florida ties are a plus"
    ],
    "how_to_apply": "Applicants should send a cover letter, resume, and two writing samples to: FL24.Resumes@mail.house.gov. No calls or drop-ins allowed.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-228-18",
    "position_title": "Legislative Assistant",
    "office": "New York Republican Member of Congress",
    "location": "Washington, DC",
    "posting_date": "2018-07-23",
    "description": "New York Republican Member of Congress is seeking an experienced legislative assistant to join the team. The legislative assistant is responsible for drafting legislation, analyzing bills, and meeting with constituents within their policy portfolio. The position requires a successful candidate to handle a diverse portfolio of policy issues. A successful candidate will possess impeccable writing skills, as well as the ability to work in a fast-paced environment. Two or more years of Hill experience is required. Candidates with NY ties a plus. This is not an entry level position.",
    "responsibilities": [
      "Formulates legislative initiatives for assigned issue areas which include:",
      "devising a legislative plan;",
      "drafting the plan into legislative form;",
      "planning, coordinating and scheduling introduction of legislation in the House (or offering it on an appropriate vehicle if it is in an amendment);",
      "gathering support for a bill or amendment from other Members, as well as appropriate interest groups;",
      "working with committees on legislation;",
      "coordinating legislative support to get the bill passed in the House.",
      "Tracks legislation and other developments in his or her assigned issue areas and briefs the Member for floor work, committee work, work in the district, and outside House-related activities;",
      "Monitors legislative developments within committees;",
      "Plans and coordinates co-sponsorship and support of other legislation;",
      "Monitors legislation on the House floor, providing the Member with information on each vote;",
      "Writes Floor speeches for the Member;",
      "If assigned to issues pending before a specific committee, prepares for and attends committee meetings and hearings with or without the Member (i.e., keeps in contact with committee staff and meets with interest groups and constituents with interests in such meetings);",
      "Acts as a liaison with committee and agency staffs;",
      "Performs special projects assigned by the Member or Chief of Staff/Administrative Assistant;",
      "Meets with constituents and interest groups;",
      "Provides information on and generates ideas for press, mass mailings, and newsletters;",
      "Drafts press releases in issue areas and provides background on media inquiries;",
      "Answers constituent letters and helps constituents on federal matters;",
      "Supervises interns with regard to legislative issues and constituent responses;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "A bachelor’s degree or higher education level is preferred, including strong academic credentials. Some period of related experience or training in legislation or equivalent is beneficial.",
      "Thorough knowledge of the legislative process and of House organization and procedures;",
      "Ability to perform the essential job functions above;",
      "Ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "Please send resume and writing sample to nyrepjobs@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "nyrepjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-219-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Progressive Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2018-07-23",
    "description": "Progressive Democrat seeks a highly motivated, detail-orientated and\nenergetic Scheduler/Executive Assistant with excellent communications,\norganizational and inter-personal skills to maintain the Member’s daily and\nlong-range official Washington, D.C. and district appointments.\n\nThe successful candidate is a self-starter, able to multi-task, quickly solve\nproblems in a fast-paced, dynamic, team-oriented and constantly changing\nenvironment. The candidate must also be comfortable communicating with a\nwide variety of people. Previous Capitol Hill scheduling or other related\nexperience is strongly preferred.\n\nThis position requires a positive attitude, an ability to be flexible and adapt\nquickly to changing circumstances, a strong level of competency and attention\nto detail and availability to assist the Member outside of regular business\nhours.",
    "responsibilities": [
      "Tracking, evaluating and responding to invitations and incoming requests for appointments",
      "Managing all travel and logistical details",
      "Working directly with the Chief of Staff and District Director to ensure smooth daily operations and a seamless schedule between both offices",
      "Managing the Member’s correspondence",
      "Performing various additional administrative duties",
      "Effectively relaying changes and updated information to the Member and staff in a timely manner"
    ],
    "qualifications": [
      "Bachelor’s degree is required",
      "1-3 years of prior scheduling experience desired",
      "Previous scheduling or advance experience on Capitol Hill is preferred",
      "Bay Area ties are a plus"
    ],
    "how_to_apply": "Interested applicants should email their resume, one short writing sample and\na list of references to CA17Scheduler@gmail.com. Please no walk-ins, faxes\nor phone-calls.",
    "salary_info": "The salary is commensurate with the candidate’s level of experience\nwith a wide range of benefits.",
    "contact": "CA17Scheduler@gmail.com",
    "equal_opportunity": "Women and people of color are strongly encouraged to apply. The office does\nnot discriminate on the basis of race, color, religion, sex, national origin, age,\ndisability, military status, gender identity, or expression, or sexual orientation,\nor in any of its activities or operations."
  },
  {
    "id": "MEM-306-18",
    "position_title": "Legislative Assistant",
    "office": "Representative Debbie Wasserman Schultz",
    "location": null,
    "posting_date": "2018-07-23",
    "description": "The office of Representative Debbie Wasserman Schultz is seeking a Legislative Assistant to handle energy, environment, transportation, agriculture, Native American issues, disaster response and other related issues. Responsibilities include but are not limited to advising the Member on all matters in the issue portfolio; developing and advancing policy proposals; drafting vote recommendations and talking points for related floor and committee proceedings; staffing the Member in relevant meetings; and representing the Member before constituents and stakeholders. The ideal candidate will have previous work expertise in the issue areas, prior experience advising a Member of Congress and advancing policy proposals; excellent written and verbal communication skills; and an eagerness to work in a fast-paced, collaborative environment. Florida ties are a plus.",
    "responsibilities": [
      "Advising the Member on all matters in the issue portfolio",
      "Developing and advancing policy proposals",
      "Drafting vote recommendations and talking points for related floor and committee proceedings",
      "Staffing the Member in relevant meetings",
      "Representing the Member before constituents and stakeholders"
    ],
    "qualifications": [
      "Previous work expertise in the issue areas",
      "Prior experience advising a Member of Congress and advancing policy proposals",
      "Excellent written and verbal communication skills",
      "Eagerness to work in a fast-paced, collaborative environment",
      "Florida ties are a plus"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to FL23Resume@mail.house.gov with the subject line “Legislative Assistant.” Please save cover letter and resume in a single file (pdf preferred) and name the file “Last name, First name.”",
    "salary_info": null,
    "contact": "FL23Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-209-18",
    "position_title": "Staff Assistant",
    "office": "New Jersey Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2018-07-23",
    "description": "New Jersey Democrat is seeking a highly motivated and organized staff assistant with excellent oral and written communication skills for the Washington, D.C. office. Responsibilities include managing front desk operations, answering telephones, greeting visitors, coordinating tours for visiting guests, processing flag requests, reviewing, sorting, and responding to incoming constituent correspondence, addressing constituent matters, and assisting the Member and legislative staff as needed. Additional duties include management of the website and social media activities, including official Facebook and Twitter accounts.",
    "responsibilities": [
      "Managing front desk operations",
      "Answering telephones",
      "Greeting visitors",
      "Coordinating tours for visiting guests",
      "Processing flag requests",
      "Reviewing, sorting, and responding to incoming constituent correspondence",
      "Addressing constituent matters",
      "Assisting the Member and legislative staff as needed",
      "Management of the website and social media activities, including official Facebook and Twitter accounts."
    ],
    "qualifications": [],
    "how_to_apply": "Please e-mail cover letter, resume and two brief writing samples to nj08jobs@gmail.com. Please, no calls or drop-ins.",
    "salary_info": null,
    "contact": "nj08jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-204-18",
    "position_title": "Events Coordinator/Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2018-07-23",
    "description": "The Events Coordinator is also a caseworker who helps constituents with federal issues but spends more of the time managing and directing very diverse city-wide and neighborhood events that relate to the Congresswoman’s congressional and constituent responsibilities, including staying on top of everyday events in the Member’s district that keep the community connected to the Member’s work. The Events Coordinator takes the lead to develop major events, among them, the Small Business Fair and Job Fair.",
    "responsibilities": [],
    "qualifications": [
      "Candidate must be able to handle multiple tasks.",
      "The office prizes staff able to think outside the box and work independently while also being available to assist in co-worker projects where necessary or requested.",
      "Prior community or event planning experience is desirable.",
      "The ideal candidate will have a bachelor’s degree, excellent writing and communication skills, experience interacting with the public and leadership qualities.",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to DC if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-193-18",
    "position_title": "Communications Director",
    "office": "New York Congressman",
    "location": "DC or NY",
    "posting_date": "2018-07-23",
    "description": "The communications director is responsible for developing and executing a media strategy, which includes writing press releases, talking points, and op-eds, while also managing the Member's social media pages, web site, pitching story ideas and working closely with reporters. Must have on-the-record experience and strong writing skills. Candidates with NY ties a plus. This is not an entry level position.",
    "responsibilities": [
      "Developing and executing a media strategy",
      "Writing press releases, talking points, and op-eds",
      "Managing the Member's social media pages",
      "Managing the web site",
      "Pitching story ideas",
      "Working closely with reporters"
    ],
    "qualifications": [
      "On-the-record experience",
      "Strong writing skills",
      "NY ties a plus"
    ],
    "how_to_apply": "Please send resume and writing sample to ny03.resumes@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "ny03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-186-18",
    "position_title": "Military Legislative Assistant",
    "office": "Member of Congress",
    "location": "Washington, DC",
    "posting_date": "2018-07-23",
    "description": "This position is open for individuals to apply that have a minimum of two years Congressional staff experience and prior military service preferred.\nThe position would include staffing a conservative Republican Member of Congress highly engaged through Committee work on Defense and Veterans policy. Some other policy areas this position would cover include appropriations, foreign affairs, homeland security, immigration, and intelligence.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of two years Congressional staff experience",
      "Prior military service preferred"
    ],
    "how_to_apply": "Please send your resume and a cover letter to defensehilljob@gmail.com.",
    "salary_info": null,
    "contact": "defensehilljob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-185-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Progressive Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2018-07-23",
    "description": "Progressive Democrat seeks a highly motivated, detail-orientated and energetic Scheduler/Executive Assistant with excellent communications, organizational and inter-personal skills to maintain the Member’s daily and long-range official Washington, D.C. and district appointments.\n\nPrimary responsibilities are tracking, evaluating and responding to invitations and incoming requests for appointments, managing all travel and logistical details, and working directly with the Chief of Staff and District Director to ensure smooth daily operations and a seamless schedule between both offices.\n\nAdditionally, the Scheduler manages the Member’s correspondence, performs various additional administrative duties, and effectively relays changes and updated information to the Member and staff in a timely manner.\n\nThe successful candidate is a self-starter, able to multi-task, quickly solve problems in a fast-paced, dynamic, team-oriented and constantly changing environment. The candidate must also be comfortable communicating with a wide variety of people. Previous Capitol Hill scheduling or other related experience is strongly preferred.\n\nThis position requires a positive attitude, an ability to be flexible and adapt quickly to changing circumstances, a strong level of competency and attention to detail and availability to assist the Member outside of regular business hours.\n\nA Bachelor’s degree is required and 1-3 years of prior scheduling experience desired. The salary is commensurate with the candidate’s level of experience with a wide range of benefits. Previous scheduling or advance experience on Capitol Hill is preferred. Bay Area ties are a plus.",
    "responsibilities": [
      "tracking, evaluating and responding to invitations and incoming requests for appointments",
      "managing all travel and logistical details",
      "working directly with the Chief of Staff and District Director to ensure smooth daily operations and a seamless schedule between both offices",
      "manages the Member’s correspondence",
      "performs various additional administrative duties",
      "effectively relays changes and updated information to the Member and staff in a timely manner"
    ],
    "qualifications": [
      "self-starter",
      "able to multi-task",
      "quickly solve problems in a fast-paced, dynamic, team-oriented and constantly changing environment",
      "comfortable communicating with a wide variety of people",
      "positive attitude",
      "an ability to be flexible and adapt quickly to changing circumstances",
      "strong level of competency and attention to detail",
      "availability to assist the Member outside of regular business hours",
      "Bachelor’s degree is required",
      "1-3 years of prior scheduling experience desired",
      "Previous Capitol Hill scheduling or other related experience is strongly preferred.",
      "Previous scheduling or advance experience on Capitol Hill is preferred.",
      "Bay Area ties are a plus."
    ],
    "how_to_apply": "Interested applicants should email their resume, one short writing sample and a list of references to CA17Scheduler@gmail.com. Please no walk-ins, faxes or phone-calls.",
    "salary_info": "The salary is commensurate with the candidate’s level of experience with a wide range of benefits.",
    "contact": "CA17Scheduler@gmail.com",
    "equal_opportunity": "Women and people of color are strongly encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity, or expression, or sexual orientation, or in any of its activities or operations."
  },
  {
    "id": "MEM-182-18",
    "position_title": "Legislative Correspondent",
    "office": "Rep. Tom McClintock",
    "location": "DC",
    "posting_date": "2018-07-23",
    "description": "Rep. Tom McClintock is seeking a Legislative Correspondent in his DC office to manage all aspects of constituent correspondence and handle a small legislative portfolio. Ideal candidates will have knowledge of the legislative process, excellent writing and organizational skills, strong attention to detail, and familiarity with Intranet Quorum (IQ).",
    "responsibilities": [
      "Processing incoming correspondence through Intranet Quorum (IQ)",
      "Drafting timely responses",
      "Reviewing and writing legislation",
      "Meeting with constituents on policy matters"
    ],
    "qualifications": [
      "Knowledge of the legislative process",
      "Excellent writing and organizational skills",
      "Strong attention to detail",
      "Familiarity with Intranet Quorum (IQ)"
    ],
    "how_to_apply": "Please email resume and cover letter to ca04resumes@gmail.com.",
    "salary_info": null,
    "contact": "ca04resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-180-18",
    "position_title": "Legislative Assistant",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2018-07-23",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and self-motivated legislative assistant with a background in law to join our Washington, DC-based policy team.\n\nThe legislative assistant will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The person will be expected to handle a diverse portfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.\n\nApplicants must have a JD or equivalent. Two years of relevant policy experience is preferred, although Hill experience is not required.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "JD or equivalent required",
      "Two years of relevant policy experience is preferred, although Hill experience is not required",
      "Commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution",
      "Excellent writer and clear thinker"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"legislative assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-179-18",
    "position_title": "Executive Assistant",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2018-07-23",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking a professional and dynamic executive assistant to join our Washington, DC-based team.\n\nThe executive assistant will be responsible for efficient and accurate management of all aspects of the member’s daily and long-term schedule, meeting logistics, maintaining files and drafting correspondence, greeting visitors, answering phones, and contributing to other miscellaneous projects as needed. The person also will be involved in scheduling staff meetings and briefings, and helping constituents with their visits to Washington, DC, among other duties.",
    "responsibilities": [
      "Efficient and accurate management of all aspects of the member’s daily and long-term schedule",
      "Meeting logistics",
      "Maintaining files and drafting correspondence",
      "Greeting visitors",
      "Answering phones",
      "Contributing to other miscellaneous projects as needed",
      "Scheduling staff meetings and briefings",
      "Helping constituents with their visits to Washington, DC"
    ],
    "qualifications": [
      "Personable, organized, flexible, and calm under pressure.",
      "Excellent communication and time-management skills",
      "A sense of urgency and the ability to work independently with sound judgment and minimal direction",
      "The ability to work cooperatively and courteously with others.",
      "Applicants must have a BA or equivalent.",
      "Two years of experience in an administrative or scheduling role is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"executive assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-177-18",
    "position_title": "Digital Press Secretary",
    "office": "House Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2018-07-23",
    "description": "The Democratic Staff of the House Committee on Oversight and Government Reform seeks an active and reliable Digital Press Secretary.",
    "responsibilities": [
      "managing the website",
      "crafting content for social media channels",
      "developing graphics and videos",
      "covering hearings and press events",
      "working with our press team to identify new ways to engage our followers"
    ],
    "qualifications": [
      "at least 1 to 2 years of communications and digital experience",
      "proficient in Adobe programs (Photoshop, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects)",
      "CMS",
      "CSS",
      "HTML",
      "manual photography",
      "analytics",
      "enjoy working in a fast-paced, rapid response environment"
    ],
    "how_to_apply": "Candidates should submit a resume and portfolio with the subject line “Digital Press Secretary” to Oversightpress@mail.house.gov. Please, no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "Oversightpress@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds are strongly encouraged to apply."
  }
]