[
  {
    "id": "MEM-162-20",
    "position_title": "Legislative Assistant and Professional Staff Member",
    "office": "Chairman Gerald E. Connolly, Committee on Oversight and Reform, Subcommittee on Government Operations",
    "location": null,
    "posting_date": "2020-06-08",
    "description": "Chairman Gerald E. Connolly seeks an exceptional, self-motivated candidate to staff Mr. Connolly on all Committee on Oversight and Reform activities. The position is shared between the personal office and the Subcommittee on Government Operations.\n\nThe position offers the opportunity to help lead an effective and fast-paced Subcommittee with a broad jurisdiction and significant legislative authority.\n\nThe Subcommittee has a wide reach and seeks to improve government across the entire enterprise of its operations.\n\nThe Chairman is particularly interested in candidates with a deep knowledge of and an interest in engaging:\noFederal information technology modernization and improvement;\noSafe agency adaptation of new technologies and IT security practices, including cloud computing;\noIssues of federalism and engaging state, local, and tribal governments;\noEnsuring the federal workforce, including civil servants and contractors, have the resources they need to serve the nation;\noWays to prevent the Trump Administration from damaging a merit-based civil service and our federal oversight infrastructure of federal inspectors general.\n\nThe individual who fills this role will have the opportunity to influence federal IT policy across the government and to help the Chairman find new ways to use oversight to encourage agencies to improve their technology postures and ensure the acquisition of technologies that can improve every operation of our federal government.\n\nThe right candidate will serve as a critical leader of a close-knit team and will have the opportunity to work both with the full Committee and with Chairman Connolly’s personal office staff. This person will keep Chairman Connolly fully informed of and staff all Oversight and Reform Committee events and activities and be an integral member of the personal office and subcommittee staff.",
    "responsibilities": [
      "designing and preparing congressional hearings",
      "working with multiple stakeholders to design legislative solutions to address complex national policy concerns",
      "writing statements and speeches",
      "conducting legal and factual research",
      "drafting memoranda",
      "ensuring Government Operations priorities are reflected in appropriations and defense authorization bills",
      "engaging the Chairman’s constituents and ensuring their needs and priorities are reflected in Committee oversight and legislation",
      "and leading oversight initiatives"
    ],
    "qualifications": [
      "an interest in public service",
      "expertise in some of the areas described above",
      "the ability to work closely with a team and remain entrepreneurial",
      "superior attention to detail",
      "work well under pressure",
      "be self-motivated",
      "possess excellent written and oral communication skills",
      "Applicants should be willing to be in the office full time and be able to attend work duties on some evenings and weekends."
    ],
    "how_to_apply": "Interested applicants should apply to this position by emailing a cover letter and resume to Government.Operations@mail.house.gov with “Oversight” in the subject line. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "Government.Operations@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-148-20",
    "position_title": "DISTRICT REPRESENTATIVE",
    "office": "Member of Congress",
    "location": "Thousand Oaks, CA",
    "posting_date": "2020-06-08",
    "description": "Member of Congress seeks an energetic and self-motivated individual to serve\nas a District Representative in an active Congressional district office.\n\nDuties include representing the Member of Congress in the community,\nmaintaining positive relationships with constituents, other local elected\nofficials, and business and community leaders and organizations.\n\nAdditionally, this individual is also responsible for handling constituent\ncasework in their assigned issue areas, which includes answering casework\ncorrespondence, meeting with constituents, communicating with constituents,\nand serving as a liaison with federal and local agencies.\n\nCandidates must be able to work quickly in a high pressure environment,\nmeet very tight deadlines, and have exceptional writing and organizational\nskills. Fluent in Spanish and Ventura County ties are a plus but not required.\n\nMust be available, as necessary, to work evenings and/or weekend hours.",
    "responsibilities": [
      "Representing the Member of Congress in the community",
      "Maintaining positive relationships with constituents, other local elected officials, and business and community leaders and organizations",
      "Handling constituent casework in their assigned issue areas",
      "Answering casework correspondence",
      "Meeting with constituents",
      "Communicating with constituents",
      "Serving as a liaison with federal and local agencies"
    ],
    "qualifications": [
      "Ability to work quickly in a high pressure environment",
      "Ability to meet very tight deadlines",
      "Exceptional writing and organizational skills",
      "Fluent in Spanish and Ventura County ties are a plus but not required",
      "Must be available, as necessary, to work evenings and/or weekend hours"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing\nsamples to CA26Resumes@gmail.com with just “District Representative” in\nthe subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2020-06-08",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative\nAssistant to cover their work on Homeland Security Committee issues,\namong others.\n\nThis is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the\nability to be a self-starter while working in a fast-paced environment.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and\nprofessional references.\nPlease send applications to congressionaljobs2805@gmail.com with\n“Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  }
]