[
  {
    "id": "MEM-374-16",
    "position_title": "Professional Staff Member",
    "office": "Democratic Staff of the House Committee on Small Business",
    "location": null,
    "posting_date": "2016-11-28",
    "description": "Democratic Staff of the House Committee on Small Business seeks a professional staff member to handle procurement policy, with an emphasis on small business contracting issues. Subject matter experience in federal setaside programs, federal agency buying practices, and federal acquisition policy is strongly preferred. The candidate must possess superior writing and analytic abilities, including strong organizational and interpersonal skills. Experience with hearing preparation and legislative development is a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please email cover letter and resume to procurement.job@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "procurement.job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-373-16",
    "position_title": "Caseworker",
    "office": "Congressman Raul Ruiz, M.D.",
    "location": "Palm Desert, CA District Office",
    "posting_date": "2016-11-28",
    "description": "Congressman Raul Ruiz, M.D. of California seeks a Caseworker for his Palm\nDesert, CA District Office. Successful candidates will have previous\nexperience in social work, familiarity with federal agencies, excellent written\nand oral communication skills, and be team-oriented. Prior experience\nworking for state or local government is a plus. Candidates with fluency or\nstrong verbal and written proficiency in Spanish are preferred. In addition,\nstrong knowledge or connection with Riverside County and California’s 36th\nCongressional District is a plus. Availability for evening and weekend\nassignments maybe required at times.\n\nCaseworkers in the Office of Congressman Ruiz assist constituents by\nnavigating complex casework through federal agencies in areas such as\nveterans affairs, social security, housing, and immigration. Caseworkers also\nassess casework and community activities for matters warranting legislative\naction.",
    "responsibilities": [
      "Assist constituents by navigating complex casework through federal agencies in areas such as veterans affairs, social security, housing, and immigration.",
      "Assess casework and community activities for matters warranting legislative action."
    ],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Prior experience working for state or local government is a plus.",
      "Candidates with fluency or strong verbal and written proficiency in Spanish are preferred.",
      "Strong knowledge or connection with Riverside County and California’s 36th Congressional District is a plus.",
      "Availability for evening and weekend assignments maybe required at times."
    ],
    "how_to_apply": "Interested candidates should send their resumes and cover letter to CARuizjobs@mail.house.gov. Please write “Caseworker” in the subject ling of your email message. Please NO walk-ins, faxes or phone calls.",
    "salary_info": null,
    "contact": "CARuizjobs@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Raul Ruiz, M.D. (CA-36) is an equal opportunity employer."
  },
  {
    "id": "MEM-372-16",
    "position_title": "Legislative Assistant, or Senior Legislative Assistant",
    "office": "Senior California Democrat",
    "location": null,
    "posting_date": "2016-11-28",
    "description": "Senior California Democrat seeks Legislative Assistant, or Senior Legislative Assistant depending on qualifications, to handle work on the Financial Services Committee and other issues.",
    "responsibilities": [],
    "qualifications": [
      "Candidates should have substantial experience with financial services issues and substantial Congressional experience.",
      "The successful applicant will possess strong writing and oral communication skills",
      "Work well with others",
      "Be comfortable in a fast-paced environment",
      "Understand the legislative process"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter, resume, and three writing samples to HouseFinancialServicesLA@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "HouseFinancialServicesLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-367-16",
    "position_title": "Communications Director",
    "office": "Southern Republican House Member",
    "location": "Washington, DC",
    "posting_date": "2016-11-28",
    "description": "Multi-term Southern Republican House Member seeks Communications Director with previous Capitol Hill experience",
    "responsibilities": [
      "to manage and coordinate all communications activities, including media contacts, for the Member and the office"
    ],
    "qualifications": [
      "at least 2 years of congressional experience and one year of experience as a Communications Director or Press Secretary",
      "strong academic credentials",
      "strong writing, editing, and proofreading skills",
      "strong oral communication skills",
      "understanding of print and broadcast media with a current working list of Washington and national media contacts",
      "thorough knowledge of legislative process",
      "knowledge of current issues and events in which the Member is involved",
      "ability to exercise discretion and independent judgment in the representation of the Member's positions on policy issues",
      "availability to work long hours",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with office staff, constituents, and media."
    ],
    "how_to_apply": null,
    "salary_info": null,
    "contact": "USHouseStaffJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-365-16",
    "position_title": "Communications Director",
    "office": "House Leadership Democrat",
    "location": "Washington and the District",
    "posting_date": "2016-11-28",
    "description": "The Communications Director will be working with our communications team to coordinate and execute the Member’s overall communication efforts.",
    "responsibilities": [
      "Handle press inquiries",
      "Speech-writing",
      "Social media",
      "Message development and strategy"
    ],
    "qualifications": [
      "Excellent writing skills",
      "On-the-record press experience",
      "Strong political instincts",
      "New media experience",
      "Thrive in a fast-moving, aggressive communications environment",
      "Team-oriented, nimble, creative and strategic",
      "Positive, can-do attitude",
      "Hill experience and Spanish literacy is a positive"
    ],
    "how_to_apply": "Please send resume to: FL23Resume@mail.house.gov. NO PHONE CALLS PLEASE.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "FL23Resume@mail.house.gov",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-361-16",
    "position_title": "Legislative Assistant",
    "office": "A Western Republican member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2016-11-28",
    "description": "A Western Republican member of Congress seeks a Legislative Assistant for\nhis Washington, D.C. office. The Assistant’s primary areas of focus are\nArmed Services and Veteran’s Affairs. Additional assignments may include\nForeign Affairs and Space/Aerospace. For the assigned subject matter, the\nAssistant is expected to:",
    "responsibilities": [
      "Support the Representative’s legislative priorities through legislative\nresearch, the drafting of legislation, acting as the liaison to the relevant\ncommittees, work with the Congressional Research Service, and identifying\nstrategies to advance those legislative priorities;",
      "Prepare the member for committee hearings, staff those hearings and\nmonitor/report to the Representative at times when he is unable to attend the\nmeeting;",
      "Assist the Representative in preparing for interviews, meetings with\nconstituents and interest groups, as well as note taking at such meetings and\nfollow up action items;",
      "Draft answers or prepare outlines of responses to constituent mail;",
      "Draft speeches, statements and correspondence with the appropriate\nexecutive agencies for review by the Legislative Director, Chief of Staff, and\nthe Representative;",
      "Develop and justify co-sponsorship and vote recommendations for review\nby the Legislative Director and Chief of Staff and for consideration by the\nRepresentative for bills in committee, mark up and on the floor in assigned\nareas of responsibility."
    ],
    "qualifications": [],
    "how_to_apply": "All interested applicants should send resume and cover letter to\nWesternRepublicanJobs@gmail.com.",
    "salary_info": null,
    "contact": "WesternRepublicanJobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-358-16",
    "position_title": "Press Secretary",
    "office": "Senior Appropriations Democrat",
    "location": null,
    "posting_date": "2016-11-28",
    "description": "Senior Appropriations Democrat seeks candidates for the position of Press Secretary for a fast-paced and highly engaged office. The successful candidate will have excellent written and verbal skills, the proven ability to manage multiple communications projects, and the ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues. S/he will be responsible for coordinating with the legislative team to develop, manage and organize all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website, implementing social media strategy, maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include briefing the Member for interviews, writing and implementing PSAs, interacting with the press as the Member's principal spokesperson and coordinating the Member's overall press relations. The ideal candidate will have Hill experience, a depth of legislative and policy knowledge including that of the appropriations process, and Ohio connections of benefit. Candidates must be able to work extended hours, under time pressure, and in a strongly collaborative office, while maintaining a positive attitude and demeanor.",
    "responsibilities": [
      "Coordinating with the legislative team to develop, manage and organize all communications activities",
      "Writing press releases",
      "Writing op-eds",
      "Writing mail pieces",
      "Writing talking points",
      "Organizing press events",
      "Maintaining the official website",
      "Implementing social media strategy",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Briefing the Member for interviews",
      "Writing and implementing PSAs",
      "Interacting with the press as the Member's principal spokesperson",
      "Coordinating the Member's overall press relations"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects",
      "Ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues",
      "Hill experience",
      "Depth of legislative and policy knowledge including that of the appropriations process",
      "Ohio connections of benefit",
      "Ability to work extended hours, under time pressure, and in a strongly collaborative office",
      "Maintaining a positive attitude and demeanor"
    ],
    "how_to_apply": "Please submit resume, cover letter, two writing samples, and salary requirements to Midwestern.Resume@mail.house.gov within the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-352-16",
    "position_title": "Investigative Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2016-11-28",
    "description": "The Committee on Oversight and Government Reform is the primary investigative committee of the U.S. House of Representatives. Rep. Elijah E. Cummings, the Ranking Member, is seeking an Investigative Counsel to join the Democratic staff to participate in all matters under the Committee’s jurisdiction, including investigations, hearings, depositions, transcribed interviews, and briefings. The ideal candidate will be an attorney with 2-5 years of investigative or litigation experience. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills. Candidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Investigative Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-351-16",
    "position_title": "Community Coordinator",
    "office": "NYC Member of Congress",
    "location": "Lower East Side of Manhattan",
    "posting_date": "2016-11-28",
    "description": "Individual will develop strategies to increase outreach to LES and represent the office at public meetings. Ideal candidate should have strong knowledge of LES community.",
    "responsibilities": [],
    "qualifications": [
      "Excellent verbal/written communication skills a plus.",
      "strong knowledge of LES community"
    ],
    "how_to_apply": "E-mail resume to: ny20515@yahoo.com",
    "salary_info": null,
    "contact": "ny20515@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-350-16",
    "position_title": "Professional Staff Member",
    "office": "Democratic Staff of the House Committee on Small Business",
    "location": null,
    "posting_date": "2016-11-28",
    "description": "Democratic Staff of the House Committee on Small Business seeks a\nprofessional staff member to handle matters including but not limited to\nagency oversight, procurement, financial services, health, and/or technology.\nPrevious legislative experience is not necessary but preferred. The candidate\nmust possess superior writing and analytic abilities, including strong\norganizational and interpersonal skills. Primary responsibilities include\nhearing preparation and legislative development.",
    "responsibilities": [
      "Hearing preparation",
      "Legislative development"
    ],
    "qualifications": [
      "Superior writing and analytic abilities",
      "Strong organizational and interpersonal skills",
      "Previous legislative experience is not necessary but preferred"
    ],
    "how_to_apply": "To apply, please email cover\nletter and resume to vacancy_employment@yahoo.com. No phone calls or\ndrop-ins please.",
    "salary_info": null,
    "contact": "vacancy_employment@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-347-16",
    "position_title": "Staff Assistant",
    "office": "Senior California Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2016-11-28",
    "description": "Responsibilities include greeting visitors, answering the telephone, scheduling tours and responding to constituent requests for general information and other inquiries. This position also monitors delivery and pickup of materials, maintains the front office, and assists with various administrative duties. The Staff Assistant must maintain a good relationship with the Member, staff and constituents, accept performance based criticism and direction, and work well under pressure. The applicant must be prepared to work a flexible schedule.",
    "responsibilities": [
      "Greeting visitors",
      "Answering the telephone",
      "Scheduling tours",
      "Responding to constituent requests for general information and other inquiries",
      "Monitoring delivery and pickup of materials",
      "Maintaining the front office",
      "Assisting with various administrative duties",
      "Maintaining a good relationship with the Member, staff and constituents",
      "Accepting performance based criticism and direction",
      "Working well under pressure",
      "Being prepared to work a flexible schedule"
    ],
    "qualifications": [
      "Previous Hill experience preferred but not required."
    ],
    "how_to_apply": "Please send cover letter and resume to castaffassistant1996@gmail.com. No phone calls or drop-ins please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "castaffassistant1996@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-333-16",
    "position_title": "District Director",
    "office": "Congressman Raul Ruiz, M.D. (CA-36)",
    "location": "Palm Desert, CA",
    "posting_date": "2016-11-28",
    "description": "The District Director will oversee management and operation of two District offices, serve as a key liaison to local organizations and elected officials, and develop and implement long-term strategic plans. Qualified candidates will demonstrate significant management experience, strong oral and written communications skills , self-motivation and outreach experience to local and state organizations. In addition, qualified candidates with have prior experience in coalition building, a thorough understanding of the federal legislative process and in-depth knowledge of Southern CA. The position requires the ability to multi-task, work well under pressure and the flexibility to work long hours, including nights and weekends. Ties to California’s 36th Congressional District are preferred and the position is based in Palm Desert, CA.",
    "responsibilities": [
      "Oversee management and operation of two District offices",
      "Serve as a key liaison to local organizations and elected officials",
      "Develop and implement long-term strategic plans"
    ],
    "qualifications": [
      "Significant management experience",
      "Strong oral and written communications skills",
      "Self-motivation",
      "Outreach experience to local and state organizations",
      "Prior experience in coalition building",
      "Thorough understanding of the federal legislative process",
      "In-depth knowledge of Southern CA",
      "Ability to multi-task",
      "Ability to work well under pressure",
      "Flexibility to work long hours, including nights and weekends",
      "Ties to California’s 36th Congressional District are preferred"
    ],
    "how_to_apply": "To apply for the District Director position, please send cover letter and resume to CA36DistrictDirectorposition@mail.house.gov with “District Director” in the subject line. Salary commensurate with experience. This is NOT an entry-level position. No phone calls, drop-ins or faxes.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "CA36DistrictDirectorposition@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer."
  }
]