[
  {
    "id": "MEM-152-20",
    "position_title": "Staff Assistant",
    "office": "Representative Spanberger",
    "location": "Washington, D.C.",
    "posting_date": "2020-05-26",
    "description": "Representative Spanberger seeks a Staff Assistant for her Washington, D.C. office. Qualified applicants should be motivated self-starters, highly organized, detail-oriented, able to multitask, have exceptional interpersonal skills, and ability to thrive in a fast-paced environment.\n\nCandidates must demonstrate excellent “people skills,” most importantly displaying compassion in all interactions, and a strong commitment to providing outstanding constituent service.\n\nThe ideal candidate should: be able to think on their feet, be a problem-solver, show keen attention to detail and an ability to multi-task, demonstrate excellent oral and written skills, maintain a positive demeanor, and demonstrate resilience in a busy environment.",
    "responsibilities": [
      "Managing the front office, including answering, appropriately logging, and directing telephone calls",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Distributing hard and electronic mail",
      "Other administrative duties",
      "Serve as the office tour coordinator",
      "Responsible for managing constituent requests for Capitol and White House tours, as well as constituent requests for flags flown over the Capitol"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Highly organized",
      "Detail-oriented",
      "Able to multitask",
      "Exceptional interpersonal skills",
      "Ability to thrive in a fast-paced environment",
      "Excellent “people skills,” most importantly displaying compassion in all interactions",
      "A strong commitment to providing outstanding constituent service",
      "Ability to think on their feet",
      "Problem-solver",
      "Keen attention to detail",
      "Ability to multi-task",
      "Excellent oral and written skills",
      "Maintain a positive demeanor",
      "Demonstrate resilience in a busy environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and a 1-page writing sample to spanberger.inquiries@mail.house.gov with “Staff Assistant” in the subject line.\nApplications will be accepted on a rolling basis until June 1.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-151-20",
    "position_title": "Deputy Communications Director or Press Secretary",
    "office": "House Financial Services Committee Majority staff",
    "location": "Capitol Hill",
    "posting_date": "2020-05-26",
    "description": "The House Financial Services Committee Majority staff seeks a creative and detail-oriented Deputy Communications Director or Press Secretary (depending on qualifications) with strong media relations and writing skills to be a core part of a four-person communications team carrying out the Committee’s communications strategy on behalf of the Chairwoman.\n\nEvening and weekend work is expected.",
    "responsibilities": [
      "Developing press releases, talking points and written materials",
      "Developing content for the Committee’s website and digital platforms",
      "Developing and maintaining relationships with national, local, political and minority-focused media",
      "Proactively pitching members of the press on Committee initiatives"
    ],
    "qualifications": [
      "Prior Capitol Hill or advocacy experience and knowledge of the legislative process",
      "Strong oral, writing and proofreading skills",
      "A positive approach to a busy and fast-paced work environment"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and two writing samples to fscdemresumes@mail.house.gov.",
    "salary_info": null,
    "contact": "fscdemresumes@mail.house.gov",
    "equal_opportunity": "The Committee is an equal opportunity employer. Women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-148-20",
    "position_title": "DISTRICT REPRESENTATIVE",
    "office": "Member of Congress",
    "location": "Thousand Oaks, CA",
    "posting_date": "2020-05-26",
    "description": "Member of Congress seeks an energetic and self-motivated individual to serve as a District Representative in an active Congressional district office. Duties include representing the Member of Congress in the community, maintaining positive relationships with constituents, other local elected officials, and business and community leaders and organizations.\n\nAdditionally, this individual is also responsible for handling constituent casework in their assigned issue areas, which includes answering casework correspondence, meeting with constituents, communicating with constituents, and serving as a liaison with federal and local agencies.",
    "responsibilities": [
      "Representing the Member of Congress in the community",
      "Maintaining positive relationships with constituents, other local elected officials, and business and community leaders and organizations",
      "Handling constituent casework in their assigned issue areas",
      "Answering casework correspondence",
      "Meeting with constituents",
      "Communicating with constituents",
      "Serving as a liaison with federal and local agencies"
    ],
    "qualifications": [
      "Must be able to work quickly in a high pressure environment",
      "Must meet very tight deadlines",
      "Must have exceptional writing and organizational skills",
      "Fluent in Spanish and Ventura County ties are a plus but not required",
      "Must be available, as necessary, to work evenings and/or weekend hours"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing samples to CA26Resumes@gmail.com with just “District Representative” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-147-20",
    "position_title": "Communications Director",
    "office": "Illinois congressional delegation",
    "location": "DC and the district",
    "posting_date": "2020-05-26",
    "description": "Active, hard-working Democratic member of Illinois congressional delegation seeks Communications Director for a fastpaced office.\n\nResponsibilities include planning and implementing communications strategy across a broad portfolio, working closely with legislative and district staff to effectively communicate the Member’s message, handling daily media inquiries, maintaining relationships with national, Chicago, and local reporters, writing talking points and press releases, pitching op-eds, overseeing paid constituent outreach (franking) budget, managing website, producing videos and social media content, and planning and promoting press events in DC and the district.",
    "responsibilities": [
      "Planning and implementing communications strategy across a broad portfolio",
      "Working closely with legislative and district staff to effectively communicate the Member’s message",
      "Handling daily media inquiries",
      "Maintaining relationships with national, Chicago, and local reporters",
      "Writing talking points and press releases",
      "Pitching op-eds",
      "Overseeing paid constituent outreach (franking) budget",
      "Managing website",
      "Producing videos and social media content",
      "Planning and promoting press events in DC and the district"
    ],
    "qualifications": [
      "Previous communications and/or Capitol Hill experience",
      "Strong writing and oral communication skills",
      "The ability to multitask and prioritize under pressure",
      "Team players with a good sense of humor",
      "Spanish fluency is a plus"
    ],
    "how_to_apply": "Please send cover letter, resume, and a writing sample as one attachment to ILCongressional.Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "ILCongressional.Jobs@mail.house.gov",
    "equal_opportunity": "Women, veterans and diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-145-20",
    "position_title": "Digital Director/Press Secretary",
    "office": "U.S. Congresswoman Katie Porter",
    "location": "Orange County",
    "posting_date": "2020-05-26",
    "description": "The office of U.S. Congresswoman Katie Porter seeks a digital/communications professional to be based in her Orange County office. The ideal candidate is highly motivated and detail-oriented, with experience in digital media strategy, graphic design, and video editing.\n\nThe Digital Director/Press Secretary will be responsible for drafting statements, releases, social media copy, and advisories; staffing the Congresswoman, including taking pictures at community events and shooting direct-to-camera videos; designing graphics and editing videos; compiling daily press clips; and maintaining reporter lists. Candidates with Orange County ties are preferred.",
    "responsibilities": [
      "Drafting statements, releases, social media copy, and advisories",
      "Staffing the Congresswoman, including taking pictures at community events and shooting direct-to-camera videos",
      "Designing graphics and editing videos",
      "Compiling daily press clips",
      "Maintaining reporter lists"
    ],
    "qualifications": [
      "Highly motivated",
      "Detail-oriented",
      "Experience in digital media strategy",
      "Experience in graphic design",
      "Experience in video editing",
      "Orange County ties preferred"
    ],
    "how_to_apply": "Applicants should submit a resume, cover letter, a writing sample, and two examples of digital media projects to KatiePorter.Press@mail.house.gov and include “Digital Director/Press Secretary” in the subject line.",
    "salary_info": null,
    "contact": "KatiePorter.Press@mail.house.gov",
    "equal_opportunity": "Congresswoman Katie Porter is committed to hiring and maintaining a diverse staff; candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2020-05-26",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others.\n\nThis is not an entry level position.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills are essential",
      "Ability to be a self-starter while working in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": "California",
    "posting_date": "2020-05-26",
    "description": "Qualified candidates should have a minimum of 2 years’ experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects.\n\nA flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Ability to meet deadlines",
      "Ability to manage multiple projects",
      "A flexible schedule and ability to travel throughout the district is required"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]