[
  {
    "id": "MEM-139-15",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Florida Democrat",
    "location": "Washington, DC",
    "posting_date": "2015-06-01",
    "description": "Florida Democrat is seeking a highly motivated, detail-oriented, and energetic individual with excellent oral and written communications skills for a Staff Assistant/Legislative Correspondent dual role in the Washington, DC office.\n\nDaily tasks include answering calls, conducting and organizing tours, processing flag requests, greeting visitors, supervising and coordinating the intern program, and aiding the office in various administrative duties.\n\nAdditionally, the individual would be expected to manage the constituent mail program which includes monitoring the flow of incoming and outgoing mail, responding to mail and e-mail in both form and individual responses, working with Legislative Director and legislative team to develop a proactive constituent communications operation, and ensure casework requests for assistance are directed to the appropriate district staff member in a timely manner.\n\nExcellent writing, verbal and strong organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment.\n\nTies to South Florida along with Capitol Hill experience are a plus. A sense of humor is greatly appreciated.",
    "responsibilities": [
      "Answering calls",
      "Conducting and organizing tours",
      "Processing flag requests",
      "Greeting visitors",
      "Supervising and coordinating the intern program",
      "Aiding the office in various administrative duties",
      "Monitoring the flow of incoming and outgoing mail",
      "Responding to mail and e-mail in both form and individual responses",
      "Working with Legislative Director and legislative team to develop a proactive constituent communications operation",
      "Ensure casework requests for assistance are directed to the appropriate district staff member in a timely manner"
    ],
    "qualifications": [
      "Excellent writing, verbal and strong organizational skills are essential",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Ties to South Florida along with Capitol Hill experience are a plus",
      "A sense of humor is greatly appreciated"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, a list of three work references, and two writing samples to FL23resumes@gmail.com with “Staff Assistant/Legislative Correspondent” in the subject line. Job opening closes on June 8th. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "FL23resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or expression, or sexual orientation."
  },
  {
    "id": "MEM-138-15",
    "position_title": "Legislative Director",
    "office": "Midwestern Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2015-06-01",
    "description": "Midwestern Democrat seeks a Legislative Director to coordinate, manage and implement an active Member's legislative agenda, oversee and direct an engaged legislative staff, as well as handle a portfolio of legislative issues including transportation. Candidates should possess an in-depth understanding of the legislative process, be able to move several legislative pieces forward at the same time, have management experience, be proactive and a self-starter who thinks creatively and thrives in a fast-paced environment and display good judgment. Excellent writing, verbal, and organizational skills are essential, as is the ability to work well under pressure. A proven track record of successful legislative achievements with a minimum of three years' previous Legislative Assistant experience required.",
    "responsibilities": [
      "Coordinate, manage and implement an active Member's legislative agenda",
      "Oversee and direct an engaged legislative staff",
      "Handle a portfolio of legislative issues including transportation"
    ],
    "qualifications": [
      "In-depth understanding of the legislative process",
      "Ability to move several legislative pieces forward at the same time",
      "Management experience",
      "Proactive and a self-starter who thinks creatively and thrives in a fast-paced environment",
      "Good judgment",
      "Excellent writing, verbal, and organizational skills",
      "Ability to work well under pressure",
      "Proven track record of successful legislative achievements with a minimum of three years' previous Legislative Assistant experience required"
    ],
    "how_to_apply": "To apply, please email resume and cover letter by c.o.b. June 19th describing your role in two to three legislative achievements to: hire@mail.house.gov.",
    "salary_info": null,
    "contact": "hire@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-137-15",
    "position_title": "Legislative Assistant",
    "office": "Congressman John Delaney",
    "location": null,
    "posting_date": "2015-06-01",
    "description": "Congressman John Delaney seeks Legislative Assistant to cover Veterans, Defense, Agriculture, Immigration, and other issues.",
    "responsibilities": [],
    "qualifications": [
      "Prior Hill experience preferred.",
      "Veterans are encouraged to apply."
    ],
    "how_to_apply": "Please send your resume to MDLAjob@mail.house.gov.",
    "salary_info": null,
    "contact": "MDLAjob@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-136-15",
    "position_title": "Research Assistant",
    "office": "House Committee on Veterans’ Affairs",
    "location": "Washington, D.C.",
    "posting_date": "2015-06-01",
    "description": "The House Committee on Veterans’ Affairs Chairman Jeff Miller seeks a Research Assistant to provide administrative support to the Subcommittee on Health. Core responsibilities include answering phones; reviewing and preparing correspondence; maintaining Subcommittee files; assisting with scheduling, planning, and preparing for Subcommittee hearings, markups, roundtables, and other events; tracking pending legislation; and, providing research support on a wide variety of veteran, health, and other policy issues. Prior Hill experience is encouraged but not required and veterans are particularly encouraged to apply.",
    "responsibilities": [
      "Answering phones",
      "Reviewing and preparing correspondence",
      "Maintaining Subcommittee files",
      "Assisting with scheduling, planning, and preparing for Subcommittee hearings, markups, roundtables, and other events",
      "Tracking pending legislation",
      "Providing research support on a wide variety of veteran, health, and other policy issues"
    ],
    "qualifications": [
      "Prior Hill experience is encouraged but not required",
      "Veterans are particularly encouraged to apply"
    ],
    "how_to_apply": "Interested candidates should email a resume and writing sample to var.resumes@mail.house.gov with a subject line: “Health Research Assistant.” No phone or office calls, please.",
    "salary_info": null,
    "contact": "var.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-135-15",
    "position_title": "Legislative Director",
    "office": "Congresswoman Tammy Duckworth",
    "location": "Washington, D.C.",
    "posting_date": "2015-06-01",
    "description": "The office of Congresswoman Tammy Duckworth seeks a Legislative Director. Responsibilities will include overseeing and implementing the Congresswoman’s policy agenda; developing and advancing policy proposals; managing legislative staff; representing the Congresswoman in meetings and communication with various external stakeholders; coordinating with the press team and District Office on messaging and events; and coordinating Floor and Committee activity. The ideal candidate will have demonstrated success in advancing policy goals and at least 3 years of experience as a Legislative Assistant or Legislative Director, including handling some Committee work. A thorough understanding of House floor and committee procedure is required. Strong oral and written communications skills, good judgement and the ability to be proactive, resourceful, and thrive in a fast-paced environment are essential. Veterans, minorities, women, and those with Illinois ties are encouraged to apply. Interested candidates should send a cover letter, resume, and writing sample to IllinoisHouseDemLD@gmail.com. No phone calls or drop-ins please.",
    "responsibilities": [
      "Overseeing and implementing the Congresswoman’s policy agenda",
      "Developing and advancing policy proposals",
      "Managing legislative staff",
      "Representing the Congresswoman in meetings and communication with various external stakeholders",
      "Coordinating with the press team and District Office on messaging and events",
      "Coordinating Floor and Committee activity"
    ],
    "qualifications": [
      "Demonstrated success in advancing policy goals",
      "At least 3 years of experience as a Legislative Assistant or Legislative Director, including handling some Committee work",
      "A thorough understanding of House floor and committee procedure is required",
      "Strong oral and written communications skills, good judgement and the ability to be proactive, resourceful, and thrive in a fast-paced environment are essential"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and writing sample to IllinoisHouseDemLD@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "IllinoisHouseDemLD@gmail.com",
    "equal_opportunity": "Veterans, minorities, women, and those with Illinois ties are encouraged to apply."
  },
  {
    "id": "MEM-133-15",
    "position_title": "Legislative Director",
    "office": "New England Democrat",
    "location": "Hill",
    "posting_date": "2015-06-01",
    "description": "New England Democrat seeks a Legislative Director to coordinate and manage the Member’s legislative agenda, as well as oversee an active and engaged legislative staff. Candidates should possess an in-depth understanding of the legislative process, have management experience, be a self-starter willing to think and act creatively, and thrive in a team-oriented environment. Excellent writing, verbal, and organizational skills are essential, as is the ability to work well under pressure. Previous Hill experience required, and New England ties are a plus.",
    "responsibilities": [],
    "qualifications": [
      "In-depth understanding of the legislative process",
      "Management experience",
      "Self-starter willing to think and act creatively",
      "Thrive in a team-oriented environment",
      "Excellent writing, verbal, and organizational skills",
      "Ability to work well under pressure",
      "Previous Hill experience required",
      "New England ties are a plus"
    ],
    "how_to_apply": "To apply, please email resume, cover letter, and two brief writing samples to hill.jobs@mail.house.gov. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-132-15",
    "position_title": "Communications Director",
    "office": "House Committee on Veterans’ Affairs",
    "location": "Capitol Hill",
    "posting_date": "2015-06-01",
    "description": "House Committee on Veterans’ Affairs Chairman Jeff Miller seeks a seasoned communications professional to oversee the implementation of the committee’s communications strategy. This is a senior staff position reporting directly to the Staff Director. Successful candidates will have a record of accomplishment with internal and external communications, press relations and social media. Prior Capitol Hill experience is a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should email a resume and three writing samples to var.resumes@mail.house.gov with subject line: Communications Director. No phone or office calls, please.",
    "salary_info": null,
    "contact": "var.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-130-15",
    "position_title": "Press Secretary",
    "office": "Northern California Democrat",
    "location": null,
    "posting_date": "2015-06-01",
    "description": "Northern California Democrat seeks a hard-working Press Secretary to help drive a dynamic, entrepreneurial communications operation. Responsibilities will include writing and editing press releases, op-eds, talking points, e-newsletters, and franked communications; developing content for and managing website and social media; coordinating telephone town halls; directing interns on communications projects; and pitching stories to the press. Candidates must be able to develop a fine-tuned sensitivity to the priorities and views of the district and find ways to advance the Member’s short-term and long-term legislative goals.",
    "responsibilities": [
      "Writing and editing press releases, op-eds, talking points, e-newsletters, and franked communications",
      "Developing content for and managing website and social media",
      "Coordinating telephone town halls",
      "Directing interns on communications projects",
      "Pitching stories to the press"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Demonstrated abilities in digital media and communication",
      "Problem solver who can work quickly and calmly under pressure",
      "Significant political experience",
      "At least an above-average sense of humor",
      "California ties (considered a plus)",
      "Spanish fluency (considered a plus)",
      "Familiarity with water, agriculture, military, and transportation policy (considered a plus)"
    ],
    "how_to_apply": "Please send cover letter, resume and a writing sample to CaliforniaCongressionalStaff@gmail.com. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "CaliforniaCongressionalStaff@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-125-15",
    "position_title": "Staff Assistant",
    "office": "Democratic member",
    "location": "Capitol Hill",
    "posting_date": "2015-06-01",
    "description": "Democratic member is seeking a staff assistant to manage the front office, supervise interns, assist with legislative tasks, and greet visitors. Qualified candidates will have excellent attention to detail, possess strong writing skills, excel at balancing competing demands, be able to anticipate and quickly solve problems in a fast-paced work environment, and be comfortable and welcoming with a wide variety of stakeholders. The ideal candidate will have a car and clean driving record, Capitol Hill experience, and a basic familiarity with the legislative process. Depending on previous work history, the opportunity for additional legislative responsibilities exists. Those with Northern California ties are strongly encouraged to apply.",
    "responsibilities": [
      "Manage the front office",
      "Supervise interns",
      "Assist with legislative tasks",
      "Greet visitors"
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Strong writing skills",
      "Excel at balancing competing demands",
      "Ability to anticipate and quickly solve problems in a fast-paced work environment",
      "Comfortable and welcoming with a wide variety of stakeholders",
      "Car and clean driving record (ideal)",
      "Capitol Hill experience (ideal)",
      "Basic familiarity with the legislative process (ideal)"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and brief writing sample to jo.th@mail.house.gov. Please no calls or drop-ins.",
    "salary_info": null,
    "contact": "jo.th@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-124-15",
    "position_title": "District Outreach Coordinator",
    "office": "Rep. Debbie Wasserman Schultz",
    "location": "District Office",
    "posting_date": "2015-06-01",
    "description": "Florida Democrat (Rep. Debbie Wasserman Schultz) seeks a high energy, highly organized, and detail oriented District Outreach Coordinator to work in the District Office. Excellent written and oral communication skills and the desire to work collaboratively with a team in a fast-paced environment are required.\n\nIdeal candidate would be politically astute and possess the ability to respond to challenging situations quickly and strategically. This position requires non-traditional hours and travel around the District.",
    "responsibilities": [
      "attend local meetings on behalf of the Congresswoman in the district",
      "organize district events and meetings with key constituency groups",
      "monitor and update the Member and District Director on district and local issues",
      "answer casework correspondence and verbal communications with constituents",
      "handle all White House and Capitol tour requests",
      "acts as the grass roots representative for the Member within his or her area of responsibility",
      "including answering casework correspondence, verbal communications with constituents, and acting as liaison with federal, district, and local agencies",
      "informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents",
      "handles all constituent tour requests for the White House and Capitol tours",
      "acts as liaison and interfaces with city, county, district, and federal officials, the chamber of commerce and other persons or groups to form effective relationships for the Member",
      "assesses casework for problems requiring legislative action and makes recommendations to the District Director and Chief of Staff/Administrative Assistant",
      "screens and refers cases, when appropriate, to other district offices",
      "trains and supervises Staff Assistants, including Interns, to handle Office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations",
      "logs in all incoming and outgoing mail and incoming telephone calls relating to casework",
      "prepares monthly reports for the District Director on pending cases and district activities in his or her assigned issue areas",
      "performs other duties as assigned"
    ],
    "qualifications": [
      "strong academic credentials",
      "strong writing, editing, and proofreading skills and oral communication skills",
      "knowledge of all issues and events in the district in which the Member is involved",
      "thoroughness and careful attention to detail",
      "ability to exercise discretion and independent judgment in fulfillment of casework responsibilities",
      "availability to work long hours",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "TO APPLY PLEASE SEND A COVER LETTER AND RESUME TO:\nFL23resume@mail.house.gov",
    "salary_info": null,
    "contact": "FL23resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-123-15",
    "position_title": "Press Secretary or Communications Director",
    "office": "Ranking Member",
    "location": null,
    "posting_date": "2015-06-01",
    "description": "Ranking Member seeks a Press Secretary or Communications Director to manage committee, legislative and local press priorities. The applicant must be a hard worker who possesses excellent written, verbal and interpersonal skills. The ideal candidate has Hill and political experience.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-117-15",
    "position_title": "Press Aide/Press Secretary",
    "office": "West Coast Democrat",
    "location": "Washington, DC",
    "posting_date": "2015-06-01",
    "description": "Duties of the position include but are not limited to:",
    "responsibilities": [
      "Coordinating and managing all district and national communications operations.",
      "Developing and executing a proactive press strategy.",
      "Drafting written materials including press releases, op-eds, and talking points.",
      "Planning and coordinating press conferences and other media events.",
      "Pitching and booking interviews with local and national media outlets.",
      "Overseeing all social media platforms and website content.",
      "Building and maintaining excellent relationships with members of the district and national media and acting as a spokesperson for the Member."
    ],
    "qualifications": [
      "Exceptional oral and written communication skills, as well as excellent interpersonal skills.",
      "Excellent writing skills with a strong attention to detail.",
      "The ability to multi-task in a fast-paced environment.",
      "Applicants should have superior organizational abilities.",
      "A successful candidate will be discreet, goal oriented, and driven.",
      "Applicants should have prior relevant press experience and demonstrated social media expertise.",
      "A sense of humor and the ability to work well as an individual and as a member of a team.",
      "Spanish fluency is required.",
      "An ideal candidate will have an undergraduate or graduate degree in communications or journalism and/or relevant professional experience."
    ],
    "how_to_apply": "If interested, please email a resume, cover letter, references, and salary history to CAJobs@mail.house.gov with “Press Aide/Press Secretary” in the subject line.",
    "salary_info": "Salary will be commensurate with experience. This is not an entry level position.",
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-098-15",
    "position_title": "Committee Investigator",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2015-06-01",
    "description": "The Majority staff of the House Committee on Veterans’ Affairs is seeking a health care professional with expert knowledge of drug interactions, pathology, and general issues regarding quality of care to serve as a Committee Investigator. Clinical experience and/or healthcare-related investigatory background preferred. Veterans with requisite experience strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Expert knowledge of drug interactions, pathology, and general issues regarding quality of care",
      "Clinical experience and/or healthcare-related investigatory background preferred"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to VAR.Resumes@Mail.house.gov with “Health Care Investigator” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "VAR.Resumes@Mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-097-15",
    "position_title": "Committee Investigator",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2015-06-01",
    "description": "The Majority staff of the House Committee on Veterans’ Affairs is seeking a federal contracting professional with expert knowledge of federal statutes and regulations pertaining to acquisitions and procurement to serve as a Committee Investigator. At least 5 years of federal government acquisitions and procurement experience preferred, as is experience with facility construction contracts. Veterans with requisite experience are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "At least 5 years of federal government acquisitions and procurement experience preferred",
      "Experience with facility construction contracts"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to VAR.Resumes@Mail.house.gov with “Contract Investigator” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "VAR.Resumes@Mail.house.gov",
    "equal_opportunity": null
  }
]