[
  {
    "id": "MEM-256-17",
    "position_title": "Staff Assistant",
    "office": "Democratic House Member",
    "location": "Washington, D.C.",
    "posting_date": "2017-07-31",
    "description": "Responsibilities include greeting visitors, answering the telephone, scheduling tours and responding to constituent requests for general information and other inquiries. This position also monitors delivery and pickup of materials, maintains the front office, and assists with various administrative duties. The staff assistant also helps manage the intern program.",
    "responsibilities": [
      "Greeting visitors",
      "Answering the telephone",
      "Scheduling tours",
      "Responding to constituent requests for general information and other inquiries",
      "Monitoring delivery and pickup of materials",
      "Maintaining the front office",
      "Assisting with various administrative duties",
      "Helping manage the intern program"
    ],
    "qualifications": [],
    "how_to_apply": "Please send cover letter and resume to castaffassistant1996@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "castaffassistant1996@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-243-17",
    "position_title": "Legislative Director",
    "office": "Democratic Member of Congress from North Carolina",
    "location": "D.C. Office",
    "posting_date": "2017-07-31",
    "description": "This individual is responsible for drafting legislation and amendments, tracking legislation, developing legislative initiatives, writing speeches and floor statements, staffing the Member in Committee, and representing the Member in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking legislation",
      "Developing legislative initiatives",
      "Writing speeches and floor statements",
      "Staffing the Member in Committee",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Ability to work well under pressure in a fast-paced environment",
      "Strong team player",
      "At least two years of legislative experience on Capitol Hill",
      "Ties to North Carolina are a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and two brief writing samples along with three references to nchousejobs@gmail.com. No drop-ins or phone calls.",
    "salary_info": null,
    "contact": "nchousejobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-235-17",
    "position_title": "Deputy Scheduler",
    "office": "Midwest Republican",
    "location": "Washington, D.C.",
    "posting_date": "2017-07-31",
    "description": "Midwest Republican is seeking a Deputy Scheduler for his Washington, D.C. office. The Deputy Scheduler must be flexible to working outside of normal business hours as the Member’s schedule requires. Strong organization and communication skills are necessary. Applicants should be able to handle a fast-paced work environment.",
    "responsibilities": [
      "Supporting the Director of Scheduling",
      "Assisting the Director with maintaining the Member’s D.C. schedule",
      "Efficiently logging and responding to meeting and speaking requests",
      "Booking official travel for the Member",
      "Screening calls for the Member"
    ],
    "qualifications": [
      "Strong organization and communication skills are necessary.",
      "Applicants should be able to handle a fast-paced work environment."
    ],
    "how_to_apply": "To apply for the position, send your cover letter and resume to: gopdeputyscheduler17@gmail.com.",
    "salary_info": null,
    "contact": "gopdeputyscheduler17@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-231-17",
    "position_title": "Legislative Director/Counsel",
    "office": "Representative Debbie Wasserman Schultz",
    "location": null,
    "posting_date": "2017-07-31",
    "description": "The office of Representative Debbie Wasserman Schultz is seeking an experienced Legislative Director/Counsel to oversee and support the Member’s legislative priorities and all other relevant legislative and policy work.",
    "responsibilities": [
      "Advising the Member on all matters in the issue portfolio which will include Foreign Policy and Health Care",
      "Developing and advancing legislative proposals",
      "Analyzing legislation and drafting vote recommendations and talking points for floor and committee proceedings",
      "Staffing the Member in relevant meetings",
      "Representing the Member before constituents and stakeholders",
      "Supervising the legislative staff"
    ],
    "qualifications": [
      "Law or advanced degree",
      "Significant foreign policy and Jewish Community experience",
      "Experience advising a Member of Congress",
      "Experience advancing policy proposals",
      "Excellent written and verbal communication skills",
      "Enjoy working in a fast-paced, collaborative environment",
      "Prior work in another Congressional or Senate office with Florida ties is a plus."
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to FL23Resume@mail.house.gov with the subject line “Legislative Director/Counsel.” Please save cover letter and resume in a single file (pdf preferred) and name the file “Last name, First name.”",
    "salary_info": null,
    "contact": "FL23Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression. Application materials must be received by 12:00pm EST July 31, 2017."
  },
  {
    "id": "MEM-223-17",
    "position_title": "Congressional Aide",
    "office": "Office of Congressman Paul D. Tonko (NY-20)",
    "location": "Albany, NY",
    "posting_date": "2017-07-31",
    "description": "The Office of Congressman Paul D. Tonko (NY-20) seeks an enthusiastic, motivated, and highly organized Congressional Aide to be based out of its Albany, NY office. This is an entry-level position with regular evening and weekend duties, and an annual base salary of approximately $30,000.\n\nApplicant must have a great sense of humor, strong writing skills, the ability to learn quickly, and a solid team mentality. Finally, a valid driver’s license with daily access to a vehicle and good driving record are required. This is an entry level position.",
    "responsibilities": [
      "Staffing the Congressman",
      "Coordinating some of the District Office’s outreach efforts, especially its Mobile Office Hours program",
      "Supporting social media efforts",
      "Providing some administrative support to the Congressman’s scheduling operation"
    ],
    "qualifications": [
      "Great sense of humor",
      "Strong writing skills",
      "Ability to learn quickly",
      "Solid team mentality",
      "Valid driver’s license with daily access to a vehicle",
      "Good driving record"
    ],
    "how_to_apply": "Interested individuals should email a cover letter, résumé, and a writing sample of no less than one (1) page and no more than five (5) pages to NY20jobs@mail.house.gov with “Team Tonko” in the subject line. No phone calls or drop-ins, please.",
    "salary_info": "approximately $30,000",
    "contact": "NY20jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Paul D. Tonko is an equal opportunity employer."
  },
  {
    "id": "MEM-205-17",
    "position_title": "Press Assistant/Legislative Correspondent",
    "office": "Congressman Brian Mast",
    "location": null,
    "posting_date": "2017-07-31",
    "description": "The Office of Congressman Brian Mast is seeking a Press Assistant/Legislative Correspondent who excels at filming and editing videos. In addition to being a strong writer, the ideal candidate will also have experience with graphic design, social media and basic HTML.",
    "responsibilities": [
      "filming/editing videos",
      "posting to social media",
      "photographing events",
      "writing/producing newsletters",
      "maintaining the website",
      "speech writing",
      "drafting constituent mail",
      "researching policy issues",
      "other responsibilities as assigned"
    ],
    "qualifications": [
      "strong writer",
      "experience with graphic design",
      "experience with social media",
      "experience with basic HTML"
    ],
    "how_to_apply": "To apply, please send resume and work samples to brianmastpress@gmail.com.",
    "salary_info": null,
    "contact": "brianmastpress@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-203-17",
    "position_title": "Scheduler/Office Manager",
    "office": "Rep. Al Green",
    "location": "Washington, DC",
    "posting_date": "2017-07-31",
    "description": "Responsibilities include developing and managing the Member's daily schedule and travel arrangements; organizing the Member's daily briefing materials; occasionally driving the Member to events, evaluating all incoming invitations and meeting requests; communicating with constituents by phone and email quickly to address requests, concerns, and questions; maintaining office records and office supplies; serving as the emergency office coordinator; and performing other duties as required.\n\nThe Scheduler/Office Manager will work closely with the Member and Chief of Staff as well as other DC and District staff to coordinate the Member's short-term and long-term schedule. Previous scheduling and/ or Capitol Hill experience is highly desirable; Texas ties are a plus.\n\nThe position involves long hours and availability by phone on weekends and evenings.",
    "responsibilities": [
      "Developing and managing the Member's daily schedule and travel arrangements",
      "Organizing the Member's daily briefing materials",
      "Occasionally driving the Member to events",
      "Evaluating all incoming invitations and meeting requests",
      "Communicating with constituents by phone and email quickly to address requests, concerns, and questions",
      "Maintaining office records and office supplies",
      "Serving as the emergency office coordinator",
      "Performing other duties as required",
      "Coordinate the Member's short-term and long-term schedule"
    ],
    "qualifications": [
      "Superior organizational skills",
      "Strong written and communication skills",
      "Poise and ability to thrive in a fast paced environment",
      "Previous scheduling and/ or Capitol Hill experience is highly desirable",
      "Texas ties are a plus",
      "Availability by phone on weekends and evenings"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to TXResumeInbox@mail.house.gov. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "TXResumeInbox@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-200-17",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2017-07-31",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include: answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.\nNO PHONE CALLS PLEASE.",
    "salary_info": "$30,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-199-17",
    "position_title": "Legislative Associate",
    "office": "Senior Democrat",
    "location": "District of Columbia",
    "posting_date": "2017-07-31",
    "description": "Senior Democrat is seeking a highly energetic, motivated and organized individual with strong writing and interpersonal skills who can manage multiple tasks and work well under pressure. The legislative associate is responsible for responding to constituent mail, including any research necessary to write an adequate response to the mail; monitoring House floor procedures; assisting the legislative director with drafting legislation; meeting with constituents and interested individuals/organizations; preparing congressional record entries; assisting the communications director with updating the website and Facebook and Twitter pages; and other duties as assigned.\nThe ideal candidate will be a results-oriented problem solver and a motivated self-starter who can think outside the box.",
    "responsibilities": [
      "Responding to constituent mail, including any research necessary to write an adequate response to the mail",
      "Monitoring House floor procedures",
      "Assisting the legislative director with drafting legislation",
      "Meeting with constituents and interested individuals/organizations",
      "Preparing congressional record entries",
      "Assisting the communications director with updating the website and Facebook and Twitter pages",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Excellent writing and communication skills",
      "Must be a resident of, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to (202) 225-1129(fax) or DC00.NortonResume@mail.house.gov.",
    "salary_info": null,
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-192-17",
    "position_title": "Staff Assistant",
    "office": "Republican office",
    "location": "Capitol Hill",
    "posting_date": "2017-07-31",
    "description": "Responsibilities include greeting visitors, answering phones, scheduling and leading tours, and responding to constituent requests for general information and other inquiries. This position requires oversight in maintaining the front office and assisting with various administrative duties. The Staff Assistant must maintain a good relationship with the Member, staff, and constituents. He or she must be willing accept performance based criticism and direction while working well under pressure. As with any job on Capitol Hill, the applicant must be open to having a flexible schedule.",
    "responsibilities": [
      "Greeting visitors",
      "Answering phones",
      "Scheduling and leading tours",
      "Responding to constituent requests for general information and other inquiries",
      "Maintaining the front office",
      "Assisting with various administrative duties",
      "Maintain a good relationship with the Member, staff, and constituents",
      "Accept performance based criticism and direction while working well under pressure",
      "Having a flexible schedule"
    ],
    "qualifications": [
      "Previous Hill experience and ties to Virginia preferred but not required"
    ],
    "how_to_apply": "Please send cover letter, resume, and any recommendations to GOPapplicant@gmail.com. No phone calls or drop-ins please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "GOPapplicant@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-191-17",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Senior Democratic House Member",
    "location": "Washington, D.C.",
    "posting_date": "2017-07-31",
    "description": "Responsibilities include managing the Congressman's D.C. schedule, tracking and responding to invitations, and maintaining accurate lists of annual meetings and long-term planning. The Scheduler/EA is also responsible for management of the intern program and junior staff, vouchering, reimbursements and budget tracking. The position will also involve management of office equipment and purchasing.",
    "responsibilities": [
      "Managing the Congressman's D.C. schedule",
      "Tracking and responding to invitations",
      "Maintaining accurate lists of annual meetings and long-term planning",
      "Management of the intern program and junior staff",
      "Vouchering",
      "Reimbursements",
      "Budget tracking",
      "Management of office equipment and purchasing"
    ],
    "qualifications": [],
    "how_to_apply": "Please send cover letter and resume to dcscheduler1@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "dcscheduler1@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-145-17",
    "position_title": "Legislative Assistant",
    "office": "Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2017-07-31",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking a bright, creative, and self-motivated legislative assistant focused on economics to join our Washington, DC-based policy team.\n\nThe legislative assistant will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. He or she will be expected to handle a diverse portfolio of policy issues, including budget and appropriations, commerce, defense, housing, social welfare, and taxation.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. He or she must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.\n\nThis job opportunity was first posted late last year, but no interviews were conducted. Previous applicants still interested in this opportunity should resubmit their materials, as previous submissions will not be considered.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues, including budget and appropriations, commerce, defense, housing, social welfare, and taxation"
    ],
    "qualifications": [
      "Applicants must have a BA or equivalent.",
      "A degree in economics or at least two years of relevant policy experience is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to mi03.apply@gmail.com. Please include \"legislative assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  }
]