[
  {
    "id": "MEM-293-22",
    "position_title": "Staff Assistant",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "DC",
    "posting_date": "2022-06-13",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks highly-motivated, detailoriented Staff Assistant with excellent written and oral communication skills for\nDC office.\nPrimary responsibility is driving the member. Other responsibilities include; general reception duty, handling tour and flag requests, processing constituent correspondence, addressing constituent matters, assist in managing interns, and assisting the Member and staff in all functions of the office.\nDaily access to an automobile preferred – with a valid driver’s license and good driving record.\nPrevious Hill experience as an intern or staff assistant preferred but not necessary.\nSouthern California ties and Spanish fluency are a plus.",
    "responsibilities": [
      "Driving the member",
      "General reception duty",
      "Handling tour and flag requests",
      "Processing constituent correspondence",
      "Addressing constituent matters",
      "Assist in managing interns",
      "Assisting the Member and staff in all functions of the office"
    ],
    "qualifications": [
      "Daily access to an automobile preferred – with a valid driver’s license and good driving record.",
      "Previous Hill experience as an intern or staff assistant preferred but not necessary.",
      "Southern California ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Staff Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-292-22",
    "position_title": "Legislative Assistant",
    "office": "Rep. Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2022-06-13",
    "description": "Rep. Nanette Diaz Barragan (CA-44) seeks a highly talented and motivated\nLegislative Assistant in her Washington, DC office – with the primary\nresponsibility of handling the Member’s work on homelessness, housing,\neducation, and other issues.",
    "responsibilities": [
      "Drafting legislation, policy letters, memos, and talking points",
      "Preparing for and staffing committee hearings",
      "Making vote recommendations",
      "Meeting and maintaining relationships with constituents and advocacy groups",
      "Working closely with the communications team and district staff",
      "Advancing a number of the Member’s legislative priorities",
      "Other tasks as required"
    ],
    "qualifications": [
      "This is NOT an entry-level position. Candidates should have at least 2-3 years of Capitol Hill or relevant policy experience",
      "Be highly motivated, detail-oriented professionals with strong organizational and time-management skills, a positive attitude, and the ability to work under pressure and meet deadlines in a fast-paced work environment",
      "Candidates should also have a strong understanding of the complexities associated with housing and homelessness, a passion for economic and racial justice, experience with coalition building, and the ability to maintain strategic relationships with constituent organizations.",
      "Los Angeles Metro Area|Southern California ties, experience working directly or indirectly with homelessness organizations, and Spanish language skills are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, two references, and two writing samples with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary starts at $60,000, but commensurate with skills and experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-291-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2022-06-13",
    "description": "Representative Nanette Diaz Barragán (CA-44) seeks an experienced\nCommunications Director to lead a fast-paced and highly engaged press\noperation. Applicants must be creative, dynamic, proactive, and energetic.\nThe Communications Director will serve as the spokesperson and primary\ncommunications advisor to the Member. They will be responsible for developing\nand executing an aggressive strategic communications plan, including social\nmedia, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director will oversee day-to-day press operations,\nincluding coordinating and managing the press team; responding to media\ninquiries; booking the Member for interviews; pitching news opportunities to\nmedia outlets; planning press conferences and in-district events; managing the\nMember’s social media accounts and official website; editing/drafting speeches,\ntalking points, floor statements, press releases, op-eds, and e-newsletters; and\ncreating and distributing e-newsletters and franked mailings.\n\nThey are also responsible for working with the Member, Chief of Staff,\nLegislative Director, and District Director to develop and coordinate core\nmessaging. The Communications Director is responsible for maintaining the\nCongresswoman’s voice across all communications materials, with an emphasis\non clarity, relatability, authenticity, and connecting the Congresswoman’s values\nand advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related\nexperience either on or off Capitol Hill. They must be highly organized,\nproficient in multi-tasking, have strong political judgment and instincts, and\npossess superior writing, editing, and proofreading skills.",
    "responsibilities": [
      "Developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Overseeing day-to-day press operations, including coordinating and managing the press team",
      "Responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member’s social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters and franked mailings.",
      "Working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
      "Maintaining the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base."
    ],
    "qualifications": [
      "NOT an entry level position.",
      "Candidates must have previous press-related experience either on or off Capitol Hill.",
      "Must be highly organized",
      "Proficient in multi-tasking",
      "Have strong political judgment and instincts",
      "Possess superior writing, editing, and proofreading skills.",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Fluency in Spanish is a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus.",
      "Additionally, the Communications Director must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-290-22",
    "position_title": "Legislative Assistant|CHC Liaison",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC House office",
    "posting_date": "2022-06-13",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks a highly talented and motivated individual to serve as a Legislative Assistant|CHC Liaison in Washington, DC House office - with the primary responsibilities of handling the Member’s immigration, foreign affairs, military, and criminal justice, Homeland Security Committee work, and serve as Member’s liaison to the Congressional Hispanic Caucus (CHC).\n\nCandidates must have a proven record of proposing legislation, developing amendments, and leading on letters.\n",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various legislative vehicles;",
      "Preparing hearing binders and questions for witnesses for Homeland Security Committee hearings;",
      "Drafting talking points, vote recommendations and other materials;",
      "Monitoring and analyzing legislative developments, committee proceedings, news stories and other relevant info; and",
      "Representing the Member in meetings with constituents and stakeholders."
    ],
    "qualifications": [
      "Ability to work under pressure and meet deadlines in a fast-paced work environment.",
      "Strong organizational and time management skills, excellent written and verbal communication skills, and a keen attention to detail are required.",
      "Spanish language skills preferred.",
      "Southern California ties a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-289-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Lois Frankel (FL-21)",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-13",
    "description": "Congresswoman Lois Frankel (FL-21) is hiring a Legislative Assistant to support her work as Co-Chair of the Democratic Women’s Caucus (DWC), and cover a range of issues on the Appropriations Committee, including the Energy & Water Subcommittee, transportation, housing, judiciary, and other areas as assigned based on need and expertise. Applicant must be comfortable working in a fast-paced and team-oriented environment.",
    "responsibilities": [],
    "qualifications": [
      "Excellent writing skills",
      "Ability to build and maintain relationships",
      "Attention to detail",
      "Previous experience with the Hill and the Appropriations process is strongly preferred"
    ],
    "how_to_apply": "Please email a cover letter and resume with the subject line “Legislative Assistant” to FLJobOpening@mail.house.gov. Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary will start at $65,000, depending on experience, and includes health insurance along with other competitive benefits.",
    "contact": "FLJobOpening@mail.house.gov",
    "equal_opportunity": "We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status."
  },
  {
    "id": "MEM-287-22",
    "position_title": "Deputy Press Secretary or Press Secretary",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2022-06-13",
    "description": "The Democratic staff of the House Committee on Veterans’ Affairs seeks a\nDeputy Press Secretary or Press Secretary to work closely with the\nCommunications Director, Digital Director, and Press Aide to implement the\nCommittee Communications Strategy.\nThey will assist in the drafting of press materials, monitor media and issues\nrelevant to the Committee, and help in handling press inquiries and managing\nmedia relationships. They will be instrumental in the successful implementation\nof day-to-day press operations. On occasion, and in consultation with the\nCommunications Director or Senior Staff, they may serve as the on-the-record\nspokesperson.",
    "responsibilities": [
      "Assist with the development of talking points, remarks, statements, press\nreleases, advisories, and caucus messaging guides",
      "Assist with the coordination, preparation, and execution of media interviews,\nspeaking engagements, and press conferences",
      "Monitor and track media appearances, manage media relationships, and work\nwith policy subject matter experts to identify opportunities for media engagement",
      "Assist with rapid response efforts",
      "Coordinate with Committee Member offices on any press related needs",
      "Staff Chairman at press events"
    ],
    "qualifications": [
      "Excellent written and verbal communications skills",
      "Willing to execute day-to-day tasks and work successfully within a team",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly\nand easily for rapid response"
    ],
    "how_to_apply": "All candidates are required to complete an online application to be considered.\nThere you can upload your resume, cover letter, and writing sample.",
    "salary_info": "Title and salary negotiable depending on experience. Salary range is $60,000 $75,000.",
    "contact": null,
    "equal_opportunity": "In an effort to build a diverse and more inclusive work environment, the\ncommittee strongly encourages veterans, minorities, women, people with\ndisabilities, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-284-22",
    "position_title": "Scheduler",
    "office": "Republican House Member",
    "location": "Capitol Hill",
    "posting_date": "2022-06-13",
    "description": "Republican House Member seeks experienced candidates for the role of\nScheduler. A successful candidate will demonstrate a keen attention to detail and\nadapt well.",
    "responsibilities": [
      "Intaking and organizing all meeting requests",
      "Updating the Member’s calendar",
      "Managing quick-to-evolve travel arrangements"
    ],
    "qualifications": [
      "Relevant scheduling or front-office experience, preferably on Capitol Hill."
    ],
    "how_to_apply": "Interested candidates should send their resume to: housegopscheduler@gmail.com.",
    "salary_info": null,
    "contact": "housegopscheduler@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-283-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Doris Matsui (D-CA-06)",
    "location": null,
    "posting_date": "2022-06-13",
    "description": "Congresswoman Doris Matsui (D-CA-06) seeks a Legislative Assistant to focus\non a portfolio of energy, environment, and climate.\n\nThis position will handle the Congresswoman’s Energy and Commerce Energy\nSubcommittee work and her role as co-chair of the House Sustainable Energy and\nEnvironment Coalition (SEEC) and co-chair of the SEEC Nature and Oceans\nTask Force. The portfolio will be focused on natural climate solutions, clean\nenergy, clean transportation, environmental justice, and energy equity policy; it\nwill also likely include women’s issues, immigration work, and potentially a few\nother issues.\n\nThis is not an entry-level position. Hill experience is strongly preferred. The\noffice is an equal opportunity employer and does not discriminate on the basis of\nrace, color, religion, sex, sexual orientation, gender identity and expression,\nnational origin, disability, military status, age, marital status, or parental status.\nVeterans, women, LGBTQ+ persons, and minority applicants are strongly\nencouraged to apply.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, cover letter, and references in a single PDF\nto seniordemresumes@gmail.com. Please use “Energy/Enviro LA” as the\nsubject.",
    "salary_info": null,
    "contact": "seniordemresumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-281-22",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Sara Jacobs (CA-53)",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-13",
    "description": "The Communications Director will be responsible for developing and implementing media, communications, and public relations strategies on behalf of Congresswoman Jacobs and her office. The ideal candidate will be a strong writer with demonstrated political instincts, solid relationships with the Capitol Hill press corps, an interest in non-traditional methods of communication, and an aversion to conventional wisdom.\n\nCalifornia ties are helpful; good judgment, common sense, and a sense of humor are a must. The position reports to the Congresswoman and Chief of Staff.",
    "responsibilities": [
      "Crafting the office's communications strategy",
      "Acting as the formal spokesperson and media liaison for the Congresswoman",
      "Writing and/or editing talking points, op-eds, press statements, press releases, social media, and weekly newsletters on behalf of the Congresswoman",
      "Working with the Capitol Hill press corps and non-political outlets to book media appearances and pitch stories",
      "Overseeing the office's mass communications/franking program, and working with the Legislative Correspondent on the office's mail program",
      "Overseeing the work of the Communications Aide in the District Office and the Digital Assistant in the Washington, D.C. office",
      "Staying up to date on current events and legislation relevant to the Congresswoman, her priorities, and her district",
      "Working a flexible schedule including long hours, nights, and weekends"
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send a cover letter, writing sample and/or portfolio, and resume with “Jacobs - Communications Director” in the subject line to SaraJacobs.Resumes@mail.house.gov. Applications will be considered on a rolling basis, with priority given to earlier applicants.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Jacobs is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-279-22",
    "position_title": "Staff Assistant",
    "office": "D.C. office",
    "location": "Washington, DC",
    "posting_date": "2022-06-13",
    "description": "The Staff Assistant will serve as an integral part of the D.C. office.",
    "responsibilities": [
      "Manage the front office",
      "Answer and log telephone calls",
      "Manage constituent requests for flags and tours",
      "Assist with constituent correspondence",
      "Recruit Capitol interns and run the Capitol internship program",
      "Share responsibility for driving the Member, although owning a vehicle is not a requirement for this position",
      "Other administrative duties as needed"
    ],
    "qualifications": [
      "Strong commitment to Mondaire’s mission and values",
      "Previous experience on the Hill preferred but not required",
      "Excellent organization",
      "Exceptional attention to detail",
      "Great writing skills",
      "Ability to be discreet with sensitive information"
    ],
    "how_to_apply": "Please begin by filling out the following form via: Staff Assistant Application (airtable.com) From there, the process is as follows:\n\nZoom Interview with the current Staff Assistant (30 minutes)\nZoom Interview with the Chief of Staff (30 minutes)\nTimed Written Exercise (1-2 hours)\nFinal Zoom Interview with Mondaire (30 minutes)\n\nPlease note that you will have time to ask questions during each of the interview stages -- we want to ensure that you have a chance to learn more about this role throughout the process!",
    "salary_info": "The salary for this position is $55,000. Benefits include health insurance coverage and up to $833 per month in student loan repayment.",
    "contact": null,
    "equal_opportunity": "Women, people of color, LGBTQ+ people, and members of other minority or marginalized groups are strongly encouraged to apply. We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status.\n\nWe are also committed to providing reasonable accommodations to individuals with disabilities throughout the interview and employment process, including using our online system to apply for a position."
  },
  {
    "id": "MEM-278-22",
    "position_title": "Digital/Press Assistant",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-13",
    "description": "The office of Congressman Dan Kildee is seeking an organized and creative communications professional to join the Washington, D.C. team.\nThe digital/press assistant will assist the press secretary in all aspects of the office’s robust communications operation for a Member of Democratic leadership.\nQualified candidates will have one to two years of political, campaign or advocacy communications experience. Successful candidates will be collaborative team players who enjoy taking initiative, solving problems and thinking creatively. Michigan ties are a plus.",
    "responsibilities": [
      "Maintain the Member’s social media accounts",
      "Develop, plan, and post social media content",
      "Create graphics, film and edit photos and videos, including clipping, captioning and adding branding",
      "Compile daily press clips",
      "Stay informed about relevant legislative issues and current events in the district",
      "Manage Member’s website",
      "Maintain press lists, robust photo archive and analytics trackers",
      "Assist with logistics for town halls, press conferences, etc.",
      "Write e-newsletters, press releases and media advisories",
      "Support franked mail and digital communications campaigns",
      "Work flexible schedule, including long hours, nights and weekends as necessary, and perform other duties as assigned"
    ],
    "qualifications": [
      "Strong writing, editing, and proofreading skills",
      "Experience using Adobe Suite, Canva, Wavve and Kapwing or equivalent digital products to create graphics, videos, and other digital content",
      "Understanding of print, broadcast, and digital media",
      "Experience developing social media content and managing platforms for clients or cause",
      "Proficiency in constituent management platforms, such as IQ, preferred",
      "Strong organizational skills, and ability to manage multiple tasks at once",
      "Ability to work cooperatively and courteously with others",
      "Command of AP style",
      "Thoroughness and careful attention to detail",
      "Ability to work well under pressure, manage multiple deadlines and accept performance-based criticism and direction"
    ],
    "how_to_apply": "Applicants should submit a resume, cover letter, one writing sample, one sample social post and one digital/creative sample to Michigan05jobs@gmail.com with the subject line “Digital/Press Assistant.” Digital portfolios or websites also accepted for creative samples.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": "Congressman Kildee’s office is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions are made without regard to race, sex, religion or belief, sexual orientation, gender identity, family or parental status, or any other status protected by law."
  },
  {
    "id": "MEM-275-22",
    "position_title": "Staff Assistant",
    "office": "Rep. Brad Schneider",
    "location": "Washington D.C.",
    "posting_date": "2022-06-13",
    "description": "Primary responsibilities include managing the front office, answering and logging telephone calls, managing constituent requests for flags and tours, assisting with constituent correspondence, recruiting and managing interns, supporting legislative and communications staff, and other administrative duties. The Staff Assistant is also responsible for driving the Member, although owning a vehicle is not a requirement for this position.\n\nIdeal candidates will be motivated self-starters with excellent oral, written, and interpersonal communication skills, strong organizational skills, an ability to think quickly when troubleshooting, and maintain a positive demeanor in a busy environment. Capitol Hill or other relevant experience, such as state or municipal government, civil service, advocacy, or customer service, is preferred. Illinois ties are a plus.",
    "responsibilities": [
      "Managing the front office",
      "Answering and logging telephone calls",
      "Managing constituent requests for flags and tours",
      "Assisting with constituent correspondence",
      "Recruiting and managing interns",
      "Supporting legislative and communications staff",
      "Other administrative duties",
      "Driving the Member"
    ],
    "qualifications": [
      "Motivated self-starters with excellent oral, written, and interpersonal communication skills",
      "Strong organizational skills",
      "Ability to think quickly when troubleshooting",
      "Ability to maintain a positive demeanor in a busy environment",
      "Capitol Hill or other relevant experience, such as state or municipal government, civil service, advocacy, or customer service, is preferred",
      "Illinois ties are a plus"
    ],
    "how_to_apply": "Please submit a cover letter and resume to IL10.Jobs@mail.house.gov and list “Staff Assistant” in the subject line to apply. Applications will be considered on a rolling basis and the deadline to apply is June 17, 2022.",
    "salary_info": "The annual salary for this position is $45,000. Employment in this office comes with a competitive benefits package including health and dental insurance, federal student loan repayment stipends (terms apply), a transportation stipend, and 12 weeks of paid FMLA leave.",
    "contact": "IL10.Jobs@mail.house.gov",
    "equal_opportunity": "This office is strongly committed to nurturing a diverse and inclusive workspace for all and does not discriminate based on race, sex, color, age, religion, disability, national origin, sexual orientation, gender identity, or uniformed status. Persons of all backgrounds and identities are strongly encouraged to apply."
  },
  {
    "id": "MEM-274-22",
    "position_title": "Press Secretary",
    "office": "Rep. Jimmy Panetta",
    "location": "Capitol Hill",
    "posting_date": "2022-06-13",
    "description": "The ideal candidate is highly motivated, detail-oriented, creative, and enthusiastic, with experience in print and digital media strategy, graphic design, web design, and video and photo editing. The staff member in this position will assist with all aspects of strategic communications including press, social media, and mass communications. This is not an entry-level position.",
    "responsibilities": [
      "Managing the Member’s social media platforms and website",
      "Planning and organizing district-based press conferences, tele-town halls, and roundtables",
      "Pitching and fielding press inquiries",
      "Building and managing in-district media relations",
      "Speech writing with the goal of incorporating intent and voice of Member",
      "Drafting statements, releases, op-eds, advisories and social media content",
      "Compiling and reviewing daily and weekend press clips",
      "Photographing and video-recording the Member at various official events",
      "Responding to media inquiries as needed."
    ],
    "qualifications": [
      "A working knowledge of California’s central coast and understanding of the regional print, broadcast, and online media landscape",
      "Excellent writing skills with strong editing, proofreading and organizational skills",
      "Creativity with strong proficiency in crafting digital content",
      "Detail-oriented self-starter and team player able to handle multiple tasks at once in a fast-paced environment.",
      "Flexibility and availability to work long hours and when necessary, weekends.",
      "Capitol Hill experience is preferred, but not required.",
      "Ties to California, especially its central coast, are strongly preferred."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, three writing samples of one page or less, samples of digital media and graphic design projects, and three references with “PRESS SECRETARY” in the subject line to ca20.jobs@mail.house.gov",
    "salary_info": "The office offers student loan repayment, paid vacation, and sick leave, in addition to other benefits that include health care and retirement.",
    "contact": "ca20.jobs@mail.house.gov",
    "equal_opportunity": "Rep. Panetta is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-273-22",
    "position_title": "Scheduler/Operations Manager",
    "office": "Office of Congressman Gregory Meeks",
    "location": "Washington DC",
    "posting_date": "2022-06-13",
    "description": "Responsibilities include working with the Chief of Staff, District Director, and the House Foreign Affairs Committee to maintain the Member’s daily and long-term DC, District, and Committee schedule; organizing and evaluating all meeting requests and invitations; oversees coordination with other Member offices, Committees, the White House, State Department, Embassies and other Executive Departments and agencies; coordinates with the Member, Chief of Staff and Committee to facilitate official travel, domestic and abroad and working with legislative and communications staff to ensure the Member is prepared for meetings, events, and interviews.\n\nThis position will also play an active role in office operations. They are the primary point of contact for House support offices and critical to office management. They will be required to serve as the parking coordinator, emergency coordinator, liaise with House Administration, and at times drive the member. The role is integral to staff onboarding, including IT and tech support, and will help facilitate other administrative needs as necessary.\n\nApplicants must be highly organized, proactive, and able to work as part of a team in a fast-paced environment. The ideal candidate performs their duties with a high level of professionalism while maintaining tact and confidentiality. This position requires availability outside of regular business hours. This is not an entry-level position. Applicants MUST have prior scheduling experience in a Congressional office or Executive office.",
    "responsibilities": [
      "Working with the Chief of Staff, District Director, and the House Foreign Affairs Committee to maintain the Member’s daily and long-term DC, District, and Committee schedule",
      "Organizing and evaluating all meeting requests and invitations",
      "Overseeing coordination with other Member offices, Committees, the White House, State Department, Embassies and other Executive Departments and agencies",
      "Coordinating with the Member, Chief of Staff and Committee to facilitate official travel, domestic and abroad and working with legislative and communications staff to ensure the Member is prepared for meetings, events, and interviews",
      "Serving as the primary point of contact for House support offices",
      "Serving as the parking coordinator",
      "Serving as the emergency coordinator",
      "Liaising with House Administration",
      "Driving the member at times",
      "Facilitating staff onboarding, including IT and tech support",
      "Facilitating other administrative needs as necessary"
    ],
    "qualifications": [
      "Applicants must be highly organized, proactive, and able to work as part of a team in a fast-paced environment",
      "The ideal candidate performs their duties with a high level of professionalism while maintaining tact and confidentiality",
      "This position requires availability outside of regular business hours",
      "This is not an entry-level position",
      "Applicants MUST have prior scheduling experience in a Congressional office or Executive office"
    ],
    "how_to_apply": "Please send your resumes and cover letters to NY05Resumes@mail.house.gov with the subject line “SCHEDULER/OPERATIONS MANAGER.”",
    "salary_info": "Salary is commensurate with experience",
    "contact": "NY05Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-272-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Clay Higgins (LA-03)",
    "location": "Capitol Hill",
    "posting_date": "2022-06-13",
    "description": "The office of Congressman Clay Higgins (LA-03) seeks a high motivated Legislative Assistant to focus on a portfolio of education, healthcare, immigration, and trade.\n\nThis is not an entry-level position. Candidates should have at least two years of Capitol Hill experience, and excellent writing and communication skills.",
    "responsibilities": [
      "Tracks legislation and other developments in assigned issue areas, briefs the Member for floor and committee work, coordinates with Communication Department to draft floor speeches for the Member and plans and coordinates co-sponsorships and support of other legislation related to assigned issue areas;",
      "Formulates legislative initiatives for assigned issue areas including planning, coordinating and scheduling introduction of legislation, gathering support for a bill or amendment; working with committees on legislation and coordinating legislative support to get the bill passed in the [Senate/House];",
      "Responsible for assigned caucuses, including attending meetings, compiling information and briefing the Member on pertinent information;",
      "Works with Scheduler, Legislative Director, Chief of Staff, and District Director to plan district events related to assigned issue areas;",
      "Meets with constituents and interest groups related to assigned issue areas and completes meeting notes for each meeting.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "At least two years of Capitol Hill experience",
      "Excellent writing and communication skills"
    ],
    "how_to_apply": "Qualified candidates should email their resume and cover letter with the subject line “Legislative Assistant” to: lalegstaffposition@gmail.com\nNo calls or walk-ins, please.",
    "salary_info": "Minimum salary of $55,000/ year. Increased salary commensurate with experience.",
    "contact": "lalegstaffposition@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-270-22",
    "position_title": "Scheduler",
    "office": "Office of Brenda Lawrence (MI-14)",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-13",
    "description": "Responsibilities include managing all aspects of the Congresswoman’s Washington, D.C. daily and long-term schedule; coordinating travel, booking flight, hotel and car reservations and coordinating logistics for events; organizing and responding to all incoming scheduling requests in a timely manner; communicating key information regarding the member and the member’s schedule to staff; assisting the District Director with district scheduling; and driving the Member in DC.\n\nIdeal candidates are flexible, responsive, collaborative, work well under pressure and on short deadlines, and are able to balance competing demands.",
    "responsibilities": [
      "Managing all aspects of the Congresswoman’s Washington, D.C. daily and long-term schedule",
      "Coordinating travel, booking flight, hotel and car reservations and coordinating logistics for events",
      "Organizing and responding to all incoming scheduling requests in a timely manner",
      "Communicating key information regarding the member and the member’s schedule to staff",
      "Assisting the District Director with district scheduling",
      "Driving the Member in DC"
    ],
    "qualifications": [
      "Flexible",
      "Responsive",
      "Collaborative",
      "Work well under pressure and on short deadlines",
      "Able to balance competing demands",
      "Previous scheduling experience is preferred, but not required",
      "Michigan ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should email their cover letter, resume and three references in one PDF to MI14District@gmail.com. Please put “MI-14 DC Scheduler Application” in the subject field. Applications will be reviewed on a rolling basis.",
    "salary_info": "$68,000. This position requires flexible hours and availability by phone during evenings and weekends.",
    "contact": "MI14District@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and veterans, LGBTQ+ individuals, women, and diverse candidates are encouraged to apply. No calls or drop-ins, please."
  },
  {
    "id": "MEM-269-22",
    "position_title": "Constituent Services Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Honolulu office",
    "posting_date": "2022-06-13",
    "description": "The ideal candidate has diverse experience working in the community to address a wide range of statewide and local issues with a strong track record of advocacy for the people of Hawai'i. The position is responsible for assisting the Congressman to address requests for assistance from individual constituents and organizations, primarily but not exclusively with a wide range of federal government programs and activities.\n\nDuties include but are not limited to dealing directly with constituents and federal state and local agencies and organizations. The position also includes interaction with the Congressman's D.C. office on related legislative and administrative matters, as well as representing the Congressman at community events, such as neighborhood board meetings, and otherwise assisting with the range of activities in the Congressman's office. Direct report to the Deputy Chief of Staff in the Honolulu office. Although the position may also interact directly with the Congressman and his Washington, D.C. office from time to time. The ideal candidate is an individual who is seeking to live and work in the community that this position is designed to serve.",
    "responsibilities": [
      "Dealing directly with constituents and federal state and local agencies and organizations.",
      "Interaction with the Congressman’s D.C. office on related legislative and administrative matters.",
      "Representing the Congressman at community events, such as neighborhood board meetings.",
      "Assisting with the range of activities in the Congressman’s office."
    ],
    "qualifications": [
      "Interest in government and in assisting others",
      "Initiative",
      "Interpersonal skills",
      "The ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long and sometimes unpredictable hours"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Constituent Services Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-268-22",
    "position_title": "Digital/Press Assistant",
    "office": "Congresswoman Ayanna Pressley (MA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2022-06-13",
    "description": "The Office of Congresswoman Ayanna Pressley (MA-07) seeks a highly motivated Digital/Press Assistant to support the Communications Director and Press Secretary in all aspects of the office’s fast-paced and dynamic communications operation, including drafting and editing social media copy, designing digital content for the Congresswoman, and media monitoring. This role reports to the Communications Director.",
    "responsibilities": [
      "Support implementation of digital communications and public relations strategies for the Congresswoman;",
      "Compile daily press clips and stay informed about current events in the district and across the country for their impact on the Congresswoman;",
      "Draft social media content and other written materials, and manage all of the Congresswoman’s social media accounts;",
      "Create graphics, film and edit photos and videos, including clipping, captioning and branding;",
      "Manage the Congresswoman’s website and maintain robust digital archives and analytics trackers for the Congresswoman;",
      "Staff digital events and video recordings with the Congresswoman;",
      "Support with logistics for town halls, press conferences, and other public-facing engagements, both virtual and in-person;",
      "Remain abreast of current legislative and non-legislative issues about which the Congresswoman may be questioned;",
      "Support on administrative functions of the office as needed, such as constituent calls and data entry;",
      "Maintain a good working relationship with the Congresswoman, staff, and constituents;",
      "Work well under pressure, handle stress, and accept performance-based criticism and direction;",
      "Work flexible schedule including long hours, nights and weekends, and perform other duties as assigned."
    ],
    "qualifications": [
      "Our office prioritizes building a diverse team committed to advocating for the residents of the Massachusetts 7th. 1-3 years of digital, graphic design, press, organizing, or advocacy experience is strongly recommended.",
      "As a practice as an office we do not require any pre-requisite degrees.",
      "Ties to Massachusetts preferred, but not required.",
      "Please expand on how your unique set of experiences suits you to excel in this role in your cover letter.",
      "Strong communications skills, including writing, editing, and proofreading;",
      "Experience creating content using Adobe Suite (Illustrator, Photoshop and Premiere or Premiere Rush)",
      "Understanding of print, broadcast, and online media;",
      "Proficiency in constituent management platforms, such as IQ, preferred.",
      "Strong organizational skills, and ability to manage multiple tasks at once;",
      "Knowledge of current issues and events in which the Congresswoman is involved;",
      "Ability to exercise discretion in the representation of the Congresswoman's position on policy issues;",
      "Ability to work cooperatively and courteously with others.",
      "Work is mainly performed in an office environment. Noise levels are usually moderate;",
      "Ability to work in small a workstation without an expectation of privacy.",
      "COVID-19 precautions and remote work expectations can be discussed during the interview process.",
      "This role is based in Washington, D.C. and requires as-needed travel to Massachusetts."
    ],
    "how_to_apply": "Please submit your resume, cover letter, 3 digital/creative samples and 3 references to ma7jobposting@gmail.com with the subject line “Press/Digital Assistant.” Digital portfolios or websites also accepted for creative samples.",
    "salary_info": "The salary for the position is $57,000, along with a competitive benefits package that includes health insurance, dental, federal student loan payments (terms apply) and 16 weeks of paid FMLA.",
    "contact": "ma7jobposting@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-267-22",
    "position_title": "Staff Assistant/Intern Coordinator",
    "office": "Representative Sean Casten (D, IL-06)",
    "location": "Glen Ellyn, Illinois",
    "posting_date": "2022-06-13",
    "description": "The District Office Staff Assistant shall be responsible for managing the district office administrative functions. They shall manage incoming constituent communications, organize, and maintain correspondence and outreach material and handle all Congressional greeting requests. The Staff Assistant shall report directly to the District Director.",
    "responsibilities": [
      "Answers and logs incoming phone calls, conducts casework intake, and greets office visitors",
      "Manages and tracks all incoming and outgoing mail to include timely submission of monthly reports",
      "Manages district written outreach efforts by drafting and preparing certificates and letters",
      "Identifies event and correspondence opportunities",
      "Manages office supply requisitions and inventory lists",
      "Staffs the Congressman and serves as staff representative for the Congressman at meetings and events",
      "Supervises the District Office intern program to include the recruitment, training, and management of district office interns",
      "Assists with planning, organizing, and executing district outreach efforts",
      "Plans, organizes, and leads execution of the Congressional Art Competition"
    ],
    "qualifications": [
      "Bachelor’s degree (B.A.) in Political Science, Public Relations, Communications, or relevant studies preferred but not required.",
      "Strong oral and written communication skills",
      "Highly organized with strict attention to detail",
      "Congressional Office or similar experience preferred but not required"
    ],
    "how_to_apply": "To apply please submit a cover letter, resume, and a short statement of no more than 300 words about why you’re a good fit for this role to Constituent.ServicesIL06@mail.house.gov. Subject Line: District Staff Assistant",
    "salary_info": "$45,000",
    "contact": "Constituent.ServicesIL06@mail.house.gov",
    "equal_opportunity": "Representative Casten’s Office is an affirmative action/equal opportunity employer dedicated to building a community of excellence, equity, and diversity. It welcomes applications from women, underrepresented minorities, individuals with disabilities, protected veterans, sexual minority groups and other candidates who will lead and contribute to the diversification and enrichment of ideas and perspectives."
  },
  {
    "id": "MEM-265-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member",
    "location": null,
    "posting_date": "2022-06-13",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized, and professional individual to serve in the role of Staff Assistant.\nThe successful applicant will be personable, organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.\nAdditional daily tasks include answering phones, processing mail, assisting with constituent requests for information, coordinating tours, and other administrative duties supporting the Member and staff as needed.",
    "responsibilities": [
      "answering phones",
      "processing mail",
      "assisting with constituent requests for information",
      "coordinating tours",
      "other administrative duties supporting the Member and staff as needed"
    ],
    "qualifications": [
      "personable",
      "organized",
      "possess excellent communication and time-management skills",
      "the ability to exercise sound, independent judgment",
      "the ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to staffassistant2022@yahoo.com.",
    "salary_info": null,
    "contact": "staffassistant2022@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-263-22",
    "position_title": "Communications Director",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2022-06-13",
    "description": "The Communications Director manages and coordinates the messaging and communications activities, including media contacts, for the Member and the Office. Traditional and digital communications are managed by the Communications Director including press statements, press releases, mass emails, social media posts, and website updates.\nThe applicant must be an excellent writer with strong organizational skills, demonstrated political instincts, and proven judgment. Ideal candidate has at least five years of communications and messaging experience in the public and/or private sector, including campaign or government, and robust media contacts.\nThe position reports to the Member and Chief of Staff.\nThe position requires an incredible attention to detail. The Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Due to COVID19 work is often from home.",
    "responsibilities": [
      "Manages and coordinates the messaging and communications activities, including media contacts, for the Member and the Office.",
      "Manages traditional and digital communications including press statements, press releases, mass emails, social media posts, and website updates."
    ],
    "qualifications": [
      "Excellent writer with strong organizational skills, demonstrated political instincts, and proven judgment.",
      "At least five years of communications and messaging experience in the public and/or private sector, including campaign or government, and robust media contacts.",
      "Incredible attention to detail."
    ],
    "how_to_apply": "Applicants should send a resume and cover letter to MD07employment@mail.house.gov. Applications will be considered on a rolling basis, but no application will be considered later than June 24, 2022. No phone calls, faxes, or separate emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-262-22",
    "position_title": "District Scheduler/Office Manager",
    "office": "North Bay legislative office",
    "location": "California",
    "posting_date": "2022-06-13",
    "description": "Responsibilities include coordinating the Member’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, and press) to identify schedule priorities, and then working proactively to make shortand long-term decisions to implement plans; working directly with the District Director and Member on logistics.\n\nAlso responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties, and managing special projects including the district internship program.\n\nOpportunities for additional responsibilities commensurate with skills and abilities.",
    "responsibilities": [
      "Coordinating the Member’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, and press) to identify schedule priorities, and then working proactively to make shortand long-term decisions to implement plans",
      "Working directly with the District Director and Member on logistics",
      "Assisting the Capitol office and District Director on maintaining financial and expense records",
      "Assisting with various administrative duties",
      "Managing special projects including the district internship program"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Have experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and positive demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov with the subject like “CA02 District Scheduler/Office Manager.”",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-231-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-06-13",
    "description": "Constituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.\n\nThe ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Helping with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-208-22",
    "position_title": "Communications Director",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-06-13",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks an experienced Communications Director based in the DC office to develop and execute the Congressman’s communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to Congressman Horsford and will supervise the work of junior communications staff. They will be responsible for executing an aggressive communications plan that generates positive local and national media coverage, reaches diverse communities, and expands the Congressman’s reach to new audiences.",
    "responsibilities": [
      "Working with Congressman Horsford, the Chief of Staff, the Deputy Chief of Staff, and the District Director to develop strategic messaging priorities.",
      "Managing all day-to-day external communications from the office, including press releases, remarks, floor speeches, interview memos, newsletters, op-eds, and social media.",
      "Proactively identifying opportunities to expand Congressman Horsford’s local and national media profile and working closely with the Congressional Black Caucus, the House Labor Caucus, and other affiliated caucuses on shared priorities.",
      "Pitching stories to local and national press and planning press conferences, press calls, and other press events.",
      "Developing a strategic plan and budget for all communications programs.",
      "Designing and implementing a creative digital communications program, including both paid advertising and organic social media. The Communications Director will also be responsible for keeping the Congressman’s website up-to-date.",
      "Overseeing franked communications and a robust 499 program."
    ],
    "qualifications": [
      "This is not an entry-level position, and candidates must have previous press experience on or off Capitol Hill.",
      "Strong oral and written communications skills are required.",
      "Prior experience managing franked communications is a plus.",
      "The ideal candidate must be collaborative, creative, energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours in a fast-paced and demanding setting.",
      "Experience with video editing and graphic design is also a plus and Nevada ties a plus."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Communications Director” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-149-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-06-13",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks)",
      "Intern coordinator by recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing, and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to:",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-06-13",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media Secretary based in the DC office to work closely with the Communications Director, based in the district office to develop and execute the Congressman's communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital, technical, and social media trends. Able to express the Congressman's voice creatively and promote social media presence, ensuring high web traffic and constituent engagement.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines. This position serves as a part of the Communications team and reports directly to the Director of Communications based in the district, however, this person will be the main point of contact in the D.C. office.\n\nThe candidate will report to the Communications Director and work closely with legislative and district staff. The ideal candidate will have experience in or interest in learning about aspects of the office's traditional press operations, including writing press releases, drafting talking points and speeches, forming relationships with members of the media, and pitching stories.\n\nThis is an ideal position for someone with 1-2 years of communications or digital experience. Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman's social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman's website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman's media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada's Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford's digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "Applicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.",
      "This is an ideal position for someone with 1-2 years of communications or digital experience.",
      "Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus.",
      "Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  }
]