[
  {
    "id": "MEM-175-23",
    "position_title": "Scheduler",
    "office": "Office of Congresswoman Angie Craig",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "The Office of Congresswoman Angie Craig seeks an organized and motivated self-starter to serve as Scheduler.\n\nIdeal candidates should have excellent oral and written communication skills, meticulous attention to detail, strong time management skills, good judgment, and an ability to thrive in a fast-paced environment. Nights and weekends may be required, especially during legislative sessions. A valid driver's license and good driving record are required.\n\nThis position is located in the Washington, DC office and reports directly to the Chief of Staff. Previous Capitol Hill experience or Minnesota ties are a plus.",
    "responsibilities": [
      "Managing the member's daily and long-term schedule for her time in Washington, DC and Minnesota",
      "Organizing and tracking invitations and meeting requests",
      "Coordinating travel for the member and staff",
      "Compiling daily briefing materials",
      "Working closely with the Staff Assistant to provide administrative support to the member and the team",
      "Transporting the member as needed",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Meticulous attention to detail",
      "Strong time management skills",
      "Good judgment",
      "Ability to thrive in a fast-paced environment",
      "Valid driver's license and good driving record are required",
      "Previous Capitol Hill experience or Minnesota ties are a plus"
    ],
    "how_to_apply": "To apply please submit your resume and a cover letter to Repcraigresumebank@gmail.com with your name and “Scheduler Application” in the subject line. No walk-ins or phone calls please.",
    "salary_info": "$60,000 - $70,000",
    "contact": "Repcraigresumebank@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-170-23",
    "position_title": "Casework Manager/Field Liaison",
    "office": "REP SHONTEL M. BROWN of OH-11",
    "location": "District",
    "posting_date": "2023-03-20",
    "description": "The Casework Manager/Field Liaison (CMFL) will manage all casework, outreach, and constituent engagement operations and supervise all caseworkers.\n\nIn addition, the CMFL is responsible for handling an individual caseload, ensuring outstanding constituent services, and developing innovative and effective outreach and public engagement strategies. The CMFL will be responsible for maintaining excellent relationships with key federal, state, and local agencies and stakeholders within a policy portfolio to be determined. The CMFL will collaborate regularly with the Press Secretary, designated legislative staff, and other relevant staff regarding district-focused policy priorities. Nontraditional work hours occur often including evening and weekends as needed.\n\nThis is not an entry-level position. Qualified candidates will excel in the following areas:\n\n* Creativity and Innovation: able to proactively seek creative solutions to pressing problems and help develop effective visual and written products to communicate those solutions to constituents\n* Project Management: able to balance short- and long-term priorities, work collaboratively with colleagues and external stakeholders, and anticipate possible obstacles to success\n* Stakeholder Management: able to build relationships with diverse stakeholders and find opportunities to collaborate",
    "responsibilities": [
      "Serves as a lead organizer and/or as a representative for the Congresswoman at events in the district as determined by the District Director",
      "Ensures outreach efforts align with the Congresswoman's strategic vision and goals",
      "Collaborates closely with the District Director and designated D.C. staff to ensure district priorities are reflected in legislative priorities",
      "Monitors and updates the District Director on casework trends",
      "Builds and maintains relationships with constituents and key community leaders and stakeholders",
      "Serves as a liaison with federal government agencies for individual constituent concerns",
      "Handles individual casework portfolio",
      "Engages in conduct and activities that reinforce the positive impact of the Congressional office on the community",
      "Performs other duties as needed"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Ability to help build, manage, and support strong goal-oriented teams",
      "Ability to navigate and advise others through challenging situations",
      "3-5 years of constituent service experience and/or experience leading outreach or engagement efforts",
      "Experience building and maintaining constituent and/or customer relationships",
      "Able to maintain composure and professionalism in every interaction with constituents",
      "Strong problem-solving and decision-making skills",
      "Ability to manage competing priorities in high-stress environments",
      "Strong organizational skills",
      "Ability to navigate nuanced and complex issues/situations",
      "Strong written and verbal communication skills, including public speaking",
      "Proven experience handling sensitive information and maintaining confidentiality"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume and writing sample to Ohio11resumes@mail.house.gov with the subject \"CMFL: Last Name, First Name\". Incomplete applications will not be considered.",
    "salary_info": "Commensurate with Experience",
    "contact": "Ohio11resumes@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-169-23",
    "position_title": "Grants Coordinator/Field Liaison (GCFL)",
    "office": "REP SHONTEL M. BROWN of OH-11",
    "location": "OH-11",
    "posting_date": "2023-03-20",
    "description": "The Grants Coordinator/Field Liaison (GCFL) will serve as a liaison to federal government agencies on behalf of the Congresswoman's constituents. The GCFL will handle the federal grant portfolio and assigned casework. They will also organize and participate in district outreach activities and workshops. The GCFL will also collaborate regularly with the District Director, Caseworkers/Field Representatives, and Director of Operations. Non-traditional work hours occur often including evening and weekends as needed.",
    "responsibilities": [
      "Serves as a liaison with federal government agencies for constituents, government entities, community organizations, nonprofits, and other grant applicants",
      "Researches and identifies federal grant opportunities",
      "Develops and maintains master files on grants as well as paperwork related to grant announcements for dissemination to constituents",
      "Monitors grant announcements and updates the District Director of new grant trends",
      "Creates and maintains a federal grant newsletter/guide for constituents",
      "Collaborates with the appropriate staff members on grant award announcements, newsletters, and media strategy",
      "Handles an individual casework portfolio",
      "Engages in conduct and activities that reinforce the positive impact of the Congressional office on the community"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Experience building and maintaining constituent and/or customer relationships",
      "Strong written and verbal communication, including public speaking skills",
      "Ability to navigate nuanced and complex issues/situations",
      "Ability to effectively manage competing priorities in high-stress environments",
      "Proven experience handling sensitive information and maintaining confidentiality",
      "Strong organizational and decision-making skills"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume and writing sample to Ohiollresumes@mail.house.gov with the subject \"Grant Coordinator/Field Representative: Last Name, First Name\". Incomplete applications will not be considered.",
    "salary_info": "Commensurate with Experience",
    "contact": "Ohiollresumes@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-168-23",
    "position_title": "Caseworker/Field Representative",
    "office": "REP SHONTEL M. BROWN of OH-11",
    "location": "Cleveland",
    "posting_date": "2023-03-20",
    "description": "The Caseworker plays a key role by serving as a liaison to the federal government on behalf of the Congresswoman's constituents. The Caseworker will manage a portfolio of issue areas and work collaboratively with the District Director, Director of Operations, and other Field Representatives to deliver exceptional service to constituents. As Field Representative, they will act as a liaison with federal, district, and local agencies for the Congresswoman and constituents. The Field Representative will also be responsible for serving as the Congresswoman's community representative for issues and programs.",
    "responsibilities": [
      "Serves as a liaison with federal government agencies for individual constituent concerns",
      "Handles individual casework portfolio",
      "Monitors and updates the District Director on casework trends",
      "Maintains accurate and complete files on all assigned casework matters",
      "Ensures outreach efforts align with the Congresswoman's strategic vision and goals",
      "Builds and maintains relationships with constituents and key community leaders and stakeholders",
      "Engages in conduct and activities that reinforce the positive impact of the Congressional office on the community",
      "Serves as a lead organizer and/or as a representative for the Congresswoman at events in the district as determined by the District Director",
      "Coordinates closely with the District Director and D.C. staff to ensure district priorities are reflective in legislative priorities",
      "Informs the Casework Manager and District Director on up-and-coming issues in the district",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Experience developing and maintaining community leaders and constituent relationships",
      "Able to maintain composure and professionalism in every interaction with constituents",
      "Strong problem-solving and decision-making skills",
      "Strong organization skills",
      "Ability to manage competing priorities in high stress environments",
      "Deep commitment to improving constituents' lives",
      "Strong written and verbal communication skills, including public speaking",
      "Proven experience handling sensitive information and maintaining confidentiality"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume and writing sample to Ohiollresumes@mail.house.gov with the subject PT Caseworker/Field Representative: Last Name, First Name\". Incomplete applications will not be considered.",
    "salary_info": "Commensurate with Experience",
    "contact": "Ohiollresumes@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-167-23",
    "position_title": "Staff Assistant",
    "office": "REP SHONTEL M. BROWN of OH-11",
    "location": "Cleveland, OH",
    "posting_date": "2023-03-20",
    "description": "The Staff Assistant will be expected to manage the front desk during office hours, support the district office staff with administrative office needs, and assist the D.C. office staff with work as assigned. Staff Assistants often provide the first impression of the office to constituents. The experiences gained in the Staff Assistant role provide a solid foundation to advance into positions of increasing responsibility.",
    "responsibilities": [
      "Provides a welcoming environment and positive first impression of the office to constituents, visitors, and other VIPs",
      "Handles incoming calls with poise, professionalism, and promptness",
      "Captures input from constituents on policy matters for the Member office's consideration and response",
      "Supervise and provide expectations and feedback for office interns",
      "Works closely with the Congresswoman's Executive Assistant to ensure appointments are on time as needed",
      "Ensures constituent casework messages are received to the appropriate district staff in an efficient and effective manner",
      "Complete resolutions and coordinate delivery based on individual needs",
      "Manage incoming and outgoing mail",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Effective communication skills for verbal and written correspondence",
      "Effective teamwork skills and the ability to support the needs of multiple team members and leaders in the office required",
      "Professional demeanor and an upbeat disposition while interacting with visitors, staff members, and stakeholders in a fast-paced, highly dynamic environment required",
      "Time management skills including the ability to prioritize, and track work status required",
      "Attention to detail",
      "Willingness to learn"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume and writing sample to Ohiollresumes@mail.house.gov with the subject PT Staff Assistant: Last Name, First Name\".\nIncomplete applications will not be considered.",
    "salary_info": "Commensurate with Experience",
    "contact": "Ohiollresumes@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-164-23",
    "position_title": "Investigative Support Analyst",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks an Investigative Support Analyst, with 2-8 years experience.\n\nThe Investigative Support Analyst will be responsible for the analysis and support of sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives, as well as other administrative functions.\nThe OCE is seeking candidates interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Support Analyst would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Assume primary responsibility for managing documentary evidence submitted to the OCE in the course of its investigations and managing office e-Discovery platform;",
      "Perform legal and other research and analysis to support OCE investigations; and",
      "Support OCE investigative staff and administrative operations as required."
    ],
    "qualifications": [
      "Two years of analyst, legal support, or other investigative experience;",
      "Strong research skills;",
      "Strong organizational skills;",
      "Strong writing and oral presentation ability;",
      "Ability to:\n\t* work independently or as part of an investigative team;\n\t* manage multiple tasks and projects; and\n\t* work well under pressure and tight time deadlines; and exercise discretion and independent judgment.",
      "Desirable but not required:\n\t* Investigative experience with high-profile and sensitive matters;\n\t* Experience with eDiscovery or litigation support platforms (eg. Casepoint);\n\t* Experience drafting and reviewing legal documents, preparing exhibits, or other published materials;\n\t* Experience with investigations involving public officials;\n\t* Experience with record or document management;\n\t* Experiencing maintaining or updating websites and other internet-based platforms;\n\t* Knowledge of current information technology tools related to investigations;\n\t* Experience with campaign finance or ethics law;\n\t* Experience conducting interviews or depositions; and\n\t* Experience writing reports or legal documents"
    ],
    "how_to_apply": "Please send cover letter and resume (electronic submissions preferred) to:\nOmar S. Ashmawy\nStaff Director and Chief Counsel\nOffice of Congressional Ethics\nUnited States House of Representatives\nP.O. Box 895\nWashington, DC 20515-0895",
    "salary_info": null,
    "contact": "OCEJOB@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-163-23",
    "position_title": "Staff Assistant/Scheduler",
    "office": "Western New York Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2023-03-20",
    "description": "Staff Assistant responsibilities include managing the front office, greeting visitors, assisting in running the office internship program, processing tour and flag requests, receiving and organizing mail and phone calls, managing reimbursements and vouchers, providing administrative support to the office, and other duties as assigned.\n\nScheduling responsibilities include managing constituent meeting requests and the Member’s weekly schedule in DC, coordinating travel and logistical details for trips back to the District, coordinating with DC and District staff to ensure a smooth weekly operation, and other duties as assigned.",
    "responsibilities": [
      "Managing the front office",
      "Greeting visitors",
      "Assisting in running the office internship program",
      "Processing tour and flag requests",
      "Receiving and organizing mail and phone calls",
      "Managing reimbursements and vouchers",
      "Providing administrative support to the office",
      "Managing constituent meeting requests",
      "Managing the Member’s weekly schedule in DC",
      "Coordinating travel and logistical details for trips back to the District",
      "Coordinating with DC and District staff to ensure a smooth weekly operation",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Strong written and oral communication skills",
      "Ability to work collaboratively in a fast-paced, team environment",
      "New York ties are welcome",
      "Prior Congressional experience is preferred",
      "Access to a personal car is a plus"
    ],
    "how_to_apply": "Please submit resume, cover letter, and writing sample to ny26.jobs@mail.house.gov with “Staff Assistant/Scheduler” in the subject line. Please send all materials in one PDF document. No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "ny26.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-162-23",
    "position_title": "Counsel or Professional Staff Member",
    "office": "House Select Subcommittee on the Coronavirus Pandemic",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "Rep. Raul Ruiz, M.D., the Ranking Member of the House Select Subcommittee on the Coronavirus Pandemic, is seeking a Counsel or Professional Staff Member to join the Democratic staff of the Select Subcommittee.\n\nThe Select Subcommittee on the Coronavirus Pandemic is authorized to investigate a broad range of matters pertaining to the coronavirus pandemic under H. Res. 5. The Select Subcommittee was established within the Committee on Oversight and Accountability, which is the primary investigative committee of the United States House of Representatives, with jurisdiction to investigate “any matter” at “any time” under House Rule X.",
    "responsibilities": [
      "Drafting letters",
      "Negotiating with counsel",
      "Preparing for depositions and transcribed interviews",
      "Drafting reports and memoranda",
      "Preparing for congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Ability to enjoy collaborative work environments",
      "Prior experience in congressional oversight and direct investigations is strongly preferred",
      "Demonstrated interest in public health, economics, and/or international affairs is strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter as PDFs to SSCPJobs@mail.house.gov, with “Counsel” or “Professional Staff Member” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "SSCPJobs@mail.house.gov",
    "equal_opportunity": "Women, LGBTQI+, and BIPOC candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-161-23",
    "position_title": "Scheduler/Office Manager",
    "office": "Senior Democratic Midwest Appropriator",
    "location": "DC",
    "posting_date": "2023-03-20",
    "description": "Senior Democratic Midwest Appropriator seeks a DC-based scheduler/office manager to coordinate the Representative’s schedule and manage the DC office’s overall operating procedures.",
    "responsibilities": [
      "Maintaining and managing the Member’s daily and long-term schedule while coordinating with District staff.",
      "Responding to all incoming meeting and scheduling requests.",
      "Organizing travel and booking flights for Member and staff.",
      "Communicating scheduling changes to the Member, staff, and outside stakeholders.",
      "Oversee and manage the Staff Assistant, Internship Program, and ensure Member and staff needs are met.",
      "Provide operational support to the office, including time-off requests, office supply needs, tech management, and other duties, to ensure staff are supported.",
      "Work closely with Chief of Staff and Financial Admin to ensure compliance with annual budget."
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "High attention to detail",
      "Ability to manage competing demands and deadlines",
      "Clean driving record",
      "Ability to handle conflicting requests",
      "Ability to anticipate the Member’s needs",
      "Ability to exercise sound judgement when scheduling meetings, events, and travel",
      "Hill and scheduling experience are strongly preferred.",
      "Ohio ties preferred but not required."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter to Steve.Katich@mail.house.gov with the subject line “Scheduler – LAST NAME, FIRST NAME.”",
    "salary_info": null,
    "contact": "Steve.Katich@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity."
  },
  {
    "id": "MEM-160-23",
    "position_title": "Constituent Advocate",
    "office": "Office of U.S. Representative Chrissy Houlahan, PA-06",
    "location": "Reading, Pennsylvania",
    "posting_date": "2023-03-20",
    "description": "As a Constituent Advocate for a congressional district office, you will be a liaison between constituents and federal government agencies. You will respond to constituent requests for assistance – from individuals, businesses, and nonprofits – and resolve casework issues through inquiries, facilitation, and problem solving.\n\nYou will represent the Congresswoman in meetings and at events in the district while building and maintaining productive, supportive working relationships with local government, business groups, non-profit, and other stakeholder groups within our community of PA-06. Constituent Advocates also identify local problems that can be solved by federal action and are knowledgeable of the impact of proposed and enacted federal legislation on stakeholders in our community.\n\nThe right candidate will serve as a critical part of a close-knit team. Applicants should have an enthusiastic interest in public service, superior attention to detail, and motivated to serve our community. Excellent written and oral communication skills are essential in English and Spanish, as well as the ability to manage multiple tasks, deadlines, and work well under pressure. Job responsibilities include outreach to relevant stakeholder groups in our community and successful candidates must have their own reliable transportation. Optimistic demeanor and a good sense of humor are a must. Connections to Pennsylvania and the 6th district are advantageous.",
    "responsibilities": [
      "Liaison between constituents and federal government agencies",
      "Respond to constituent requests for assistance",
      "Resolve casework issues through inquiries, facilitation, and problem solving",
      "Represent the Congresswoman in meetings and at events",
      "Build and maintain productive, supportive working relationships with local government, business groups, non-profit, and other stakeholder groups",
      "Identify local problems that can be solved by federal action",
      "Knowledgeable of the impact of proposed and enacted federal legislation on stakeholders"
    ],
    "qualifications": [
      "Enthusiastic interest in public service",
      "Superior attention to detail",
      "Motivated to serve our community",
      "Excellent written and oral communication skills in English and Spanish",
      "Ability to manage multiple tasks and deadlines",
      "Ability to work well under pressure",
      "Reliable transportation",
      "Optimistic demeanor",
      "Good sense of humor",
      "Connections to Pennsylvania and the 6th district are advantageous"
    ],
    "how_to_apply": "Please submit resume, writing sample, and cover letter to PA06HoulahanJobs@gmail.com and indicate “CONSTITUENT ADVOCATE: (your last name)” in the subject line. No walk-ins or drop-bys, please. This position will report to the District Director and begin on April 24, 2023.",
    "salary_info": "$58,000 annual salary. Medical benefits, savings and investment planning, tuition loan reimbursement, and 20 days paid leave are available as benefits for full-time staff members. Additionally, each staff member is allocated 5 additional days of paid leave for volunteer work.",
    "contact": "PA06HoulahanJobs@gmail.com",
    "equal_opportunity": "THIS OFFICE IS AN EQUAL OPPORTUNITY EMPLOYER: Women and minorities are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-158-23",
    "position_title": "LEGISLATIVE DIRECTOR",
    "office": "Congressman Jake Auchincloss (MA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-03-20",
    "description": "Congressman Jake Auchincloss (MA-04), member of the House Transportation & Infrastructure Committee and the House Select Committee on Strategic Competition between the U.S. and the Chinese Communist Party, is seeking an experienced Legislative Director to coordinate and oversee the Member’s legislative agenda, along with advising the Member on legislative activities and managing the legislative staff.\n\nIdeal candidate will have at least 5 years of legislative experience on the Hill. Candidate should possess a strong understanding of the legislative process, including House organization and procedures, as well as managerial experience. Applicant must also demonstrate an ability to manage and mentor staff, think strategically, and have experience in formulating strategic plans for advancing legislation. Prior experience with healthcare policy or the Transportation & Infrastructure Committee would be a valuable asset.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. A sense of humor is greatly appreciated.",
    "responsibilities": [],
    "qualifications": [
      "At least 5 years of legislative experience on the Hill",
      "Strong understanding of the legislative process, including House organization and procedures, as well as managerial experience",
      "Ability to manage and mentor staff",
      "Ability to think strategically",
      "Experience in formulating strategic plans for advancing legislation",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast paced environment"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and writing sample to AuchinclossJobs@mail.house.gov with “LD – First Name Last Name” in the Subject Line. Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-156-23",
    "position_title": "caseworker",
    "office": "Congressman Brad Sherman (CA-32)",
    "location": "Sherman Oaks district office",
    "posting_date": "2023-03-20",
    "description": "The Office of Congressman Brad Sherman (CA-32) is seeking to fill a job\nopening for a caseworker position in the (Sherman Oaks) district office.\n\nApplicant should be organized, professional, highly motivated and must possess\nstrong writing, typing and interpersonal skills. Must be able to work in a fastpaced environment and meet deadlines. Proficiency with Microsoft Office and\ndatabase software preferred.\n\nPosition is entry-level, but past experience in a social work or government field is\npreferred. Candidate should have graduated from an accredited four-year college\nor university with a bachelor's degree.",
    "responsibilities": [
      "Interact with constituents via phone, email and in-office meetings",
      "Assist senior staff with administrative responsibilities",
      "Input, file and review constituent inquiries",
      "Contact federal agencies on behalf of constituents"
    ],
    "qualifications": [
      "Organized, professional, highly motivated",
      "Strong writing, typing and interpersonal skills",
      "Able to work in a fastpaced environment and meet deadlines",
      "Proficiency with Microsoft Office and database software preferred",
      "Past experience in a social work or government field is preferred",
      "Candidate should have graduated from an accredited four-year college or university with a bachelor's degree"
    ],
    "how_to_apply": "Please submit cover letter and resume attn: Scott Abrams\nto scott.abrams@mail.house.gov\nNo calls please.",
    "salary_info": "Salary starts at $45,000 annually, with additional considerations made for\nrelevant experience. We offer a generous student loan reimbursement package.",
    "contact": "scott.abrams@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-154-23",
    "position_title": "Staff Assistant/Scheduler",
    "office": "Congresswoman Emilia Strong Sykes (OH-13)",
    "location": "Akron, Ohio",
    "posting_date": "2023-03-20",
    "description": "This position will work closely with and report to the Director of Outreach in support of the Congresswoman’s community engagement logistics and front office management. Primary responsibilities include answering phones, greeting office guests, conducting research, engaging in constituent correspondence, community outreach, and assisting with special projects. This position will also maintain the Member’s official daily schedule, travel plans, and related records while in Ohio.",
    "responsibilities": [
      "Tracking, evaluating, and responding to local invitations and scheduling requests, while maintaining close contact with the Member, DC staff, and District staff."
    ],
    "qualifications": [
      "Highly motivated",
      "Well-organized",
      "Detail-oriented",
      "Able to work in a fast-paced environment",
      "Excellent interpersonal skills",
      "Organization",
      "Should enjoy working as part of a team"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume and a cover letter to JoinTeamSykes@mail.house.gov with the following subject line: “Full Name – Staff Assistant/Scheduler.”",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Sykes is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-153-23",
    "position_title": "Field Representative",
    "office": "Congresswoman Emilia Strong Sykes (OH-13)",
    "location": "Akron, Ohio",
    "posting_date": "2023-03-20",
    "description": "This position will work closely with and report to the Director of Outreach in support of the Congresswoman’s community engagement efforts. Primary responsibilities include regular engagement with constituents; acting as a liaison with Federal, State, and local agencies and organizations; staffing the Congresswoman and attending community events; building relationships with a range of stakeholders throughout the district; and handling administrative tasks as assigned. Duties require travel throughout Summit and Portage Counties, including occasional meetings and events during evenings and weekends.\n\nThis position requires excellence in community relations and engagement.",
    "responsibilities": [
      "Regular engagement with constituents",
      "Acting as a liaison with Federal, State, and local agencies and organizations",
      "Staffing the Congresswoman and attending community events",
      "Building relationships with a range of stakeholders throughout the district",
      "Handling administrative tasks as assigned",
      "Travel throughout Summit and Portage Counties, including occasional meetings and events during evenings and weekends"
    ],
    "qualifications": [
      "Highly motivated",
      "Detail-oriented",
      "Able to work in a fast-paced environment",
      "Excellent interpersonal skills",
      "Enjoy working as part of a team",
      "Able to build and maintain relationships with a broad swath of stakeholders",
      "Able to effectively manage competing demands",
      "Politically astute",
      "Deep knowledge of the Congressional district is expected; this is not an entry-level position"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume and a cover letter to JoinTeamSykes@mail.house.gov with the following subject line: “Full Name – Field Representative.”",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Sykes is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-152-23",
    "position_title": "Constituent Advocate/Grant Coordinator",
    "office": "Congresswoman Emilia Strong Sykes (OH-13)",
    "location": "Akron, Ohio",
    "posting_date": "2023-03-20",
    "description": "This position will work closely with and report to the Director of Constituent Services in support of the Congresswoman’s community engagement efforts.\n\nPrimary responsibilities include regular engagement with constituents; answering casework correspondence and communications; acting as a liaison with Federal, State, and local agencies; communicating grant opportunities to local stakeholders and drafting letters of support; preparing correspondence to agency contacts and constituents; building relationships with a range of constituents and stakeholders throughout the district; and handling administrative tasks as assigned.\n\nThis position requires excellence in constituent relations, service delivery, and community engagement. Qualified candidates are highly motivated, detailoriented, able to work in a fast-paced environment, have excellent interpersonal skills, are able to manage competing demands, and enjoy working as part of a team. Previous advocacy and casework experience is preferred; this is not an entry-level position.",
    "responsibilities": [
      "Regular engagement with constituents",
      "Answering casework correspondence and communications",
      "Acting as a liaison with Federal, State, and local agencies",
      "Communicating grant opportunities to local stakeholders and drafting letters of support",
      "Preparing correspondence to agency contacts and constituents",
      "Building relationships with a range of constituents and stakeholders throughout the district",
      "Handling administrative tasks as assigned"
    ],
    "qualifications": [
      "Excellence in constituent relations, service delivery, and community engagement.",
      "Highly motivated",
      "Detail-oriented",
      "Able to work in a fast-paced environment",
      "Excellent interpersonal skills",
      "Able to manage competing demands",
      "Enjoy working as part of a team",
      "Previous advocacy and casework experience is preferred; this is not an entry-level position."
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume and a cover letter to JoinTeamSykes@mail.house.gov with the following subject line: “Full Name – Constituent Advocate/Grant Coordinator.”",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Sykes is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-151-23",
    "position_title": "Staff Assistant",
    "office": "Democratic Member",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized, and professional individual to serve in the role of Staff Assistant.\nThe successful applicant will be personable, organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.\nAdditional daily tasks include answering phones, processing mail, assisting with constituent requests for information, coordinating tours, and other administrative duties supporting the Member and staff as needed.",
    "responsibilities": [
      "Answering phones",
      "Processing mail",
      "Assisting with constituent requests for information",
      "Coordinating tours",
      "Other administrative duties supporting the Member and staff as needed"
    ],
    "qualifications": [
      "Personable",
      "Organized",
      "Excellent communication and time-management skills",
      "Ability to exercise sound, independent judgment",
      "Ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to staffassistant2023@yahoo.com. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "staffassistant2023@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-148-23",
    "position_title": "Press Secretary",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2023-03-20",
    "description": "The press secretary will manage communications in a fast-paced congressional office for a member of House Democratic leadership in a competitive district.\n\nResponsibilities are wide-ranging and include responding to daily media inquiries, building relationships with national, state and local reporters, pitching and booking frequent national cable interviews, writing press releases, statements and media advisories, creating and managing social media content, including graphics and videos, drafting speeches, talking points and op-eds, and creating franked communications, including mailers and telephone townhalls. The press secretary will also be responsible for managing a full-time press assistant and press interns.",
    "responsibilities": [
      "Responding to daily media inquiries",
      "Building relationships with national, state and local reporters",
      "Pitching and booking frequent national cable interviews",
      "Writing press releases, statements and media advisories",
      "Creating and managing social media content, including graphics and videos",
      "Drafting speeches, talking points and op-eds",
      "Creating franked communications, including mailers and telephone townhalls",
      "Managing a full-time press assistant and press interns"
    ],
    "qualifications": [
      "Strong written and verbal communication skills",
      "Self-starting personality",
      "Desire to continually learn in political communications",
      "Ability to work in a fast-pace congressional office under tight press deadlines",
      "Eagerness to work in a collaborative office environment",
      "This is not an entry-level position",
      "Michigan ties and Adobe Creative Suite skills preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter to kildeejobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "kildeejobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-145-23",
    "position_title": "Communications Director",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington",
    "posting_date": "2023-03-20",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), Ranking Member of the Ways & Means\nHealth Subcommittee and Executive Board member of the Congressional\nProgressive Caucus, seeks an experienced Communications Director for his\nWashington office.\nThis is not an entry level position. Excellent written and oral communication\nskills required. Hill experience strongly preferred. Texas ties a plus.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill experience strongly preferred.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor references to DoggettJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-139-23",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Homeland Security Republican Staff",
    "location": null,
    "posting_date": "2023-03-20",
    "description": "The House Committee on Homeland Security Republican Staff is hiring for a Professional Staff Member position supporting the Director of Investigations and the Subcommittee on Oversight, Investigations, and Accountability.\nThe ideal candidate will have a strong interest in investigations and homeland security issues.",
    "responsibilities": [
      "Staffing Subcommittee and some Full Committee congressional hearings",
      "Drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations",
      "Transcribed interviews",
      "Reviewing document productions",
      "Research",
      "Interacting with various congressional committee and personal offices"
    ],
    "qualifications": [
      "Must possess a strong work ethic, attention to detail, desire to learn how to conduct congressional oversight and investigations, be self-motivated, work well under pressure, and possess strong research, written, and oral communication skills.",
      "The ability to work both independently and as part of a team are critical.",
      "Prior Hill experience preferred, but not required."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to Resumes.CHS@mail.house.gov with the subject line \"<Applicant First and Last Name> - OIA PSM.\"",
    "salary_info": null,
    "contact": "Resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-138-23",
    "position_title": "Counsel",
    "office": "House Committee on Homeland Security Republican Staff",
    "location": null,
    "posting_date": "2023-03-20",
    "description": "The House Committee on Homeland Security Republican Staff is hiring for a Counsel position supporting the Director of Investigations and the Subcommittee on Oversight, Investigations, and Accountability.\n\nThe ideal candidate will have at least three years of experience with a background or strong interest in investigations. Experience in homeland security issues is a plus.",
    "responsibilities": [
      "Staffing Subcommittee and some Full Committee congressional hearings",
      "Drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations",
      "Depositions/ transcribed interviews",
      "Reviewing document productions",
      "Research",
      "Managing external sources of information",
      "Interacting with various congressional committee and personal offices"
    ],
    "qualifications": [
      "Candidates must possess a strong work ethic, superior attention to detail, be self-motivated, work well under pressure, and possess excellent written and oral communication skills.",
      "The ability to work both independently and as part of a team are critical.",
      "JD required.",
      "Prior Hill experience preferred."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to Resumes.CHS@mail.house.gov with the subject line “<Applicant First and Last Name> - OIA Counsel.”",
    "salary_info": null,
    "contact": "Resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-137-23",
    "position_title": "Counsel",
    "office": "House Committee on Energy and Commerce Oversight and Investigations Subcommittee",
    "location": null,
    "posting_date": "2023-03-20",
    "description": "The House Committee on Energy and Commerce Oversight and Investigations Subcommittee is seeking a mid- or senior-level Counsel to work on oversight issues related to the Committee’s broad jurisdiction for the Committee’s Democratic staff. Prior familiarity working for or with Congress and area(s) of expertise under the Committee’s jurisdiction—including environment, energy, health, telecommunications, or consumer protection—is required.",
    "responsibilities": [
      "Staffing congressional hearings",
      "Assisting in the management of investigations of governmental and non-governmental entities",
      "Conducting research, document review, and analysis",
      "Aiding in the drafting of official letters, memoranda, and investigative reports",
      "Helping to coordinate with other subcommittees of the full Committee."
    ],
    "qualifications": [
      "The successful candidate will be a detail-oriented and proactive self-starter with strong communication and writing skills.",
      "A minimum of five years of work experience is required.",
      "A J.D. is required, and experience within the areas of the Committee’s jurisdiction may be equally relevant."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and short writing sample to ecdjobs@mail.house.gov with the subject line, “E&C OI Professional Staff/Counsel.”",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "People of color, veterans, women, and LGBTQ+ candidates are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-129-23",
    "position_title": "Scheduler",
    "office": "Rep. Judy Chu (CA-28)",
    "location": "Washington, D.C.",
    "posting_date": "2023-03-20",
    "description": "This individual will be responsible for the Member’s daily and long-term schedule in D.C. and work in close coordination with the district scheduler.\n\nSpecific responsibilities will include managing invitations and scheduling requests, travel and logistical details, acting as a liaison to constituent groups, handling the member’s correspondence, and various additional administrative duties.",
    "responsibilities": [
      "Managing invitations and scheduling requests",
      "Travel and logistical details",
      "Acting as a liaison to constituent groups",
      "Handling the member’s correspondence",
      "Various additional administrative duties"
    ],
    "qualifications": [
      "Good writer",
      "Politically savvy",
      "Able to multi-task",
      "Meticulously organized",
      "Able to quickly solve problems in a fast-paced work environment",
      "Comfortable dealing with a wide variety of people and stakeholders",
      "Previous Capitol Hill scheduling or other scheduling experience is preferred",
      "A good sense of humor is a must"
    ],
    "how_to_apply": "To apply, please email cover letter and resume in one PDF document to ca28.jobs@gmail.com. Please include Scheduler in the subject line. No phone calls or drop-ins please!",
    "salary_info": null,
    "contact": "ca28.jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Consistent with applicable law, this office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment."
  },
  {
    "id": "MEM-128-23",
    "position_title": "Communications Director",
    "office": "Congressman Joe Courtney (CT-02)",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "The Communications Director will be responsible for managing all media and communications activities for the office, including planning and executing strategies to generate earned media coverage and maximizing proactive constituent communications.",
    "responsibilities": [
      "Proactive press outreach",
      "Working with local, national, and international media outlets",
      "Managing social media platforms",
      "Writing press releases",
      "Writing op-eds",
      "Drafting weekly e-newsletters",
      "Overseeing the Digital Media Manager to maximize the impact of content throughout eastern Connecticut through proactive constituent outreach and social media platforms",
      "Arranging all press conferences, TV appearances, radio interviews, and local media opportunities"
    ],
    "qualifications": [
      "Excellent written and oral communications abilities.",
      "Prior relevant communications experience required, previous congressional experience preferred, and New England or Connecticut ties are a plus.",
      "This is not an entry-level position."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and at least two relevant writing samples to ct02job@mail.house.gov by March 22, 2023. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "ct02job@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity."
  },
  {
    "id": "MEM-127-23",
    "position_title": "Minority Staff Director",
    "office": "Rep. Ami Bera, House Foreign Affairs Subcommittee on the Indo-Pacific",
    "location": "Washington, D.C.",
    "posting_date": "2023-03-20",
    "description": "The role will support and implement the Ranking Member’s legislative and foreign policy goals and liaise with foreign embassies and other stakeholders.",
    "responsibilities": [
      "Drafting legislation",
      "Developing policy and communications objectives",
      "Preparing the Ranking Member for hearings, briefings, and other engagements through verbal and written briefings",
      "Managing fellows and supporting personal office foreign policy team",
      "Serving as primary policy support for Subcommittee Democratic Members and staff",
      "Coordinating with House Foreign Affairs Committee staff"
    ],
    "qualifications": [
      "Strong verbal and written communication skills and relevant Asia policy experience",
      "Solid understanding of the Hill",
      "Robust network in the foreign affairs and Asia policy community",
      "Proven track record at achieving policy goals"
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to jobs.ca06@gmail.com. Please no calls or drop-ins.",
    "salary_info": null,
    "contact": "jobs.ca06@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-113-23",
    "position_title": "Chief Counsel",
    "office": "House Select Subcommittee on the Coronavirus Pandemic",
    "location": null,
    "posting_date": "2023-03-20",
    "description": "Rep. Raul Ruiz, M.D., the Ranking Member of the House Select Subcommittee on the Coronavirus Pandemic, is seeking a Chief Counsel to join the Democratic staff of the Select Subcommittee.\n\nThe Select Subcommittee on the Coronavirus Pandemic is authorized to investigate a broad range of matters pertaining to the coronavirus pandemic under H. Res. 5. The Select Subcommittee was established within the Committee on Oversight and Accountability, which is the primary investigative committee of the United States House of Representatives, with jurisdiction to investigate “any matter” at “any time” under House Rule X.",
    "responsibilities": [
      "Overseeing investigations",
      "Depositions",
      "Transcribed interviews"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Ability to enjoy collaborative work environments",
      "Prior experience in congressional oversight and direct investigations is strongly preferred."
    ],
    "how_to_apply": "Please send a resume and cover letter as PDFs to SSCPJobs@mail.house.gov, with “Chief Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "SSCPJobs@mail.house.gov",
    "equal_opportunity": "Women, LGBTQI+, and BIPOC candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-108-23",
    "position_title": "Legislative Director",
    "office": "Rep. Josh Gottheimer (NJ-5)",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "Rep. Josh Gottheimer (NJ-5), Co-Chair of the Problem Solvers Caucus, member of the House Permanent Select Committee on Intelligence, and member of the House Committee on Financial Services, seeks qualified candidates for the position of Legislative Director to join his Washington, DC team.",
    "responsibilities": [
      "Leading the development and implementation of the Member's short-term and long-term legislative priorities with the Member and Chief of Staff;",
      "Monitoring and managing activity on the House Floor, and working with the legislative team to develop vote recommendations;",
      "Managing the legislative team and overseeing their day-to-day progress;",
      "Developing and reviewing memos, remarks, committee materials, and other briefing materials for the Member on related topics;",
      "Working closely with the Chief of Staff and the communications team on messaging legislative issues;",
      "Managing a portfolio of senior legislative projects, especially around major legislative negotiations around the Member's work with the Problem Solvers Caucus;",
      "Working closely with bi-partisan Member staff in the House and Senate."
    ],
    "qualifications": [
      "A Bachelor's degree or related job experience;",
      "3-5 years of legislative experience in a Congressional office or legislative environment;",
      "Knowledge of the legislative process and procedures;",
      "Excellent attention to detail and strong organizational skills;",
      "Sound judgment;",
      "Strong communication skills;",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner;",
      "Willingness to accept direction and guidance on performance and process improvements from the Member and the Chief of Staff;",
      "The ability to thrive in a fast-paced environment;",
      "The ability to work flexible hours including long hours, nights, and weekends;",
      "The ability to anticipate challenges and proactively offer solutions."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Legislative Director - Last Name” as the subject line",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-105-23",
    "position_title": "Press Assistant",
    "office": "House Committee on Agriculture Republicans",
    "location": "Capitol Hill",
    "posting_date": "2023-03-20",
    "description": "The House Committee on Agriculture is seeking a detail-oriented and enthusiastic press assistant to join the communications shop.\nThe ideal candidate will have strong writing skills and work well in a rapidresponse environment.\nGeneral knowledge of agriculture is a bonus but not required. While day-to-day responsibilities may vary, the press assistant can expect to perform the following duties with regularity:",
    "responsibilities": [
      "Assist the communications director with drafting speeches, talking points, opeds, blogs, press releases, etc.",
      "Lead media tracking efforts by collecting press hits for the Committee and member offices.",
      "Draft Committee newsletters in consultation with the communications director and deputy communications director.",
      "Assist deputy communications director with member office requests during hearings.",
      "Assist the communications director in handling press inquiries and background conversations."
    ],
    "qualifications": [
      "Minimum 1-2 years in Capitol Hill or political experience",
      "Strong writing and strategic thinking skills",
      "Attention to detail",
      "Able to manage varying priorities and balance multiple deadlines",
      "A good attitude"
    ],
    "how_to_apply": "Interested candidates should send their resume and two writing samples to houseaggop@gmail.com.",
    "salary_info": null,
    "contact": "houseaggop@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-102-23",
    "position_title": "Legislative Correspondent",
    "office": "Conservative Congressman",
    "location": "Washington, DC",
    "posting_date": "2023-03-20",
    "description": "Responsibilities include drafting grant letters of support, constituent letters, sorting and batching mail, and assisting the legislative staff with various projects.\n\nApplicants should possess strong conservative credentials, effective writing and research skills, attention to detail, and the ability to manage multiple tasks at once. Position also includes a potential opportunity to manage a small legislative portfolio. Previous Capitol Hill experience preferred.",
    "responsibilities": [
      "Drafting grant letters of support",
      "Constituent letters",
      "Sorting and batching mail",
      "Assisting the legislative staff with various projects"
    ],
    "qualifications": [
      "Strong conservative credentials",
      "Effective writing and research skills",
      "Attention to detail",
      "Ability to manage multiple tasks at once",
      "Previous Capitol Hill experience preferred"
    ],
    "how_to_apply": "To apply, send resume and cover letter to gopwesternjobs1776@gmail.com",
    "salary_info": null,
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-101-23",
    "position_title": "Scheduler",
    "office": "Bay Area Democrat",
    "location": "Washington DC",
    "posting_date": "2023-03-20",
    "description": "Scheduler will manage all aspects of the Member's daily and long-term schedule in DC and in the district. This individual will work closely with the member, DC and district staff.\nThis person should be well-organized, detail-oriented, self-motivated, and able to work effectively in a fast-paced office.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the member",
      "Managing operational and logistical support for the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill or comparable work environment",
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Please submit your resume, cover letter and two references to CAHouseJob@mail.house.gov and include “Scheduler” in the subject line.",
    "salary_info": null,
    "contact": "CAHouseJob@mail.house.gov",
    "equal_opportunity": "Women, LGBTQ+, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with California ties."
  },
  {
    "id": "MEM-100-23",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Emilia Strong Sykes (OH-13)",
    "location": "Capitol Hill",
    "posting_date": "2023-03-20",
    "description": "Congresswoman Emilia Strong Sykes (OH-13) is seeking a Legislative Assistant to primarily manage her work on the Science, Space, and Technology Committee.\n\nThis position will work closely with and report to the Legislative Director to advance the Congresswoman's legislative priorities. In addition to staffing the Congresswoman on the Science, Space, and Technology Committee, the Legislative Assistant will also manage a broad portfolio including agriculture, education, energy and environment, healthcare, judiciary, and labor, among others.\n\nThe ideal candidate will be creative, able to staff and brief the Congresswoman for Committee work, an excellent writer, able to build and maintain relationships with a broad swath of stakeholders, and politically astute.\n\nThis is a full-time position. The Office of Congresswoman Sykes is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability.",
    "responsibilities": [
      "Manage work on the Science, Space, and Technology Committee.",
      "Staff the Congresswoman on the Science, Space, and Technology Committee.",
      "Manage a broad portfolio including agriculture, education, energy and environment, healthcare, judiciary, and labor, among others."
    ],
    "qualifications": [
      "Highly motivated",
      "Detail-oriented",
      "Able to manage competing demands",
      "Enjoy working as part of a team",
      "Creative",
      "Able to staff and brief the Congresswoman for Committee work",
      "Excellent writer",
      "Able to build and maintain relationships with a broad swath of stakeholders",
      "Politically astute",
      "Capitol Hill legislative experience is required; this is not an entry-level position."
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a resume and a cover letter to JoinTeamSykes@mail.house.gov with the following subject line: “Full Name – SST Legislative Assistant.”",
    "salary_info": null,
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Sykes is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-024-23",
    "position_title": "Scheduler",
    "office": "The Freshman Democrat from Hawai'i",
    "location": "DC and the district",
    "posting_date": "2023-03-20",
    "description": "The Freshman Democrat from Hawai'i is seeking a Scheduler with strong judgment, communication skills, and attention to detail to build and oversee all aspects of scheduling operations for the Member.\n\nThis position requires consistent and effective collaboration with all components of the Member's office. The Scheduler will work directly with the Chief of Staff, District Chief, and other senior staff.",
    "responsibilities": [
      "Building the Member's daily and long-term schedule for DC and the district and managing this system",
      "Responding to all incoming scheduling requests",
      "Booking and coordinating travel back to Hawai'i and within Hawai'i",
      "Ensuring the Member, staff, and external stakeholders have key information about the schedule",
      "Compiling daily briefing materials for the Member and coordinating the collection of information from staff and other sources",
      "Supporting the team with special events and ad hoc projects",
      "Other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a cover letter, resume, and references to hawaii02jobs@gmail.com.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, sexual orientation, or gender identity. Candidates from diverse backgrounds, especially with ties to Hawai'i, are encouraged to apply. Being able to serve as a secondary driver when needed is preferred, but not required."
  }
]