[
  {
    "id": "MEM-065-15",
    "position_title": "Scheduler",
    "office": "New England Democrat",
    "location": "District and DC",
    "posting_date": "2015-02-23",
    "description": "New England Democrat seeks a high energy, highly-organized, detail-oriented Scheduler to manage the Member's District and DC schedule. Responsibilities include organizing and tracking invitations, meetings, speaking engagements, in District tours and meetings, and scheduling requests for the Member; occasional driving; and managing travel reservations. Candidates must be on call and available to assist the Member after regular business hours. Additionally, the Scheduler will work closely with the Chief of Staff and District Director to ensure efficient and seamless office operations.",
    "responsibilities": [
      "Organizing and tracking invitations, meetings, speaking engagements",
      "In District tours and meetings",
      "Scheduling requests for the Member",
      "Occasional driving",
      "Managing travel reservations"
    ],
    "qualifications": [
      "Have a car",
      "High energy",
      "A very positive attitude",
      "Strong organizational skills",
      "Orientation to detail",
      "Possess strong verbal and written communication skills",
      "Strong interpersonal skills",
      "Savvy political instincts",
      "Poise and ability to thrive in a fast-paced environment",
      "The ability to multi-task",
      "Connecticut ties and willingness to work from Connecticut a plus"
    ],
    "how_to_apply": "Interested parties should email a cover letter and resume to CT05Jobs@gmail.com. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "CT05Jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-059-15",
    "position_title": "Legislative Assistant",
    "office": "Southern Democrat and Member of the Small Business Committee",
    "location": null,
    "posting_date": "2015-02-23",
    "description": "Legislative Assistant to handle a broad legislative portfolio including Small Business, Financial Services, Judiciary, Healthcare, and Immigration.\nQualified candidates must have strong writing, analytical, and organizational skills; a proven ability to perform under pressure while juggling multiple tasks with competing priorities; and sound political judgment. The Legislative Assistant will be expected to handle relevant committee work. This is not an entry level position.",
    "responsibilities": [],
    "qualifications": [
      "Strong writing, analytical, and organizational skills",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Sound political judgment"
    ],
    "how_to_apply": "Please email cover letter and resume to: NCCongressionalJobs@gmail.com (subject line should read: Legislative Assistant).",
    "salary_info": null,
    "contact": "NCCongressionalJobs@gmail.com",
    "equal_opportunity": "Minorities and women are encouraged to apply, North Carolina ties preferred but not required."
  },
  {
    "id": "MEM-058-15",
    "position_title": "Director of Intergovernmental Relations",
    "office": "GA04",
    "location": "District office",
    "posting_date": "2015-02-23",
    "description": "Incumbent will interface with Governor’s office, other constitutional officers, DeKalb, Rockdale, Gwinnett, Newton delegations in the Georgia House and Senate, state and local elected governmental agencies. Incumbent will develop and maintain relationships with government and constituent groups and monitor State legislation for their impact on federal policies and programs and will advocate for the legislative priorities of the Member in the District. The incumbent will draft speeches, public relations (i.e., congratulatory letters, letters of greeting, etc.) and serve as point person on local appropriations, ACA, and other issues. The incumbent will also assist the Communications Director and the DC office on messaging, providing original copy and editing, as needed, provides detailed reports on activities to DC and District staff, and must be willing to perform other duties as assigned. This is a senior staff appointment located in the District office reporting directly to the Congressman, Chief of Staff and District Director.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Interested persons should email ga04position@gmail.com.",
    "salary_info": "$50,000 – 60,000",
    "contact": "ga04position@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-052-15",
    "position_title": "Press Secretary",
    "office": "Senior Republican",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-23",
    "description": "The successful candidate will have excellent written and verbal skills as well as the proven ability to manage multiple communications projects. She/he will be responsible for developing, managing and coordinating all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website including design, implementing social media strategy including Facebook, Twitter, etc., maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include early daily news clips, briefing the Member for radio interviews, writing and implementing PSA's from the Member, interacting with the press as the Member's principal spokesperson and coordinating the Member's overall press relations. The ideal candidate will have Hill experience and familiarity with New Jersey. Must be able to work extended hours and under time pressure.",
    "responsibilities": [
      "Developing, managing and coordinating all communications activities",
      "Writing press releases, op-eds, mail pieces, talking points",
      "Organizing press events",
      "Maintaining the official website including design",
      "Implementing social media strategy including Facebook, Twitter, etc.",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Early daily news clips",
      "Briefing the Member for radio interviews",
      "Writing and implementing PSA's from the Member",
      "Interacting with the press as the Member's principal spokesperson",
      "Coordinating the Member's overall press relations"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects",
      "Hill experience",
      "Familiarity with New Jersey",
      "Ability to work extended hours",
      "Ability to work under time pressure"
    ],
    "how_to_apply": "Please email a resume, cover letter, and two writing samples to pressopportunity2015@gmail.com.",
    "salary_info": null,
    "contact": "pressopportunity2015@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-049-15",
    "position_title": "Press Secretary",
    "office": "Pennsylvania Republican",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-23",
    "description": "Duties include performing day-to-day operations of an active press office, including new media, drafting press releases, e-newsletters, talking points, and columns.",
    "responsibilities": [
      "Performing day-to-day operations of an active press office",
      "New media",
      "Drafting press releases",
      "E-newsletters",
      "Talking points",
      "Columns"
    ],
    "qualifications": [
      "Hill or campaign experience",
      "PA ties preferred"
    ],
    "how_to_apply": "Send resume, writing sample, and cover letter to PA.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "PA.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-048-15",
    "position_title": "Communications Director",
    "office": "North Carolina Democratic Congresswoman",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-23",
    "description": "The ideal applicant will be an excellent writer and editor with a proven ability to prioritize and handle multiple tasks in a fastpaced environment, while meeting tight deadlines.",
    "responsibilities": [
      "planning and implementing national and local media strategies",
      "managing social media platforms",
      "writing press releases, talking points, op-eds and other materials"
    ],
    "qualifications": [
      "Candidate must build and maintain excellent relationships with members of the national and local media and editorial boards and have on-the-record experience.",
      "Hill experience is highly desired.",
      "Excellent writer and editor",
      "Proven ability to prioritize and handle multiple tasks in a fast-paced environment",
      "Ability to meet tight deadlines"
    ],
    "how_to_apply": "Please send resume and two writing samples to NCCongressionalJobs@gmail.com. No phone calls, e-mails or walk-ins, please.",
    "salary_info": null,
    "contact": "NCCongressionalJobs@gmail.com",
    "equal_opportunity": "Minorities and women encouraged to apply, North Carolina ties preferred."
  },
  {
    "id": "MEM-044-15",
    "position_title": "Communications Director",
    "office": "Florida Democrat",
    "location": "D.C.",
    "posting_date": "2015-02-23",
    "description": "The Communications Director will coordinate all press activities, serve as the primary spokesperson for the Representative, and manage national media. The Communications Director will work with the Orlando-based Press Secretary to execute messaging strategies and media activities in the district.\n\nCandidates should be proactive, and possess superior written and oral communication skills (including strong writing, editing, and proofreading capabilities). The ideal candidate will have prior political experience and at least two years of professional communications work with national media experience.",
    "responsibilities": [
      "Establishing and maintaining relationships with national and D.C.-based media",
      "Coordinating all media efforts and communications-related events",
      "Drafting and distributing press releases and media advisories; drafting, editing, and placing op-eds",
      "Pitching stories to reporters, responding to press inquiries, and serving as the point-of-contact for national press",
      "Monitoring media narratives and identifying opportunities to promote the Member",
      "Overseeing franked communications strategy, including: the drafting, design, and distribution of franked mail content; executing telephone town hall events; and managing congressional e-newsletter",
      "Managing the congressional website and ensuring that it features timely content",
      "Coordinating and staffing the Congressman for interviews and events (including night and weekend commitments)"
    ],
    "qualifications": [
      "Proactive",
      "Superior written and oral communication skills (including strong writing, editing, and proofreading capabilities)",
      "Prior political experience",
      "At least two years of professional communications work with national media experience"
    ],
    "how_to_apply": "Please send a current resume, cover letter, salary requirement, two writing samples (not to exceed one page each), and three references to FL09job@gmail.com. No calls, emails or walk-ins, please.",
    "salary_info": null,
    "contact": "FL09job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-041-15",
    "position_title": "Communications Director",
    "office": "Joint Economic Committee Democratic staff",
    "location": null,
    "posting_date": "2015-02-23",
    "description": "The Joint Economic Committee Democratic staff seeks a Communications Director with 5 or more years of experience in political communications or a closely-related field. He or she must have a proven ability to work with national print and broadcast reporters - a deep rolodex is a big plus. A successful candidate must be an innovative thinker with an ability to turn complex issues into stories suitable for print, television and radio. He or she must demonstrate excellent writing and editing skills and must possess a strong portfolio of press releases, statements, op-eds and other pieces. Knowledge of economic issues as well as significant coursework in economics is strongly desired. Experience with social media and graphics design is helpful but not required.",
    "responsibilities": [],
    "qualifications": [
      "5 or more years of experience in political communications or a closely-related field",
      "Proven ability to work with national print and broadcast reporters",
      "Excellent writing and editing skills",
      "Strong portfolio of press releases, statements, op-eds and other pieces",
      "Knowledge of economic issues as well as significant coursework in economics is strongly desired.",
      "Experience with social media and graphics design is helpful but not required."
    ],
    "how_to_apply": "Please submit a cover letter, resume and two short writing samples to:",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "joint_economic_committee-dems_press@jec.senate.gov",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-038-15",
    "position_title": "Legislative Correspondent",
    "office": "Congresswoman Donna F. Edwards",
    "location": "Hill",
    "posting_date": "2015-02-23",
    "description": "Congresswoman Donna F. Edwards seeks a Legislative Correspondent for an active mail program. Individual will be responsible for drafting all constituent correspondence and potentially providing policy support to the Legislative Assistants. Candidate should have excellent writing ability, superior researching skills, and understanding of the legislative process in order to provide thoughtful and substantive responses to constituent correspondence. Hill background, experience with Intranet Quorum, and Maryland ties a plus.",
    "responsibilities": [
      "Drafting all constituent correspondence",
      "Potentially providing policy support to the Legislative Assistants"
    ],
    "qualifications": [
      "Excellent writing ability",
      "Superior researching skills",
      "Understanding of the legislative process",
      "Hill background (a plus)",
      "Experience with Intranet Quorum (a plus)",
      "Maryland ties (a plus)"
    ],
    "how_to_apply": "Please send your resume, a cover letter (include salary requirements), two writing samples (maximum of two-pages each), and a list of three references to chris.schloesser@mail.house.gov with “Legislative Correspondent Position” in the subject line. No phone calls or drop bys, please.",
    "salary_info": null,
    "contact": "chris.schloesser@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-034-15",
    "position_title": "Legislative Assistant",
    "office": "Office of Rep. Justin Amash (R-MI)",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-23",
    "description": "The Office of Rep. Justin Amash (R-MI) seeks a bright, creative, and hardworking legislative assistant to join our Washington, D.C.-based policy team.\nThe legislative assistant will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The legislative assistant will be expected to handle a diverse portfolio of policy issues, which can be tailored somewhat to the staffer's expertise and interests.\nThe successful candidate will demonstrate a strong commitment to individual liberty, economic freedom, and the defense of the Constitution. He or she also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. Candidates who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.\nCandidates must have a B.A. or equivalent, and we prefer candidates with some policy experience, although Hill experience is not required. This is not an entry-level position.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "B.A. or equivalent",
      "Policy experience preferred",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume and cover letter to mi03.apply@gmail.com.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-030-15",
    "position_title": "Legislative Assistant for Small Business & Finance",
    "office": null,
    "location": "Washington, D.C.",
    "posting_date": "2015-02-23",
    "description": "CORE RESPONSIBILITIES:\n\nDUTIES:\n\nPreference for applicants from Michigan.",
    "responsibilities": [
      "to develop and plan legislative initiatives especially around small business and tax issues",
      "to monitor legislative developments within Committees and on the House floor",
      "to write floor speeches for the Member",
      "extensive knowledge of federal/state workforce issues and organized labor",
      "ability to draft statements for the Member",
      "to draft constituent correspondence for the Member",
      "to meet with constituents and special interest groups on behalf of the Member",
      "formulates legislative initiatives for assigned issue areas which includes:\n- devising a legislative plan;\n- drafting the plan into legislative form;\n- planning, coordinating and scheduling introduction of legislation in the House (or offering it on an appropriate vehicle if it is an amendment);\n- gathering support for a bill or amendment from other Members, as well as appropriate interest groups;\n- working with committees on legislation;\n- coordinating legislative support to get the bill passed in the House.",
      "tracks legislation and other developments in his or her assigned issue areas and briefs the Member for floor work, committee work, work in the district, and outside House-related activities",
      "monitors legislative developments within committees",
      "plans and coordinates co-sponsorship and support of other legislation",
      "monitors legislation on the House floor, providing the Member with information on each vote",
      "writes Floor speeches for the Member",
      "if assigned to issues pending before a specific committee, prepares for and attends committee meetings and hearings with or without the Member (i.e., keeps in contact with committee staff and meets with interest groups and constituents with interests in such meetings)",
      "acts as liaison with committee and agency staffs",
      "performs special projects assigned by the Member or Chief of Staff / Legislative Counsel",
      "meets with constituents and interest groups",
      "provides information on and generates ideas for press, mass mailings, and newsletters",
      "answers constituent letters and helps constituents on federal matters",
      "performs other duties as assigned"
    ],
    "qualifications": [
      "at least two (2) years of legislative experience not including internships",
      "strong academic credentials focused on business, tax and/or energy",
      "excellent oral and written communication skills",
      "thorough knowledge of the legislative process",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member on small business, federal tax and/or energy issues",
      "ability to work cooperatively and courteously with others",
      "ability to work well under pressure",
      "able to support a progressive caucus agenda",
      "reliable transportation",
      "ability to work in, and support a team environment",
      "thoroughness and careful attention to detail",
      "availability to work long hours during the week and occasionally on weekends"
    ],
    "how_to_apply": "SEND RESUMES AND ONE WRITING SAMPLE TO:",
    "salary_info": null,
    "contact": "CapitolHill14@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-023-15",
    "position_title": "Legislative Assistant",
    "office": "Republican Committee Staff",
    "location": null,
    "posting_date": "2015-02-23",
    "description": "Republican Committee Staff is seeking applications for a Legislative Assistant position to serve as the junior member of the Committee's tax policy group. Primary responsibilities include administrative and clerking duties, active responsiveness to Member office requests, and contribution to materials for member meetings, hearings, markups, draft legislation, and other committee business. JD, CPA, and/or tax experience preferred. Recent law school graduates with a strong interest in tax welcome to apply.",
    "responsibilities": [
      "Administrative and clerking duties",
      "Active responsiveness to Member office requests",
      "Contribution to materials for member meetings, hearings, markups, draft legislation, and other committee business"
    ],
    "qualifications": [
      "JD, CPA, and/or tax experience preferred",
      "Recent law school graduates with a strong interest in tax welcome to apply"
    ],
    "how_to_apply": "Please submit a resume and one brief writing sample to GOPTaxLA@gmail.com.",
    "salary_info": null,
    "contact": "GOPTaxLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-15",
    "position_title": "Tax and Finance Counsel/ Advisor",
    "office": "Ways and Means Committee Member",
    "location": null,
    "posting_date": "2015-02-23",
    "description": "Senior, Progressive, Democratic Ways and Means Committee Member has an opening for a Tax and Finance Counsel/ Advisor to handle tax, pension, financial services, small business, immigration, and homeland security policy.\nThis is not an entry-level position. Ideal candidates have Congressional experience and substantive tax policy/ legal knowledge. Applicants should be strong writers with the abilities to learn quickly, multi-task, and work independently in a fluid environment. Great interpersonal skills and a good sense of humor are a requisite.",
    "responsibilities": [],
    "qualifications": [
      "Congressional experience",
      "Substantive tax policy/ legal knowledge",
      "Strong writing abilities",
      "Ability to learn quickly",
      "Ability to multi-task",
      "Ability to work independently in a fluid environment",
      "Great interpersonal skills",
      "Good sense of humor"
    ],
    "how_to_apply": "Please email a cover letter, resume, and references to leg.job@mail.house.gov. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "leg.job@mail.house.gov",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-009-15",
    "position_title": "Communications Director/Policy Advisor",
    "office": "Senior Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-23",
    "description": "Senior Democrat seeks candidates for the position of Communications Director/Policy Advisor for a fast-paced and highly engaged office. The successful candidate will have excellent written and verbal skills, the proven ability to manage multiple communications projects, and the ability to exercise discretion and independent judgment in the representation of the Member’s position on policy issues. S/he will be responsible for developing, managing and coordinating all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website, implementing social media strategy, maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include briefing the Member for interviews, writing and implementing PSAs, interacting with the press as the Member’s principal spokesperson and coordinating the Member’s overall press relations. The ideal candidate will have Hill experience, a depth of legislative and policy knowledge including that of the appropriations process, and Ohio connections of benefit. Candidates must be able to work extended hours and under time pressure, while maintaining a positive attitude and demeanor.",
    "responsibilities": [
      "Developing, managing and coordinating all communications activities",
      "Writing press releases",
      "Writing op-eds",
      "Writing mail pieces",
      "Writing talking points",
      "Organizing press events",
      "Maintaining the official website",
      "Implementing social media strategy",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Briefing the Member for interviews",
      "Writing and implementing PSAs",
      "Interacting with the press as the Member’s principal spokesperson",
      "Coordinating the Member’s overall press relations"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects",
      "Ability to exercise discretion and independent judgment in the representation of the Member’s position on policy issues",
      "Hill experience",
      "Depth of legislative and policy knowledge including that of the appropriations process",
      "Ohio connections of benefit",
      "Ability to work extended hours and under time pressure, while maintaining a positive attitude and demeanor"
    ],
    "how_to_apply": "Please submit resume, cover letter, two writing samples, and salary requirements to Midwestern.Resume@mail.house.gov with “Communication Director/Policy Advisor” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-15",
    "position_title": "Legislative Director",
    "office": "Progressive Senior Appropriator",
    "location": "Washington, DC",
    "posting_date": "2015-02-23",
    "description": "Progressive Senior Appropriator seeks a Legislative Director to lead staff in a team-oriented office and serve as liaison to DHS appropriations subcommittee.",
    "responsibilities": [
      "supervise day to day activity of legislative staff",
      "contribute to office communications plan",
      "proactively promote the office legislative agenda",
      "manage a personal legislative issue portfolio which may include homeland security, defense, civil rights, judiciary, trade and foreign affairs among others",
      "perform other related duties as assigned"
    ],
    "qualifications": [
      "thorough knowledge of the legislative process and House procedures",
      "previous supervisory experience",
      "excellent organizational and communication skills",
      "ability to work under pressure and meet deadlines",
      "flexibility with priorities and ever changing deadlines",
      "detail orientation",
      "ability to meet attendance requirements including a varied and often unpredictable work schedule"
    ],
    "how_to_apply": "Interested applicants should submit via email the following documents: cover letter, resume and one writing sample. Care should be taken to include each document as a separate attachment in the same email to: SoCalDCstaffOpening@mail.house.gov.",
    "salary_info": null,
    "contact": "SoCalDCstaffOpening@mail.house.gov",
    "equal_opportunity": "People of color, women and LGBT persons strongly encouraged to apply."
  }
]