[
  {
    "id": "MEM-029-16",
    "position_title": "Communications Director",
    "office": "Senior Democrat",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "Senior Democrat seeks Communications Director to manage legislative and local press priorities. The applicant must be a hard worker who possesses excellent written, verbal and interpersonal skills. The ideal candidate has Hill and political experience.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-027-16",
    "position_title": "Press Secretary/Communications Director",
    "office": "Northeast Republican in the House",
    "location": "Washington, D.C.",
    "posting_date": "2016-01-18",
    "description": "Duties include performing day-to-day operations of an active press office; managing the website and all social media accounts; developing and generating content for press releases, e-newsletters, talking points, speeches, columns, advertisements, and franked mail; and building press relations with local, regional, and DC press.",
    "responsibilities": [
      "Performing day-to-day operations of an active press office",
      "Managing the website and all social media accounts",
      "Developing and generating content for press releases, e-newsletters, talking points, speeches, columns, advertisements, and franked mail",
      "Building press relations with local, regional, and DC press"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Demonstrated abilities in digital media and communication",
      "Previous Hill or campaign experience",
      "Candidates must be able to execute a media and communications plan in line with the unique priorities of the Congressman and views of the district."
    ],
    "how_to_apply": "Send resume, writing sample, cover letter, and salary range to PressRez@gmail.com.",
    "salary_info": null,
    "contact": "PressRez@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-021-16",
    "position_title": "General Counsel",
    "office": "Senior Member of Congress",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "Senior Member of Congress seeks General Counsel – the ideal candidate would have experience in a wide range of legal and administrative, legislative, and ethics issues relevant to a small government agency. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines. Individuals must be U.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas travel will be required.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-16",
    "position_title": "Global Security/Political Military Affairs Policy Advisor",
    "office": "Commission on Security and Cooperation in Europe",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "Ideal candidate would have experience in areas including: transnational security threats; arms control; monitoring compliance with international instruments; and working with international organizations with a security dimension such as OSCE and NATO. Area studies expertise in Europe and Eurasia is also a plus. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines. Individuals must be U.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas travel will be required.",
    "responsibilities": [],
    "qualifications": [
      "Experience in areas including: transnational security threats; arms control; monitoring compliance with international instruments; and working with international organizations with a security dimension such as OSCE and NATO.",
      "Area studies expertise in Europe and Eurasia is also a plus.",
      "Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work.",
      "Strong commitment to public service",
      "Strong writing, speaking and analytical skills",
      "Be proactive, resourceful, well-organized, and able to meet deadlines.",
      "U.S. citizens and have, or be able to obtain, a Top Secret Clearance.",
      "Overseas travel will be required."
    ],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-019-16",
    "position_title": "Middle-Eastern Policy Advisor",
    "office": "Commission on Security and Cooperation in Europe",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "Commission on Security and Cooperation in Europe seeks Middle-Eastern\nPolicy Advisor – the ideal candidate would have extensive and broad\nexperience as a Middle East expert with experience in formulating policies to\ndeal with political movements, security issues, and human rights challenges in\nthe Middle East. Area studies expertise in the Middle East is also a plus as is\ndeep knowledge of Arab cultures and fluency in Arabic language. Relevant\npolicy experience and advanced degree(s) valued over Capitol Hill or political\nwork. The successful candidate will have a strong commitment to public\nservice, strong writing, speaking and analytical skills, be proactive,\nresourceful, well-organized, and able to meet deadlines. Individuals must be\nU.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas\ntravel will be required.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please e-mail a cover letter and resume to\ncscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-018-16",
    "position_title": "Russian Policy Advisor",
    "office": "Commission on Security and Cooperation in Europe",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "The ideal candidate would have extensive and broad expertise as a Russia expert with experience in formulating policies to deal with both security and human rights challenges posed by Russia. Specific expertise on Russia's interaction with international organizations such as the OSCE and international instruments such as the Conventional Forces in Europe (CFE) treaty and the Open Skies Agreement are a plus. Area studies expertise in Eurasia is also a plus as is proficiency in Russian and other Eurasian languages. Relevant policy experience and advanced degree(s) valued over Capitol Hill or political work. The successful candidate will have a strong commitment to public service, strong writing, speaking and analytical skills, be proactive, resourceful, well-organized, and able to meet deadlines. Individuals must be U.S. citizens and have, or be able to obtain, a Top Secret Clearance. Overseas travel will be required.",
    "responsibilities": [],
    "qualifications": [
      "Extensive and broad expertise as a Russia expert",
      "Experience in formulating policies to deal with both security and human rights challenges posed by Russia",
      "Strong commitment to public service",
      "Strong writing, speaking and analytical skills",
      "Proactive, resourceful, well-organized, and able to meet deadlines",
      "U.S. citizens",
      "Have, or be able to obtain, a Top Secret Clearance"
    ],
    "how_to_apply": "Please e-mail a cover letter and resume to cscepositions115@gmail.com.",
    "salary_info": null,
    "contact": "cscepositions115@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-16",
    "position_title": "Press Secretary",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington",
    "posting_date": "2016-01-18",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a press secretary for his Washington office. Spanish skills and Hill experience a plus.",
    "responsibilities": [],
    "qualifications": [
      "Spanish skills a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-455-15",
    "position_title": "Legislative Director",
    "office": "Ranking Member Louise Slaughter (NY-25)",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "Responsibilities include developing and overseeing the Congresswoman’s legislative agenda, managing a large legislative staff, editing written material, and handling a legislative portfolio, including health and pro-choice issues.",
    "responsibilities": [
      "Developing and overseeing the Congresswoman’s legislative agenda",
      "Managing a large legislative staff",
      "Editing written material",
      "Handling a legislative portfolio, including health and pro-choice issues"
    ],
    "qualifications": [
      "At least five years of legislative experience",
      "A deep understanding of legislative process",
      "A passion for public policy",
      "Strong writing and communications skills",
      "Experience working with external stakeholders",
      "The ability to work collaboratively"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter and resume to employ@mail.house.gov.",
    "salary_info": null,
    "contact": "employ@mail.house.gov",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-454-15",
    "position_title": "Staff Assistant",
    "office": "U.S. Member of Congress in New York",
    "location": "D.C. Office",
    "posting_date": "2016-01-18",
    "description": "Individuals should demonstrate strong interpersonal skills and ability to manage multiple tasks, possess strong computing skills, and have a solid work ethic. Responsibilities include, but are not limited to, answering and screening telephone calls, organizing and managing the front office, greeting constituents and visitors, preparing and coordinating requests for tours, congressional proclamations and other recognitions, monitoring deliveries, tracking and managing office supplies and materials, assisting staff with projects, research and assignments. Must be proficient in Microsoft Word, Outlook and Excel and experience with communications or graphic design is desired but not required.",
    "responsibilities": [
      "Answering and screening telephone calls",
      "Organizing and managing the front office",
      "Greeting constituents and visitors",
      "Preparing and coordinating requests for tours, congressional proclamations and other recognitions",
      "Monitoring deliveries",
      "Tracking and managing office supplies and materials",
      "Assisting staff with projects, research and assignments"
    ],
    "qualifications": [
      "Strong interpersonal skills and ability to manage multiple tasks",
      "Strong computing skills",
      "Solid work ethic",
      "Proficient in Microsoft Word, Outlook and Excel",
      "Experience with communications or graphic design is desired but not required"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, and resume to ResumeNY@mail.house.gov Please be sure to put STAFF ASSISTANT in the subject line. PLEASE NO WALK-INS OR PHONE CALLS",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-453-15",
    "position_title": "District Caseworker",
    "office": "U.S. Member of Congress in New York",
    "location": "Congressional District Office",
    "posting_date": "2016-01-18",
    "description": "Congressional District Office is seeking a full time Caseworker. A highly motivated and experienced candidate will be responsible for helping navigate constituents through governmental services, particularly in the policy/issue areas of: immigration, veterans’ affairs, social security, housing, and assessing casework and community outreach activities for matters affecting or warranting potential legislative action.",
    "responsibilities": [
      "Helping navigate constituents through governmental services",
      "Assessing casework and community outreach activities for matters affecting or warranting potential legislative action"
    ],
    "qualifications": [
      "Previous experience in immigration laws, outreach, organizing and case management",
      "Prior experience working for federal, state or local unit of government is a plus",
      "Excellent oral and written skills",
      "Ability to work independently and as part of a team",
      "Highly organized, self-motivated",
      "Able to perform in a fast pace environment",
      "Bilingual/multilingual is a plus",
      "Valid driver’s license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Please e-mail resume and cover letter to ResumeNY@mail.house.gov. Please be sure to put CASEWORKER in the subject line. PLEASE NO WALK-INS OR PHONE CALLS",
    "salary_info": "Salary commensurate with experience",
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-452-15",
    "position_title": "District Representative",
    "office": "U.S. Member of Congress in New York",
    "location": "New York",
    "posting_date": "2016-01-18",
    "description": "Seeking a team player capable of representing the Member and the office of the Congressional district within his/her designated area. Duties for this position include, but are not limited to community outreach activities and public speaking; responding to constituent case work through correspondence, meeting with constituents, as well as, with local businesses, merchants associations, community-based organizations and agencies to assist in navigating the services provided by the federal government. Organizing and participating in community projects and events. Working with the District Director to develop and execute outreach strategies for the district.\n\nServe as liaison to Community Boards, Precincts Councils and Block Associations. Attend and speak at meetings and/or events on the Member's behalf.",
    "responsibilities": [
      "Community outreach activities and public speaking",
      "Responding to constituent case work through correspondence",
      "Meeting with constituents, as well as, with local businesses, merchants associations, community-based organizations and agencies to assist in navigating the services provided by the federal government",
      "Organizing and participating in community projects and events",
      "Working with the District Director to develop and execute outreach strategies for the district",
      "Serve as liaison to Community Boards, Precincts Councils and Block Associations",
      "Attend and speak at meetings and/or events on the Member's behalf"
    ],
    "qualifications": [
      "Must have extraordinary interpersonal skills",
      "Be constituent service oriented",
      "Exhibit a professional demeanor and work ethic",
      "Have excellent writing skills",
      "Bilingual a plus",
      "Highly motivated and organized individual",
      "Detail-oriented",
      "Able to work well under pressure",
      "Valid driver's license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Please send resume and cover letter to ResumeNY@mail.house.gov Please be sure to put DISTRICT REPRESENTATIVE in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-15",
    "position_title": "Communications Director",
    "office": "U.S. Member of Congress in New York",
    "location": "New York",
    "posting_date": "2016-01-18",
    "description": "to develop and implement aggressive communications strategy with local and national media. Ideal applicant is a quick and clean writer, detail-oriented, able to juggle numerous tasks successfully and best under tight deadlines.\nResponsibilities include writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters; coordinating interviews with reporters, set up press events and press conferences, developing relationships with the media; implementing district outreach activities (as it relates to press); responding to media inquiries and coordinating the office's online and social media operations. Requires strong written and oral communication skills, creativity, and the ability to work well with legislative and district office staff. An ideal candidate will possess a minimum of 3-5 years of communications experience, a demonstrated understanding of federal politics and policy and a desire to work in a fast-paced and fluid environment. Bilingual a plus. Valid driver's license desired. Availability for Evening and Weekend assignments is required.",
    "responsibilities": [
      "writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters",
      "coordinating interviews with reporters, set up press events and press conferences",
      "developing relationships with the media",
      "implementing district outreach activities (as it relates to press)",
      "responding to media inquiries",
      "coordinating the office's online and social media operations"
    ],
    "qualifications": [
      "strong written and oral communication skills, creativity, and the ability to work well with legislative and district office staff",
      "minimum of 3-5 years of communications experience",
      "demonstrated understanding of federal politics and policy",
      "desire to work in a fast-paced and fluid environment",
      "Bilingual a plus",
      "Valid driver's license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume and three writing samples to ResumeNY@mail.house.gov. Please be sure to put COMMUNICATIONS DIRECTOR in the subject line.\nPLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-449-15",
    "position_title": "Constituent Services Representative",
    "office": "Congressman Brendan Boyle",
    "location": "Norristown district office",
    "posting_date": "2016-01-18",
    "description": "The office of Congressman Brendan Boyle is seeking a Constituent Services Representative in his Norristown district office beginning in January 2016.\n\nGeneral responsibilities will include working with constituents and federal agencies on individual and community-based issues, answering constituent phone calls, sorting mail, maintaining office files and supply inventories, as well as other administrative tasks as needed.",
    "responsibilities": [
      "Working with constituents and federal agencies on individual and community-based issues",
      "Answering constituent phone calls",
      "Sorting mail",
      "Maintaining office files and supply inventories",
      "Other administrative tasks as needed"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Team oriented and comfortable working both independently and as part of a group",
      "Self-starters, able to take and listen to direction",
      "Willingness to continuously learn new skills",
      "Fluency or strong verbal and written proficiency in Spanish are strongly preferred",
      "Strong working knowledge of or connection with Montgomery County and the 13th congressional district is a plus"
    ],
    "how_to_apply": "Interested candidates should send your resume and cover letter to pa13jobs@gmail.com. Please list “Constituent Services Representative” in the subject line.",
    "salary_info": null,
    "contact": "pa13jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-448-15",
    "position_title": "Special Assistant/Constituent Service Representative",
    "office": "Congressman Brendan Boyle",
    "location": "District Office",
    "posting_date": "2016-01-18",
    "description": "The district office of Congressman Brendan Boyle is looking for a Special\nAssistant/Constituent Service Representative to help coordinate the\nMember's in-district events and other logistics, in addition to working with\nthe constituents of the 13th congressional district.\n\nSuccessful candidates will possess strong oral and written communication\nskills and a temperament to communicate with a variety of personalities in a\ntactful, pleasant, and professional manner at all times.",
    "responsibilities": [
      "Transporting the Member to in-district and regional events as needed and ensuring the member is keeping to his schedule at all times.",
      "Ensuring that the Member has necessary event related materials, talking points, and other items as needed.",
      "Coordinating event photo records, taking pictures at events of the Member.",
      "Ensuring that the member has all nonspecific event materials available at all times (business cards, office information).",
      "Possessing the ability to exercise discretion and independent judgment with respect to prioritization as related to the member's schedule and itinerary within specific events.",
      "Other miscellaneous tasks as needed.",
      "Working with constituents in the district office to resolve or address issues with various federal agencies or other community problems.",
      "Answering phones and interacting with constituents via email and written correspondence.",
      "Working with other district staff to maintain office filing system.",
      "Other administrative tasks as needed."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail",
      "Full-time availability",
      "Flexible scheduling (including working evenings and weekends on an as-needed basis)",
      "Ownership of a car and having a valid driver's license are all required.",
      "Ability to work in a fast paced environment and be able to improvise in a variety of settings.",
      "Previous experience working legislative or government affairs is a plus.",
      "Candidates with a strong working knowledge of the City of Philadelphia, Montgomery County, personal connections or residency in the 13th congressional district and familiarity with local transportation are strongly preferred."
    ],
    "how_to_apply": "Interested candidates should send your resume and cover letter to pa13jobs@gmail.com. Please list “Special Assistant” in the subject line.",
    "salary_info": null,
    "contact": "pa13jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-445-15",
    "position_title": "Events Coordinator",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2016-01-18",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible constituent services staff. The Events Coordinator is also a caseworker who helps constituents with federal issues but spends part of the time managing and directing very diverse city-wide and neighborhood events that relate to the Congresswoman’s congressional and constituent responsibilities, including staying on top of everyday events in the Member’s district that keep the community connected to the Member’s work. The Events Coordinator takes the lead to develop major events, among them, the Tax Fair, Small Business Fair, Job Fair, and Black History Month events.",
    "responsibilities": [
      "Managing and directing city-wide and neighborhood events",
      "Staying on top of everyday events in the Member's district",
      "Developing major events such as Tax Fair, Small Business Fair, Job Fair, and Black History Month events"
    ],
    "qualifications": [
      "Must be able to handle multiple tasks",
      "Able to think outside the box and work independently",
      "Able to assist in co-worker projects",
      "Prior community or event planning experience desirable",
      "Bachelor’s degree",
      "Excellent writing and communication skills",
      "Experience interacting with the public",
      "Leadership qualities",
      "Must be a resident of the District of Columbia or willing to move immediately to DC if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter and references to: (202) 225-1129 (fax) or to dc00.nortonresume@mail.house.gov. NO PHONE CALLS PLEASE!",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": {
      "fax": "(202) 225-1129",
      "email": "dc00.nortonresume@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-444-15",
    "position_title": "Staff Assistant",
    "office": "Congressman Paul D. Tonko (NY-20)",
    "location": "Washington, DC",
    "posting_date": "2016-01-18",
    "description": "Responsibilities include managing front office operations, processing tour and flag requests, overseeing intern program, providing assistance to Office Manager and legislative team, and a wide variety of other tasks.\n\nApplicant must have a great sense of humor, strong writing skills, the ability to learn quickly, and a solid team mentality. Finally, a valid driver's license with daily access to a vehicle and good driving record are preferred.\n\nThis is an entry level position. Women, minorities and those with ties to New York's Capital Region are encouraged to apply.",
    "responsibilities": [
      "Managing front office operations",
      "Processing tour and flag requests",
      "Overseeing intern program",
      "Providing assistance to Office Manager and legislative team",
      "A wide variety of other tasks"
    ],
    "qualifications": [
      "Great sense of humor",
      "Strong writing skills",
      "Ability to learn quickly",
      "Solid team mentality",
      "Valid driver's license with daily access to a vehicle and good driving record are preferred"
    ],
    "how_to_apply": "Interested individuals should email a cover letter, resume, and a short writing sample to ny20resumes@mail.house.gov with “Team Tonko” in the subject line. No phone calls or drop-bys, please.",
    "salary_info": null,
    "contact": "ny20resumes@mail.house.gov",
    "equal_opportunity": "Women, minorities and those with ties to New York's Capital Region are encouraged to apply."
  },
  {
    "id": "MEM-440-15",
    "position_title": "Staff Assistant",
    "office": "Congressman French Hill (AR-02)",
    "location": "Washington, D.C.",
    "posting_date": "2016-01-18",
    "description": "Congressman French Hill (AR-02) is seeking a Staff Assistant in his Washington, D.C. office beginning immediately. General responsibilities include greeting constituents, answering constituent phone calls, opening and sorting mail, guiding U.S. Capitol building tours, processing flag requests, organizing supplies and inventory, and assisting staff with administrative and legislative tasks.\n\nCandidates will have a positive attitude, strong work ethic, and excellent written and oral communication skills. Social media and other communications experience a strong plus. Successful candidates will be selfstarters, take and listen to direction, and be able to work both independently and as part of a team.\n\nApplicants should have working knowledge of current events and policy topics as well as a willingness to assist with daily office tasks. Arkansas ties strongly preferred.",
    "responsibilities": [
      "Greeting constituents",
      "Answering constituent phone calls",
      "Opening and sorting mail",
      "Guiding U.S. Capitol building tours",
      "Processing flag requests",
      "Organizing supplies and inventory",
      "Assisting staff with administrative and legislative tasks"
    ],
    "qualifications": [
      "Positive attitude",
      "Strong work ethic",
      "Excellent written and oral communication skills",
      "Working knowledge of current events and policy topics",
      "Willingness to assist with daily office tasks",
      "Ability to work independently and as part of a team",
      "Self-starter",
      "Ability to take and listen to direction",
      "Social media and other communications experience a strong plus",
      "Arkansas ties strongly preferred"
    ],
    "how_to_apply": "Those interested please send your resume and cover letter to ar02.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ar02.applications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-438-15",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2016-01-18",
    "description": "Duties include:\nanswering telephones; assisting with the tracking and processing of\ncommittee correspondence; providing administrative support in setting up\ncommittee meetings; and entering data and navigating databases with\naccuracy. This is a non-partisan position which requires the ability to serve\nall Members of Congress equally and refrain from political or partisan\nactivity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-418-15",
    "position_title": "Communications Assistant",
    "office": "Congressman Dan Kildee (MI-05)",
    "location": "Washington, D.C.",
    "posting_date": "2016-01-18",
    "description": "Congressman Dan Kildee (MI-05) is seeking a Communications Assistant in Washington, D.C., to assist with the Member’s external communications efforts.",
    "responsibilities": [
      "Drafting media advisories and press releases",
      "Collating daily press clips and morning headlines",
      "Creating content for the Member’s social media accounts",
      "Graphic design projects",
      "Drafting constituent mail and managing the constituent mail program"
    ],
    "qualifications": [
      "Creative",
      "Have excellent written and oral communication skills",
      "Be strongly proficient with digital and social media platforms",
      "Be an energetic and a detail-oriented team player able to multi-task and produce high-quality work on tight deadlines",
      "Graphic and/or video editing skills are highly preferred",
      "Michiganders are strongly encouraged to apply"
    ],
    "how_to_apply": "Please e-mail resume, cover letter and two writing samples (no more than 1page each) to michigan05jobs@gmail.com (subject line should read: Communications Assistant Application). No telephone calls, emails or walkins, please.",
    "salary_info": null,
    "contact": "michigan05jobs@gmail.com",
    "equal_opportunity": null
  }
]