[
  {
    "id": "MEM-471-19",
    "position_title": "CHIEF OF STAFF POSITION",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": "Washington D.C.",
    "posting_date": "2019-09-30",
    "description": "The Chief of Staff acts as the Member's chief policy advisor. This position develops and implements all policy objectives, strategies and operating plans for the Member's offices and manages and directs all activities and staff of the Member's Washington D.C. and district office(s), as well as coordinates the activities of the Member with Leadership and committee office(s).",
    "responsibilities": [
      "Supervisory: Directly supervises up to eighteen full time employees and up to four part-time and temporary employees; carries out responsibilities in accordance with office policy and applicable laws. Responsibilities include interviewing, hiring and training employees; planning, assigning and directing work; appraising performances; rewarding and disciplining employees; addressing complaints; and resolving problems;",
      "Manages the Washington, D.C. Office and work with District Director on all projects with the Member;",
      "Sets and oversees the administration of office goals, policies and procedures and has oversight responsibility for all personnel matters including hiring, salary, and disciplinary decisions;",
      "Manages long-term legislative plan of the Member;",
      "Manage and coordinate all staff activities for completion;",
      "Delegate tasks to staff for timely completion;",
      "Coordinates and supervises the efforts of all employees including the press and constituent service staffs;",
      "Conducts staff meetings;",
      "Approves strategies and tactics on legislative issues;",
      "Acts as the Member's principal liaison and responds to office visits and telephone inquiries from constituents and various interest groups;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Speaks to local groups when the Member is unavailable;",
      "Oversees the office budget;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Meets attendance requirements as established by the office;",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned by the Member."
    ],
    "qualifications": [
      "A minimum of a bachelor’s degree in political science or related field, including strong academic credentials is preferred. Alternatively, five years of related experience or training in management and/or legislation or equivalent experience.",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Thorough knowledge of the Members' Congressional Handbook and House Rules;",
      "An understanding of the district and federal political process;",
      "Provides necessary organization, supervisory leadership, and motivation to manage a House office;",
      "Ability to perform essential job functions above;",
      "Ability to maintain a good working relationship with the Congresswoman, staff and constituents;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Excellent oral and written communication skills;",
      "Knowledge of the office policies, practices, and procedures;",
      "Knowledge of office computer applications; and",
      "Proficiency in word processing.",
      "Work is mainly performed in an office environment. Noise levels are usually moderate; and",
      "Ability to work in a small work station without an expectation of privacy."
    ],
    "how_to_apply": "e-mail a cover letter, detailed resume and the name, address, and phone number of three references to: NC12.cos@mail.house.gov\nYour cover letter should answer the following questions:\n1. Describe how your experience prepares you for the “responsibilities” specified in the job announcement.\n2. Give examples of your work experience that demonstrates your mastery of some of the “skills and abilities” listed in the job announcement.\n3. Describe how your work experience meets the “preferred experience” listed in the job announcement.",
    "salary_info": null,
    "contact": "NC12.cos@mail.house.gov",
    "equal_opportunity": "THIS OFFICE IS AN EQUAL OPPORTUNITY EMPLOYER: Women and minorities are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-470-19",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": null,
    "posting_date": "2019-09-30",
    "description": "The Communications Director is a key member of the management team that\nincludes the Chief of Staff, Legislative Director, and the District Director.",
    "responsibilities": [
      "Successful candidates will have superb written and verbal communication skills, be comfortable multi-tasking, have excellent attention to detail, and work well under pressure.",
      "Primary responsibilities include (but not limited to) managing press releases, speeches, op-eds, and letters to the editor, and other written material for the Member, managing an active social media presence, managing e-newsletters, and graphic design.",
      "The Communications Director will work closely with the Press Assistant and other press team members to finalize press/communication products and strategy."
    ],
    "qualifications": [
      "A minimum of a bachelor’s degree in journalism, communications, public relations, or related field;",
      "Strong academic credentials are preferred;",
      "Two years of journalism, communications, and/ or public relations experience;",
      "Understanding of legislative process and of the nuances between broad messaging and individual member needs; and",
      "Must have had primary responsibility for creating and executing a media strategy or public relations plan - preferably in public policy arena."
    ],
    "how_to_apply": "E-mail a cover letter, detailed resume, and the name, address, and phone number of three references to NC12.COS@mail.house.gov",
    "salary_info": null,
    "contact": "NC12.COS@mail.house.gov",
    "equal_opportunity": "THIS OFFICE IS AN EQUAL OPPORTUNITY EMPLOYER: Women and\nminorities are strongly encouraged to apply. The office is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national\norigin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-469-19",
    "position_title": "Legislative Correspondent",
    "office": "Congresswoman Jahana Hayes",
    "location": null,
    "posting_date": "2019-09-30",
    "description": "Congresswoman Jahana Hayes seeks a Legislative Correspondent to oversee her constituent mail program. Ideal candidates will have excellent written and verbal communication skills; strong organizational and time management skills; positive attitude and disposition suited to the work environment; solid knowledge of the legislative process; and an ability to work under pressure and meet deadlines in an fast-paced work environment. Applicants should have experience with Intranet Quorum (IQ).",
    "responsibilities": [
      "Answer constituent letters, including any research necessary to formulate an adequate response to the letters",
      "Develop and maintain a collection of prepared text for use in responding to constituent mail",
      "Draft form letters to respond to a large number of letters on the same issue",
      "Consult with the Legislative Director and Legislative Assistants to keep the form letters up to date",
      "Supervise the printing and proofreading of form letters",
      "Draft responses to constituent mail that cannot be answered with a form letter",
      "Write and disseminate office newsletter (at least once per week)",
      "Prepare weekly reports to the Congresswoman and staff that provide an update on the mail program and identify emerging trends"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Strong organizational and time management skills",
      "Positive attitude and disposition suited to the work environment",
      "Solid knowledge of the legislative process",
      "Ability to work under pressure and meet deadlines in an fast-paced work environment",
      "Experience with Intranet Quorum (IQ)"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter, resume and two writing samples in a single PDF to CT05jobs@mail.house.gov with the following subject line: First name Last Name - Legislative Correspondent. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Connecticut ties are a plus, but not required. Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-467-19",
    "position_title": "District Coordinator",
    "office": "Representative Abigail Spanberger",
    "location": "Glen Allen, Virginia",
    "posting_date": "2019-09-30",
    "description": "The District Coordinator is responsible for handling constituent\ncasework by answering constituent correspondence, meeting with\nconstituents, and liaising with federal agencies. Additional duties include\nrepresenting Congresswoman Spanberger in the community, maintaining\npositive relationships with constituents, and effectively communicating with\nlocal community leaders and organizations.",
    "responsibilities": [
      "Handling constituent casework by answering constituent correspondence",
      "Meeting with constituents",
      "Liaising with federal agencies",
      "Representing Congresswoman Spanberger in the community",
      "Maintaining positive relationships with constituents",
      "Effectively communicating with local community leaders and organizations"
    ],
    "qualifications": [
      "Must be able to work courteously and cooperatively with others",
      "Understand the needs of VA-07",
      "Work efficiently in a high-pressure environment while juggling multiple tasks",
      "Have strong writing and organizational skills"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and short writing sample to:\nKaren Mask, District Director, Karen.Mask@mail.house.gov with “District\nCoordinator” in the subject line.",
    "salary_info": null,
    "contact": "Karen Mask, District Director, Karen.Mask@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The\noffice does not discriminate on the basis of race, color, religion, gender,\nsexual orientation, gender identity, national origin, age, genetic information,\ndisability, or uniformed service."
  },
  {
    "id": "MEM-466-19",
    "position_title": "Press Secretary",
    "office": "Congressman Greg Pence",
    "location": null,
    "posting_date": "2019-09-30",
    "description": "Congressman Greg Pence is seeking an experienced Press Secretary to implement a strategic media plan in a fast-paced and collaborative environment. Candidates should have excellent written and oral communication skills, and expertise with various media tools, including: social media, video creation, website, e-newsletters and surveys, talking point/speechwriting, press releases, on-the-record experience and interview prep, and op-ed preparation.\nThis is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send their resume, cover letter, and references to gopresumesubmission@gmail.com.",
    "salary_info": null,
    "contact": "gopresumesubmission@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-464-19",
    "position_title": "WASHINGTON PRESS SECRETARY",
    "office": "Northeast Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2019-09-30",
    "description": "Northeast Democrat seeks Press Secretary to work under District-based Communications Director and D.C. Chief of Staff to run Capitol Hill press operations, including working closely with Member’s legislative staff, DPCC and other leadership staff, committee press staff, and national TV news reporters and producers. Position includes co-management of the Member’s website, social media pages, newsletters, biweekly e-news updates, and other constituent outreach. Excellent research and writing skills required.",
    "responsibilities": [
      "Run Capitol Hill press operations",
      "Work closely with Member’s legislative staff, DPCC and other leadership staff, committee press staff, and national TV news reporters and producers",
      "Co-management of the Member’s website, social media pages, newsletters, biweekly e-news updates, and other constituent outreach"
    ],
    "qualifications": [
      "Excellent research and writing skills required"
    ],
    "how_to_apply": "Send cover letter and resume to democratic.hilljob@gmail.com. No phone calls will be accepted.",
    "salary_info": "$42,000",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Minority, LGBTQ, and women candidates are encouraged to apply."
  },
  {
    "id": "MEM-462-19",
    "position_title": "Attorney",
    "office": "Office of the Law Revision Counsel",
    "location": "U.S. House of Representatives",
    "posting_date": "2019-09-30",
    "description": "The Office of the Law Revision Counsel-a small, nonpartisan office within the U.S. House of Representatives-seeks an attorney to assist in the editing and publishing of the United States Code, the codification of general and permanent Federal statutory law.\n\nIn addition to the basic tasks required to integrate new laws into the Code, other duties may be required, such as reviewing drafts of bills to enact titles as positive law, doing extensive research and editorial work to improve the organization of existing provisions in the Code, and assisting in the continuing modernization of the Office, including support of online and machine readable versions of the Code.",
    "responsibilities": [
      "reading new laws to determine which provisions should appear in the Code and where",
      "updating the Code to reflect new law and amendments to existing law",
      "writing concise editorial notes to explain amendments, effective dates, references within the text to other laws, and a variety of other legislative concepts",
      "preparing statutory citations and tables",
      "identifying errors in grammar and spelling",
      "all while conforming to very strict style guidelines."
    ],
    "qualifications": [
      "J.D. degree and attorney license in any U.S. jurisdiction or intention to obtain license within one year.",
      "At least one year of professional experience in editing or publishing, preferably in the legal field.",
      "Meticulous attention to detail and dedication to accuracy.",
      "Excellent verbal and written communication skills.",
      "Absolute proficiency in grammar, spelling, and usage.",
      "Ability to analyze and summarize complex legal issues.",
      "Ability to identify issues affecting Federal statutes and explain them clearly and concisely within firmly established parameters."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter with salary requirements to:\nuscodeapplicant@mail.house.gov\nApplicants will be evaluated based on the ability to meet the qualifications stated above. Significant weight will be given to the applicant's cover letter. If chosen for an interview, an applicant will be requested to submit a writing sample.",
    "salary_info": null,
    "contact": "uscodeapplicant@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-460-19",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Alexandria Ocasio-Cortez",
    "location": "DC Office",
    "posting_date": "2019-09-30",
    "description": "Responsibilities include welcoming office visitors; processing flag and tour requests; organizing Member correspondence and incoming mail and phone messages; logging constituent mail and working with the Legislative Correspondent to respond to inquiries; managing and executing the intern program; staffing and driving the Member to events and other duties as assigned.\n\nThe ideal candidate will have a solution-oriented personality, a great sense of humor, and the ability to manage a vast but essential portfolio.\n\nPrior congressional experience, familiarity with Fireside, Spanish language skills, and ties to New York's 14th Congressional District are strongly preferred.",
    "responsibilities": [
      "Welcoming office visitors",
      "Processing flag and tour requests",
      "Organizing Member correspondence and incoming mail and phone messages",
      "Logging constituent mail and working with the Legislative Correspondent to respond to inquiries",
      "Managing and executing the intern program",
      "Staffing and driving the Member to events",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Solution-oriented personality",
      "Great sense of humor",
      "Ability to manage a vast but essential portfolio",
      "Prior congressional experience (strongly preferred)",
      "Familiarity with Fireside (strongly preferred)",
      "Spanish language skills (strongly preferred)",
      "Ties to New York's 14th Congressional District (strongly preferred)"
    ],
    "how_to_apply": "All applicants must fill out our online application. Please click here airtable.com/shrE5NCa1g1PR5pXC to access the form!",
    "salary_info": "$52,000 per year",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-458-19",
    "position_title": "District Representative",
    "office": "Member of Congress",
    "location": "Congressional district office",
    "posting_date": "2019-09-30",
    "description": "Member of Congress seeks an energetic and self-motivated individual to serve as a District Representative in an active Congressional district office. Duties include representing the Member of Congress in the community, maintaining positive relationships with constituents, other local elected officials, and business and community leaders and organizations. Additionally, this individual is responsible for handling constituent casework in their assigned issue areas, which includes answering casework correspondence, meeting with constituents, communicating with constituents, and serving as a liaison with federal and local agencies.",
    "responsibilities": [
      "Representing the Member of Congress in the community",
      "Maintaining positive relationships with constituents, other local elected officials, and business and community leaders and organizations",
      "Handling constituent casework in their assigned issue areas",
      "Answering casework correspondence",
      "Meeting with constituents",
      "Communicating with constituents",
      "Serving as a liaison with federal and local agencies"
    ],
    "qualifications": [
      "Ability to work quickly in a high pressure environment",
      "Ability to meet very tight deadlines",
      "Exceptional writing and organizational skills",
      "Fluency in Spanish and Southern California ties are a plus but not required",
      "Must be available, as necessary, to work evenings and/or weekend hours"
    ],
    "how_to_apply": "Please send cover letter, resume, and a short writing sample to: Nina Moussavi, District Director, Nina.Moussavi@mail.house.gov.",
    "salary_info": null,
    "contact": "Nina Moussavi, District Director, Nina.Moussavi@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, age, or protected veteran status."
  },
  {
    "id": "MEM-457-19",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-09-30",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office. The Committee’s financial disclosure counsel are responsible for reviewing financial statements and providing legal advice on a high volume of financial disclosure issues, education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Reviewing financial statements",
      "Providing legal advice on a high volume of financial disclosure issues",
      "Education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-456-19",
    "position_title": "District Staff Member",
    "office": "Congressman David Trone (MD06)",
    "location": "Gaithersburg and Frederick, MD",
    "posting_date": "2019-09-30",
    "description": "Congressman David Trone (MD06) is seeking a high-energy, highlyorganized, and detail-oriented District Staff Member for his offices in\nGaithersburg and Frederick, MD.",
    "responsibilities": [
      "Serve as the official representative for the Member in the community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Director on district and local issues of importance.",
      "Staff and provide logistical support for scheduled district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to md06.jobs@gmail.com with “District Staff” in the subject line. No phone calls or walk ins.",
    "salary_info": null,
    "contact": "md06.jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-19",
    "position_title": "Parliamentarian",
    "office": "House Judiciary Committee Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2019-09-30",
    "description": "The House Judiciary Committee Democratic Staff seeks a Parliamentarian to advise the Chairman during Judiciary Committee proceedings.\nResponsibilities include assisting in all aspects of preparation for Committee hearings and markups; staffing hearings and serving as a resource to all Members of the Committee; ensuring all legislative materials for markups and floor consideration are properly prepared and comply with House rules and procedures; and working closely with the Chief Clerk to ensure all notice deadlines and reporting requirements are met.",
    "responsibilities": [
      "Assisting in all aspects of preparation for Committee hearings and markups",
      "Staffing hearings and serving as a resource to all Members of the Committee",
      "Ensuring all legislative materials for markups and floor consideration are properly prepared and comply with House rules and procedures",
      "Working closely with the Chief Clerk to ensure all notice deadlines and reporting requirements are met"
    ],
    "qualifications": [
      "A detailed understanding of House rules and procedures",
      "Excellent written and oral communication skills",
      "Exceptional organizational skills",
      "A proven ability to perform under pressure",
      "Sound judgment"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and writing sample to Job.Jdem@mail.house.gov. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Job.Jdem@mail.house.gov",
    "equal_opportunity": "The Judiciary Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-450-19",
    "position_title": "Deputy Press Secretary",
    "office": "The House Judiciary Committee Democratic Staff",
    "location": null,
    "posting_date": "2019-09-30",
    "description": "The House Judiciary Committee Democratic Staff seeks a motivated and hardworking communications professional to join a fast-paced communications team to help manage communications for the full committee and subcommittees.",
    "responsibilities": [
      "Drafting communications materials (news releases, statements, talking points, etc.)",
      "Managing public notices for the Committee and Subcommittee’s work",
      "Helping with press inquiries",
      "Maintaining media directories of reporters who cover the committee",
      "Coordinating with the Committee’s communications team and staff of committee members."
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "The ability to comprehend and summarize complex legislation quickly",
      "A proven ability to perform under pressure while juggling multiple tasks",
      "Sound political judgment",
      "At least 2 years of relevant experience.",
      "Prior Hill or campaign experience, as well as familiarity with immigration issues is preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and three writing samples to Job.Jdem@mail.house.gov. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Job.Jdem@mail.house.gov",
    "equal_opportunity": "The Judiciary Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-448-19",
    "position_title": "Lead Orange County District Representative for California’s 49th Congressional District",
    "office": "California’s 49th Congressional District",
    "location": "Orange County",
    "posting_date": "2019-09-30",
    "description": "The staffer in this position is responsible for running the Congressman’s Orange County office and leading all Orange County efforts for the district. Among other duties, this team member represents the Member of Congress during local meetings and events and acts as a liaison between the Member of Congress and his constituents and federal, district, and local agencies. Responsibilities include: constituent casework; planning and staffing in-district events, meetings, and site visits; and working closely with the Oceanside District Office and Washington, DC staff on local and assigned policy issues and areas.",
    "responsibilities": [
      "constituent casework",
      "planning and staffing in-district events, meetings, and site visits",
      "working closely with the Oceanside District Office and Washington, DC staff on local and assigned policy issues and areas"
    ],
    "qualifications": [
      "Applicants should have a thorough knowledge of California’s 49th district (particularly the Orange County portion), a positive, service-oriented attitude, strong organizational skills, proficiency at prioritizing and managing multiple projects at one time, a capacity to work both independently and as part of a team, and strong written and oral communications.",
      "Preference may be given to residents of the 49th District."
    ],
    "how_to_apply": "Please send resume, cover letter, and two writing samples to ca49.applications@mail.house.gov",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "We are an equal opportunity employer and encourage all qualified applicants to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-444-19",
    "position_title": "Staff Assistant",
    "office": "Congressman Denny Heck (WA-10)",
    "location": "Washington DC",
    "posting_date": "2019-09-30",
    "description": "Congressman Denny Heck (WA-10) seeks an organized, passionate, teamoriented Staff Assistant for the Washington DC office. Responsibilities include: managing the front office, coordinating tour and flag requests, overseeing the DC internship program, and providing additional office support as needed. While this is an entry-level position, candidates should have excellent oral and written communication skills, great attention to detail, strong time management skills, and a desire to work collaboratively. Washington State ties are preferred.",
    "responsibilities": [
      "managing the front office",
      "coordinating tour and flag requests",
      "overseeing the DC internship program",
      "providing additional office support as needed"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Great attention to detail",
      "Strong time management skills",
      "A desire to work collaboratively",
      "Washington State ties are preferred"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and references to Heck.Resumes@mail.house.gov using “Staff Assistant” and their name in the subject line. Please no drop-ins or calls.",
    "salary_info": null,
    "contact": "Heck.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer. Veterans, women, and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-444-19",
    "position_title": "Field Representative/Caseworker",
    "office": "Congresswoman Tulsi Gabbard",
    "location": "Honolulu, HI",
    "posting_date": "2019-09-30",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a district based Field Representative/Caseworker in Honolulu, HI with strong organizational and communication skills.\n\nResponsibilities include helping constituents navigate the services provided by the federal government when they need assistance. This position manages constituent casework, participates in community projects and events. Responsibilities also include monitoring and updating the Congresswoman and Chief of Staff on district and local issues. This person acts as a liaison to community groups for the local Hawaii office.\n\nWe are seeking applicants to join our fun, team-oriented, hard-working office.\n\nThe ideal candidate will possess a can-do attitude and will be solutions oriented. He or she will also be an independent worker, a self-starter and will possess the capacity to produce high quality work on short deadlines. He or she will also have a demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment.\n\nThis is not an entry level position. The selected applicant with be expected to operate in a fast-paced office and requires dedication, close attention to detail and the ability to think outside the box. Non-traditional work hours, occasional travel are required. Veteran applications are welcome!",
    "responsibilities": [
      "Helping constituents navigate the services provided by the federal government when they need assistance.",
      "Managing constituent casework.",
      "Participating in community projects and events.",
      "Monitoring and updating the Congresswoman and Chief of Staff on district and local issues.",
      "Acting as a liaison to community groups for the local Hawaii office."
    ],
    "qualifications": [
      "Can-do attitude.",
      "Solutions oriented.",
      "Independent worker.",
      "Self-starter.",
      "Capacity to produce high quality work on short deadlines.",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment.",
      "Dedication.",
      "Close attention to detail.",
      "Ability to think outside the box."
    ],
    "how_to_apply": "Please do not call or drop in to the office, qualified applicants may email a cover letter, resume and two writing samples with “Caseworker” in the email title to: hi02jobs@gmail.com",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-437-19",
    "position_title": "Staff Assistant and Driver",
    "office": "Congressman Jimmy Gomez (CA34)",
    "location": "Washington DC",
    "posting_date": "2019-09-30",
    "description": "The Office of Congressman Jimmy Gomez (CA34) seeks an organized, passionate, team-oriented Staff Assistant and Driver for the Washington DC office. Responsibilities include: managing the front office, coordinating tour and flag requests, managing DC internship program, driving the Congressman to and from events, and providing additional office support as needed. While this is an entry-level position, candidates should have excellent oral and written communication skills, great attention to detail, strong time management skills, and an ability to work under pressure to meet tight deadlines. A valid driver’s license, daily access to an automobile and a good driving record are a necessity.",
    "responsibilities": [
      "managing the front office",
      "coordinating tour and flag requests",
      "managing DC internship program",
      "driving the Congressman to and from events",
      "providing additional office support as needed"
    ],
    "qualifications": [
      "excellent oral and written communication skills",
      "great attention to detail",
      "strong time management skills",
      "ability to work under pressure to meet tight deadlines",
      "valid driver’s license",
      "daily access to an automobile",
      "good driving record"
    ],
    "how_to_apply": "Please send resume and two writing samples to Gomez.Jobs@mail.house.gov with “Staff Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": "Equal Employment Opportunity Employer."
  },
  {
    "id": "MEM-436-19",
    "position_title": "Staff Assistant",
    "office": "Congressman Jimmy Gomez (CA34)",
    "location": "Los Angeles office",
    "posting_date": "2019-09-30",
    "description": "The Office of Congressman Jimmy Gomez (CA34) seeks an organized, passionate, team-oriented Staff Assistant for the Los Angeles office.\n\nResponsibilities include: managing the front office, coordinating tour and flag requests, managing LA internship program, and providing additional office support as needed. While this is an entry-level position, candidates should have excellent oral and written communication skills, great attention to detail, strong time management skills, and an ability to work under pressure to meet tight deadlines.",
    "responsibilities": [
      "managing the front office",
      "coordinating tour and flag requests",
      "managing LA internship program",
      "providing additional office support as needed"
    ],
    "qualifications": [
      "excellent oral and written communication skills",
      "great attention to detail",
      "strong time management skills",
      "an ability to work under pressure to meet tight deadlines"
    ],
    "how_to_apply": "Please send resume and two writing samples to Gomez.Jobs@mail.house.gov with “Staff Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": "Equal Employment Opportunity Employer."
  },
  {
    "id": "MEM-435-19",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2019-09-30",
    "description": "Co-Chair of the Congressional Progressive Caucus, seeks an experienced and enthusiastic Legislative Assistant to cover her work on the House Judiciary Committee, including immigration, constitutional issues, criminal justice, and civil rights and civil liberties. The ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of immigration policy. This is not an entry level position. Candidates with graduate training in law, public policy, or social science are preferred.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. Job responsibilities will include drafting legislation, writing hearing statements and legislative memos, and preparing briefing materials.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of immigration policy",
      "Graduate training in law, public policy, or social science preferred",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Legislative Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Equal Employment Opportunity Employer. Women, people of color, new Americans, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-429-19",
    "position_title": "Social Media Manager",
    "office": "House Rules Committee Majority",
    "location": "Capitol Hill",
    "posting_date": "2019-09-30",
    "description": "The House Rules Committee Majority is looking for a talented, creative, and motivated Social Media Manager to join a proactive communications team.\n\nMust be comfortable working collaboratively to execute a broad communications strategy. This position reports to the Communications Director. The office is an equal opportunity employer and diverse candidates, those with untraditional backgrounds, women, and LGBTQ persons are strongly encouraged to apply.",
    "responsibilities": [
      "Crafting social media posts",
      "Designing graphics, GIFs, videos, and other web content",
      "Monitoring the committee’s digital channels",
      "Updating the website",
      "Compiling daily press clips"
    ],
    "qualifications": [
      "At least 1 year of digital experience, preferably on a campaign or on Capitol Hill",
      "Excellent writing and organizational skills and the ability to work under tight deadlines",
      "Experience designing graphics and editing photos and video is required",
      "Fluency in Adobe Creative Suite is preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, writing sample, and three social content/graphic design samples to DemRules.Jobs@mail.house.gov with “Social Media Manager” in the subject line. No phone calls or drop-bys, please.",
    "salary_info": null,
    "contact": "DemRules.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and diverse candidates, those with untraditional backgrounds, women, and LGBTQ persons are strongly encouraged to apply."
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": "California",
    "posting_date": "2019-09-30",
    "description": "Qualified candidates should have a minimum of 2 years’ experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects. A flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years’ experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Ability to meet deadlines",
      "Ability to manage multiple projects",
      "Flexible schedule",
      "Ability to travel throughout the district"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-426-19",
    "position_title": "Investigator",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-09-30",
    "description": "The Committee on Ethics seeks an experienced investigative professional for an investigator position. The Committee’s investigator is responsible for assisting the Committee in all aspects of its investigative work, including researching and reviewing public data sources, forensic research, document review, data collection and analysis, preparing for and participating in witness interviews, and drafting and editing Committee documents.\n\nThis is a nonpartisan position which requires the ability to assist with impartial investigations and refrain from political or partisan activity.\n\nCandidates must possess outstanding organizational, research, and analytical skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, or financial accounting. Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred.",
    "responsibilities": [
      "Assisting the Committee in all aspects of its investigative work",
      "Researching and reviewing public data sources",
      "Forensic research",
      "Document review",
      "Data collection and analysis",
      "Preparing for and participating in witness interviews",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Outstanding organizational, research, and analytical skills",
      "Sound judgment necessary to evaluate sensitive matters",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, or financial accounting.",
      "Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigator” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-425-19",
    "position_title": "Communications Director",
    "office": "Midwest Republican Member",
    "location": null,
    "posting_date": "2019-09-30",
    "description": "Midwest Republican Member is seeking an experienced Communications Director to implement a strategic media plan in a fast-paced and resultsdriven environment. Candidates should have experience with the various media tools available, including: social media, video creation, website, enewsletters and surveys, talking points/speechwriting, press releases, on-therecord experience and interview prep, and op-ed preparation.\nThis is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send submit their resume, cover letter, and two writing samples to communicationsdirectoropening@gmail.com",
    "salary_info": null,
    "contact": "communicationsdirectoropening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-423-19",
    "position_title": "Communications Director",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2019-09-30",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced, creative and highly motivated Communications Director to serve on the Congresswoman’s senior team.\n\nThe ideal candidate will be a strong writer and seasoned manager who can think strategically, work collaboratively, and manage an ambitious communications program in a fast-paced setting under tight deadlines. This is a senior position, and will be compensated accordingly.",
    "responsibilities": [
      "Serve as the primary spokesperson for the Congresswoman;",
      "Develop and maintain strong relationships with reporters, editors, producers, bookers and social media influencers;",
      "Proactively engage in media outreach, including pitching and fielding press inquiries;",
      "Manage the development of press releases, speeches and op-eds;",
      "Oversee an ambitious digital communications program;",
      "Supervise a Press Secretary and Digital Strategist;",
      "Prepare and staff the Congresswoman for press events and interviews; and",
      "Work collaboratively with the District Office to ensure strong local media engagement."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, three writing samples (including one speech) and three references.\nPlease send applications to jobs.pramila@mail.house.gov with “Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": "This is a senior position, and will be compensated accordingly.",
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-422-19",
    "position_title": "Staff Assistant",
    "office": "House Committee on Energy and Commerce Democratic Staff (majority)",
    "location": "Washington, DC",
    "posting_date": "2019-09-30",
    "description": "The House Committee on Energy and Commerce Democratic Staff (majority) seeks an enthusiastic, motivated, and highly-organized staff assistant for fastpaced committee office.",
    "responsibilities": [
      "Tasks associated with a front office such as receptionist duties, answering phones, greeting visitors, ensuring that office and meeting rooms are kept in order",
      "Supporting staff in preparations for committee events such as hearings, markups, meetings, and events",
      "Delivering documents and obtaining signatures on letters",
      "Training and supervising interns",
      "Handling and sorting incoming mail, maintaining both digital and paper records and files, maintaining office supplies and mastering basic equipment operations",
      "Assisting other staff with research, work product, web content, special projects, and other duties as assigned"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Attention to detail",
      "Professionalism",
      "Superior time management skills",
      "Ability to work collaboratively",
      "Hill experience preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and a short writing sample to ecdjobs@mail.house.gov",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": null
  }
]