[
  {
    "id": "MEM-003-18",
    "position_title": "Caseworker",
    "office": "Congressman Ted Lieu",
    "location": "Los Angeles District Office",
    "posting_date": "2018-03-01",
    "description": "Congressman Ted Lieu has an immediate opening for a Caseworker in his\nLos Angeles District Office. Primary responsibilities include assisting\nconstituents with federal casework, assisting the Casework Supervisor with\ncasework outreach, intake and processing. The Caseworker would also attend\ncommunity events and conduct casework outreach directly with constituents.\nCaseworkers meet frequently with constituents and liaise with federal\nagencies, and help organize outreach events for the Congressman’s office.\n\nThe successful applicant should have experience working on federal\ncasework, must have a positive attitude and the ability to work and set\npriorities in a fast-paced and challenging environment. Strong writing and\nverbal communications skills are essential. At least one year of experience\nworking for an elected official or community-based organization is strongly\npreferred. A valid California Driver License and automobile are required.\nBilingual skills are a plus.\n\nThe position is full-time with federal benefits. Congressman Lieu’s primary\ndistrict office is located in Central Los Angeles.",
    "responsibilities": [
      "Assisting constituents with federal casework",
      "Assisting the Casework Supervisor with casework outreach, intake and processing",
      "Attend community events and conduct casework outreach directly with constituents",
      "Meet frequently with constituents and liaise with federal agencies",
      "Help organize outreach events for the Congressman’s office"
    ],
    "qualifications": [
      "Experience working on federal casework",
      "Positive attitude and the ability to work and set priorities in a fast-paced and challenging environment",
      "Strong writing and verbal communications skills",
      "At least one year of experience working for an elected official or community-based organization is strongly preferred",
      "Valid California Driver License and automobile are required",
      "Bilingual skills are a plus"
    ],
    "how_to_apply": "If interested, please send a resume, cover letter, and two short writing samples\nno later than January 15, 2018 to:\n\nNICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33)\n5055 Wilshire Blvd., Suite 310\nLos Angeles, CA 90036\nLieu.Staff@mail.house.gov",
    "salary_info": null,
    "contact": {
      "name": "NICOLAS RODRIQUEZ",
      "title": "District Director",
      "address": "5055 Wilshire Blvd., Suite 310\nLos Angeles, CA 90036",
      "email": "Lieu.Staff@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-001-18",
    "position_title": "Communications Director",
    "office": "Texas Democrat",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "Texas Democrat is seeking an experienced Communications Director to plan and execute a proactive and aggressive media and community outreach strategy. Candidates should have excellent writing skills and work well in a fast-paced collaborative environment. Applicant should also have an extensive social media background. Texas ties and knowledge of TX media and political landscape are a plus and management experience is preferred. This is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should submit a resume, cover letter, and two writing samples, including a press release to TXResumeInbox@mail.house.gov.",
    "salary_info": null,
    "contact": "TXResumeInbox@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-17",
    "position_title": "Legislative Director",
    "office": "Senior Democratic House member and Committee Ranking Member",
    "location": "Capitol Hill",
    "posting_date": "2018-03-01",
    "description": "Primary responsibilities include developing policy and legislative initiatives and advising Member on all legislative issues. Position will manage long-term and short-term legislative planning; monitor legislative activity on the House floor; supervise all legislative staff in the personal office; ensure effective coordination between the personal office and committee office; and assist with hearing preparation as needed. Position will also manage health policy portfolio. The successful candidate will be a results-oriented problem solver and have a proven track record of developing and advancing legislation. Excellent oral and written communication skills, time-management skills, and the ability to quickly analyze and summarize complex legislative details are essential. Advanced degree and extensive experience on Capitol Hill are required.",
    "responsibilities": [
      "Developing policy and legislative initiatives",
      "Advising Member on all legislative issues",
      "Managing long-term and short-term legislative planning",
      "Monitoring legislative activity on the House floor",
      "Supervising all legislative staff in the personal office",
      "Ensuring effective coordination between the personal office and committee office",
      "Assisting with hearing preparation as needed",
      "Managing health policy portfolio"
    ],
    "qualifications": [
      "Results-oriented problem solver",
      "Proven track record of developing and advancing legislation",
      "Excellent oral and written communication skills",
      "Time-management skills",
      "Ability to quickly analyze and summarize complex legislative details",
      "Advanced degree",
      "Extensive experience on Capitol Hill"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter and resume with the words “Legislative Director” in the subject line to job_09@live.com. Please paste the cover letter and resume directly in the body of the email.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-511-17",
    "position_title": "Clerk",
    "office": "Committee on Natural Resources’ Subcommittee on Oversight and Investigations",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "The Committee on Natural Resources’ Subcommittee on Oversight and Investigations is seeking to fill a Clerk position on the majority staff. The ideal candidate should have a strong interest in investigations and natural resources issues.",
    "responsibilities": [
      "Staffing Subcommittee hearings as well as some Full Committee hearings",
      "Sending and receiving Subcommittee correspondence to and from the Executive Branch as well as with outside organizations",
      "Managing the Subcommittee’s administrative needs"
    ],
    "qualifications": [
      "Strong work ethic",
      "Attention to detail",
      "Desire to learn how to conduct congressional oversight and investigations",
      "Self-motivated",
      "Prior Hill experience preferred, but not required"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to NaturalResources.Jobs@mail.house.gov, with “O&I Clerk” in the subject line.",
    "salary_info": null,
    "contact": "NaturalResources.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-509-17",
    "position_title": "Deputy Chief Clerk/Calendar Clerk",
    "office": "House Committee on Homeland Security",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "The House Committee on Homeland Security is looking for a non-partisan Deputy Chief Clerk/Calendar Clerk to assist with Committee operations. Among other duties, the person filling this role will assist the Chief Clerk in the performance of the following:",
    "responsibilities": [
      "Managing Committee hearings and markups",
      "Plan and manage Committee field hearings",
      "Maintain Committee legislative calendar",
      "Prepare Committee archive and historical records"
    ],
    "qualifications": [
      "The ideal candidate for this position is detail oriented, a self-starter and works well independently as well as with others.",
      "At least 1 year of prior Capitol Hill experience required."
    ],
    "how_to_apply": "Please send resumes and statement of interest to: Resumes.CHS@mail.house.gov.",
    "salary_info": null,
    "contact": "Resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-508-17",
    "position_title": "Staff Assistant",
    "office": "U.S. Rep. Lloyd Doggett",
    "location": "Washington office",
    "posting_date": "2018-03-01",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a staff assistant for his Washington office. Excellent written and oral communication skills required. Texas connection and Spanish ability a plus.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Texas connection and Spanish ability a plus."
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use title on your email: Staff Assistant Application. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-507-17",
    "position_title": "Senior Legislative Aide",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Hill",
    "posting_date": "2018-03-01",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a senior legislative aide with a minimum of three years of Hill experience. This is not an entry level position. Excellent written and oral communication skills required. Advanced degree a plus. Spanish ability a plus.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of three years of Hill experience",
      "Excellent written and oral communication skills required",
      "Advanced degree a plus",
      "Spanish ability a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use title on your email: Senior LA Position. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-490-17",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2018-03-01",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-489-17",
    "position_title": "Legislative Assistant",
    "office": "Member of Appropriations Committee",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "Senior, active member of appropriations committee seeks hard working and experienced legislative assistant to handle health issues, including appropriations, budget, and tax policy. Experience working on the Hill is essential and related policy experience is preferred.",
    "responsibilities": [
      "Handle health issues",
      "Handle appropriations",
      "Handle budget",
      "Handle tax policy"
    ],
    "qualifications": [
      "Experience working on the Hill is essential",
      "Related policy experience is preferred"
    ],
    "how_to_apply": "Please send cover letter, resume, writing sample, and salary requirements to ct03laopening@gmail.com.",
    "salary_info": null,
    "contact": "ct03laopening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-483-17",
    "position_title": "Communications Director/Press Secretary",
    "office": "Congresswoman Michelle Lujan Grisham",
    "location": "Washington, D.C.",
    "posting_date": "2018-03-01",
    "description": "Congresswoman Michelle Lujan Grisham is seeking a Communications Director/Press Secretary to lead an aggressive communications operation. The ideal candidate must be a talented writer; have previous communications experience; and be able to work quickly under pressure in a fast paced work environment. This role demands creativity, high attention to detail, and hard work.",
    "responsibilities": [
      "Working with the Congresswoman and the legislative team on developing and implementing a communications strategy",
      "Managing social media platforms",
      "Maintaining the office website",
      "Briefing the Congresswoman before interviews",
      "Writing talking points for the Congresswoman’s speaking engagements, events, and floor speeches",
      "Drafting op-eds",
      "Pitching stories"
    ],
    "qualifications": [
      "Talented writer",
      "Previous communications experience",
      "Ability to work quickly under pressure in a fast paced work environment",
      "Creativity",
      "High attention to detail",
      "Hard work",
      "Hill experience a plus"
    ],
    "how_to_apply": "Interested candidates should submit both a cover letter and resume in one attachment to NM01.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": "Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-479-17",
    "position_title": "Legislative Assistant",
    "office": "Virginia Republican House member",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "Virginia Republican House member is seeking an experienced Legislative\nAssistant to handle a diverse issue portfolio, including committee work.\nSuccessful applicants will be a creative thinker with exceptional writing and\nediting skills, and a willingness working in a fast-moving team environment.",
    "responsibilities": [
      "tracking bills and legislative developments",
      "developing policy recommendations on legislation and creative ideas for new legislation",
      "preparing the Congressman for hearings, floor activities, and events in the district",
      "tracking regulatory changes and advising the communications team on policy for messaging",
      "reviewing constituent correspondence",
      "regular interface with Federal agencies, issue advocates, and constituents"
    ],
    "qualifications": [
      "Minimum two years experience in a legislative role in a House/Senate office",
      "Bachelor’s degree"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and 3\nwriting samples in .pdf format to:",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "VirginiaLegislativeAssistant@gmail.com",
    "equal_opportunity": "EOE"
  },
  {
    "id": "MEM-478-17",
    "position_title": "Press Secretary",
    "office": "Progressive Democrat",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "Progressive Democrat seeks experienced, creative and proactive Press\nSecretary to help lead aggressive media outreach in fast-paced office. The\nideal candidate will have at least five years' experience executing media plans\nand proven success pitching/booking national cable interviews.",
    "responsibilities": [
      "pitching reporters and producers",
      "managing local press outreach and social media platforms",
      "drafting statements, op-eds and other press materials as needed"
    ],
    "qualifications": [
      "excellent writing, editing and verbal skills",
      "the ability to manage pressure and meet deadlines"
    ],
    "how_to_apply": "Please submit a cover letter, outlining media relations success, resume and two writing samples with the subject line “Press Secretary” to cademhilljobs@gmail.com.",
    "salary_info": null,
    "contact": "cademhilljobs@gmail.com",
    "equal_opportunity": "Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-316-17",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2018-03-01",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives, and Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff. The ideal candidate will be a junior attorney (fewer than five years of experience) with a background or strong interest in investigations.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  }
]