[
  {
    "id": "MEM-136-14",
    "position_title": "Press Secretary",
    "office": "Freshman Democratic Member of Congress",
    "location": "DC and district",
    "posting_date": "2014-02-24",
    "description": "Candidates must possess strong writing skills, creativity, a good sense of humor, strong political judgment, the flexibility to work quickly and carefully under tight deadlines, and the ability to work collaboratively with both DC and district staff to grasp and communicate legislative and local priorities.\n\nThe Press Secretary also helps manage a press assistant/special projects coordinator. Prior on-the-record experience, speech writing and Capitol Hill experience strongly preferred.",
    "responsibilities": [
      "Coordinating day-to-day press operations",
      "Responding to media inquiries and interview requests",
      "Pro-actively pitching stories",
      "Organizing earned media events in DC and district",
      "Writing press releases, advisories, talking points, op-eds, e-newsletter and speeches",
      "Managing website and social media platforms"
    ],
    "qualifications": [
      "Strong writing skills",
      "Creativity",
      "Good sense of humor",
      "Strong political judgment",
      "Flexibility to work quickly and carefully under tight deadlines",
      "Ability to work collaboratively with both DC and district staff to grasp and communicate legislative and local priorities",
      "Prior on-the-record experience (strongly preferred)",
      "Speech writing (strongly preferred)",
      "Capitol Hill experience (strongly preferred)"
    ],
    "how_to_apply": "Qualified candidates should send a resume and cover letter to NM01.Resumes@mail.house.gov with “Press Secretary” in the subject line. No phone calls, faxes or drop-ins, please.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-127-14",
    "position_title": "Legislative Correspondent",
    "office": "Senior Midwest Democrat",
    "location": null,
    "posting_date": "2014-02-24",
    "description": "Senior Midwest Democrat seeks a Legislative Correspondent to handle issuespecific constituent communications and legislative research. Responsibilities include, but are not limited to, drafting constituent correspondence, tracking legislation, meeting with constituents and interest groups, briefing the Congressman, and generally supporting the legislative and front office operations. Candidate must be highly dependable, flexible, and have superior organizational and writing skills. Knowledge of the legislative process and Indiana ties a plus.",
    "responsibilities": [
      "Drafting constituent correspondence",
      "Tracking legislation",
      "Meeting with constituents and interest groups",
      "Briefing the Congressman",
      "Generally supporting the legislative and front office operations"
    ],
    "qualifications": [
      "Highly dependable",
      "Flexible",
      "Superior organizational and writing skills",
      "Knowledge of the legislative process a plus",
      "Indiana ties a plus"
    ],
    "how_to_apply": "Please send a cover letter, resume, and a short writing sample to in01.resume@mail.house.gov. No calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "in01.resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-125-14",
    "position_title": "COMMUNICATIONS ASSISTANT",
    "office": "Congressman Dan Kildee (MI-05)",
    "location": "Washington, D.C.",
    "posting_date": "2014-02-24",
    "description": "Congressman Dan Kildee (MI-05) is seeking a Communications Assistant in Washington, D.C., to assist with the Member’s external communications efforts.",
    "responsibilities": [
      "Drafting media advisories and press releases",
      "Collating daily press clips and morning headlines",
      "Creating content for the Member’s social media accounts",
      "Developing graphic design and drafting constituent mail and managing the constituent mail program."
    ],
    "qualifications": [
      "Creative",
      "Excellent written and oral communication skills",
      "Strongly proficient with digital and social media platforms",
      "Energetic and a detail-oriented team player able to multi-task and produce high-quality work on tight deadlines",
      "Graphic and/or video editing skills are highly preferred",
      "Michiganders are strongly encouraged to apply"
    ],
    "how_to_apply": "Please e-mail resume, cover letter and two writing samples (no more than 1page each) to michigan05jobs@gmail.com (subject line should read: Communications Assistant Application). No telephone calls, emails or walkins, please.",
    "salary_info": null,
    "contact": "michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-123-14",
    "position_title": "Tax Attorney",
    "office": "Democratic Congressional committee",
    "location": "Washington, D.C.",
    "posting_date": "2014-02-24",
    "description": "Democratic Congressional committee seeks experienced tax attorney to advise on tax policy, brief Members and write Committee materials on budget implications of federal tax policies, and work with Congressional and outside experts on revenue options. Requires knowledge of corporate and individual tax policy, strong analytical and quantitative skills, strong written and oral communication skills, attention to detail, and the ability to work effectively under tight deadlines. Hill experience preferred.",
    "responsibilities": [],
    "qualifications": [
      "Knowledge of corporate and individual tax policy",
      "Strong analytical and quantitative skills",
      "Strong written and oral communication skills",
      "Attention to detail",
      "Ability to work effectively under tight deadlines",
      "Hill experience preferred"
    ],
    "how_to_apply": "Email resume, two brief writing samples, and cover letter with subject line “revenue analyst” to revenue.analyst@mail.house.gov",
    "salary_info": null,
    "contact": "revenue.analyst@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "PAR-001-14",
    "position_title": "Digital Editor",
    "office": "Compilation of Precedents Office",
    "location": "Washington, D.C.",
    "posting_date": "2014-02-24",
    "description": "The Compilation of Precedents Office is looking for a DIGITAL EDITOR to join the office. The Digital Editor will assist the Legal Editors and the IT Director on a variety of projects relating to the publication of the precedents of the U.S. House of Representatives. The Office is nonpartisan and is affiliated with the House Parliamentarian’s Office.",
    "responsibilities": [
      "Maintaining, updating, and editing the Office’s SQL database for content and accuracy for publishable materials. Researching and composing reports from database to assist with Office’s needs. Utilizing technological knowledge to expand and enhance the database’s capabilities while maintaining accuracy and precision.",
      "Working closely with the IT Director on developing other research methods and composition techniques based on current capabilities and in accordance with Government Printing Office’s technology/standards.",
      "Assisting the Legal Editors in preparation for publications of various products. This will include citation checking, basic copy editing, and style checking consistent with internal, GPO, and legal standards.",
      "Acting as a liaison between the Office and the GPO in production and distribution of products. The Digital Editor will potentially oversee work of GPO detailees and interns working on various projects for office.",
      "Creating new research reports from a variety of sources (including internal database, various government and legal databases, and working with various House staff) as needed."
    ],
    "qualifications": [
      "Bachelor’s degree required.",
      "Excellent computer database management essential. Knowledge of SQL, XML, Microsoft Office, and publication software preferred.",
      "Excellent editing skills and commitment to detail essential. Legal or citation checking helpful.",
      "Commitment to nonpartisan atmosphere essential. Knowledge of Hill or legislative processes helpful, but not essential.",
      "Ability to work both independently and in a collaborative matter essential. Ability to be a self-starter also essential."
    ],
    "how_to_apply": "Please send cover letter, resume sample, and either a writing sample or digital portfolio to Andrew Neal, Compilation of Precedents Editor, by email only to Andrew.neal@mail.house.gov by March 1, 2014.",
    "salary_info": null,
    "contact": "Andrew.neal@mail.house.gov",
    "equal_opportunity": null
  }
]