[
  {
    "id": "MEM-262-21",
    "position_title": "Press Secretary / Communications Director",
    "office": "Representative Juan Vargas",
    "location": "Washington DC or San Diego",
    "posting_date": "2021-07-19",
    "description": "Representative Juan Vargas (CA-51), member of the Financial Services Committee and Foreign Affairs Committee, seeks an energetic and wellorganized professional to manage his communications portfolio. The position could be based in Washington DC or San Diego and will travel between both cities as needed. Candidates must have professional fluency in English & Spanish. Must be self-motivated, diligent, and a team player.\n\nCandidates should possess strong oral, writing, and proof-reading skills, as well as the ability to develop and maintain relationships with local state, and national media reporters. The ideal candidate will have a passion for practical policies that unite the country and digital organizing / communications in all formats.\n\nOther duties include, but are not limited to: developing messaging and talking points; overseeing all communications materials, including press releases, website content, franked mail and social media accounts; working with policy staff on short- and long-term communications goals; and regularly briefing and staffing the member. Salary is between $65-$75K based on experience.\n\nThis position will mentor /manage appropriate press interns in both the DC and San Diego Offices. This is not an entry-level position.",
    "responsibilities": [
      "Developing messaging and talking points",
      "Overseeing all communications materials, including press releases, website content, franked mail and social media accounts",
      "Working with policy staff on short- and long-term communications goals",
      "Regularly briefing and staffing the member",
      "Mentoring /managing appropriate press interns in both the DC and San Diego Offices"
    ],
    "qualifications": [
      "Strong communications skills (writing, editing, proofreading) with at least two years of political communications experience including producing Op-Ed’s, Press Releases & Other written communications",
      "Understanding of print, broadcast, & online social media tools / platforms like Instagram, Facebook, TikTok, What’s App, Twitter, BigVu, Streamyard, CanvaPro, Adobe Premier, etc. Strong Skills & experience producing excellent written & visual content, including graphics & video, for a variety of social media platforms.",
      "An ability to amplify limited media coverage & grow its impact exponentially",
      "Thorough knowledge of the legislative process, procedures & organization of the House – a plus",
      "Creating high-quality graphics, editing photos and videos, & supporting management of all Congressman Vargas’s website / digital platforms.",
      "Knowledge of current issues & events in which the Congresswoman is involved",
      "Working with policy staff on short / long-term communications goals",
      "Ability to exercise discretion & judgment in the representation of the Congressman's position on policy issues",
      "Must have the ability to prioritize duties & manage staff in a fast-paced work environment while meeting rapid timelines",
      "Excellent understanding of online organizing communications",
      "Critical & strategic thinking",
      "Strong technical writing skills",
      "Ability to translate complex policy issues into simple language, creating talking point summaries",
      "Leading, managing & optimizing production needs surrounding virtual & inperson town hall meetings, public forums, & press conferences & creating graphics & media presentation when required",
      "Proactively pitching national/local media",
      "Creating, recording & editing video content /messages /livestreaming/moderating town halls",
      "Creating e-newsletters & managing the franked mailers process for the office",
      "Tracking press and social media analytics",
      "Assisting in the development of local & national media strategy"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and writing samples to: CAJobs@mail.house.gov with the “Press Secretary /Communications Director- [NAME]” in the subject line and include two writing samples. Applications due by July 23, 2021.",
    "salary_info": "$65-$75K based on experience",
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all identity groups to apply."
  },
  {
    "id": "MEM-261-21",
    "position_title": "Data Analyst",
    "office": "Joint Economic Committee",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "The Republican staff of U.S. Congress’s Joint Economic Committee seek a data\nanalyst with strong quantitative skills for the Social Capital Project. Proficiency\nin Excel as well as STATA, R, or other statistical software package is required\nfor this role. Successful candidates will have a background in economics, public\npolicy, or similar field. Ability to think creatively, work independently, and take\ninitiative is necessary.\n\nThe Project provides a unique chance to develop an ambitious agenda aimed at\nenabling more Americans to thrive in the 21st century. Interest in JEC Social\nCapital Project-related research topics, including expanding opportunity by\nstrengthening families, communities, and attachment to work, is a plus. Salary is\ncommensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "Proficiency in Excel as well as STATA, R, or other statistical software package is required for this role.",
      "Successful candidates will have a background in economics, public policy, or similar field.",
      "Ability to think creatively, work independently, and take initiative is necessary.",
      "Interest in JEC Social Capital Project-related research topics, including expanding opportunity by strengthening families, communities, and attachment to work, is a plus."
    ],
    "how_to_apply": "Interested candidates should send a resume and writing sample to RJobs@jec.senate.gov",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "RJobs@jec.senate.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-260-21",
    "position_title": "Senior Policy Advisor/Senior Economist",
    "office": "Republican staff of U.S Congress's Joint Economic Committee",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "The Republican staff of U.S Congress's Joint Economic Committee seek a senior policy advisor/senior economist for the Social Capital Project. The Project, a \"think tank within a committee,\" seeks candidates with experience in social science and public policy research and interest in evidence-based approaches to expanding opportunity by strengthening families, communities, and attachment to work.\n\nFor these roles, successful candidates will have proven policy research and writing experience (for a public audience) and be able to weigh empirical evidence and think creatively about policy. Ability to work independently and take initiative are also essential.\n\nThe Project provides a unique chance to develop an ambitious policy agenda aimed at enabling more Americans to thrive in the 21st century. We encourage applications from those with a masters, PhD, or equivalent level of policy knowledge/experience. Salary commensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "Proven policy research and writing experience (for a public audience)",
      "Ability to weigh empirical evidence",
      "Ability to think creatively about policy",
      "Ability to work independently",
      "Ability to take initiative",
      "Masters, PhD, or equivalent level of policy knowledge/experience"
    ],
    "how_to_apply": "Interested candidates should send a resume and writing sample (not to exceed thirty pages) to RJobs@jec.senate.gov",
    "salary_info": "Salary commensurate with experience.",
    "contact": "RJobs@jec.senate.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-255-21",
    "position_title": "Deputy Chief of Staff & Legislative Director",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "Capitol Hill",
    "posting_date": "2021-07-19",
    "description": "Congresswoman Nanette Diaz Barragan (CA-44)- Member of the Energy and Commerce and Homeland Security Committees - seeks a Deputy Chief of Staff & Legislative Director.\nThis is not an entry-level position and previous legislative, and Capitol Hill experience is required.\nCandidates must have a thorough understanding of the legislative and committee process, floor procedure, strong management, oral and written communications skills, be energetic, detail-oriented, able to multi-task, and willing to work extended hours including evenings and weekends as needed.\nThe Deputy Chief of Staff & Legislative Director will be responsible for strategizing, developing, and implementing legislative plans; introducing legislation; providing cosponsor and cosign recommendations; managing a team of Legislative Assistants and a Legislative Correspondent; oversee the office's constituent mail program; monitor the House Floor; provide vote recommendations; and work with the scheduling team to ensure that any changes are reflected in the Congresswoman's schedule.\nThe Deputy Chief of Staff & Legislative Director will have a legislative portfolio – currently consisting of handling the Energy & Commerce Health Subcommittee, healthcare, judiciary and foreign relations but there is room for moving around the portfolios. The individual also leads the office's Appropriations process, including working with the legislative team and district office to compile requests, circulate sign-on letters, and submit materials to the Subcommittees.\nThe Deputy Chief of Staff & Legislative Director works closely with the District Director and Communication Director in helping with community outreach including providing backup information for events, speeches, and townhalls. The individual will also work closely with the Chief of Staff in overseeing scheduling, HR, and budget issues for the office – and other responsibilities as assigned.\nQualified candidates will demonstrate significant management experience (federal, state, or local government management experience are a plus), strategic planning abilities, self-motivation, and an ability to work collaboratively.",
    "responsibilities": [
      "Strategizing, developing, and implementing legislative plans",
      "Introducing legislation",
      "Providing cosponsor and cosign recommendations",
      "Managing a team of Legislative Assistants and a Legislative Correspondent",
      "Oversee the office’s constituent mail program",
      "Monitor the House Floor",
      "Provide vote recommendations",
      "Work with the scheduling team to ensure that any changes are reflected in the Congresswoman’s schedule",
      "Handling the Energy & Commerce Health Subcommittee, healthcare, judiciary and foreign relations",
      "Leads the office’s Appropriations process, including working with the legislative team and district office to compile requests, circulate sign-on letters, and submit materials to the Subcommittees",
      "Works closely with the District Director and Communication Director in helping with community outreach including providing backup information for events, speeches, and townhalls",
      "Work closely with the Chief of Staff in overseeing scheduling, HR, and budget issues for the office"
    ],
    "qualifications": [
      "Previous legislative, and Capitol Hill experience is required",
      "Thorough understanding of the legislative and committee process, floor procedure",
      "Strong management, oral and written communications skills",
      "Energetic, detail-oriented, able to multi-task",
      "Willing to work extended hours including evenings and weekends as needed",
      "Significant management experience (federal, state, or local government management experience are a plus)",
      "Strategic planning abilities",
      "Self-motivation",
      "Ability to work collaboratively"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, two references, and two writing samples with “CA44 Deputy Chief|LD” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-254-21",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-07-19",
    "description": "The Committee's investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:\ngovernment ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-253-21",
    "position_title": "Investigator",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-07-19",
    "description": "The Committee on Ethics seeks an experienced investigative professional for an investigator position. The Committee’s investigator is responsible for assisting the Committee in all aspects of its investigative work, including researching and reviewing public data sources, forensic research, document review, data collection and analysis, preparing for and participating in witness interviews, and drafting and editing Committee documents.\n\nThis is a nonpartisan position which requires the ability to assist with impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding organizational, research, and analytical skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Assisting the Committee in all aspects of its investigative work",
      "Researching and reviewing public data sources",
      "Forensic research",
      "Document review",
      "Data collection and analysis",
      "Preparing for and participating in witness interviews",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Outstanding organizational, research, and analytical skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, or financial accounting",
      "Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred"
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigator” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-252-21",
    "position_title": "Press Assistant/Digital Director",
    "office": "House Republican",
    "location": "Washington, DC",
    "posting_date": "2021-07-19",
    "description": "Candidates must excel in a fast-paced existing press operation. Prior experience in a political office or campaign experience preferred, but not required.\nFamiliarity or existing contacts with conservative media outlets a major plus.\nPosition based in Washington, DC office. Must work well under pressure.",
    "responsibilities": [
      "Compile daily clips",
      "Assist with press releases, talking points, op-eds, and other materials",
      "Grow and manage a national press list",
      "Create compelling social media content",
      "Assist with maintaining office's website and social media accounts",
      "Create and edit videos and graphics",
      "Monitor the Congressman's presence and interactions on social media. Keeping Communications Director and Chief of Staff up-to-date on emerging trends and important conversations happening online",
      "Take photos/video at events"
    ],
    "qualifications": [
      "Video editing skills",
      "Excellent research skills",
      "Ability to write well"
    ],
    "how_to_apply": "Please submit your resume to Midwestern.Job@mail.house.gov with “Press Assistant/Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "Midwestern.Job@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-250-21",
    "position_title": "Communications Director or Press Secretary",
    "office": "Congressman John Sarbanes",
    "location": "Washington, D.C.",
    "posting_date": "2021-07-19",
    "description": "The Office of Congressman John Sarbanes seeks an experienced Communications Director or Press Secretary to serve in its Washington, D.C. office.\n\nThis office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Impeccable writing skills",
      "A close eye to detail",
      "Fluency with a wide range of social media platforms and digital tools – including Adobe Creative Suite and website CMS services",
      "The ability to manage several, simultaneous projects in a fast-paced environment",
      "Experience working closely with national and local press, along with television and radio booking producers"
    ],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and writing portfolio to employment@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-247-21",
    "position_title": "Press & Digital Media Assistant",
    "office": "Congresswoman Lisa Blunt Rochester",
    "location": "Wilmington, Delaware",
    "posting_date": "2021-07-19",
    "description": "This position is based in Wilmington, Delaware. Responsibilities include managing the Congresswoman’s website and social media accounts, working collaboratively to generate creative and engaging content for digital platforms, drafting talking points and advisories, and staffing the Congresswoman and taking photos/videos at events.\n\nAdditionally, the press & digital media assistant will help draft and copy-edit speeches and talking points for the Congresswoman for events in Delaware, and the person in this role will report directly to the DC-based Communications Director. Prior press/digital experience; Hill or campaign experience and familiarity with social media and graphic/video design are strongly preferred. Delaware ties a major plus. Strong written and oral communications skills, a flexible schedule, access to a car, and a clean driving record are musts.",
    "responsibilities": [
      "Managing the Congresswoman’s website and social media accounts",
      "Working collaboratively to generate creative and engaging content for digital platforms",
      "Drafting talking points and advisories",
      "Staffing the Congresswoman and taking photos/videos at events",
      "Help draft and copy-edit speeches and talking points for the Congresswoman for events in Delaware"
    ],
    "qualifications": [
      "Prior press/digital experience",
      "Hill or campaign experience and familiarity with social media and graphic/video design are strongly preferred",
      "Delaware ties a major plus",
      "Strong written and oral communications skills",
      "Flexible schedule",
      "Access to a car",
      "Clean driving record are musts"
    ],
    "how_to_apply": "Interested candidates must submit a resume, one cover letter, two writing samples, and two examples of social media or digital media work samples to lbr.jobposting@gmail.com",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-240-21",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT/COUNSEL",
    "office": "Rep. Karen Bass (CA37)",
    "location": "Hill",
    "posting_date": "2021-07-19",
    "description": "Rep. Karen Bass (CA37) seeks a hardworking lawyer with legal, policy, and Hill experience to serve as a Senior Legislative Assistant/Counsel, with the primary portfolio focusing on the Member’s Judiciary Committee work.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Preparing and staffing the Member in committee hearings and markups",
      "Drafting talking points and speeches",
      "Researching, drafting, and introducing legislation"
    ],
    "qualifications": [
      "Team player",
      "Excellent writing and communication skills",
      "Ability to work independently",
      "Thorough understanding of the legislative process",
      "Good relationships on the Hill with Democrats and Republicans",
      "Ability to work effectively in a fast-paced environment",
      "Track record of turning ideas into legislation and preferably legislation into law"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and a short (1-2 page) writing sample to CA37.HR@mail.house.gov with “Senior Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, disability, military status, age, marital status, or parental status.\nWomen, people of color, LGBTQ+ individuals, and members of other underrepresented communities are strongly encouraged to apply.\nNo phone calls or drop-ins, please."
  },
  {
    "id": "MEM-235-21",
    "position_title": "Scheduler",
    "office": "Republican House Member",
    "location": "Washington, DC and in the District",
    "posting_date": "2021-07-19",
    "description": "The scheduler will manage all aspects of the Member's daily and long-term schedule in DC and in the District. This individual will work closely with the Member, DC and District staff.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Managing operational and logistical support for the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill or comparable work environment",
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Applicants should send their resume, and references to PA09Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "PA09Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-231-21",
    "position_title": "Counsel for House Judiciary Subcommittee on the Constitution, Civil Rights, and Civil Liberties",
    "office": "House Judiciary Committee’s Subcommittee on the Constitution, Civil Rights, and Civil Liberties",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "The House Judiciary Committee’s Subcommittee on the Constitution, Civil Rights, and Civil Liberties seeks a dedicated and hard-working lawyer with a minimum of 5 years of professional legal experience to serve as a subcommittee counsel.\n\nThe counsel will be responsible for handling assignments in a range of issue areas, including reproductive rights, women’s issues, religious freedom, voting rights, civil rights litigation, torts and civil procedure, claims against the United States, separation of powers, federalism, individual constitutional rights, and any other areas as assigned.",
    "responsibilities": [
      "serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee’s jurisdiction",
      "drafting legislation",
      "preparing hearings",
      "drafting statements, memos, and briefing materials",
      "providing guidance to Democratic House offices on matters of constitutional and civil rights law"
    ],
    "qualifications": [
      "must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and the ability to work on novel and complex matters under time and other pressures",
      "must also be able to work collaboratively with a broad range of personalities",
      "sound political judgment, prior legislative or policy experience, a substantive background in civil rights or constitutional law, and a demonstrated commitment to public service are strongly preferred",
      "A sense of humor is a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Constitution Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee strongly encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-228-21",
    "position_title": "Procurement Counsel or Professional Staff Member",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": "District of Columbia",
    "posting_date": "2021-07-19",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) seeks to fill a Procurement Counsel or Professional Staff Member position on the Democratic staff. The ideal candidate will have several years of experience overseeing government procurement awards and performance.",
    "responsibilities": [
      "Research",
      "Investigations",
      "Briefings",
      "Managing congressional hearings"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Procurement” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills."
  },
  {
    "id": "MEM-227-21",
    "position_title": "Legislative Assistant/Senior Legislative Assistant",
    "office": "Ways and Means Republican",
    "location": "Hill",
    "posting_date": "2021-07-19",
    "description": "Senior Ways and Means Republican is seeking a legislative assistant/senior legislative assistant to handle a diverse legislative portfolio. Qualified candidates will have a minimum of 3 years legislative experience on the Hill and substantial knowledge of the legislative process and floor procedure. Strong writing, research and communication skills a must. All resumes handled in strict confidence.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 3 years legislative experience on the Hill",
      "Substantial knowledge of the legislative process and floor procedure",
      "Strong writing, research and communication skills"
    ],
    "how_to_apply": "Please forward a resume, cover letter and writing sample to resumes.FL16@mail.house.gov.",
    "salary_info": null,
    "contact": "resumes.FL16@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-226-21",
    "position_title": "STAFF ASSISTANT",
    "office": "Office of Representative Thomas Massie",
    "location": "Crescent Springs, Kentucky",
    "posting_date": "2021-07-19",
    "description": "The Office of Representative Thomas Massie is seeking a staff assistant to serve in the Crescent Springs, Kentucky office. Ideal candidate will be motivated self-starter with outstanding interpersonal, customer service, time-management, and organizational skills.\nSuccessful candidate will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, show strong attention to detail, and an ability to multitask effectively in a fast-paced environment.\nPrimary responsibilities will include maintaining the front office, answering phones, processing and logging constituent mail, greeting visitors, monitoring office deliveries, responding to inquiries, assisting with constituent casework, and other duties as assigned.",
    "responsibilities": [
      "Maintaining the front office",
      "Answering phones",
      "Processing and logging constituent mail",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Responding to inquiries",
      "Assisting with constituent casework",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starter",
      "Outstanding interpersonal skills",
      "Customer service skills",
      "Time-management skills",
      "Organizational skills",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Strong attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume and cover letter to mary.troutman@mail.house.gov with “District Staff Assistant” in the subject line. Applications will be reviewed on a rolling basis until the position is filled.",
    "salary_info": null,
    "contact": "mary.troutman@mail.house.gov",
    "equal_opportunity": "Representative Massie’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-218-21",
    "position_title": "Professional Staff Member for Women Veterans Policy - House Committee on Veterans' Affairs (Majority)",
    "office": "House Committee on Veterans' Affairs",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "The Democratic staff of the House Committee on Veterans' Affairs seeks a Professional Staff Member (PSM) to join its Health Subcommittee staff.\nThe PSM will manage a portfolio focused on issues impacting women veterans to include matters related to military service, impacts to women veterans' health, well-being, and access to care, benefits, and economic resources, as well as systemic and structural barriers which may inhibit access. The PSM will report directly to the staff director of the Subcommittee. Some travel will be required.",
    "responsibilities": [
      "Working with Committee leadership to develop an overall policy and legislative strategy",
      "Conducting oversight and investigations within the portfolio",
      "Tracking legislative and policy developments within the portfolio",
      "Drafting written product, to include memoranda, correspondence, reports, and public statements",
      "Planning and executing hearings and other official events",
      "Conducting site visits",
      "Developing and drafting legislation",
      "Engaging and working with stakeholders to include the Administration, Veterans Service Organization (VSOs), and others",
      "Supporting the full Committee and Subcommittee Chairs in advancing the Committee's priorities"
    ],
    "qualifications": [
      "Highly qualified candidates will have significant experience with issues impacting women veterans, as well experience in government (at any level) or advocacy. Congressional experience is not required but is a plus.",
      "Qualified candidates will be extremely organized, have excellent oral and written communications skills, have a demonstrated ability to work on a team, and have a track record of successfully delivering excellent work in short timeframes."
    ],
    "how_to_apply": "All candidates are required to complete an online application via https://veterans.house.gov/opportunities to be considered.\nCandidates should upload a resume, cover letter, writing sample, and diversity & inclusion statement.\nThe diversity & inclusion statement should be 250 words or less and: 1) Explain how your past personal and/or professional experiences have contributed to your growth in understanding diversity, equity, and inclusion, and/or 2) Explain how you plan to engage in diversity, equity and inclusion matters in this role. Applications will not be considered complete if there is no diversity & inclusion statement.",
    "salary_info": "Starting salary is $90k, commensurate with experience.",
    "contact": null,
    "equal_opportunity": "In an effort to build a diverse and more inclusive work environment, the committee strongly encourages veterans, minority, women, people with disabilities, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-208-21",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Senior Democratic Member",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized and professional individual for the position of Staff Assistant/Legislative Correspondent. The successful applicant will be personable, organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.\n\nThis individual will help manage the constituent mail program, including monitoring the flow of incoming and outgoing mail, keeping the constituent database current, responding to constituent correspondence, and working with legislative staff to maintain a proactive constituent outreach program.\n\nAdditional daily tasks include answering phones, processing mail, assisting with constituent requests for information, coordinating tours, and other administrative duties supporting the Member and staff as needed. Please note that we may split this position for two separate hires.",
    "responsibilities": [
      "Manage the constituent mail program, including monitoring the flow of incoming and outgoing mail",
      "Keeping the constituent database current",
      "Responding to constituent correspondence",
      "Working with legislative staff to maintain a proactive constituent outreach program",
      "Answering phones",
      "Processing mail",
      "Assisting with constituent requests for information",
      "Coordinating tours",
      "Other administrative duties supporting the Member and staff as needed"
    ],
    "qualifications": [
      "Personable",
      "Organized",
      "Excellent communication skills",
      "Excellent time-management skills",
      "Ability to exercise sound, independent judgment",
      "Ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to staffassistantlc@yahoo.com",
    "salary_info": null,
    "contact": "staffassistantlc@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-205-21",
    "position_title": "Legislative Assistant",
    "office": "Senior House Democratic Member of the Foreign Affairs Committee",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "Senior House Democratic Member of the Foreign Affairs Committee seeks legislative assistant to handle work on that committee and related issues.\nIn addition to a strong interest and experience in foreign policy issues and the operations of U.S. foreign affairs agencies, the successful applicant will be organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume and a cover letter to foreignpolicyla@yahoo.com",
    "salary_info": null,
    "contact": "foreignpolicyla@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-202-21",
    "position_title": "Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": "District of Columbia",
    "posting_date": "2021-07-19",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) seeks to fill a Counsel position on the Democratic staff. The ideal candidate will be an attorney with several years of investigative or litigation experience.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Managing congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-201-21",
    "position_title": "Chief Health Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": "District of Columbia",
    "posting_date": "2021-07-19",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) is looking for an experienced attorney to lead a team of attorneys and professional staff in executing the Committee’s health and gender equity-related investigations and oversight work.",
    "responsibilities": [
      "managing investigations",
      "taking depositions and transcribed interviews",
      "managing congressional hearings"
    ],
    "qualifications": [
      "attorney with several years of relevant investigative, litigation, or regulatory experience",
      "superior attention to detail",
      "work well under pressure",
      "be self-motivated",
      "possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Chief Health Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format:\n“LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-200-21",
    "position_title": "EEO / Whistleblower Protection Investigative Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": "District of Columbia",
    "posting_date": "2021-07-19",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) is looking for an Investigative Counsel on the Democratic staff. The ideal candidate will be an attorney with several years of litigation experience, a demonstrated commitment to civil rights and social justice, and a background in antidiscrimination, employment, whistleblower protection, and retaliation laws. Candidates with diverse backgrounds and experiences are strongly encouraged to apply. Responsibilities include depositions, transcribed interviews, whistleblower interviews, briefings, and managing congressional hearings. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Whistleblower interviews",
      "Briefings",
      "Managing congressional hearings"
    ],
    "qualifications": [
      "Attorney with several years of litigation experience",
      "Demonstrated commitment to civil rights and social justice",
      "Background in antidiscrimination, employment, whistleblower protection, and retaliation laws",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Employment / Whistleblower Protection” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-199-21",
    "position_title": "Staff Assistant",
    "office": "Representative Spanberger",
    "location": "Washington, D.C.",
    "posting_date": "2021-07-19",
    "description": "Representative Spanberger seeks a Staff Assistant for her Washington, D.C. office. Qualified applicants should be motivated self-starters, highly organized, detail-oriented, able to multitask, have exceptional interpersonal skills, and be eager to join a mission-oriented team that thrives in a fast-paced environment. Candidates must demonstrate excellent “people skills” and a strong commitment to providing outstanding constituent service. The ideal candidate should: be able to think on their feet and be a problem solver; show keen attention to detail and an ability to multi-task; demonstrate excellent oral and written skills; maintain a positive demeanor; and demonstrate resilience in a busy environment.",
    "responsibilities": [
      "Answering and logging telephone calls",
      "Recruiting and managing interns",
      "Assisting the Legislative Correspondent with batching mail",
      "Managing constituent requests for flags and tours",
      "Other administrative duties",
      "Greeting visitors to the office and giving Capitol tours (once the Capitol reopens to the public)",
      "Manage incoming constituent requests for flags flown over the Capitol"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Highly organized",
      "Detail-oriented",
      "Able to multitask",
      "Exceptional interpersonal skills",
      "Eager to join a mission-oriented team that thrives in a fast-paced environment",
      "Excellent “people skills”",
      "Strong commitment to providing outstanding constituent service",
      "Able to think on their feet and be a problem solver",
      "Keen attention to detail",
      "Ability to multi-task",
      "Excellent oral and written skills",
      "Maintain a positive demeanor",
      "Demonstrate resilience in a busy environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and writing sample (3 pages or less) in a single PDF document to spanberger.inquiries@mail.house.gov with “DC Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-198-21",
    "position_title": "Professional Staff Member/Legislative Aide",
    "office": "House Committee on the Judiciary",
    "location": null,
    "posting_date": "2021-07-19",
    "description": "Responsibilities include participating in a wide range of oversight projects, assisting in preparation for Committee hearings and markups, and providing research assistance.\n\nIdeal candidates must be comfortable producing extensive research into a variety of issues and have demonstrated experience proof-reading and fact-checking complex documents. Candidates should additionally be highly detailed-oriented and organized, experienced handling large volumes of information, and have a demonstrated ability to meet precise deadlines in a fast-paced setting.\n\nThe Committee strives to ensure that our staff reflects the diversity of the country's population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race,\ncolor, religion, sex (including marital or parental status, sexual orientation, and\ngender identity), disability, age, or national origin. The anticipated start date for\nthis position is in August.",
    "responsibilities": [
      "Participating in a wide range of oversight projects",
      "Assisting in preparation for Committee hearings and markups",
      "Providing research assistance"
    ],
    "qualifications": [
      "Must be comfortable producing extensive research into a variety of issues",
      "Demonstrated experience proof-reading and fact-checking complex documents",
      "Highly detailed-oriented and organized",
      "Experienced handling large volumes of information",
      "Demonstrated ability to meet precise deadlines in a fast-paced setting"
    ],
    "how_to_apply": "To apply, please send a resume and cover letter to Job.JDEM@mail.house.gov with the subject: PSM/LA - [Your Full Name]",
    "salary_info": null,
    "contact": "Job.JDEM@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff reflects the diversity of the country's population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-07-19",
    "description": "Responsibilities include responding to constituent inquiries, managing constituent casework with federal agencies, working with the legislative team to address constituent concerns, and district outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events. Additional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills and have significant experience interacting with the public.\n\nAdditionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-162-21",
    "position_title": "STAFF ASSISTANT",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-07-19",
    "description": "Responsibilities include managing the front office, answering phones, processing and logging constituent mail, greeting visitors, monitoring office deliveries, scheduling assistance, responding to inquiries, assisting with constituent casework, and other duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills. Additionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "managing the front office",
      "answering phones",
      "processing and logging constituent mail",
      "greeting visitors",
      "monitoring office deliveries",
      "scheduling assistance",
      "responding to inquiries",
      "assisting with constituent casework",
      "other duties as assigned"
    ],
    "qualifications": [
      "motivated self-starters",
      "strong interpersonal skills",
      "customer service skills",
      "time-management skills",
      "organizational skills",
      "positive, solution-driven personality",
      "excellent oral and written communication skills",
      "keen attention to detail",
      "ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume, writing sample, and cover letter (3 pages or less) to spanberger.inquiries@mail.house.gov with “District Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]