[
  {
    "id": "MEM-429-22",
    "position_title": "LEGISLATIVE DIRECTOR",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "Capitol Hill",
    "posting_date": "2022-08-08",
    "description": "Congressman Andy Kim (NJ-03), a member of the House Armed Services Committee, House Foreign Affairs Committee, and House Small Business Committee, seeks a hard working, experienced Legislative Director to oversee his policy team and legislative agenda. This is not an entry-level position and previous policy and managerial experience on Capitol Hill is required.\n\nThe ideal applicant will be a team player, have a demonstrated ability to manage and mentor staff, think strategically, and have experience in formulating and advancing legislation. Successful applicants will work quickly under pressure, have good working knowledge of House legislative processes and procedures, excellent organization and communication skills, and work well with others. This senior staff position reports to the Chief of Staff and the Congressman.\n\nCandidates with more than a decade of policy, political and managerial experience that may be interested in a Deputy Chief of Staff role will be considered.",
    "responsibilities": [
      "Executes long-term and short-term strategic planning for the Member’s legislative agenda",
      "Manages the policy team and assigns, monitors, and evaluates legislative staff work-products",
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise",
      "Monitors activity on the House Floor and the Member’s committees",
      "Provides the casework team and the district staff with federal updates and guidance on federal matters",
      "Builds relationships with district and national stakeholders and advocacy organizations",
      "Takes constituent and advocacy group meetings as necessary",
      "Coordinates the preparation of legislative memos, policy-related prep, and cosponsorships"
    ],
    "qualifications": [
      "5+ years of Capitol Hill / Legislative experience",
      "3+ years management experience",
      "Policy experience in national security, foreign affairs, and/or defense a plus",
      "Knowledge of or ties to New Jersey a plus"
    ],
    "how_to_apply": "Email a cover letter, resume, a short writing sample and 2-3 references to NJ03Resumes@mail.house.gov with the subject line, “Legislative Director: [Your Full Name]” Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-427-22",
    "position_title": "Legislative Director",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2022-08-08",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks an experienced Legislative Director to oversee the legislative team in the Washington, DC office. This is not an entry-level position and significant Capitol Hill experience is required. The Legislative Director will manage a large and diverse portfolio, while creatively and effectively identifying new policy areas to pursue. The ideal candidate will demonstrate an ability to manage and mentor staff, think strategically, and advance legislation and policy initiatives.",
    "responsibilities": [
      "Manage a legislative team of 4-5 staff",
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff",
      "Set goals and develop strategic plans to meet those goals",
      "Consistently monitor Congressional proceedings and develop strategies for best advancing the Member's goals",
      "Work collaboratively as part of a team to accomplish goals",
      "In consultation with the communications staff, ensure accomplishments are communicated to constituents and stakeholders in the district."
    ],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Ability to concisely communicate in real time and under pressure important and often complex policy issues",
      "Capability to manage a team of policy professionals and develop communication and analytical skills in that team",
      "Clear understanding of the legislative process and ability to execute a legislative strategy",
      "Excellent organization and time management skills and ability to prioritize tasks."
    ],
    "how_to_apply": "Interested parties should e-mail a concise cover letter including salary requirements, a resume, and two short writing samples (one narrative style and one issue brief) to CT05jobs@mail.house.gov with the following subject line: Full Name – Legislative Director. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-424-22",
    "position_title": "Press Assistant/Digital Director",
    "office": "Republican Conference",
    "location": "Capitol Hill",
    "posting_date": "2022-08-08",
    "description": "A conservative Member of the Republican Conference on an “A” committee is expanding his communications team, and to that end seeks a Press Assistant/Digital Director.\n\nThe Press Assistant/Digital Director will report directly to the Communications Director and be responsible for managing and creating digital content for all social media channels, including graphics and videos, tracking and analyzing daily press clips and weekly social media traffic, maintaining and updating the press list monthly, and other communications-centric duties as assigned and as their experience grows.\n\nThe ideal candidate will be detail-orientated, creative, and have an interest or experience in digital communications and a strong work ethic. This is an excellent opportunity for a current or former Congressional intern (or similar position) or a current or former Staff Assistant interested in pursuing a career in Communications in an office with a growing Communications Department.\n\nCapitol Hill experience and Tennessee ties are preferred but not required.",
    "responsibilities": [
      "Managing and creating digital content for all social media channels, including graphics and videos",
      "Tracking and analyzing daily press clips and weekly social media traffic",
      "Maintaining and updating the press list monthly",
      "Other communications-centric duties as assigned and as their experience grows"
    ],
    "qualifications": [
      "Detail-orientated",
      "Creative",
      "Interest or experience in digital communications",
      "Strong work ethic",
      "Capitol Hill experience and Tennessee ties are preferred but not required."
    ],
    "how_to_apply": "Interested applicants should submit their resume with the subject line “Press Assistant/Digital Director—First Name, Last Name” to dylan.jones@mail.house.gov",
    "salary_info": null,
    "contact": "dylan.jones@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-423-22",
    "position_title": "Scheduler",
    "office": "Congressman Tom McClintock (CA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-08",
    "description": "The Scheduler will be expected to work closely with the Chief of Staff to coordinate the Member’s DC schedule, arrange travel plans, and manage day to day logistics. Additionally, this role will oversee the office’s intern program.",
    "responsibilities": [
      "Works with the Member, Chief of Staff, and District Director to determine and finalize the Member’s daily and long-term schedule.",
      "Manage all incoming meeting requests and invitations.",
      "Coordinates all travel arrangements.",
      "Process/schedule all incoming tour requests.",
      "Manage the office’s internship program."
    ],
    "qualifications": [
      "Able to coordinate and manage several scheduling activities with multiple parties",
      "Able to manage varying priorities and adapt to rapidly changing situations impacting the schedule",
      "Experience handling sensitive information and maintaining confidentiality",
      "Adaptable and organized with a keen attention to detail",
      "Strong decision-making skills and comfortable navigating challenging situations",
      "Works well under pressure"
    ],
    "how_to_apply": "Interested candidates should send resumes and cover letters to gopwesternjobs1776@gmail.com.",
    "salary_info": null,
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-416-22",
    "position_title": "Legislative Aide",
    "office": "House Leadership",
    "location": null,
    "posting_date": "2022-08-08",
    "description": "Senior progressive appropriator and member of House leadership seeks a\nLegislative Aide to help manage constituent casework and manage a small\nlegislative portfolio to include: Fin Serv, Tax and Trade, Veterans, Animals,\nPostal Services and Sports.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Chief of Staff/Legislative Director",
      "Works with the Legislative Director and Chief of Staff to formulate and advance legislative initiatives for assigned issue areas",
      "Tracks legislation and coordinates co-sponsorship of bills for the Member",
      "Provides input to help the Communications Director to draft speeches, press releases, op-eds, and Congressional Record statements for the Member"
    ],
    "qualifications": [
      "Strong progressive values",
      "Experience researching public policy and preparing recommendations for a Member of Congress or other executives/leaders (e.g., Federal department/agency, non-profit organization, private sector)",
      "Strong written and verbal communication skills",
      "Experience making decisions and advising senior leaders on important issues",
      "Comfortable navigating challenging situations and being politically savvy",
      "Prior experience with forming partnerships and advancing legislative priorities for a Member of Congress",
      "Prioritization and time management skills, with the ability to manage multiple projects at a time",
      "Knowledge of issues in portfolio"
    ],
    "how_to_apply": "To apply, send a cover letter, resume and short writing sample\nto lee.resumes@mail.house.gov with “Legislative Aide” in the subject line.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. People of color and people from underrepresented groups are\nstrongly encouraged to apply."
  },
  {
    "id": "MEM-412-22",
    "position_title": "STAFF ASSISTANT",
    "office": "Congressman Matt Cartwright (PA-08)",
    "location": "Capitol Hill",
    "posting_date": "2022-08-08",
    "description": "Staff Assistant for Capitol Hill front desk duties, including answering phones, greeting visitors, recruiting and managing D.C. interns, processing flag and tour requests, and other office-supporting administrative tasks.\nSome communications and constituent correspondence work is also included in the job.",
    "responsibilities": [
      "Answering phones",
      "Greeting visitors",
      "Recruiting and managing D.C. interns",
      "Processing flag and tour requests",
      "Other office-supporting administrative tasks",
      "Communications work",
      "Constituent correspondence"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should send resume and cover letter to democratic.hilljob@gmail.com.",
    "salary_info": "$45,000",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Women, candidates of color, and LGBTQ+ candidates are encouraged to apply."
  },
  {
    "id": "MEM-410-22",
    "position_title": "Digital Media Manager",
    "office": "Congressman Dwight Evans",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-08",
    "description": "The Office of Congressman Dwight Evans (D-PA-03) seeks a highly motivated\nand creative individual to join the Washington, D.C. team as the Congressman’s\nDigital Media Manager.\n\nThe primary function of this job will be supporting the Congressman’s\ncommunication platforms to ensure his priorities and message extend to as many\nconstituents as possible. This position reports directly to the Congressman’s\nCommunications Director. Candidates must have strong writing and digital media\nskills, be highly organized, energetic, and be capable of thriving in a fast-paced\nand rapidly changing environment. The ability to meet deadlines is a must.\nProficiency with social media tools and standard Microsoft Office and Adobe\nsoftware tools is required. District knowledge and familiarity is preferred.",
    "responsibilities": [
      "drafting daily social media content on all of the Congressman’s official platforms",
      "creating graphics",
      "editing videos",
      "sending daily news clips",
      "drafting op-eds on a variety of issues and e-newsletters",
      "working with district staff to produce regular virtual and tele-town hall meetings",
      "coordinating the draft of the Congressman’s annual State of the District report",
      "consistently monitoring and updating the Congressman’s website"
    ],
    "qualifications": [
      "strong writing and digital media skills",
      "highly organized",
      "energetic",
      "capable of thriving in a fast-paced and rapidly changing environment",
      "ability to meet deadlines",
      "proficiency with social media tools and standard Microsoft Office and Adobe software tools",
      "district knowledge and familiarity is preferred"
    ],
    "how_to_apply": "Qualified candidates should send a cover letter, resume and three examples of\nyour work, including at least one writing sample\nto PA03.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "PA03.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from\ndiverse backgrounds to apply."
  },
  {
    "id": "MEM-409-22",
    "position_title": "Outreach Manager",
    "office": "Congressional office",
    "location": "District",
    "posting_date": "2022-08-08",
    "description": "The Outreach Manager monitors and updates the Member and District Director on district and local issues in respective region. This position is responsible for overseeing and executing outreach activities that maintain and strengthen relationships between the Member and community leaders, constituents and organizations as well as helping constituents navigate the services and assistance with the federal government. This position assists with office operations, constituent casework, participates in community projects and events, and actively works to implement the outreach throughout the region. This position reports directly to the District Director.",
    "responsibilities": [
      "Outreach",
      "Serve as eyes and ears of the Congresswoman in the respective region of District",
      "Identify, develop and maintain relationships with key stakeholders and constituency groups.",
      "Create and maintain contact list of community and constituency group leaders for assigned outreach issue areas;",
      "Recommend strategic outreach planning and the development resulting from Congresswoman’s legislative agenda and priorities",
      "Engage constituent groups and their leadership to identify public policy problems & discuss legislative objectives and foster collaboration through advanced outreach;",
      "Develop forward looking events, town hall meetings and discussions to convey the office message and engage local residents.",
      "Attend related meetings and events to listen & learn from constituents and to communicate the status of specific legislation and Congresswoman’s priorities;",
      "Constituent Services",
      "Responsible for the general administrative operations",
      "Respond and triage constituent calls and mail; respond to walk-in constituents, stakeholders, etc.",
      "Casework Issues:",
      "Prepare certificates, proclamations, etc. for local and regional entities in coordination with staff assistant",
      "Compose letters of support as requested by various stakeholders, recognize constituents for their achievements in the community as well as thank you and follow up notes for meetings/events in region",
      "Identify casework of significant public interest and assess casework for problems that may require legislative action and make recommendations to District Director, Deputy District Director and Senior Casework Liaison.",
      "Assist constituents and businesses who have issues or problems interacting with the Federal government and act as a liaison to federal agencies.",
      "Operations",
      "Work in coordination with the Scheduler and District Director to strategically plan events and activities",
      "Represent and staff the Congresswoman at meetings/events with advocates / businesses / organizations / constituents",
      "Prepare Congresswoman for district meeting/events",
      "Provide information on upcoming events by scanning newspapers, city/town websites, social media, chamber emails, etc.",
      "Assist in planning and executing events as well as advancing events",
      "Press",
      "Work with Communications Team to help publicize major district events in the region",
      "Recommend and help prepare Congresswoman for press opportunities pertaining to local issues in region",
      "Other",
      "Drive the Congresswoman to meetings/events when appropriate.",
      "Other related duties as required"
    ],
    "qualifications": [
      "Bachelor’s degree in a related field (may be substituted for two or more years of related experience)",
      "Strong organizational, research, writing and communication skills",
      "At least a basic knowledge of legislative process;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Relationships with key stakeholders and knowledge of district issues and events in the district;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework and outreach responsibilities;",
      "Knowledge of office computer applications; and proficiency in word processing."
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to raul.martinez@mail.house.gov",
    "salary_info": null,
    "contact": "raul.martinez@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-393-22",
    "position_title": "Staff Assistant",
    "office": "Indiana Republican",
    "location": "Washington D.C.",
    "posting_date": "2022-08-08",
    "description": "The successful candidate will work closely with the D.C. and district staff on a variety of tasks including communications, legislative and administrative work.",
    "responsibilities": [
      "Answering constituent phone calls",
      "Overseeing internship program",
      "Greeting and escorting guests",
      "Coordinating and leading tours of the Capitol Building",
      "Sorting and drafting responses to constituent concerns",
      "Attending briefings/hearings and conducting research for staff",
      "Driving the Member to and from events",
      "Handling a variety of administrative and office tasks"
    ],
    "qualifications": [
      "Works a flexible schedule",
      "Excellent communication skills and strong attention to detail",
      "Indiana ties are required"
    ],
    "how_to_apply": "Interested applicants should email a resume and writing sample to MidwestHouseJobs@gmail.com with subject “LASTNAME, FIRSTNAME Staff Assistant Application”.",
    "salary_info": null,
    "contact": "MidwestHouseJobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-380-22",
    "position_title": "Communications Director",
    "office": "U.S. Representative Norma J. Torres (CA-35)",
    "location": "Washington, DC",
    "posting_date": "2022-08-08",
    "description": "U.S. Representative Norma J. Torres (CA-35) seeks an experienced Communications Director to lead an active, bilingual press operation for her Washington, DC office.\n\nCandidate must have experience pitching and placing stories in traditional and digital media and booking the Member on national TV.\n\nThe ideal candidate will thrive have strong oral and written communications skills, thrive in a fast paced environment, and be a creative and strategic thinker.\n\nThis is not an entry level position and candidates must have previous pressrelated experience either on or off Capitol Hill. Fluency in Spanish is a big plus.",
    "responsibilities": [
      "Maintaining relationships with California, national, and international reporters",
      "Developing and implementing weekly and long-term strategic communications plans",
      "Briefing and preparing the Member for interviews",
      "Writing press releases, talking points, and speeches",
      "Developing social media content",
      "Helping the Chief of Staff implement the Franked communications plan",
      "Assisting on other issues as needed"
    ],
    "qualifications": [
      "Experience pitching and placing stories in traditional and digital media",
      "Experience booking the Member on national TV",
      "Strong oral and written communications skills",
      "Ability to thrive in a fast-paced environment",
      "Creative and strategic thinking skills",
      "Previous press-related experience either on or off Capitol Hill",
      "Fluency in Spanish is a big plus"
    ],
    "how_to_apply": "Interested candidates should send an email to CA35.OfficeStaff@mail.house.gov with “Comms Director/Press Secretary” in the subject line and include a cover letter, resume, and two writing samples.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "CA35.OfficeStaff@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-379-22",
    "position_title": "Scheduler/Office Manager",
    "office": "Rep. Norma J. Torres",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-08",
    "description": "Rep. Norma J. Torres seeks an experienced Scheduler/Office Manager for her\nWashington, D.C. office. Duties will include:\nThis person will also serve the Congresswoman’s drivers; driver’s license, good\ndriving record, and access to a vehicle is required. Candidate must be highly\norganized, detail oriented, work well under pressure, and an efficient self-starter.\nWork may include some long hours, nights, and weekends.",
    "responsibilities": [
      "Manage and maintain all aspects of the Member’s daily and long-term DC and national schedule",
      "Making all air travel and ground transportation arrangements to and from the district and other locations",
      "Responds to all incoming meeting and scheduling requests",
      "Briefs the Member on all scheduling activities and requests of the Washington, D.C. and district offices",
      "Ensures that the Member has briefing materials for each event by coordinating with event participants and the appropriate legislative and/or district staff",
      "Coordinating the scheduling of press, interviews, radio and television time with the communications team",
      "Submits vouchers for travel and expense reimbursement to the staff member responsible for submitting office bills for payment",
      "Work with other congressional offices, committee staff, leadership office, and the Executive Branch agencies on events and scheduling requests",
      "Assists with office operations, including orientation and training for new staff, assisting departing employees, administering parking space assignments, managing leave and time record for staff, scheduling of rooms for outside group functions, maintaining emergency information for staff, ordering office supplies",
      "Other duties as assigned"
    ],
    "qualifications": [
      "driver’s license",
      "good driving record",
      "access to a vehicle",
      "highly organized",
      "detail oriented",
      "work well under pressure",
      "efficient self-starter"
    ],
    "how_to_apply": "To apply, please email a cover letter and resume to CA35.OfficeStaff@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA35.OfficeStaff@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-366-22",
    "position_title": "Staff Assistant",
    "office": "Nebraska House Republican",
    "location": "Washington, DC",
    "posting_date": "2022-08-08",
    "description": "The primary responsibility of the staff assistant is to serve as support staff for the operations team to maintain the regular daily functions and operations of the Washington, DC office. This could include answering telephones, greeting visitors to the office, assisting with appointments and scheduling, answering constituent requests for general information, giving tours of the capitol, monitoring deliveries, maintaining the front office, and assisting with other various administrative duties.",
    "responsibilities": [
      "Answering and screening telephone calls for the Member and other staff members.",
      "Greeting and screening visitors.",
      "Assisting individuals who have appointments with the Member or other staff members.",
      "Maintaining handout literature regarding the state and Congress.",
      "Signing for deliveries and forwarding deliveries to appropriate staff members.",
      "Maintaining the office answering machine and tracking voicemails.",
      "Ensuring that requests for assistance are directed to appropriate staff members.",
      "Maintaining the reception room.",
      "Maintaining the office guest book.",
      "Maintaining quick reference sheets of prominent VIPs and a list of frequently requested contacts.",
      "Recording visitors’ opinions, names, addresses, and other relevant information.",
      "Helping to log mail.",
      "Performing general typing and administrative assignments."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should send a resume to jobs@mikefloodfornebraska.com.",
    "salary_info": null,
    "contact": "jobs@mikefloodfornebraska.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-364-22",
    "position_title": "Outreach Assistant",
    "office": "Office of Representative Mikie Sherrill",
    "location": "NJ DISTRICT office",
    "posting_date": "2022-08-08",
    "description": "This position is responsible for maintaining both Rep. Sherrill’s district schedule and a comprehensive knowledge of all incoming requests. As outreach assistant, the position provides administrative and outreach support to the district office. As a member of a small cohesive team this position also provides exposure to a wide variety of projects and issues.",
    "responsibilities": [
      "Organize and maintain incoming requests from constituents, local organizations and staff from District and Washington D.C. offices",
      "Monitor the district work period schedule of the Congresswoman and anticipate logistical or detail needs",
      "Coordinate meeting, event scheduling and logistical planning (travel, locations, etc.)",
      "Work with DC Scheduler and District Directors to effectively and efficiently manage the Congresswoman’s time",
      "Support district team members in scheduling, event staffing, managing outreach lists, letter writing",
      "Represent the Congresswoman and the District Office at local events",
      "Undertake projects as needed including research, progress reporting and information gathering"
    ],
    "qualifications": [
      "Applicants must have a car and NJ driver’s license.",
      "Must possess strong written and communication skills.",
      "This position requires travel throughout the district and flexible hours, including some work on nights and weekends."
    ],
    "how_to_apply": "To apply please send resume, cover letter and references to NAME at resumes.nj11@mail.house.gov with the subject line please put \"OUTREACH ASSISTANT APPLICATION\"",
    "salary_info": null,
    "contact": "resumes.nj11@mail.house.gov",
    "equal_opportunity": "Women, minorities and LGBTQ+ persons are encouraged to apply. No calls or drop-ins."
  },
  {
    "id": "MEM-358-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2022-08-08",
    "description": "The Legislative Assistant will be responsible for handling a broad range of domestic policy issues, including the member’s Science and Technology Committee work. The Legislative Assistant will be responsible for drafting and monitoring legislation, preparing materials for committee hearings and markups, representing the Member in meetings/briefings, working with constituent organizations, and performing other tasks as assigned.\n\nThe ideal candidate will have a strong understanding of the legislative process, excellent writing and communication skills, and a demonstrated ability to work effectively in a fast-paced office. Press and communications experience is also a plus, but not required.",
    "responsibilities": [
      "Handling a broad range of domestic policy issues, including the member’s Science and Technology Committee work.",
      "Drafting and monitoring legislation",
      "Preparing materials for committee hearings and markups",
      "Representing the Member in meetings/briefings",
      "Working with constituent organizations",
      "Performing other tasks as assigned"
    ],
    "qualifications": [
      "Hill experience in a legislative role or comparable experience is required.",
      "Strong understanding of the legislative process",
      "Excellent writing and communication skills",
      "Demonstrated ability to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to legislativeposition2022@gmail.com.",
    "salary_info": null,
    "contact": "legislativeposition2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-231-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-08-08",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work. In addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Helping with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Office of Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-08-08",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media\nSecretary based in the DC office to work closely with the Communications\nDirector, based in the district office to develop and execute the Congressman's\ncommunications strategy as a member of the House Ways and Means, Armed\nServices, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital,\ntechnical, and social media trends. Able to express the Congressman's voice\ncreatively and promote social media presence, ensuring high web traffic and\nconstituent engagement.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours\nand producing high-quality work under tight deadlines. This position serves as a\npart of the Communications team and reports directly to the Director of\nCommunications based in the district, however, this person will be the main point\nof contact in the D.C. office.\n\nThe candidate will report to the Communications Director and work closely with\nlegislative and district staff. The ideal candidate will have experience in or\ninterest in learning about aspects of the office's traditional press operations,\nincluding writing press releases, drafting talking points and speeches, forming\nrelationships with members of the media, and pitching stories.\n\nThis is an ideal position for someone with 1-2 years of communications or digital\nexperience. Applicants must be passionate about public service, well-organized,\nand have the ability to work on weekends and holidays when necessary.",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman's social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman's website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman's media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada's Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford's digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "1-2 years of communications or digital experience",
      "Passionate about public service",
      "Well-organized",
      "Ability to work on weekends and holidays when necessary",
      "Fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus.",
      "Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  }
]