[
  {
    "id": "MEM-121-15",
    "position_title": "Legislative Assistant",
    "office": "Democrat",
    "location": "Washington, DC",
    "posting_date": "2015-04-20",
    "description": "Senior Democrat is seeking a highly energetic, motivated and organized\nlawyer with strong interpersonal, legal and writing skills. The ideal candidate\nwill be able to manage multiple tasks and work well under pressure and after a\nyear, may be considered a legislative counsel. The Legislative Assistant\nworks with the Chief Counsel/Legislative Director and with the Chief of Staff\nto develop and implement the Member’s legislative strategy in his/her issue\nareas; prepares materials for hearings; drafts legislation, amendments, and\ncongressional record statements; and conducts research.",
    "responsibilities": [
      "managing and handling issues that include but are not limited to Federal-District of Columbia issues",
      "Federal Workforce",
      "U.S. Postal Service",
      "Labor policy"
    ],
    "qualifications": [
      "Candidate must possess a law degree and be, or be willing to become, a resident of the District of Columbia.",
      "The ability to write well under tight deadlines is essential.",
      "Candidate must be able to handle multiple tasks and issues effectively while meeting deadlines.",
      "A successful candidate will be a results-oriented, problem solving lawyer and motivated self-starter who can think outside the box.",
      "Prior Hill, law firm or similar experience is preferred but not always required."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two\nwriting samples to (202 225-1129 (fax) or DC00.NortonResume@mail.house.gov. NO PHONE CALLS, PLEASE!",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-120-15",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2015-04-20",
    "description": "Duties include:\nanswering telephones; assisting with the tracking and processing of committee\ncorrespondence; providing administrative support in setting up committee\nmeetings; and entering data and navigating databases with accuracy. This is a\nnon-partisan position which requires the ability to serve all Members of\nCongress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-119-15",
    "position_title": "Senior Legislative Assistant",
    "office": "Congresswoman Tammy Duckworth",
    "location": "Washington, D.C.",
    "posting_date": "2015-05-04",
    "description": "Responsibilities will include managing the Congresswoman's Oversight and Government Reform Committee portfolio, including her role as Ranking Member of the Transportation Subcommittee; managing her work on transportation, manufacturing, small business, tax/budget, appropriations, labor, and trade issues; serving as the Member's liaison to the Congressional Asian Pacific American Caucus (CAPAC) and the Friends of Thailand Caucus; coordinating vote recommendations and reports from the legislative team; and helping oversee the member's legislative agenda.\n\nThe ideal candidate will be proactive, resourceful, a strong team player, and will have substantial Hill experience as a legislative staffer. Strong oral and written communications skills, the ability to thrive in a fast-paced environment, and good judgment are essential. Veterans, minorities, women, and those with Illinois ties are encouraged to apply.",
    "responsibilities": [
      "Managing the Congresswoman's Oversight and Government Reform Committee portfolio, including her role as Ranking Member of the Transportation Subcommittee",
      "Managing her work on transportation, manufacturing, small business, tax/budget, appropriations, labor, and trade issues",
      "Serving as the Member's liaison to the Congressional Asian Pacific American Caucus (CAPAC) and the Friends of Thailand Caucus",
      "Coordinating vote recommendations and reports from the legislative team",
      "Helping oversee the member's legislative agenda"
    ],
    "qualifications": [
      "Proactive",
      "Resourceful",
      "Strong team player",
      "Substantial Hill experience as a legislative staffer",
      "Strong oral and written communications skills",
      "Ability to thrive in a fast-paced environment",
      "Good judgment"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and writing sample to kalina.bakalov@mail.house.gov.",
    "salary_info": null,
    "contact": "kalina.bakalov@mail.house.gov",
    "equal_opportunity": "Veterans, minorities, women, and those with Illinois ties are encouraged to apply."
  },
  {
    "id": "MEM-117-15",
    "position_title": "Press Aide/Press Secretary",
    "office": "West Coast Democrat",
    "location": "Washington, DC",
    "posting_date": "2015-05-04",
    "description": "Duties of the position include but are not limited to:",
    "responsibilities": [
      "Coordinating and managing all district and national communications operations.",
      "Developing and executing a proactive press strategy.",
      "Drafting written materials including press releases, op-eds, and talking points.",
      "Planning and coordinating press conferences and other media events.",
      "Pitching and booking interviews with local and national media outlets.",
      "Overseeing all social media platforms and website content.",
      "Building and maintaining excellent relationships with members of the district and national media and acting as a spokesperson for the Member."
    ],
    "qualifications": [
      "Exceptional oral and written communication skills, as well as excellent interpersonal skills.",
      "Excellent writing skills with a strong attention to detail.",
      "The ability to multi-task in a fast-paced environment.",
      "Applicants should have superior organizational abilities.",
      "A successful candidate will be discreet, goal oriented, and driven.",
      "Applicants should have prior relevant press experience and demonstrated social media expertise.",
      "A sense of humor and the ability to work well as an individual and as a member of a team.",
      "Spanish fluency is required.",
      "An ideal candidate will have an undergraduate or graduate degree in communications or journalism and/or relevant professional experience."
    ],
    "how_to_apply": "If interested, please email a resume, cover letter, references, and salary history to CAJobs@mail.house.gov with “Press Aide/Press Secretary” in the subject line.",
    "salary_info": "Salary will be commensurate with experience. This is not an entry level position.",
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-116-15",
    "position_title": "Field Representative",
    "office": "A Maryland Democrat",
    "location": "District Office",
    "posting_date": "2015-05-04",
    "description": "A Maryland Democrat is seeking a high energy, highly-organized, and detail oriented Field Representative for his District Office.",
    "responsibilities": [
      "Serve as the official representative for the Member in the local community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Directors on district and local issues of importance.",
      "Staff and provide logistical support for scheduled district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Directors and Chief of Staff.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Train and supervise a staff of Interns to handle routine Office matters, such as incoming correspondence, visitors, telephone calls, and other issues that may arise."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "A working knowledge of the VA and military issues are preferred, but not required.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "Applications will be accepted on a rolling basis until the position is filled. To apply, please email a resume and cover letter to MD.06Jobs@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "MD.06Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-111-15",
    "position_title": "Scheduler/Office Manager",
    "office": "Senior Democratic Congresswoman",
    "location": "Washington, D.C.",
    "posting_date": "2015-04-20",
    "description": "Responsibilities include managing office calendars and visitor access to Member and staff in front office, organizing and tracking invitations, speaking engagements, travel reservations and other requests for the Member, coordinating with district staff, and maintaining administrative demands. The Scheduler/Office Manager will work closely with other staff members, particularly senior staffers, to ensure efficient and seamless office operations.\nIdeal candidates are flexible, responsive, collaborative, work well under pressure and on short deadlines, and are able to balance competing demands. Candidates must be available to assist the Member outside of regular business hours. Applicants should also have a positive attitude, excellent organizational skills, strong written and verbal communication and interpersonal skills, political instincts and an ability to thrive in a fast-paced environment. This is not an entry-level position. Previous Capitol Hill operational and/or scheduling experience is required. Ohio ties preferred.",
    "responsibilities": [
      "Managing office calendars and visitor access to Member and staff in front office",
      "Organizing and tracking invitations, speaking engagements, travel reservations and other requests for the Member",
      "Coordinating with district staff",
      "Maintaining administrative demands",
      "Working closely with other staff members, particularly senior staffers, to ensure efficient and seamless office operations"
    ],
    "qualifications": [
      "Flexible",
      "Responsive",
      "Collaborative",
      "Work well under pressure and on short deadlines",
      "Able to balance competing demands",
      "Available to assist the Member outside of regular business hours",
      "Positive attitude",
      "Excellent organizational skills",
      "Strong written and verbal communication and interpersonal skills",
      "Political instincts",
      "Ability to thrive in a fast-paced environment",
      "Previous Capitol Hill operational and/or scheduling experience is required",
      "Ohio ties preferred"
    ],
    "how_to_apply": "Please submit cover letter, resume, and at least two references to Midwestern.Resume@mail.house.gov.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-108-15",
    "position_title": "Writer",
    "office": "Democratic member of the U.S. House of Representatives",
    "location": null,
    "posting_date": "2015-05-04",
    "description": "Democratic member of the U.S. House of Representatives seeks a prolific writer. The writer will be responsible for writing in the Member’s unique voice for a weekly newsletter, op-eds, speeches, floor statements, press releases and more.",
    "responsibilities": [
      "Writing in the Member’s unique voice for a weekly newsletter",
      "Writing op-eds",
      "Writing speeches",
      "Writing floor statements",
      "Writing press releases"
    ],
    "qualifications": [
      "The successful candidate may have decades of writing experience or s/he may be a gifted recent graduate who can adeptly turn a phrase.",
      "An ability to digest complicated policies and turn them into short and concise articles or statements is a necessity.",
      "The qualified applicant will have the ability to work and thrive in a fast-paced environment with short deadlines.",
      "Basic knowledge and understanding of web site technology for producing and sending newsletter is a must."
    ],
    "how_to_apply": "Please submit a resume and several types of writing samples to: job.app@mail.house.gov by close of business May 1st.",
    "salary_info": null,
    "contact": "job.app@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-104-15",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2015-05-04",
    "description": "Duties include:\nanswering telephones; assisting with the tracking and processing of committee\ncorrespondence; providing administrative support in setting up committee\nmeetings; and entering data and navigating databases with accuracy. This is a\nnon-partisan position which requires the ability to serve all Members of\nCongress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.\nNO PHONE CALLS PLEASE",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-098-15",
    "position_title": "Committee Investigator",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2015-05-04",
    "description": "The Majority staff of the House Committee on Veterans’ Affairs is seeking a health care professional with expert knowledge of drug interactions, pathology, and general issues regarding quality of care to serve as a Committee Investigator. Clinical experience and/or healthcare-related investigatory background preferred. Veterans with requisite experience strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to VAR.Resumes@Mail.house.gov with “Health Care Investigator” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "VAR.Resumes@Mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-097-15",
    "position_title": "Committee Investigator",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2015-04-20",
    "description": "The Majority staff of the House Committee on Veterans’ Affairs is seeking a federal contracting professional with expert knowledge of federal statutes and regulations pertaining to acquisitions and procurement to serve as a Committee Investigator. At least 5 years of federal government acquisitions and procurement experience preferred, as is experience with facility construction contracts. Veterans with requisite experience are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "At least 5 years of federal government acquisitions and procurement experience preferred",
      "Experience with facility construction contracts preferred"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to VAR.Resumes@Mail.house.gov with “Contract Investigator” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "VAR.Resumes@Mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-092-15",
    "position_title": "Communications Director",
    "office": "Rep. Jerry McNerney",
    "location": "Washington, DC",
    "posting_date": "2015-05-04",
    "description": "California Democrat (Rep. Jerry McNerney) seeks experienced communications director to develop and execute aggressive, proactive long-term media and outreach strategy.\n\nCandidate must be comfortable working closely with the Member and staff.\n\nIdeal candidate would be politically astute and have a good sense of humor.\n\nDesired qualities include the ability to respond to challenging situations quickly and strategically.\n\nThis position requires non-traditional hours and travel to the District.\n\nCalifornia ties, Hill experience, and Spanish literacy are a plus.",
    "responsibilities": [
      "Serving as chief spokesperson",
      "Successfully pitching stories and press events to both national and local media outlets",
      "Responding to media inquiries",
      "Effectively messaging policy and other priorities",
      "Maintaining an active new media profile",
      "Writing press releases, op-eds, speeches, talking points, and franked mail"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Strong editing and proofreading abilities",
      "The desire to work collaboratively with a team in a fast-paced environment"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume and two writing samples to: McNerneyResumes@mail.house.gov. No calls or drop ins, please.",
    "salary_info": null,
    "contact": "McNerneyResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-091-15",
    "position_title": "Health Counsel",
    "office": "Democratic staff of the Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2015-04-20",
    "description": "The Democratic staff of the Committee on Oversight and Government Reform is seeking a mid-level Health Counsel with 5 to 10 years of congressional experience on health policy issues including ACA, Medicare, and Medicaid.\nAttorneys with investigative or litigation experience are preferred. Candidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "5 to 10 years of congressional experience on health policy issues including ACA, Medicare, and Medicaid",
      "Attorneys with investigative or litigation experience are preferred"
    ],
    "how_to_apply": "Please send resume and cover letter to oversightjobs@mail.house.gov. Please no phone calls.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  }
]