[
  {
    "id": "MEM-468-23",
    "position_title": "Investigative Counsel",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2023-09-11",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks one attorney with 5-10 years of experience to serve as Investigative Counsel.\n\nThe Investigative Counsel reports to the Staff Director and Chief Counsel and will be responsible for conducting sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives and advising the Staff Director and Chief Counsel on legal and policy matters.\n\nThe OCE is seeking attorneys interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Counsel would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Review information received by OCE, discern possible violations, and identify facts requiring further investigation",
      "Plan, organize and conduct investigations regarding allegations and advise the Staff Director and Chief Counsel regarding appropriate evaluation of cases",
      "Advise the Staff Director and Chief Counsel on legal issues in matters under investigation and on broader legal and policy issues involved in the operations of OCE",
      "Draft lengthy and detailed memoranda, reports, and referrals for Board consideration and potential public release",
      "Developing investigative strategies and implementing investigative plans",
      "Reviewing evidence and data in order to analyze, develop, and provide detailed written and oral reports of findings",
      "Identifying information to substantiate or disprove allegations and assess the likely sources of that information",
      "Collecting and reviewing documents, electronic media, and physical evidence",
      "Interviewing witnesses and subjects",
      "Performing other duties as assigned"
    ],
    "qualifications": [
      "Demonstrated ability to conduct and direct complex legal research and present the results in a clear, precise and persuasive manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Strong legal judgment and demonstrated professional integrity",
      "Experience auditing large sets of data or evidence and providing detailed analysis",
      "Investigative experience with high-profile and sensitive matters",
      "Experience with investigations involving public officials",
      "Experience with campaign finance or ethics law",
      "Experience conducting interviews or depositions",
      "Experience writing public reports or legal documents",
      "Advanced proficiency in development and use of electronic databases, and other computer skills including knowledge of current information technology tools related to investigations",
      "work independently or as part of an investigative team",
      "manage multiple tasks and projects",
      "work well under pressure and tight time deadlines",
      "exercise discretion and independent judgment"
    ],
    "how_to_apply": "Please send cover letter, short writing sample, and resume (electronic submissions preferred) to:",
    "salary_info": null,
    "contact": "Omar S. Ashmawy\nStaff Director and Chief Counsel\nOffice of Congressional Ethics\nUnited States House of Representatives\nP.O. Box 895\nWashington, DC 20515-0895\nOCEJOB@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-466-23",
    "position_title": "Legislative Assistant/Foreign Policy Advisor",
    "office": "Congresswoman Lois Frankel (FL-22)",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "Congresswoman Lois Frankel (FL-22), is hiring a Legislative Assistant/Foreign Policy Advisor to support her work as a member of the House Appropriations Committee and as Co-Chair of the bipartisan Women, Peace, and Security Caucus. This position will encompass a wide range of foreign policy issues including covering the State and Foreign Operations Appropriations Subcommittee, Israel, homeland security, immigration, veterans, and other issues as assigned.\nApplicant must be comfortable working in a fast-paced and team-oriented environment. Excellent writing skills, ability to build and maintain relationships, and attention to detail are required. This is not an entry-level position. Previous experience on the Hill and with the Appropriations process is preferred.",
    "responsibilities": [],
    "qualifications": [
      "Comfortable working in a fast-paced and team-oriented environment.",
      "Excellent writing skills, ability to build and maintain relationships, and attention to detail are required.",
      "Previous experience on the Hill and with the Appropriations process is preferred."
    ],
    "how_to_apply": "Please fill out the google form at tinyurl.com/FL22FPLA to apply. Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary range is $70,000 - $85,000 depending on experience, and includes health insurance, student loan repayment, and other competitive benefits. Title and salary will be commensurate with experience.",
    "contact": null,
    "equal_opportunity": "Women, people of color, LGBTQ+ people, and members of other minority or marginalized groups are strongly encouraged to apply. We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status."
  },
  {
    "id": "MEM-464-23",
    "position_title": "Press Secretary / Digital Director / Deputy Communications Director",
    "office": "Congresswoman Diana DeGette (D-CO)",
    "location": "Washington, D.C. or Denver, CO",
    "posting_date": "2023-09-11",
    "description": "Congresswoman Diana DeGette (D-CO) is seeking a highly motivated, detailorientated communications professional for a vacancy in her communications\nshop. This position can be based out of either DeGette’s Washington, D.C. or\nDenver, CO office.\n\nThe ideal candidate will be creative, have strong writing and organizational skills,\nand a proficiency in crafting digital content — as well as experience coordinating\nwith media. Being a detail-oriented team player is essential, along with the ability\nto be a self-starter and work on multiple projects at once in a fast-paced\nenvironment. A good attitude and friendly demeanor are greatly appreciated.\n\nCapitol Hill experience or Colorado ties are a plus, but not required.",
    "responsibilities": [
      "Overseeing digital content for the member’s social media platforms and website",
      "Graphic design",
      "Video filming and editing",
      "Taking photographs",
      "Drafting releases, newsletters, advisories, talking points, speeches, and more",
      "Organizing press events",
      "Compiling daily press clips",
      "This position will coordinate closely with and report to the Communications Director."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples, and an example of previous digital media or graphic design projects to DeGette.Comms@mail.house.gov with their last name in the subject line. Applications will be considered on a rolling basis until the position is filled. No phone calls, faxes, or drop-ins please.",
    "salary_info": "The salary range for the position is commensurate with experience and expected\nto fall within $55,000 – $65,000 annually. Both title and salary are negotiable\nbased on experience.",
    "contact": "DeGette.Comms@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on\nrace, color, religion, sex, sexual orientation, gender identity and expression,\nnational origin, disability, military status, age, marital status, or parental status.\nCandidates from all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-463-23",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee (MI-08)",
    "location": "Washington, D.C.",
    "posting_date": "2023-09-11",
    "description": "The legislative assistant will be responsible for important issues areas such as worker and family support, education, labor, transportation, among other issues, in a fast-paced congressional office for a member of House Democratic Leadership on the Ways and Means Committee and Budget Committee.",
    "responsibilities": [
      "Drafting bills and amendments",
      "Developing strategic plans to advance legislation through Congress",
      "Staffing committee meetings",
      "Interacting with constituents and district stakeholders, committee/leadership committee staff and federal agencies",
      "Writing policy briefing memos and talking points"
    ],
    "qualifications": [
      "Self-starting personality",
      "Passion for public service",
      "Strong written and verbal communication skills",
      "Eagerness to work on a team in a collaborative office environment",
      "A minimum three years of relevant work experience is required.",
      "Michigan ties preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to kildeejobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "kildeejobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-462-23",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": "Washington DC or the Charlotte, NC District Office",
    "posting_date": "2023-09-11",
    "description": "The Communications Director is expected to work closely with the Chief of Staff, Deputy Chief of Staff / District Director, and the Legislative Director to develop and execute a comprehensive and aggressive strategic plan to inform constituents and the media about Congresswoman Adams and her work as a member of congress.\n\nThis includes making media pitches, organizing press events, and reviewing, drafting, and finalizing statements, talking points/speeches, press releases, media advisories, and other messaging (e.g., newsletters and social media). Finally, the Communications Director will oversee all Franked communications, which includes mailers. Successful candidates will be exceptional writers and have strong experience working in fast-paced environments and implementing aggressive communications plans. North Carolina ties strongly preferred.\n\nView the full job description attached.",
    "responsibilities": [
      "Develop strategic communications plans and work closely with the DC and District Offices to implement successful media strategies;",
      "Produce written and visual content for the office, including but not limited to press releases, statements, social media post and weekly newsletters;",
      "Manage, mentor, and grow the communications team, focusing on staff professional development, skill building, and efficient workflows;",
      "Build and sustain strong relationships with North Carolina and national print, online, radio, and broadcast media (reporters, producers, editors, columnists, etc), and remain ready to identify creative ways to pitch the Member;",
      "Prepare, brief, and staff the Member for media interviews, press conferences, roundtables, and other engagements;",
      "Draft and edit office materials, talking points, speeches, press releases, op-eds, and other materials as necessary; and",
      "Speak on background or on the record with reporters when necessary and act as a media liaison for the Member."
    ],
    "qualifications": [
      "Bachelor’s Degree in a relevant field or equivalent professional experience;",
      "Previous Capitol Hill, campaign or political experience strongly preferred;",
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Previous on the record experience;",
      "Experience managing others and promoting professional development;",
      "Deep understanding of print, broadcast, and online media and how to successfully create and leverage opportunities in each;",
      "Strategic thinker, politically savvy, and ability to manage competing priorities and develop solutions under tight deadlines;",
      "Ability to work well with others, willingness to take initiative, manage competing priorities, and turn around high-quality products under tight deadlines are a must; and",
      "Works a flexible schedule, including long hours on nights and weekends."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, a resume, three references, and three writing samples to NC12.resume@mail.house.gov with \"[NAME] – Communications Director\" in the subject line.",
    "salary_info": null,
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": "Rep. Alma S. Adams’ office provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
  },
  {
    "id": "MEM-457-23",
    "position_title": "Scheduler or Director of Operations",
    "office": "Office of Congresswoman Jennifer McClellan (VA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-09-11",
    "description": "The Office of Congresswoman Jennifer McClellan (VA-04) seeks a highly organized, detail-oriented candidate to serve as her scheduler or director of operations (commensurate with experience) in her Washington, D.C. office. This position reports directly to the Chief of Staff and will work closely with both the D.C. and District staff.\n\nThe scheduler will develop, coordinate, and manage all aspects of the Member’s schedule and logistics in D.C. and in district. Other responsibilities include tracking, evaluating, and responding to all invitations and scheduling requests, coordinating travel for the Member, compiling her briefing materials, and providing operational support for the office.\n\nThis includes but is not limited to facilitating Member to Member and stakeholder outreach, coordinating internal and external events, coordinating with the legislative and press teams for necessary briefing materials, overseeing coordination with other Member offices, committee staff, leadership offices, the White House, executive departments and other federal agencies, coordinating with campaign and non-official staff on political scheduling requests, and other tasks as assigned.",
    "responsibilities": [
      "Develop, coordinate, and manage all aspects of the Member’s schedule and logistics in D.C. and in district.",
      "Tracking, evaluating, and responding to all invitations and scheduling requests.",
      "Coordinating travel for the Member.",
      "Compiling her briefing materials.",
      "Providing operational support for the office.",
      "Facilitating Member to Member and stakeholder outreach.",
      "Coordinating internal and external events.",
      "Coordinating with the legislative and press teams for necessary briefing materials.",
      "Overseeing coordination with other Member offices, committee staff, leadership offices, the White House, executive departments and other federal agencies.",
      "Coordinating with campaign and non-official staff on political scheduling requests.",
      "Other tasks as assigned."
    ],
    "qualifications": [
      "Previous scheduling or administrative experience",
      "Excellent attention to detail",
      "Strong communication skills",
      "Thrive in a fast-paced work environment",
      "Hill experience is desired but not required",
      "Ability to multitask",
      "Work well under pressure",
      "Manage conflicting requests",
      "Communicate scheduling changes to the Member",
      "Flexibility to respond to urgent scheduling needs outside of normal hours when necessary"
    ],
    "how_to_apply": "To apply please email a resume and short cover letter or statement of interest to VA04.Jobs@mail.house.gov.",
    "salary_info": "$75,000-$85,000 and other benefits include generous leave and work from home policies.",
    "contact": "VA04.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, religious affiliation, national origin, age, or military, marital, or parental status. The office prioritizes building a diverse team: women and candidates from BIPOC, LGBTQ+, and other underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-455-23",
    "position_title": "Committee Deputy Clerk",
    "office": "House Committee on Transportation and Infrastructure",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "The Majority Staff of the House Committee on Transportation and Infrastructure\nis seeking a Committee Deputy Clerk.\nThis is position requires attention to detail, strong time management and\norganization skills, and discretion and confidentiality in handling committee\nmatters.",
    "responsibilities": [
      "Tracking documents and ensuring that items adhere to the in-house style guide.",
      "Organizing and preparing for meetings and Committee events, including gathering documents and attending to logistics.",
      "Proof-reading content to ensure for accuracy including spelling, grammar, and punctuation.",
      "Assisting in maintaining Committee official records.",
      "Aiding the Committee counsels in organizing and documenting Committee markups.",
      "Ensuring that all Committee activities run smoothly and according to Committee operational procedure.",
      "Assisting as the non-partisan Committee Clerk with Committee activities as additional reading clerk and tally clerk when required.",
      "Assisting in the preparation and filing of Committee legislative reports.",
      "Providing administrative support to Committee staff as required."
    ],
    "qualifications": [
      "A minimum of two years previous Congressional experience",
      "Knowledge of Congressional administrative rules and procedures",
      "The ability to manage multiple tasks and projects",
      "Ability to work well under pressure",
      "Strong oral and written communication skills",
      "The ability to exercise discretion and independent judgment"
    ],
    "how_to_apply": "Interested candidates should email a resume and cover letter to tirepresumes@mail.house.gov with the subject line, Full Committee Deputy Clerk – Majority Office.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "tirepresumes@mail.house.gov",
    "equal_opportunity": "The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-454-23",
    "position_title": "Operations Manager",
    "office": "Majority Staff of the Committee on Transportation and Infrastructure",
    "location": "Capitol Hill",
    "posting_date": "2023-09-11",
    "description": "This position reports directly to the Director of Operations and Administration and would assist them in ensuring operational support for committee activity as well as administrative support for the office.",
    "responsibilities": [
      "Providing executive support to the Staff Director",
      "Assisting in scheduling and support of external events held in committee hearing rooms",
      "Tracking long-term requests to CAO and AOC",
      "Maintaining adequate stock of office supplies and equipment",
      "Serving as internship program coordinator",
      "Providing operational support to official committee activity",
      "Coordinating staff assistants to ensure administrative support for full committee staff"
    ],
    "qualifications": [
      "Demonstrated experience in highpressure work environments",
      "At least one year of full-time experience on Capitol Hill in an operations role"
    ],
    "how_to_apply": "Interested candidates should send a resume to tiresumes22@gmail.com.",
    "salary_info": null,
    "contact": "tiresumes22@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-453-23",
    "position_title": "Research Assistant",
    "office": "House Committee on Transportation & Infrastructure, Subcommittee on Water Resources and Environment",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "The Majority Staff of the House Committee on Transportation & Infrastructure is\nseeking candidates for the position of Research Assistant on the Subcommittee\non Water Resources and Environment.\n\nMajor pieces of legislation in the Subcommittee’s jurisdiction include the Clean\nWater Act and Water Resource Development Acts, among others. The position\nincludes both administrative and policy research responsibilities to support\nSubcommittee members and staff.",
    "responsibilities": [
      "conducting legislative research",
      "drafting legislative memoranda",
      "assisting with oversight activities",
      "compiling materials for Members and staff for use during Committee activity",
      "maintaining legislative trackers",
      "other responsibilities as assigned"
    ],
    "qualifications": [
      "1 to 3 years of demonstrated ability to conduct policy research and manage administrative duties.",
      "organized, proactive, motivated self-starter.",
      "Enthusiasm for and some knowledge of Subcommittee issue areas is a plus and/or ability to learn issues quickly.",
      "Superior organizational skills, superior written and oral communications skills, the ability to work both independently and as part of a team, and attention to detail are critical."
    ],
    "how_to_apply": "Interested candidates should send a resume to tiresumes22@gmail.com",
    "salary_info": null,
    "contact": "tiresumes22@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), the Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2023-09-11",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-450-23",
    "position_title": "SCHEDULER",
    "office": "Congressman Jerrold Nadler, Ranking Member of the House Judiciary Committee",
    "location": "DC",
    "posting_date": "2023-09-11",
    "description": "Congressman Jerrold Nadler, Ranking Member of the House Judiciary Committee, seeks Scheduler to manage Member’s daily and long-term DC schedule, including coordinating with Committee staff on hearings, meetings, and markups, organizing and tracking invitations, speaking engagements and scheduling requests for the Member, assisting in coordinating travel arrangements and keeping Member on schedule throughout day.\n\nDuties also include managing the intern program, maintaining the DC office, and processing flag requests and White House tour requests. Candidates must be highly organized, attentive to detail, and capable of thriving in a fast-paced and rapidly changing environment. Previous scheduling/office management experience, including a strong background in Outlook scheduling functions, is a plus. Ranking Member Nadler is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply.",
    "responsibilities": [
      "Manage Member’s daily and long-term DC schedule",
      "Coordinating with Committee staff on hearings, meetings, and markups",
      "Organizing and tracking invitations, speaking engagements and scheduling requests for the Member",
      "Assisting in coordinating travel arrangements",
      "Keeping Member on schedule throughout day",
      "Managing the intern program",
      "Maintaining the DC office",
      "Processing flag requests and White House tour requests"
    ],
    "qualifications": [
      "Highly organized",
      "Attentive to detail",
      "Capable of thriving in a fast-paced and rapidly changing environment",
      "Previous scheduling/office management experience, including a strong background in Outlook scheduling functions, is a plus"
    ],
    "how_to_apply": "To apply send a resume and cover letter to NY12.JOB@mail.house.gov.",
    "salary_info": null,
    "contact": "NY12.JOB@mail.house.gov",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-448-23",
    "position_title": "Professional Staff Member",
    "office": "House Armed Services Committee Democrats",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "The House Armed Services Committee Democrats are seeking a Professional Staff Member for the Military Personnel Subcommittee.\n\nResponsibilities include, but are not limited to, advising Members of Congress on military justice and other military personnel policy matters, evaluating budget requests and legislative proposals, preparing for committee hearings and briefings, and developing and drafting proposal for inclusion in the annual National Defense Authorization Act.\n\nThe Military Personnel Subcommittee jurisdiction includes: policy and programs and accounts related to military personnel and their families, Reserve Component integration and employment, military health care, military education, dependent schools, POW/MIA issues, Morale, Welfare and Recreation, commissaries, cemeteries under the jurisdiction of the Department of Defense, the Uniform Code of Military Justice, military retirement issues, and the civilian and contract workforce.\n\nThis is not an entry level position. Candidates with a law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred. The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees. A successful candidate will be required to obtain and maintain a security clearance.",
    "responsibilities": [
      "Advising Members of Congress on military justice and other military personnel policy matters",
      "Evaluating budget requests and legislative proposals",
      "Preparing for committee hearings and briefings",
      "Developing and drafting proposal for inclusion in the annual National Defense Authorization Act"
    ],
    "qualifications": [
      "Law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred",
      "A successful candidate will be required to obtain and maintain a security clearance."
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, to hasc.dememployment@mail.house.gov with the subject line: “Full Name – PSM – Military Personnel.” We will accept applications until the position is filled.",
    "salary_info": null,
    "contact": "hasc.dememployment@mail.house.gov",
    "equal_opportunity": "The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees."
  },
  {
    "id": "MEM-447-23",
    "position_title": "Press Assistant",
    "office": "Pennsylvania Republican",
    "location": "Washington, D.C.",
    "posting_date": "2023-09-11",
    "description": "The Press Assistant will report directly to the Communications Director. The ideal candidate should be hardworking, able to juggle multiple projects at once, and demonstrate a proficiency in writing, editing, and digital/social media content creation. Pennsylvania ties preferred but not required.",
    "responsibilities": [
      "Assisting the Communications Director in drafting and editing written materials such as the press releases, statements, Floor speeches, op-eds, and e-mailers",
      "Managing the Member’s social media pages and drafting content for those platforms",
      "Updating the Member’s official website",
      "Working with the Communications Director to execute short and long-term communications strategies."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, email cover letter, resume, and two writing samples to PaPressAssistantJob@gmail.com.",
    "salary_info": null,
    "contact": "PaPressAssistantJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-446-23",
    "position_title": "Military Legislative Assistant",
    "office": "Office of Congressman Frank J. Mrvan",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "The Military Legislative Assistant (MLA) is responsible in the personal office for managing the Congressman’s responsibilities as a Member of the House Committee on Veterans’ Affairs and the Ranking Member of the Subcommittee on Oversight and Investigations. The MLA is also responsible for legislative issues related to national security, foreign affairs, and other assigned issue areas, including the drafting of prep material, constituent correspondence, and meeting with constituent and special interest groups under these issue areas on behalf of the Member.\n\nCandidate must be highly dependable, detail-focused, value responsiveness to constituents, and have superior organizational and writing skills. Knowledge of the legislative process and Indiana ties are a plus. Minority and veteran candidates are encouraged to apply.",
    "responsibilities": [
      "In a timely fashion, completes research and draft responses to constituents letters on federal matters",
      "Formulates legislative initiatives for assigned issue areas including deceiving legislative plans, drafting the plan into legislative form, coordinating the support and advancement of the plan with personal office, Committee office, other Member offices and outside stakeholders.",
      "Tracks legislation and other developments in his or her assigned issue areas and briefs the Member for floor work, committee work, and work in the district",
      "Plans and coordinates co-sponsorship and support of other legislation recommendations in coordination with the Legislative Director",
      "Monitors legislation on the House floor and makes vote recommendations in coordination with the Legislative Director",
      "Ability to work cooperatively and courteously with others",
      "Maintains a good working relationship with the Congressman, staff and constituents",
      "Accepts performance based criticism and direction",
      "Meets attendance requirements as established by the office",
      "Works well under pressure and handles stress",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Excellent organizational and proofreading skills",
      "Ability to perform essential job functions above",
      "Professional telephone manner",
      "Ability to work cooperatively and courteously with others",
      "Knowledge of office policies, practices, and procedures",
      "Knowledge of office computer applications"
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and two writing samples to Kevin.Spicer@mail.house.gov with “Military Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Kevin.Spicer@mail.house.gov",
    "equal_opportunity": "Minority and veteran candidates are encouraged to apply."
  },
  {
    "id": "MEM-444-23",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space, and Technology",
    "location": "Capitol Hill",
    "posting_date": "2023-09-11",
    "description": "Ranking Member Zoe Lofgren of the House Committee on Science, Space, and Technology seeks to fill Professional Staff Member position on the Committee.\n\nDuties include oversight of the Department of Energy (DOE) and other agencies within the Committee's jurisdiction, outreach to stakeholder groups, researching and drafting legislation, staffing hearings, and preparing memoranda, statements, and speeches for Democratic Members. Applicants should have experience in at least one or both of the following subject matter areas: 1) science and energy research and technology development activities carried out by DOE, 2) energy and related environmental policy.\n\nAll applicants should possess strong writing, organizational, and communication skills; the capacity to articulate technical and policy issues clearly and concisely; and the ability to meet tight deadlines. The ideal candidate will have significant Capitol Hill or relevant government or industry experience. An advanced degree or technical background is a plus, but not required.",
    "responsibilities": [
      "Oversight of the Department of Energy (DOE) and other agencies within the Committee's jurisdiction",
      "Outreach to stakeholder groups",
      "Researching and drafting legislation",
      "Staffing hearings",
      "Preparing memoranda, statements, and speeches for Democratic Members"
    ],
    "qualifications": [
      "Experience in at least one or both of the following subject matter areas:",
      "Science and energy research and technology development activities carried out by DOE",
      "Energy and related environmental policy",
      "Strong writing, organizational, and communication skills",
      "Capacity to articulate technical and policy issues clearly and concisely",
      "Ability to meet tight deadlines",
      "Significant Capitol Hill or relevant government or industry experience (ideal candidate)",
      "Advanced degree or technical background (a plus, but not required)"
    ],
    "how_to_apply": "Please send a cover letter and resume to SciResumes@mail.house.gov. This not an entry-level position.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-443-23",
    "position_title": "Special Assistant",
    "office": "Representative Elissa Slotkin",
    "location": "Lansing, Michigan",
    "posting_date": "2023-09-11",
    "description": "The Special Assistant will report to the District Director.",
    "responsibilities": [
      "Managing all Michigan scheduling for Representative Slotkin, coordinating closely with the Washington, DC-based Director of Operations;",
      "Staffing Representative Slotkin as appropriate;",
      "Assisting the District Office leadership team with general office management and special projects;",
      "Representing the Office of Representative Slotkin at some community events in the Lansing area;",
      "Additional projects as assigned by the District Office leadership team."
    ],
    "qualifications": [
      "Candidates should be college graduates and have a strong desire to learn how Congress works by joining a dynamic office. Ideal candidates are:",
      "Experienced in scheduling and/or directly supporting a senior leader;",
      "Hardworking and detail-oriented self-starters;",
      "Team players, able to work both collaboratively and individually;",
      "Excellent oral and written communicators;",
      "Able to produce high quality work in a fast-paced environment under tight deadlines;",
      "Enthusiastic, collegial, and professional."
    ],
    "how_to_apply": "Interested candidates should submit a resume with two professional references, a cover letter, and one writing sample of 1,000 words to jobs.mi07@mail.house.gov.",
    "salary_info": null,
    "contact": "jobs.mi07@mail.house.gov",
    "equal_opportunity": "The Office of U.S. Representative Elissa Slotkin is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-442-23",
    "position_title": "Chief of Staff",
    "office": "Southern California Democrat",
    "location": "Washington DC",
    "posting_date": "2023-09-11",
    "description": "The Chief of Staff will work with the Member to determine the overall strategies of the office. This includes, but is not limited to, formulating policy positions, overseeing the office’s legislative and media relations strategies, and collaborating with District staff on important local outreach and communication efforts.\n\nIn addition, the Chief of Staff will provide leadership and guidance to structure the office to provide outstanding constituent relations.\n\nThe Chief of Staff will also oversee all recruiting and hiring efforts, the establishment of office policies and procedures, and perform other critical functions to support legislative and administrative operations and advocacies.\n\nFinally, the Chief of Staff will have direct supervision over the Legislative Director, Communications Director, District Director, and Scheduler.\n\nThe position requires the ability to multi-task, work well under pressure and the flexibility to work long hours, including nights and weekends. Strong managerial skills, strategic thinking, mission driven passion, and ties to Southern California are preferred.\n\nThis is NOT an entry-level position.\nNo phone calls, drop-ins or faxes.",
    "responsibilities": [
      "Work with the Member to determine the overall strategies of the office",
      "Formulating policy positions",
      "Overseeing the office’s legislative and media relations strategies",
      "Collaborating with District staff on important local outreach and communication efforts",
      "Provide leadership and guidance to structure the office to provide outstanding constituent relations",
      "Oversee all recruiting and hiring efforts",
      "Establishment of office policies and procedures",
      "Perform other critical functions to support legislative and administrative operations and advocacies",
      "Direct supervision over the Legislative Director, Communications Director, District Director, and Scheduler"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Ability to work well under pressure",
      "Flexibility to work long hours, including nights and weekends",
      "Strong managerial skills preferred",
      "Strategic thinking preferred",
      "Mission driven passion preferred",
      "Ties to Southern California are preferred"
    ],
    "how_to_apply": "To apply for the Chief of Staff position, please send cover letter and resume to CARuizJobs@mail.house.gov with “Chief of Staff” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "CARuizJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-438-23",
    "position_title": "Legislative Correspondent",
    "office": "The Office of Congresswoman Katie Porter",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "The Office of Congresswoman Katie Porter seeks a legislative correspondent to respond to constituent inquiries, provide constituents with written updates on policy developments, administer the office’s legislative systems and processes, and develop original legislative and oversight work.\n\nThe ideal candidate will have at least two years of relevant professional experience, a strong understanding of congressional processes and procedures, and a sharp attention to detail. The salary for this position is $55,000 to $60,000.",
    "responsibilities": [
      "Organize incoming and outgoing mail and communicate progress in responding to messages through regular reports to the Member of Congress and staff.",
      "Organize and distribute messages to legislative and district staff to complete personal responses to individual constituents when appropriate.",
      "Draft and edit form letters to respond to constituent concerns and respond personally to constituent messages when appropriate.",
      "Develop proactive correspondence to communicate policy developments to constituents.",
      "Track all legislative requests and accomplishments and organize legislative systems and processes.",
      "Take in person and virtual meetings with constituents and stakeholder groups.",
      "Support the office with drafting and editing memos, oversight letters, op-eds, talking points, speeches, and legislation.",
      "Provide other legislative and administrative support and complete duties as assigned by the Deputy Chief of Staff & Legislative Director and Chief of Staff."
    ],
    "qualifications": [
      "at least two years of relevant professional experience",
      "a strong understanding of congressional processes and procedures",
      "a sharp attention to detail"
    ],
    "how_to_apply": "To apply, send a resume and a short writing sample to CA47.Resumes@mail.house.gov with “Legislative Correspondent” in the subject line. Applications will be accepted until the position is filled.",
    "salary_info": "$55,000 to $60,000",
    "contact": "CA47.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, ethnicity, color, religion, sex, national origin, age, family status, military status, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-435-23",
    "position_title": "Senior Legislative Assistant",
    "office": "The Office of Congresswoman Barbara Lee",
    "location": "Washington, DC",
    "posting_date": "2023-09-11",
    "description": "The Office of Congresswoman Barbara Lee - a senior progressive appropriator and member of House leadership - seeks an experienced, highly-motivated Senior Legislative Assistant.\n\nThe Senior LA will be responsible for handling the following issues areas and caucuses, with some flexibility: LHHSED Approps Subcommittee and issues (Health, Labor, Education), Ag Approps Subcommittee and issues,CAPAC Health Task Force, Health Equity and Accountability Act, HIV Caucus, CBC Domestic Health Task Force, Sickle Cell Caucus, Poverty Task Force\n\nThe Senior Legislative Assistant will be responsible for jumping in to handle Farm Bill priorities amid ongoing negotiations and will ideally overlap with the outgoing Sr. Legislative Assistant for 1-2 weeks in late August/early September.",
    "responsibilities": [
      "Drafting and advancing legislative proposals",
      "Preparing the Member for hearings and markups",
      "Meeting with stakeholders and constituents",
      "Providing vote recommendations",
      "Performing additional tasks as assigned"
    ],
    "qualifications": [
      "Experience in health policy and ideally additional issue areas",
      "Hill experience",
      "Strong writing and analytical skills",
      "Ability to operate with grace and humor in a fast-paced environment",
      "Experience in an Appropriator office (advantage)",
      "Ties to California (advantage)",
      "Advanced education (advantage)",
      "Prior experience as a Legislative Assistant is required for the Senior title.",
      "This is not an entry-level position."
    ],
    "how_to_apply": "Applicants should email a cover letter, resume, one writing sample, and three references to Lee.resumes@mail.house.gov with “Sr. Legislative Assistant – [Last Name]” as the subject line.",
    "salary_info": "Starting salary is $85,000 for Senior Legislative Assistants",
    "contact": "Lee.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal-opportunity employer. We do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-433-23",
    "position_title": "Scheduler",
    "office": "Rep. Josh Gottheimer",
    "location": "DC",
    "posting_date": "2023-09-11",
    "description": "Rep. Josh Gottheimer seeks qualified candidates for the position of Scheduler in\nhis DC office.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term District schedule.",
      "Supporting the operations team across DC and District needs.",
      "Working with a variety of stakeholders to balance the Member’s time between\ncommitments.",
      "Working with the scheduling team to evaluate incoming requests and invitations.",
      "Working with the operations team to ensure that briefing materials are provided\nfor each event and meeting.",
      "Coordinating travel arrangements.",
      "Assisting with office management responsibilities, and performing other duties\nas required."
    ],
    "qualifications": [
      "Experience in a Congressional office, on a political campaign, or in another fastpaced administrative environment, with a strong preference for past\nCongressional experience.",
      "Excellent attention to detail, and strong organizational skills.",
      "Sound judgment.",
      "Strong communication skills.",
      "The ability to anticipate challenges and proactively offer solutions.",
      "The ability to thrive in a fast-paced environment.",
      "The ability to work flexible hours including weekends and evenings."
    ],
    "how_to_apply": "Please send a resume and\ncover letter with “Scheduler - Last Name” as the subject line\nto NJ5Jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, and\nLGBTQ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-354-23",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": "Washington, D.C.",
    "posting_date": "2023-09-11",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-305-23",
    "position_title": "DPCC COMMUNICATIONS DIRECTOR",
    "office": "House Democratic Policy and Communications Committee",
    "location": "Capitol Hill",
    "posting_date": "2023-09-11",
    "description": "The House Democratic Policy and Communications Committee seeks an experienced Communications Director.\n\nThe Communications Director will work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats; create messaging guidance, event suggestions, sample releases, and other communications tools; help Democratic offices pitch stories, hold strong local press events, and position Members in the media; and assist in bolstering paid communications programs in Democratic offices.\n\nThe Communications Director is also expected to assist with the planning and execution of regular DPCC message meetings and policy dinners; support DPCC outreach initiatives; and assist with daily tasks and long-term planning. Spanish language fluency and experience with constituency media is strongly preferred.\n\nThis is not an entry-level position; a strong background in communications on Capitol Hill is required. DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply.",
    "responsibilities": [
      "Work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats",
      "Create messaging guidance, event suggestions, sample releases, and other communications tools",
      "Help Democratic offices pitch stories, hold strong local press events, and position Members in the media",
      "Assist in bolstering paid communications programs in Democratic offices",
      "Assist with the planning and execution of regular DPCC message meetings and policy dinners",
      "Support DPCC outreach initiatives",
      "Assist with daily tasks and long-term planning"
    ],
    "qualifications": [
      "Strong background in communications on Capitol Hill is required",
      "Spanish language fluency and experience with constituency media is strongly preferred"
    ],
    "how_to_apply": "To apply, please email jobs.DPCC@mail.house.gov with the following application materials attached as one combined PDF: 1. Cover letter; 2. Resume; 3. Two writing samples, with one coming from work on Capitol Hill; and 4. Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without contacting you first).",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-300-23",
    "position_title": "Legislative Director",
    "office": "Congressman Steven Horsford (NV-O4)",
    "location": "Capitol Hill",
    "posting_date": "2023-09-11",
    "description": "Congressman Steven Horsford (NV-O4) seeks a highly motivated, hard-working, skilled and experienced Legislative Director to help shape and manage a robust legislative portfolio.\n\nCongressman Horsford is a member of the Armed Services and Financial Services Committees, Chair of the Congressional Black Caucus, and an active frontline member. Previous legislative experience on Capitol Hill is required, and Nevada ties are a plus.\n\nIdeal candidates will have experience managing and mentoring staff, thinking strategically and will possess a sophisticated understanding of the legislative process, along with excellent writing, organizational and time management skills.\n\nThe ideal candidate will primarily be responsible for managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues.\n\nCandidates should be creative, proactive and self-motivated, and have an ability to operate effectively under pressure and work closely in a team atmosphere in this fast-moving, dynamic office.",
    "responsibilities": [
      "Managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues."
    ],
    "qualifications": [
      "Previous legislative experience on Capitol Hill is required",
      "Nevada ties are a plus",
      "Experience managing and mentoring staff",
      "Thinking strategically",
      "Sophisticated understanding of the legislative process",
      "Excellent writing, organizational and time management skills",
      "Creative, proactive and self-motivated",
      "Ability to operate effectively under pressure",
      "Ability to work closely in a team atmosphere"
    ],
    "how_to_apply": "Interested candidates must include a cover letter, resume, two page max writing sample and three professional references in a single PDF file.\nEmail submissions to the Director of Administration, Selena Harvey at nv04resumes@mail.house.gov. Subject line must read",
    "salary_info": "Salary is competitive and commensurate with experience, along with generous benefits and professional development opportunities.",
    "contact": {
      "name": "Selena Harvey",
      "email": "nv04resumes@mail.house.gov"
    },
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color and LGBTQAI+ candidates are strongly encouraged to apply, as are candidates with Nevada ties."
  },
  {
    "id": "MEM-NV04-23",
    "position_title": "Legislative Director",
    "office": "MEM-NV04",
    "location": null,
    "posting_date": "2023-09-11",
    "description": null,
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "last name\". No calls please. Individuals selected for an interview will be contacted.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-276-23",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Majority Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-09-11",
    "description": "Provides administrative, legislative, and research support to Subcommittee staff, and assists with duties as assigned.",
    "responsibilities": [
      "Answering the telephone and responding to caller inquiries",
      "Reviewing incoming mail and preparation of correspondence",
      "Maintaining Subcommittee archive, activities report, and relevant publications",
      "Assisting with full Committee hearings on matters within Subcommittee jurisdiction",
      "Maintaining the Subcommittee’s outstanding deliverable requests made to the Department of Veterans Affairs (VA)",
      "Determining and tracking the status of pending legislation",
      "Reviewing the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to subcommittee Members and staff",
      "Participating in staff-level negotiations, to include knowledge of background information on legislation being considered",
      "Assisting Subcommittee staff in organization of, and preparation for, hearings, to include determination of Majority agenda, briefing of Members, and development of questions",
      "Conducting meetings with VA, veteran service organizations or other scheduled parties",
      "Drafting remarks for Chairman and suggested questions for hearings",
      "Preparation of memorandums for the full Committee and Subcommittee Chairman on matters under the jurisdiction of the Subcommittee",
      "Research preparation of hearings by reviewing previous hearing transcripts, relevant statutes, and VA policy",
      "Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; and assist other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "Work, internship, or other experience in a professional environment"
    ],
    "how_to_apply": "Qualified candidates please send their cover letter, resume, and three writing samples to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  }
]