[
  {
    "id": "MEM-023-18",
    "position_title": "Legislative Director",
    "office": "Rep. Anthony Brown (MD-04)",
    "location": "Hill",
    "posting_date": "2018-01-16",
    "description": "Primary responsibilities include developing, implementing and successfully advancing the office’s legislative agenda while handling policy portfolio in a fast-paced office. If you enjoy working in a fast-paced, multi-tasking, deadline-oriented dynamic environment, then you should apply. JD or advanced degree in policy and Maryland ties are a plus.",
    "responsibilities": [
      "Developing, implementing and successfully advancing the office’s legislative agenda",
      "Handling policy portfolio in a fast-paced office"
    ],
    "qualifications": [
      "Significant Hill experience",
      "Previous managerial experience",
      "Strong organizational skills",
      "Knowledge of legislative procedure"
    ],
    "how_to_apply": "Please send cover letter and resume to: md.jobposting@mail.house.gov with “Legislative Director” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "md.jobposting@mail.house.gov",
    "equal_opportunity": "Women and minority applicants encouraged to apply."
  },
  {
    "id": "MEM-019-18",
    "position_title": "Deputy Press Secretary/Digital Manager",
    "office": "Maryland Democratic Congressman",
    "location": "Washington, DC",
    "posting_date": "2018-01-16",
    "description": "Responsibilities include managing social media channels and sharpening Congressman's digital voice; planning and pitching press events and responding to press inquiries; compiling press clips and media monitoring; writing press advisories, releases and speeches; updating website; taking photographs and making compelling graphics and multimedia content; and helping to develop and execute overall communication strategies.\n\nIdeal candidate will have strong written and verbal skills, be able to work demanding hours in a fast-paced environment, take initiative and display creativity, work well with a team and multi-task, be detail oriented and organized, and have a positive attitude and a sense of humor. Maryland ties, previous congressional or campaign experience, and photography and graphic design skills preferred.",
    "responsibilities": [
      "Managing social media channels and sharpening Congressman's digital voice",
      "Planning and pitching press events and responding to press inquiries",
      "Compiling press clips and media monitoring",
      "Writing press advisories, releases and speeches",
      "Updating website",
      "Taking photographs and making compelling graphics and multimedia content",
      "Helping to develop and execute overall communication strategies"
    ],
    "qualifications": [
      "Strong written and verbal skills",
      "Ability to work demanding hours in a fast-paced environment",
      "Take initiative and display creativity",
      "Work well with a team and multi-task",
      "Be detail oriented and organized",
      "Positive attitude and a sense of humor",
      "Maryland ties (preferred)",
      "Previous congressional or campaign experience (preferred)",
      "Photography and graphic design skills (preferred)"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter describing their fit for the role, resume and if available writing or multimedia samples to md.jobposting@mail.house.gov with “Deputy Press Secretary/Digital Manager” in the subject line. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "md.jobposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-018-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Congresswoman Tulsi Gabbard",
    "location": "Washington D.C.",
    "posting_date": "2018-01-16",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a Scheduler/Executive Assistant with strong organizational, communication, and writing skills.\n\nWe are seeking applicants to join our fun, team-oriented, and hard-working office. The ideal candidate will possess a can-do attitude, pay high attention to detail, and be solution oriented. He or she will also be an independent worker, a self-starter, and will possess the capacity to produce high quality work on short deadlines. He or she will also have a demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment.\n\nThis is not an entry level position. The selected applicant will be expected to operate in a fast-paced office and requires dedication and the ability to think outside the box. Opportunities to assist in other legislative areas are also available. Non-traditional work hours, occasional travel are required. Veteran applications are welcome!",
    "responsibilities": [
      "Maintaining the Member’s schedule for the Washington D.C. office",
      "Organizing, evaluating and tracking invitations and scheduling requests",
      "Coordinating travel arrangements",
      "Coordinating/drafting the Member’s personal correspondence",
      "Arranging and/or providing surface transportation for the Member in DC",
      "Coordinating with staff",
      "Other tasks as assigned by the Chief of Staff"
    ],
    "qualifications": [
      "Strong organizational skills",
      "Strong communication skills",
      "Strong writing skills",
      "Can-do attitude",
      "High attention to detail",
      "Solution oriented",
      "Independent worker",
      "Self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment"
    ],
    "how_to_apply": "Please do not call or drop by to the office, qualified applicants may email a cover letter, resume and two writing samples with “Scheduler” in the email title to:",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-18",
    "position_title": "Constituent Engagement Officer (CEO)",
    "office": "Maryland Democratic Congressman",
    "location": "DC suburbs",
    "posting_date": "2018-01-16",
    "description": "Maryland Democratic Congressman looking for Constituent Engagement Officer (CEO) to serve as the grassroots extension of the member in his district located in the DC suburbs. They are his “eye and ears” for issues on the ground. They are a consistent presence at events in the district, develops and maintains relationships with local government officials and community leaders. They always reflect well on the member with their responsiveness, professionalism and courteousness. CEOs also provide excellent constituent service through the management of casework in assigned issue areas and work with federal and local agencies to ensure constituents receive a response to their inquiry. They may also be assigned to short-term or special projects, including planning events, authoring correspondence and other related duties. CEOs are hard-working and dedicated team players, committed to the goals of the office and to improving the lives of the residents of the district.",
    "responsibilities": [
      "to serve as a local representative for the member in defined geographic areas, which are subject to change based on the needs of the office;",
      "to manage casework within an assigned portfolio;",
      "to monitor and update the Member and District Director on district and local issues;"
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should submit their resume as soon as possible to md.jobposting@mail.house.gov. Applications are accepted on a rolling basis.",
    "salary_info": null,
    "contact": "md.jobposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-014-18",
    "position_title": "Press Assistant",
    "office": "Southern California Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2018-01-16",
    "description": "Southern California Democrat is seeking a Press Assistant to work closely with the Communications Director to elevate the Member’s communications operation.\n\nDuties will include compiling daily press clips, monitoring social media, producing graphics and videos, maintaining the website, managing press lists, meticulously proofreading, and drafting/fact-checking written materials, including briefing memos, social media posts, press statements, newsletters, and talking points.\n\nThe ideal candidate will be organized, detail-oriented, have superior writing and proofreading skills, be able to work long hours in a fast-paced and demanding setting, exhibit situational awareness and discretion, have the ability to multi-task without sacrificing quality, work well with a team, be proactive yet humble, and have a sense of humor. Spanish fluency, Southern California ties, previous congressional or campaign experience, and photography/videography/graphic design skills preferred.",
    "responsibilities": [
      "Compiling daily press clips",
      "Monitoring social media",
      "Producing graphics and videos",
      "Maintaining the website",
      "Managing press lists",
      "Meticulously proofreading",
      "Drafting/fact-checking written materials, including briefing memos, social media posts, press statements, newsletters, and talking points"
    ],
    "qualifications": [
      "Organized",
      "Detail-oriented",
      "Superior writing and proofreading skills",
      "Able to work long hours in a fast-paced and demanding setting",
      "Exhibit situational awareness and discretion",
      "Ability to multi-task without sacrificing quality",
      "Work well with a team",
      "Proactive yet humble",
      "Sense of humor",
      "Spanish fluency (preferred)",
      "Southern California ties (preferred)",
      "Previous congressional or campaign experience (preferred)",
      "Photography/videography/graphic design skills (preferred)"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter describing their fit for the role, resume, short writing sample, and if available, graphic/video samples, to CA26PressJob@gmail.com with just “Press Assistant\" in the subject line. No phone calls, faxes, or drop-ins, please.",
    "salary_info": null,
    "contact": "CA26PressJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-013-18",
    "position_title": "Legislative Correspondent",
    "office": "Conservative southeastern office",
    "location": "Capitol Hill",
    "posting_date": "2018-01-16",
    "description": "Responsibilities include a small issue portfolio, responding to constituent mail, overseeing a top-tier 499 program, maintaining organization and records for legislative team, as well as hiring and training interns.",
    "responsibilities": [
      "Small issue portfolio",
      "Responding to constituent mail",
      "Overseeing a top-tier 499 program",
      "Maintaining organization and records for legislative team",
      "Hiring and training interns"
    ],
    "qualifications": [
      "Need not have Hill experience",
      "Demonstrate reasonable knowledge of public policy and movement conservative philosophy",
      "Excellence in writing",
      "Skillful argument development",
      "Commitment to achievement on Capitol Hill"
    ],
    "how_to_apply": "Send resume and various writing samples to southeastcongress2018@gmail.com.",
    "salary_info": null,
    "contact": "southeastcongress2018@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-008-18",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Homeland Security",
    "location": null,
    "posting_date": "2018-01-16",
    "description": "The Majority staff of the House Committee on Homeland Security is seeking a Professional Staff Member.",
    "responsibilities": [],
    "qualifications": [
      "Extensive knowledge of the Department of Homeland Security including, but not limited to:",
      {
        "Acquisition and procurement policy and practices": null
      },
      {
        "Financial and Information technology management": null
      },
      {
        "Departmental workforce": null
      }
    ],
    "how_to_apply": "Please email a resume and writing sample to resumes.CHS@mail.house.gov.",
    "salary_info": null,
    "contact": "resumes.CHS@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-003-18",
    "position_title": "Caseworker",
    "office": "Congressman Ted Lieu",
    "location": "Los Angeles District Office",
    "posting_date": "2018-01-16",
    "description": "Congressman Ted Lieu has an immediate opening for a Caseworker in his\nLos Angeles District Office. Primary responsibilities include assisting\nconstituents with federal casework, assisting the Casework Supervisor with\ncasework outreach, intake and processing. The Caseworker would also attend\ncommunity events and conduct casework outreach directly with constituents.\nCaseworkers meet frequently with constituents and liaise with federal\nagencies, and help organize outreach events for the Congressman’s office.\n\nThe successful applicant should have experience working on federal\ncasework, must have a positive attitude and the ability to work and set\npriorities in a fast-paced and challenging environment. Strong writing and\nverbal communications skills are essential. At least one year of experience\nworking for an elected official or community-based organization is strongly\npreferred. A valid California Driver License and automobile are required.\nBilingual skills are a plus.\n\nThe position is full-time with federal benefits. Congressman Lieu’s primary\ndistrict office is located in Central Los Angeles.",
    "responsibilities": [
      "Assisting constituents with federal casework",
      "Assisting the Casework Supervisor with casework outreach, intake and processing",
      "Attending community events and conduct casework outreach directly with constituents",
      "Meet frequently with constituents and liaise with federal agencies",
      "Help organize outreach events for the Congressman’s office"
    ],
    "qualifications": [
      "Experience working on federal casework",
      "Positive attitude and the ability to work and set priorities in a fast-paced and challenging environment",
      "Strong writing and verbal communications skills",
      "At least one year of experience working for an elected official or community-based organization is strongly preferred",
      "Valid California Driver License and automobile are required",
      "Bilingual skills are a plus"
    ],
    "how_to_apply": "If interested, please send a resume, cover letter, and two short writing samples no later than January 15, 2018 to:",
    "salary_info": null,
    "contact": {
      "name": "NICOLAS RODRIQUEZ",
      "title": "District Director",
      "address": "Congressman Ted Lieu (CA-33)\n5055 Wilshire Blvd., Suite 310\nLos Angeles, CA 90036",
      "email": "Lieu.Staff@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-001-18",
    "position_title": "Communications Director",
    "office": "Texas Democrat",
    "location": null,
    "posting_date": "2018-01-16",
    "description": "Texas Democrat is seeking an experienced Communications Director to plan and execute a proactive and aggressive media and community outreach strategy. Candidates should have excellent writing skills and work well in a fast-paced collaborative environment. Applicant should also have an extensive social media background. Texas ties and knowledge of TX media and political landscape are a plus and management experience is preferred. This is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified applicants should submit a resume, cover letter, and two writing samples, including a press release to TXResumeInbox@mail.house.gov.",
    "salary_info": null,
    "contact": "TXResumeInbox@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-17",
    "position_title": "Legislative Director",
    "office": "House member and Committee Ranking Member",
    "location": "Capitol Hill",
    "posting_date": "2018-01-16",
    "description": "Primary responsibilities include developing policy and legislative initiatives and advising Member on all legislative issues. Position will manage long-term and short-term legislative planning; monitor legislative activity on the House floor; supervise all legislative staff in the personal office; ensure effective coordination between the personal office and committee office; and assist with hearing preparation as needed. Position will also manage health policy portfolio. The successful candidate will be a results-oriented problem solver and have a proven track record of developing and advancing legislation. Excellent oral and written communication skills, time-management skills, and the ability to quickly analyze and summarize complex legislative details are essential. Advanced degree and extensive experience on Capitol Hill are required.",
    "responsibilities": [
      "Developing policy and legislative initiatives",
      "Advising Member on all legislative issues",
      "Managing long-term and short-term legislative planning",
      "Monitoring legislative activity on the House floor",
      "Supervising all legislative staff in the personal office",
      "Ensuring effective coordination between the personal office and committee office",
      "Assisting with hearing preparation as needed",
      "Managing health policy portfolio"
    ],
    "qualifications": [
      "Results-oriented problem solver",
      "Proven track record of developing and advancing legislation",
      "Excellent oral and written communication skills",
      "Time-management skills",
      "Ability to quickly analyze and summarize complex legislative details",
      "Advanced degree",
      "Extensive experience on Capitol Hill"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter and resume with the words “Legislative Director” in the subject line to job_09@live.com. Please paste the cover letter and resume directly in the body of the email.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-511-17",
    "position_title": "Clerk",
    "office": "Committee on Natural Resources’ Subcommittee on Oversight and Investigations",
    "location": null,
    "posting_date": "2018-01-16",
    "description": "The Committee on Natural Resources’ Subcommittee on Oversight and Investigations is seeking to fill a Clerk position on the majority staff. The ideal candidate should have a strong interest in investigations and natural resources issues.",
    "responsibilities": [
      "Staffing Subcommittee hearings as well as some Full Committee hearings",
      "Sending and receiving Subcommittee correspondence to and from the Executive Branch as well as with outside organizations",
      "Managing the Subcommittee’s administrative needs"
    ],
    "qualifications": [
      "Strong work ethic",
      "Attention to detail",
      "Desire to learn how to conduct congressional oversight and investigations",
      "Self-motivated",
      "Prior Hill experience preferred, but not required"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to NaturalResources.Jobs@mail.house.gov, with “O&I Clerk” in the subject line.",
    "salary_info": null,
    "contact": "NaturalResources.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-507-17",
    "position_title": "Senior Legislative Aide",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington, D.C.",
    "posting_date": "2018-01-16",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a senior legislative aide with a minimum of three years of Hill experience. This is not an entry level position. Excellent written and oral communication skills required. Advanced degree a plus. Spanish ability a plus.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of three years of Hill experience",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use title on your email: Senior LA Position. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-316-17",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2018-01-16",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives, and Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff. The ideal candidate will be a junior attorney (fewer than five years of experience) with a background or strong interest in investigations.\nResponsibilities include depositions, transcribed interviews, briefings, and congressional hearings. Candidates with diverse backgrounds and experiences are strongly encouraged to apply. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Junior attorney (fewer than five years of experience)",
      "Background or strong interest in investigations",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  }
]