[
  {
    "id": "MEM-448-17",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Tulsi Gabbard’s Oahu district office",
    "location": "Oahu",
    "posting_date": "2017-11-13",
    "description": "Job responsibilities include fielding constituent calls, processing mail, coordinating internship program, assisting with casework and constituent requests for information, maintaining a photographic database, drafting correspondence, maintaining office equipment, and other administrative duties. In addition, the staff assistant occasionally represents Congresswoman Gabbard at community events.",
    "responsibilities": [
      "Fielding constituent calls",
      "Processing mail",
      "Coordinating internship program",
      "Assisting with casework and constituent requests for information",
      "Maintaining a photographic database",
      "Drafting correspondence",
      "Maintaining office equipment",
      "Other administrative duties",
      "Occasionally represents Congresswoman Gabbard at community events"
    ],
    "qualifications": [
      "Strong ties to the state",
      "Organizational skills"
    ],
    "how_to_apply": "To apply for the position, please e-mail your cover letter, resume, two writing samples and contact information for three work references to hi02jobs@gmail.com with the subject line \"STAFF ASSISTANT.\" No calls or “walk-ins” please.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-447-17",
    "position_title": "Military and Veterans Liaison and Caseworker",
    "office": "Congresswoman Tulsi Gabbard",
    "location": null,
    "posting_date": "2017-11-13",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a Military and Veterans\nLiaison and Caseworker with strong organizational and communication\nskills.\n\nThe liaison/caseworker is responsible for helping constituents resolve issues\nand navigate the services provided by the federal government. This person\nmanages constituent casework, and participates in community projects and\nevents. Responsibilities include monitoring and updating the Congresswoman\nand Chief of Staff on district and local issues, and acts as a liaison to federal\nand local agencies for the Congresswoman for the following issue areas:\nDepartment of Defense/Military, Homeland Security (Military-related)\nincluding U.S. Coast Guard, Intelligence, Veterans, Foreign Affairs,\nFAA, and FEMA/Disaster Management.\n\nThe ideal candidate will possess a can-do attitude and is solutions oriented.\nHe or she will also be a self-starter and will possess the capacity to produce\nquality work on short deadlines. He or she will also have a demonstrated\nability to communicate effectively with colleagues in a dynamic work\nenvironment.\n\nThe selected applicant will be expected to thrive in a fast-paced office, with\nthe ability to pay close attention to detail and think creatively to find\nsolutions. Non-traditional work hours, and occasional travel are required.\nVeteran applications are welcome!",
    "responsibilities": [
      "Helping constituents resolve issues and navigate the services provided by the federal government.",
      "Managing constituent casework.",
      "Participating in community projects and events.",
      "Monitoring and updating the Congresswoman and Chief of Staff on district and local issues.",
      "Acts as a liaison to federal and local agencies for the Congresswoman for the following issue areas: Department of Defense/Military, Homeland Security (Military-related) including U.S. Coast Guard, Intelligence, Veterans, Foreign Affairs, FAA, and FEMA/Disaster Management."
    ],
    "qualifications": [
      "Strong organizational and communication skills.",
      "Can-do attitude and solutions oriented.",
      "Self-starter.",
      "Capacity to produce quality work on short deadlines.",
      "Demonstrated ability to communicate effectively with colleagues in a dynamic work environment.",
      "Ability to thrive in a fast-paced office.",
      "Ability to pay close attention to detail and think creatively to find solutions."
    ],
    "how_to_apply": "Please do not call or drop by the office, qualified applicants may email a cover letter, resume and two writing samples with “Military Liaison” in the email title to: hi02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-17",
    "position_title": "Scheduler/Executive Assistant",
    "office": "New Mexico Democrat and CHC Chairwoman",
    "location": "Washington, DC",
    "posting_date": "2017-11-13",
    "description": "Responsibilities include maintaining the Member’s daily and long-term schedules, processing all incoming invitations and meeting requests, coordinating travel arrangements, and communicating with constituents by phone and email to address requests, concerns, and questions. The ideal candidate will be detail-oriented and extremely well-organized. Applicants should have previous scheduling experience (at least one year in a similar position).\n\nResponsibilities also include driving the member (including nights and some weekends). Responsibilities include greeting visitors, answering phones, opening the office, and general assistance to the DC office staff. This position is also responsible for backing up the Staff Assistant and assisting office with administrative duties. New Mexico ties and a sense of humor are a plus. Previous scheduling experience is important.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedules",
      "Processing all incoming invitations and meeting requests",
      "Coordinating travel arrangements",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Driving the member (including nights and some weekends)",
      "Greeting visitors",
      "Answering phones",
      "Opening the office",
      "General assistance to the DC office staff",
      "Backing up the Staff Assistant",
      "Assisting office with administrative duties"
    ],
    "qualifications": [
      "Detail-oriented",
      "Extremely well-organized",
      "Previous scheduling experience (at least one year in a similar position)",
      "New Mexico ties and a sense of humor are a plus",
      "Previous scheduling experience is important"
    ],
    "how_to_apply": "To apply, please submit resume, cover letter and three references to NM01.Resumes@mail.house.gov with “Scheduler/Executive Assistant” in the subject line. Please submit all application materials in one pdf. No phone calls please.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-426-17",
    "position_title": "Health Legislative Assistant",
    "office": "A Midwest Republican",
    "location": "Capitol Hill",
    "posting_date": "2017-11-13",
    "description": "A Midwest Republican is accepting resumes for a Health Legislative Assistant to coordinate the Member’s legislative agenda (with the LD) and oversee health and other issues that fit with the applicants skills and interest.",
    "responsibilities": [],
    "qualifications": [
      "At least three years’ legislative experience on Capitol Hill",
      "A track record of passing legislation",
      "Knowledge of health care systems and laws",
      "Excellent interpersonal and organizational skills",
      "Initiative",
      "Top-notch written and oral skills",
      "An economics background is a plus"
    ],
    "how_to_apply": "Qualified candidates should send a resume with Health Care LA in the subject line and include a cover letter and resume to Congressional.Vacancy@mail.house.gov.",
    "salary_info": null,
    "contact": "Congressional.Vacancy@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-409-17",
    "position_title": "Press Secretary",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2017-11-13",
    "description": "California Democrat seeks proactive, experienced Press Secretary to help\nlead an aggressive national communications operation. The ideal applicant\nwill have 4-6 years of experience creating and executing media plans as well\nas proven success confirming national cable TV interviews. Responsibilities\ninclude frequent pitching and reporter/producer engagement; social media\nplatform management; and drafting op-eds, releases and press materials. This\nrole demands creativity, excellent writing and editing skills, and poise under\npressure. This is not an entry level position. Diverse candidates are\nencouraged to apply.",
    "responsibilities": [
      "Frequent pitching and reporter/producer engagement",
      "Social media platform management",
      "Drafting op-eds, releases and press materials"
    ],
    "qualifications": [
      "4-6 years of experience creating and executing media plans",
      "Proven success confirming national cable TV interviews",
      "Creativity",
      "Excellent writing and editing skills",
      "Poise under pressure"
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter, and\ntwo writing samples with the subject line “Press Secretary” to\ncademhilljobs@gmail.com.",
    "salary_info": null,
    "contact": "cademhilljobs@gmail.com",
    "equal_opportunity": "Diverse candidates are\nencouraged to apply."
  },
  {
    "id": "MEM-397-17",
    "position_title": "Legislative Assistant",
    "office": "Midwestern Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2017-11-13",
    "description": "Midwestern Democratic Member is seeking an experienced legislative assistant to handle a portfolio including commerce, trade, labor, and other issues as assigned. Ideal candidate will have prior experience as a Legislative Assistant or otherwise managing commerce, trade, and labor policy. Candidate must be proficient at advancing legislation, analyzing and briefing on complex policy issues, and drafting a wide array of written materials. Strong written and verbal communication skills and a demonstrated ability to work collaboratively in a team environment are critical. This is not an entry level position and interns will not be considered. At least three years of Hill or other relevant professional experience is required.",
    "responsibilities": [
      "Handling a portfolio including commerce, trade, labor, and other issues as assigned.",
      "Advancing legislation.",
      "Analyzing and briefing on complex policy issues.",
      "Drafting a wide array of written materials.",
      "Work collaboratively in a team environment."
    ],
    "qualifications": [
      "Prior experience as a Legislative Assistant or otherwise managing commerce, trade, and labor policy.",
      "Proficient at advancing legislation, analyzing and briefing on complex policy issues, and drafting a wide array of written materials.",
      "Strong written and verbal communication skills.",
      "Demonstrated ability to work collaboratively in a team environment.",
      "At least three years of Hill or other relevant professional experience is required."
    ],
    "how_to_apply": "Applicants should email a resume, cover letter, and two writing samples to resume.la@mail.house.gov.",
    "salary_info": null,
    "contact": "resume.la@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-395-17",
    "position_title": "Caseworker",
    "office": "Congressman",
    "location": null,
    "posting_date": "2017-11-13",
    "description": "The Caseworker position acts as a liaison to federal, district, and local agencies for the Congressman and constituents and answers casework correspondence and verbal communications with constituents.\nThis position may require work on weekends and holidays.",
    "responsibilities": [
      "Acts as the representative for the Congressman answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Handles casework assignments;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Congressman;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Chief of Staff.",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Logs in all incoming telephone calls relating to casework;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Congressman, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Strong written, communication, analytical, and organization skills; an ability to relate well with individuals of diverse backgrounds; impeccable customer service manners.",
      "Bachelor’s degree required.",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point.",
      "Candidate must have an understanding of government agencies and structure (local, county, state and federal).",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines and balance multiple projects.",
      "Attention to detail and accuracy is essential.",
      "Candidate should demonstrate a positive attitude, commitment to excellence, upbeat demeanor and flexibility.",
      "Bilingual skills a plus."
    ],
    "how_to_apply": "All interested individuals should email a cover letter and resume to Gomez.CAjobs@mail.house.gov. No phone calls please.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "Gomez.CAjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-387-17",
    "position_title": "Communications Director",
    "office": "Congresswoman Tulsi Gabbard",
    "location": "Washington, DC",
    "posting_date": "2017-11-13",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a Communications\nDirector to manage and coordinate all media and public relations activities in\na very busy and dynamic office. The ideal candidate will be able to develop\nand execute integrated communications plans, collaborate effectively with\ncolleagues and implement all public relations strategies.\n\nThis is a senior level position which requires dedication, close attention to\ndetail and the ability to think outside the box. Non-traditional work\nhours, and travel to the District are to be expected. Hawaii ties are ideal but\nnot required. Veteran applications are welcome.",
    "responsibilities": [
      "Building and expanding the office’s relationships with media outlets",
      "Working with the Chief of Staff and Legislative Director to develop media strategies",
      "Successfully pitching stories and press events to a wide range of media outlets",
      "Responding to and managing media inquiries from diverse media outlets",
      "Writing op-eds, speeches, press releases, statements and talking points",
      "Working with the deputy communications director in the District Office",
      "Maintaining an active social media profile",
      "Managing the Member’s official website"
    ],
    "qualifications": [
      "Be able to thrive in a fast-paced office",
      "Have excellent written and oral communication skills",
      "Strong editing and proofreading abilities",
      "Be able to develop a keen understanding of the unique priorities and views of the district and find ways to advance the Member’s objectives"
    ],
    "how_to_apply": "Qualified applicants may email a cover letter, resume and writing samples to: hi02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-382-17",
    "position_title": "Legislative Assistant",
    "office": "Democratic Member of the House Foreign Affairs Committee",
    "location": "Capitol Hill",
    "posting_date": "2017-11-13",
    "description": "Democratic Member of the House Foreign Affairs Committee is seeking a skilled and experienced Legislative Assistant to handle foreign policy and related issues.",
    "responsibilities": [],
    "qualifications": [
      "Relevant Capitol Hill experience",
      "Excellent communications skills",
      "Background in foreign policy and/or an advanced degree",
      "Background in Asia policy a plus"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to LegislativeAssistant2017@gmail.com.",
    "salary_info": null,
    "contact": "LegislativeAssistant2017@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-316-17",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2017-11-13",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives, and Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff. The ideal candidate will be a junior attorney (fewer than five years of experience) with a background or strong interest in investigations.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  }
]