[
  {
    "id": "MEM-142-16",
    "position_title": "Caseworker",
    "office": "Congressman Raul Ruiz, M.D. of California",
    "location": "Palm Desert, California",
    "posting_date": "2016-02-16",
    "description": "Caseworkers in the Office of Congressman Ruiz assist constituents by navigating complex casework through federal agencies in areas such as veterans’ affairs, social security, housing, immigration. Caseworkers also assess casework and community activities for matters warranting legislative action.",
    "responsibilities": [
      "Assist constituents by navigating complex casework through federal agencies in areas such as veterans’ affairs, social security, housing, immigration.",
      "Assess casework and community activities for matters warranting legislative action."
    ],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Comfortable working both independently and as part of a team",
      "Prior experience working for federal, state, or local government is a plus",
      "Fluency or strong verbal and written proficiency in Spanish are strongly preferred",
      "Strong knowledge or connection with Riverside County and California’s 36th Congressional District is a plus",
      "Availability for evening and weekend assignments is required"
    ],
    "how_to_apply": "Interested candidates should send their resume and cover letter to Octavio.Gonzalez@mail.house.gov. Please write “Caseworker” in the subject line of your email message.\nPLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "Octavio.Gonzalez@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-141-16",
    "position_title": "Communications Director",
    "office": "North Carolina Democrat",
    "location": "DC",
    "posting_date": "2016-02-16",
    "description": "This person will be responsible for planning and executing a proactive and aggressive media and community outreach strategy. Candidates must have excellent writing skills, be creative, energetic, politically astute and able to work well in a fast-paced collaborative environment. It is preferred that candidates have prior on-the-record experience, have drafted all forms of communications materials--especially op-eds--and an ability to respond to challenging situations quickly and strategically. Candidates should have a track-record of successfully pitching both national and local media entities as well as existing relationships with DC reporters and producers.",
    "responsibilities": [
      "Serving as spokesperson",
      "Drafting press releases and advisories, op-eds, and talking points",
      "Managing a press secretary",
      "Responsible of implementing a strategic social media outreach"
    ],
    "qualifications": [
      "At least 2 years of experience",
      "Excellent writing skills",
      "Creative, energetic, politically astute",
      "Able to work well in a fast-paced collaborative environment",
      "Prior on-the-record experience (preferred)",
      "Experience drafting all forms of communications materials--especially op-eds (preferred)",
      "Ability to respond to challenging situations quickly and strategically (preferred)",
      "Track-record of successfully pitching both national and local media entities",
      "Existing relationships with DC reporters and producers",
      "North Carolina ties preferred"
    ],
    "how_to_apply": "Please send cover letter, resume and two writing samples (including a press release) to NCHouseJobs@gmail.com with Communications Director in subject line. No calls or drop ins.",
    "salary_info": null,
    "contact": "NCHouseJobs@gmail.com",
    "equal_opportunity": "The Office is an Equal Opportunity Employer and strongly values the diversity of its employees. We encourage women and people of color to apply."
  },
  {
    "id": "MEM-140-16",
    "position_title": "Legislative Assistant",
    "office": "Senior Democrat",
    "location": "Capitol Hill",
    "posting_date": "2016-02-16",
    "description": "Senior Democrat seeks a Legislative Assistant to handle a diverse portfolio of issues including science, technology, education, energy, and agriculture.\n\nStaffer must be able to handle multiple projects simultaneously in a demanding office environment; must have superior written and oral communications skills; and must be able to interface effectively with committee staff.\n\nThis is not an entry-level position and prior Capitol Hill experience either as a Legislative Correspondent or Legislative Assistant is required.",
    "responsibilities": [
      "Handle a diverse portfolio of issues including science, technology, education, energy, and agriculture.",
      "Handle multiple projects simultaneously.",
      "Interface effectively with committee staff."
    ],
    "qualifications": [
      "Superior written and oral communications skills",
      "Prior Capitol Hill experience either as a Legislative Correspondent or Legislative Assistant"
    ],
    "how_to_apply": "Please send resume with cover letter to txdemjobs@gmail.com. No phone calls or walk-ins will be considered.",
    "salary_info": null,
    "contact": "txdemjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-135-16",
    "position_title": "Staff Assistant/Scheduler",
    "office": "California Democrat",
    "location": "Washington, DC",
    "posting_date": "2016-05-16",
    "description": "California Democrat seeks a motivated, energetic, and detail-oriented Staff Assistant/Scheduler for the Washington, DC office. Responsibilities include coordinating and maintaining the Member’s schedule, front office duties, conducting Capitol tours, and greeting office visitors. Qualified applicants must be personable, dependable, and able to juggle multiple tasks with competing priorities. California ties and Spanish language proficiency strongly preferred.",
    "responsibilities": [
      "Coordinating and maintaining the Member’s schedule",
      "Front office duties",
      "Conducting Capitol tours",
      "Greeting office visitors"
    ],
    "qualifications": [
      "Personable",
      "Dependable",
      "Able to juggle multiple tasks with competing priorities",
      "California ties strongly preferred",
      "Spanish language proficiency strongly preferred"
    ],
    "how_to_apply": "To apply, please submit resume, cover letter, and a short writing sample to CADemOfficeJob@gmail.com.",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-133-16",
    "position_title": "Scheduler",
    "office": "Office of Rep. Justin Amash (R-MI)",
    "location": "Washington, DC",
    "posting_date": "2016-02-16",
    "description": "The Office of Rep. Justin Amash (R-MI) is seeking an energetic, detailoriented, and hard-working scheduler to join our Washington, DC-based team.\n\nThe scheduler will be responsible for managing—and ensuring the smooth execution of—all aspects of the member’s daily and long-term schedule, as well as providing related administrative support.\n\nThe successful applicant will be personable, organized, and committed to individual liberty, economic freedom, and the Constitution. He or she must demonstrate excellent communication skills and the ability to exercise sound, independent judgment. Individuals who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Managing all aspects of the member’s daily and long-term schedule",
      "Ensuring the smooth execution of the member’s daily and long-term schedule",
      "Providing related administrative support"
    ],
    "qualifications": [
      "Applicants must have a BA or equivalent.",
      "Hill experience is not required.",
      "Personable, organized, and committed to individual liberty, economic freedom, and the Constitution.",
      "Demonstrate excellent communication skills and the ability to exercise sound, independent judgment."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and writing sample to mi03.apply@gmail.com. Please include \"scheduler applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-132-16",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D)",
    "location": "Hill",
    "posting_date": "2016-02-16",
    "description": "U.S. Rep. Lloyd Doggett (D) seeks Legislative Assistant to cover immigration and other issues. Spanish a plus.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience preferred.",
      "Proven writing and research skills required."
    ],
    "how_to_apply": "Email cover letter, resume, three references, and brief writing sample to: DoggettJobs@mail.house.gov. (No calls please).",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-130-16",
    "position_title": "Legislative Assistant",
    "office": "Democratic Member",
    "location": "Washington DC",
    "posting_date": "2016-02-16",
    "description": "Democratic Member seeks an organized, energetic and savvy Legislative Assistant to handle health and aging policy portfolio. The selected candidate will be joining a fast-paced, team-oriented Washington DC office, and must be a self-starter that can quickly learn district and Member priorities.",
    "responsibilities": [
      "Preparing and staffing the Member for committee hearings and floor votes",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "qualifications": [
      "Superior analytical skills",
      "Strong written and oral communication skills",
      "Strong interpersonal skills",
      "A sense of humor",
      "Knowledge of the Affordable Care Act, Medicare, Medicaid, and the legislative process required"
    ],
    "how_to_apply": "Interested candidates should email a resume and cover letter to Resumes4@mail.house.gov.",
    "salary_info": null,
    "contact": "Resumes4@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-129-16",
    "position_title": "Press Secretary",
    "office": "Progressive Florida Democrat",
    "location": "D.C.",
    "posting_date": "2016-02-16",
    "description": "Progressive Florida Democrat seeks a Press Secretary to serve in his D.C.\noffice. Candidates should be proactive, and possess superior written and oral\ncommunication skills (including strong writing, editing, and proofreading\ncapabilities). The ideal candidate will have prior political/legislative and\ncommunications experience.",
    "responsibilities": [
      "Establishing and maintaining relationships with national and D.C.-based media",
      "Coordinating all media efforts and communications-related events",
      "Drafting and distributing press releases and media advisories; drafting, editing, and placing op-eds",
      "Pitching stories to reporters, responding to press inquiries, and serving as the point-of-contact for national press",
      "Monitoring media narratives and identifying opportunities to promote the Member",
      "Overseeing franked communications strategy, including: the drafting, design, and distribution of franked mail content; executing telephone town hall events; and managing congressional e-newsletter",
      "Managing the congressional website and ensuring that it features timely content",
      "Coordinating and staffing the Congressman for interviews and events (including occasional night and weekend commitments)",
      "Compiling and distributing press clippings"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a current resume, cover letter with salary requirement, two writing samples (not to exceed one page each), and three references to FL09job@gmail.com. No calls, emails or walk-ins, please.",
    "salary_info": null,
    "contact": "FL09job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-128-16",
    "position_title": "Legislative Assistant",
    "office": "California Republican",
    "location": "DC",
    "posting_date": "2016-05-02",
    "description": "Duties will include tracking legislation and other developments to brief the Member on floor votes and pending legislative matters, developing and implementing policy initiatives in line with office goals, meeting with constituents and other interest groups, and coordinating with DC and district staff regarding legislation, messaging, and events. Qualified candidates must be proactive and hard working with exceptional writing and communication skills and the ability to work effectively in a fast paced environment. Legislative experience required. California ties are a plus.",
    "responsibilities": [
      "Tracking legislation and other developments to brief the Member on floor votes and pending legislative matters",
      "Developing and implementing policy initiatives in line with office goals",
      "Meeting with constituents and other interest groups",
      "Coordinating with DC and district staff regarding legislation, messaging, and events"
    ],
    "qualifications": [
      "Proactive and hard working with exceptional writing and communication skills",
      "Ability to work effectively in a fast paced environment",
      "Legislative experience required",
      "California ties are a plus"
    ],
    "how_to_apply": "Please email resume and cover letter to cagopjobs@gmail.com.",
    "salary_info": null,
    "contact": "cagopjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-092-16",
    "position_title": "Communications Director",
    "office": "Active Democrat House Member",
    "location": "D.C. and the district",
    "posting_date": "2016-05-02",
    "description": "Active Democrat House Member seeks experienced, media savvy communications director to run aggressive press operation in fast-paced office. Duties include: managing day-to-day press operations in D.C. and the district, developing communication strategy, drafting press releases, op-eds, talking points and other content, overseeing and planning media events, preparing member, developing relationships with local and national reporters, and working in conjunction with outreach director and district staff. Ideal candidate will have a sense of humor, on-the-record experience and excellent writing skills. Hill or other political experience/California ties a plus.",
    "responsibilities": [
      "Managing day-to-day press operations in D.C. and the district",
      "Developing communication strategy",
      "Drafting press releases, op-eds, talking points and other content",
      "Overseeing and planning media events",
      "Preparing member",
      "Developing relationships with local and national reporters",
      "Working in conjunction with outreach director and district staff"
    ],
    "qualifications": [
      "Sense of humor",
      "On-the-record experience",
      "Excellent writing skills",
      "Hill or other political experience/California ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and two writing samples to ca07jobs@gmail.com. Please, no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": null
  }
]