[
  {
    "id": "MEM-104-15",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2015-04-13",
    "description": "Duties include:\nanswering telephones; assisting with the tracking and processing of committee\ncorrespondence; providing administrative support in setting up committee\nmeetings; and entering data and navigating databases with accuracy. This is a\nnon-partisan position which requires the ability to serve all Members of\nCongress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "answering telephones",
      "assisting with the tracking and processing of committee correspondence",
      "providing administrative support in setting up committee meetings",
      "entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "excellent organizational skills and a professional telephone manner",
      "good computer skills",
      "proficiency in Microsoft Word and Excel",
      "ability to work cooperatively and courteously with others",
      "ability to use good judgment in responding to inquiries and requests",
      "flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.\nNO PHONE CALLS PLEASE",
    "salary_info": null,
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-098-15",
    "position_title": "Committee Investigator",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2015-04-13",
    "description": "The Majority staff of the House Committee on Veterans’ Affairs is seeking a health care professional with expert knowledge of drug interactions, pathology, and general issues regarding quality of care to serve as a Committee Investigator. Clinical experience and/or healthcare-related investigatory background preferred. Veterans with requisite experience strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Expert knowledge of drug interactions, pathology, and general issues regarding quality of care",
      "Clinical experience and/or healthcare-related investigatory background preferred"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to VAR.Resumes@Mail.house.gov with “Health Care Investigator” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "VAR.Resumes@Mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-097-15",
    "position_title": "Committee Investigator",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2015-04-13",
    "description": "The Majority staff of the House Committee on Veterans’ Affairs is seeking a federal contracting professional with expert knowledge of federal statutes and regulations pertaining to acquisitions and procurement to serve as a Committee Investigator. At least 5 years of federal government acquisitions and procurement experience preferred, as is experience with facility construction contracts. Veterans with requisite experience are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "expert knowledge of federal statutes and regulations pertaining to acquisitions and procurement",
      "At least 5 years of federal government acquisitions and procurement experience preferred",
      "experience with facility construction contracts preferred"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references and writing samples to VAR.Resumes@Mail.house.gov with “Contract Investigator” in the subject line. No walk-ins please.",
    "salary_info": null,
    "contact": "VAR.Resumes@Mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-092-15",
    "position_title": "Communications Director",
    "office": "Rep. Jerry McNerney",
    "location": "Washington, D.C.",
    "posting_date": "2015-04-13",
    "description": "California Democrat (Rep. Jerry McNerney) seeks experienced communications director to develop and execute aggressive, proactive longterm media and outreach strategy.\n\nCandidate must be comfortable working closely with the Member and staff. Ideal candidate would be politically astute and have a good sense of humor.\n\nDesired qualities include the ability to respond to challenging situations quickly and strategically.\n\nThis position requires non-traditional hours and travel to the District.\n\nCalifornia ties, Hill experience, and Spanish literacy are a plus.",
    "responsibilities": [
      "Serving as chief spokesperson",
      "Successfully pitching stories and press events to both national and local media outlets",
      "Responding to media inquiries",
      "Effectively messaging policy and other priorities",
      "Maintaining an active new media profile",
      "Writing press releases, op-eds, speeches, talking points, and franked mail"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "Strong editing and proofreading abilities",
      "The desire to work collaboratively with a team in a fast-paced environment"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume and two writing samples to: McNerneyResumes@mail.house.gov. No calls or drop ins, please.",
    "salary_info": null,
    "contact": "McNerneyResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-091-15",
    "position_title": "Health Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2015-04-13",
    "description": "The Democratic staff of the Committee on Oversight and Government Reform is seeking a mid-level Health Counsel with 5 to 10 years of congressional experience on health policy issues including ACA, Medicare, and Medicaid. Attorneys with investigative or litigation experience are preferred. Candidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please send resume and cover letter to oversightjobs@mail.house.gov.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-059-15",
    "position_title": "Legislative Assistant",
    "office": "Southern Democrat and Member of the Small Business Committee",
    "location": null,
    "posting_date": "2015-04-13",
    "description": "Legislative Assistant to handle a broad legislative portfolio including Small Business, Financial Services, Judiciary, Healthcare, and Immigration. The Legislative Assistant will be expected to handle relevant committee work. This is not an entry level position.",
    "responsibilities": [],
    "qualifications": [
      "Strong writing, analytical, and organizational skills",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Sound political judgment"
    ],
    "how_to_apply": "Please email cover letter and resume to:",
    "salary_info": null,
    "contact": "NCCongressionalJobs@gmail.com (subject line should read: Legislative Assistant)",
    "equal_opportunity": "Minorities and women are encouraged to apply, North Carolina ties preferred but not required."
  }
]