[
  {
    "id": "MEM-029-19",
    "position_title": "Legislative Director",
    "office": "Northeast Democrat",
    "location": "Hill",
    "posting_date": "2019-01-14",
    "description": "Northeast Democrat seeks enthusiastic Legislative Director to coordinate and oversee the Member’s legislative agenda, along with advising the Member on legislative activities and leading legislative staff. This is not an entry-level position. An ideal candidate will have at least 3 years of legislative experience on the Hill. Successful applicants must have a demonstrated ability to manage and mentor staff, think strategically, and have experience in formulating strategic plans for advancing legislation.",
    "responsibilities": [
      "Coordinate and oversee the Member’s legislative agenda",
      "Advising the Member on legislative activities",
      "Leading legislative staff"
    ],
    "qualifications": [
      "At least 3 years of legislative experience on the Hill",
      "Demonstrated ability to manage and mentor staff",
      "Think strategically",
      "Experience in formulating strategic plans for advancing legislation",
      "Expert knowledge of House legislative processes and procedures",
      "Excellent organization and communication skills",
      "Ability to work under pressure and meet deadlines",
      "New Jersey ties are a plus but not required"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to NJ10resumes@gmail.com with the following subject line: First name Last Name - Legislative Director. Applications received by January 16, 2019 will receive priority. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "NJ10resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-027-19",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT",
    "office": "House Committee on Transportation & Infrastructure",
    "location": "Hill",
    "posting_date": "2019-01-14",
    "description": "Senior Member on the House Committee on Transportation & Infrastructure is seeking qualified candidates to staff the Member’s committee assignment in addition to managing a diverse legislative issue portfolio. Candidates should be accomplished at drafting, advancing, and analyzing legislation, monitoring legislative developments, conducting research, and drafting vote recommendations. Ideal candidates will have strong organizational and time management skills, excellent written and verbal communication skills, and a positive attitude. Paramount is a solid knowledge of the legislative process as well as an ability to work under pressure and meet deadlines in an unpredictable work environment, all while keeping a sense of humor. This is not an entry-level legislative position. 2-3 years of Hill experience strongly preferred. MidSouth ties are a plus but not required. Women and minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "Drafting, advancing, and analyzing legislation",
      "Monitoring legislative developments",
      "Conducting research",
      "Drafting vote recommendations"
    ],
    "qualifications": [
      "Strong organizational and time management skills",
      "Excellent written and verbal communication skills",
      "Positive attitude",
      "Solid knowledge of the legislative process",
      "Ability to work under pressure and meet deadlines in an unpredictable work environment",
      "2-3 years of Hill experience strongly preferred",
      "MidSouth ties are a plus but not required"
    ],
    "how_to_apply": "Interested individuals should e-mail a resume and 2 recent writing samples (no longer than 2 pages each) to tn09jobs18@mail.house.gov with the following subject line: [First name] [Last Name] – Senior Legislative Assistant. Please be aware this office has a dog. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "tn09jobs18@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-025-19",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-01-14",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:",
      "Government ethics",
      "Criminal law",
      "Employment law, including the laws governing sexual harassment in the workplace",
      "Civil litigation",
      "Administrative investigations and adjudications",
      "Depositions",
      "Financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-19",
    "position_title": "Communications Director",
    "office": "Democratic House member from California",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "Democratic House member from California seeks pro-active, experienced communications director to develop and implement strategic media plan in a fast-paced and results -driven environment.",
    "responsibilities": [],
    "qualifications": [
      "Must have proven track-record",
      "Ability to manage website and social media tools",
      "Outstanding writing skills and strong pitching skills are required",
      "This is not an entry level position"
    ],
    "how_to_apply": "Qualified candidates should submit resume and cover letter to commstaffer@gmail.com.",
    "salary_info": null,
    "contact": "commstaffer@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-019-19",
    "position_title": "Senior Policy Analyst",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nSenior Policy Analyst to research and write reports, policy memos and other\nmaterials; prepare briefing documents for Congressional hearings; monitor\neconomic indicators; conduct quantitative analyses; and oversee the work of\nmid-level policy staff.",
    "responsibilities": [
      "Research and write reports, policy memos and other materials",
      "Prepare briefing documents for Congressional hearings",
      "Monitor economic indicators",
      "Conduct quantitative analyses",
      "Oversee the work of mid-level policy staff"
    ],
    "qualifications": [
      "A qualified candidate has a master’s degree in economics, or an MPP degree.",
      "Excellent quantitative and analytical skills",
      "Be able to convey complex information to a non-expert audience",
      "Write clearly and to give careful feedback on others’ writing.",
      "Proficiency with Haver and working with government databases including Current Population Survey (CPS) and Current Employment Statistics (CES).",
      "Experience with STATA, EViews, Matlab, or R is a plus.",
      "Applicants should have two+ years in experience in government, think tank or academic research.",
      "Experience with the following issues are a plus: trade, climate change, health care, family workplace policies, immigration, consumer protection, automation, outsourcing, inequality, taxation, federal debt or other topics that relate to current issues in economics.",
      "Hill experience is preferred but not required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224744 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-018-19",
    "position_title": "Press Assistant",
    "office": "U.S. Congress Joint Economic Committee",
    "location": "Washington, DC",
    "posting_date": "2019-01-14",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a Press Assistant to work as part of a three-person communications team.",
    "responsibilities": [
      "monitoring media coverage",
      "compiling press clips",
      "maintaining press lists",
      "drafting press releases",
      "organizing press events",
      "assisting with social media"
    ],
    "qualifications": [
      "bachelor's degree in economics, journalism, English, political science or a related field",
      "a proven ability to write well",
      "experience with social media",
      "excellent attention to detail and accuracy",
      "strong research skills",
      "Hill experience preferred but not required",
      "Basic graphics or video experience a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224746 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-017-19",
    "position_title": "Communications Director",
    "office": "U.S. Congress Joint Economic Committee",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-14",
    "description": "The Democratic Staff of the U.S. Congress Joint Economic Committee seeks a Communications Director to design and implement an aggressive and creative communications strategy in a challenging media environment.",
    "responsibilities": [
      "developing strong relationships with reporters",
      "pitching stories",
      "developing messaging",
      "writing press releases, speeches, op-eds and other documents",
      "planning and reviewing documents by policy staff",
      "preparing the Vice Chair for interviews",
      "building relationships with the communication staffs of other committees and offices",
      "managing a Digital Media Associate and a Press Assistant"
    ],
    "qualifications": [
      "A qualified candidate has a minimum of five years of experience in communications",
      "an ability to think creatively about strategy and to find opportunities where others don’t see them",
      "demonstrated ability to convey complex information to a wide audience",
      "excellent writing and editing skills",
      "professional experience or coursework in economic or related issues",
      "social media experience",
      "the ability to manage a team",
      "Hill or other political experience is strongly preferred by not required",
      "Knowledge of economic issues is a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and 3-5 writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224751 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-016-19",
    "position_title": "Digital Media Manager",
    "office": "U.S. Congress Joint Economic Committee",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-14",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a Digital Media Manager to work as part of a three-person communications team. Responsibilities include helping to create an innovative social media strategy; writing, posting and monitoring social media content; reaching out to social media staff at other organizations; and substantially increasing the number and quality of followers.",
    "responsibilities": [
      "Helping to create an innovative social media strategy",
      "Writing, posting and monitoring social media content",
      "Reaching out to social media staff at other organizations",
      "Substantially increasing the number and quality of followers"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Minimum of two years working as a social media professional",
      "Proven ability to write social media content",
      "Excellent attention to detail and accuracy",
      "Strong research skills",
      "Hill experience preferred but not required.",
      "Basic graphics or video experience a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and a substantial selection of tweets and Facebook posts (in a Word or PDF document) to senate_employment@saa.senate.gov indicating the job title and referral number 224750 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-015-19",
    "position_title": "Research Assistant",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a Research Assistant to help policy staff research, write and fact-check reports, policy briefs, hearing memos, charts and other documents.\nA qualified candidate has a bachelor’s or master’s degree in economics, political science or a related degree. In addition, he or she should have excellent analytical skills; an ability to process and simplify complex issues; meticulous attention to detail and an ability to handle multiple projects simultaneously. Hill experience is preferred but not required.",
    "responsibilities": [
      "research",
      "write and fact-check reports",
      "policy briefs",
      "hearing memos",
      "charts",
      "other documents"
    ],
    "qualifications": [
      "bachelor’s or master’s degree in economics, political science or a related degree",
      "excellent analytical skills",
      "ability to process and simplify complex issues",
      "meticulous attention to detail",
      "ability to handle multiple projects simultaneously",
      "Hill experience is preferred but not required"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224745 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11th.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-014-19",
    "position_title": "Editor",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Democratic Staff of the U.S. Congress Joint Economic Committee seeks an Editor to write, edit and frame Committee materials. Editor will play key role in shaping Committee reports, releases, speeches, op-eds and other documents.",
    "responsibilities": [],
    "qualifications": [
      "A qualified candidate has a minimum of five years of experience in journalism or communications;",
      "excellent writing and editing skills;",
      "an ability to work on multiple projects simultaneously;",
      "demonstrated ability to convey complex information to a wide audience;",
      "mastery of grammar, punctuation and style;",
      "professional experience or strong interest in economic issues.",
      "The ideal candidate will have worked in news environment as a reporter/editor, or as an editor at a think tank."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and 3-5 writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224748 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-013-19",
    "position_title": "Economist",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks an Economist to research and write reports, policy memos and other materials; participate in long-term planning of hearings and reports; prepare briefing documents for Congressional hearings; monitor economic indicators; conduct quantitative analyses; and oversee the work of mid-level policy staff.\n\nApplicants should have two+ years of experience in government, think tank or academic research. Experience with the following issues are a plus: trade, climate change, health care, family workplace policies, immigration, consumer protection, automation, outsourcing, inequality, taxation, federal debt or other topics that relate to current issues in economics. Hill experience is preferred but not required.",
    "responsibilities": [
      "Research and write reports, policy memos and other materials",
      "Participate in long-term planning of hearings and reports",
      "Prepare briefing documents for Congressional hearings",
      "Monitor economic indicators",
      "Conduct quantitative analyses",
      "Oversee the work of mid-level policy staff"
    ],
    "qualifications": [
      "A qualified candidate has a Ph.D. or master’s degree in economics, or an MPP degree and excellent quantitative and analytical skills.",
      "He or she should be able write clearly and to give careful feedback on others’ writing",
      "Convey complex information to a non-expert audience.",
      "Proficiency in STATA, EViews, Matlab, or R, as well as solid experience with Haver and government databases including the Current Population Survey (CPS) and Current Employment Statistics (CES)."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224749 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-012-19",
    "position_title": "Policy Analyst",
    "office": "Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a Policy Analyst to help researching and writing reports; drafting policy memos and other documents; preparing for hearings; and fact checking. He or she will report to the senior policy staff and will work closely with the communications team.",
    "responsibilities": [
      "Researching and writing reports",
      "Drafting policy memos and other documents",
      "Preparing for hearings",
      "Fact checking"
    ],
    "qualifications": [
      "At least a bachelors degree in economics, political science or a related degree; a master's degree, especially an MPP, is preferred.",
      "Excellent quantitative and analytical skills",
      "The ability to write clearly",
      "An ability to convey complex information to a non-expert audience.",
      "Hill experience preferred but not required.",
      "Experience with Haver and working with government databases including Current Population Survey (CPS) and Current Employment Statistics (CES) are a plus.",
      "Two to five years of work experience is expected."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224747 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-011-19",
    "position_title": "District Director",
    "office": "Congresswoman Diana DeGette",
    "location": "Denver",
    "posting_date": "2019-01-14",
    "description": "The District Director manages all aspects of district office operations including community outreach, casework, and staff oversight and represents the Congresswoman at events and meetings throughout the community.\n",
    "responsibilities": [
      "Manages district office staff; including planning, assigning and directing work. addressing complaints; and resolving problems.",
      "Manages district office budget and finances.",
      "Manages the Congresswoman's schedule in coordination with the district scheduler.",
      "Manages staff outreach to the local community with the assistance of the outreach coordinator.",
      "Oversees the management of constituent casework with the Deputy District Director coordinator.",
      "Ensures clear communication with the DC office and regular reporting of district office activities to the Congresswoman.",
      "Coordinates closely with DC staff to develop and implement the overall strategic plan for the Congresswoman's staff.",
      "Initiates and maintains key relationships with elected and non-elected leaders in the congressional district.",
      "Develops a keen understanding of the local political climate and the needs and concerns of all the constituencies within the congressional district.",
      "Actively promotes the Congresswoman's legislative goals and accomplishments in the local community.",
      "Maintains direct outreach connections with specific constituencies as assigned based on experience and the needs of the office.",
      "Represents the Congresswoman and/or assigns appropriate staff to do so in meetings and at events with elected officials and local groups in the district.",
      "Works a flexible schedule including long hours, nights and weekends.",
      "Assists constituents as needed.",
      "Performs other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should send a resume and cover letter to degettedistrictdirectorsearch@gmail.com.",
    "salary_info": null,
    "contact": "degettedistrictdirectorsearch@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-009-19",
    "position_title": "Clerk",
    "office": "Democratic Chair-elect of the House Committee on Science, Space, and Technology",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "Duties include assisting with the preparation and conduct of markups, assisting with hearing preparation, maintaining and archiving Committee records, assisting with the printing of Committee documents, and executing other administrative duties as needed.",
    "responsibilities": [
      "Assisting with the preparation and conduct of markups",
      "Assisting with hearing preparation",
      "Maintaining and archiving Committee records",
      "Assisting with the printing of Committee documents",
      "Executing other administrative duties as needed"
    ],
    "qualifications": [
      "Strong organizational and communication skills",
      "The ability to work under tight deadlines",
      "Be able to multi-task effectively",
      "Hill experience is required",
      "Previous clerking experience is strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-19",
    "position_title": "Press Secretary",
    "office": "Committee on Oversight and Government Reform",
    "location": "Washington, DC",
    "posting_date": "2019-01-14",
    "description": "Rep. Elijah E. Cummings is seeking a detail-oriented communications\nprofessional to join the staff of the Committee on Oversight and Government\nReform as Press Secretary. The ideal candidate should be a strong writer, a\nproactive team player, have experience with rapid responses, and be able to\nmulti-task in a fast-paced environment. This position reports directly to the\nCommunications Director.",
    "responsibilities": [
      "Develop day-to-day press materials, including press releases, talking points,\nstatements, and media advisories.",
      "Field and respond to media inquiries.",
      "Seek to correct inaccurate reporting.",
      "Strategize with the Communications Director on interview requests.",
      "Staff the congressman at interviews and press events.",
      "Physically manage the press at Committee hearings.",
      "Work closely with member relations Committee staff to achieve goals for\nCommittee Members.",
      "Liaison with committee member and other congressional offices.",
      "Organize press conferences.",
      "Assist with overall communications strategy.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "A Bachelor’s degree in Journalism, English, Public Relations, or a closely\nrelated field preferred.",
      "A minimum of four years of media relations and/or social media\ncoordination experience.",
      "Experience with rapid responses.",
      "A strong ability to perform multiple tasks accurately and efficiently in a fastpaced environment.",
      "Previous campaign experience a plus.",
      "Previous Hill experience a plus."
    ],
    "how_to_apply": "Submit a cover letter and resume to oversightpress@mail.house.gov with\n“Press Secretary Application” in the subject line. Applications will be\naccepted until January 18. Please no drop-by applications, phone calls, or\nseparate emails.",
    "salary_info": null,
    "contact": "oversightpress@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-006-19",
    "position_title": "Senior Health LA",
    "office": "U.S. Rep. Lloyd Doggett (D)",
    "location": "Washington office",
    "posting_date": "2019-01-14",
    "description": "Not an entry level job. Law degree a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Email cover letter, resume, and three references to: DoggettJobs@mail.house.gov. (No calls or drop-ins please) Reply with subject line, Senior Health LA.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-005-19",
    "position_title": "Scheduler",
    "office": "Senior California Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-01-14",
    "description": "Senior California Democrat seeks a motivated, energetic, and detail-oriented Scheduler for the Washington, DC office. Responsibilities include coordinating and maintaining the Member’s schedule, drafting personal correspondence, and occasionally driving the member.",
    "responsibilities": [
      "Coordinating and maintaining the Member’s schedule",
      "Drafting personal correspondence",
      "Occasionally driving the member"
    ],
    "qualifications": [
      "Must be personable, dependable, and able to juggle multiple tasks with competing priorities",
      "California ties preferred",
      "Sense of humor required"
    ],
    "how_to_apply": "To apply, please submit resume, cover letter, and a short writing sample to CADemOfficeJob@gmail.com",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-513-18",
    "position_title": "Scheduler",
    "office": "Office of Congresswoman-Elect Veronica Escobar (TX-16)",
    "location": "Capitol Hill",
    "posting_date": "2019-01-14",
    "description": "The Office of Congresswoman-Elect Veronica Escobar (TX-16) seeks a Scheduler to begin in the new year. This individual will be responsible for maintaining the Member-Elect's official schedule, travel plans, personal schedule, along with coordinating press interviews, radio and television time with the Press Secretary; legislative briefings and hearings with the Legislative team and other tasks as assigned. This position will also be in charge of coordinating with the district director all district visits. This is NOT AN ENTRY LEVEL position.",
    "responsibilities": [
      "Maintaining the Member-Elect's official schedule",
      "Travel plans",
      "Personal schedule",
      "Coordinating press interviews, radio and television time with the Press Secretary",
      "Legislative briefings and hearings with the Legislative team",
      "Coordinating with the district director all district visits"
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Previous scheduling and administrative experience (one year in a similar position) is required",
      "Texas, southwest ties and Spanish language proficiency a plus"
    ],
    "how_to_apply": "Please email resume, writing sample and cover letter to tx16resumes@gmail.com with the subject line SCHEDULER APPLICATION.",
    "salary_info": null,
    "contact": "tx16resumes@gmail.com",
    "equal_opportunity": "Women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-512-18",
    "position_title": "Staff Assistant",
    "office": "Office of Congresswoman-Elect Veronica Escobar (TX-16)",
    "location": "Washington, DC",
    "posting_date": "2019-01-14",
    "description": "The Office of Congresswoman-Elect Veronica Escobar (TX-16) seeks a Staff Assistant to start in the new year and join an active office in Washington, DC. Responsibilities will include managing front desk operations, answering phones, sorting mail, coordinating tours, supervising interns, greeting visitors, processing flag requests and other duties as assigned.\n\nThis is an entry-level position and prior Hill internship preferred. Successful candidates will be able to adapt to a startup environment and work under tight deadlines. Texas, southwest ties and Spanish language proficiency a plus, women and minority candidates are encouraged to apply.",
    "responsibilities": [
      "managing front desk operations",
      "answering phones",
      "sorting mail",
      "coordinating tours",
      "supervising interns",
      "greeting visitors",
      "processing flag requests",
      "other duties as assigned"
    ],
    "qualifications": [
      "entry-level position",
      "prior Hill internship preferred",
      "Successful candidates will be able to adapt to a startup environment and work under tight deadlines.",
      "Texas, southwest ties and Spanish language proficiency a plus"
    ],
    "how_to_apply": "Please email resume, writing sample and cover letter to tx16resumes@gmail.com with the subject line STAFF ASSISTANT APPLICATION.",
    "salary_info": null,
    "contact": "tx16resumes@gmail.com",
    "equal_opportunity": "women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-511-18",
    "position_title": "Legislative Director",
    "office": "New York City Member",
    "location": "Capitol Hill",
    "posting_date": "2019-01-14",
    "description": "Progressive New York City Member seeks Legislative Director to oversee and support the Member’s legislative priorities. Responsibilities include providing the Member with vote recommendations, setting legislative priorities and managing staff to achieve them, planning dynamic events to raise awareness of the Member’s actions, writing talking points, liaising with community leaders, and spearheading legislative initiatives within their own portfolio. Ideal candidates will have a strong understanding of housing and immigration policy, an advanced degree, and 3-5 years of legislative experience on Capitol Hill. Strong written and verbal skills are essential as is the ability to work collaboratively in a fast-paced, dynamic environment. This is not an entry-level position and New York City ties are a plus.",
    "responsibilities": [
      "Providing the Member with vote recommendations",
      "Setting legislative priorities and managing staff to achieve them",
      "Planning dynamic events to raise awareness of the Member’s actions",
      "Writing talking points",
      "Liaising with community leaders",
      "Spearheading legislative initiatives within their own portfolio"
    ],
    "qualifications": [
      "Strong understanding of housing and immigration policy",
      "Advanced degree",
      "3-5 years of legislative experience on Capitol Hill",
      "Strong written and verbal skills",
      "Ability to work collaboratively in a fast-paced, dynamic environment",
      "New York City ties are a plus"
    ],
    "how_to_apply": "Interested parties should email a cover letter and resume to Kendall.Mitchell@mail.house.gov with “Legislative Director” in the subject line.",
    "salary_info": null,
    "contact": "Kendall.Mitchell@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-510-18",
    "position_title": "Digital Specialist and Press Aide",
    "office": "Rep. Ro Khanna",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "Rep. Ro Khanna, a very active leader of the Progressive Caucus, seeks a\nDigital Specialist and Press Aide to create original content in videos, social\nmedia and other messaging vehicles to expand the reach of the Member's\nvision and priorities. This individual will work collaboratively with the\nCommunications Director in managing the Member's social media channels\n(Facebook, Twitter and Instagram) and using the platforms to frequently share\ncontent and elevate the Member's online presence.\n\nThe Digital Specialist and Press Aide will work the Communications Director\nto design and implement a robust communications/digital/social media plan.\nThis individual will be proficient in video/audio production, graphic design\nand editing. Audio and video clips of various topics and events attended by\nthe Member will be used to develop creative content for use within videos and\nonline communications distributed by the office.",
    "responsibilities": [],
    "qualifications": [
      "At least two years of relevant video experience in a legislative office, political organization or progressive advocacy group",
      "Proficiency in video filming, editing and graphic design software",
      "Knowledge of live-streaming platforms, digital trends and developments in media",
      "Strong organizational, time-management, problem-solving and story-telling skills",
      "After hours and weekend responsiveness will be required."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, two writing samples, three graphic design samples and links to three samples of video work.",
    "salary_info": null,
    "contact": "RepRoKhannaCA17@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-509-18",
    "position_title": "Press/Digital Assistant",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "Progressive Democrat and Senior Member of the House Judiciary Committee is seeking a Press/Digital Assistant to work closely with the Communications Director to elevate the Member’s communications operation. Duties will include monitoring and maintenance of the Member’s social media accounts, drafting and posting content for social media, producing graphics and videos, maintaining the website, compiling daily press clips, meticulously proofreading and fact-checking written materials (including letters, social media posts, press releases, newsletters, talking points, and more), creating e-newsletters and franked mailings, creating targeted mailing lists for mass outreach campaigns, and other responsibilities assigned. The ideal candidate will be organized, detailoriented, tech-savvy, able to work long hours in a fast-paced environment, have superior writing and proofreading skills and the ability to work closely with a communications and legislative team. Ties to Tennessee’s 9th District, previous congressional or campaign experience, and photography/videography/graphic design skills strongly preferred.",
    "responsibilities": [
      "Monitoring and maintenance of the Member’s social media accounts",
      "Drafting and posting content for social media",
      "Producing graphics and videos",
      "Maintaining the website",
      "Compiling daily press clips",
      "Meticulously proofreading and fact-checking written materials (including letters, social media posts, press releases, newsletters, talking points, and more)",
      "Creating e-newsletters and franked mailings",
      "Creating targeted mailing lists for mass outreach campaigns",
      "Other responsibilities assigned"
    ],
    "qualifications": [
      "Organized",
      "Detail-oriented",
      "Tech-savvy",
      "Able to work long hours in a fast-paced environment",
      "Superior writing and proofreading skills",
      "Ability to work closely with a communications and legislative team",
      "Ties to Tennessee’s 9th District (preferred)",
      "Previous congressional or campaign experience (preferred)",
      "Photography/videography/graphic design skills (preferred)"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, 2 writing samples, an original graphic and/or video, and sample tweets to tn09jobs18@mail.house.gov. Please write “Press/Digital Assistant” in the subject line. Please be aware this office has a dog. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "tn09jobs18@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-508-18",
    "position_title": "Digital Director/Washington Press Assistant",
    "office": "Rep. Debbie Wasserman Schultz",
    "location": "Washington",
    "posting_date": "2019-01-14",
    "description": "The office of Rep. Debbie Wasserman Schultz seeks an experienced Digital Director and Press Assistant to handle a range of fast-paced media issues, and will report to the Communications Director. Duties will include working with local and national reporters; long-term planning; drafting e-newsletters, social media posts, press releases, op-eds and speeches. This position will be responsible for managing digital media accounts and producing video content. It requires excellent writing skills and an ability to work closely with legislative and district staff. This is a fast-paced work environment, and not an entry-level position. Prior work in another Congressional or Senate office with Florida ties, and graphic design capabilities, are a plus.",
    "responsibilities": [
      "Working with local and national reporters",
      "Long-term planning",
      "Drafting e-newsletters, social media posts, press releases, op-eds and speeches",
      "Managing digital media accounts",
      "Producing video content"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Ability to work closely with legislative and district staff",
      "Prior work in another Congressional or Senate office with Florida ties (plus)",
      "Graphic design capabilities (plus)"
    ],
    "how_to_apply": "Interested parties should email a cover letter and resume to FL23ResumeComm@mail.house.gov with the subject line “Digital Director/Press Assistant.” Please save cover letter and resume in a single file (pdf preferred) and name the file “Last name, First name.”",
    "salary_info": null,
    "contact": "FL23ResumeComm@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-507-18",
    "position_title": "Legislative Director/Counsel",
    "office": "Representative Debbie Wasserman Schultz",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The office of Representative Debbie Wasserman Schultz is seeking an experienced Legislative Director/Counsel to oversee and support the Member’s legislative priorities and all other relevant legislative and policy work.",
    "responsibilities": [
      "Advising the Member on all matters in the issue portfolio and advancing legislative proposals",
      "Analyzing legislation and drafting vote recommendations and talking points for floor and committee proceedings",
      "Staffing the Member in relevant meetings",
      "Representing the Member before constituents and stakeholders",
      "Supervising the legislative staff"
    ],
    "qualifications": [
      "Law or advanced degree",
      "Significant foreign policy and Jewish Community experience",
      "Experience advising a Member of Congress",
      "Experience managing staff",
      "Experience advancing policy proposals",
      "Excellent written and verbal communication skills",
      "Enjoy working in a fast-paced, collaborative environment",
      "Prior work in another Congressional or Senate office with Florida ties is a plus"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to FL23Resume@mail.house.gov with the subject line “Legislative Director/Counsel.” Please save cover letter and resume in a single file (pdf preferred) and name the file “Last name, First name.”",
    "salary_info": null,
    "contact": "FL23Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-506-18",
    "position_title": "Professional Staff Member or Counsel",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Energy & Commerce Committee, Democratic Staff seeks dedicated, organized and enthusiastic candidates to join the Consumer Protection Subcommittee staff as Professional Staff Member or Counsel. The broad jurisdiction of the subcommittee includes consumer affairs and consumer protection generally; motor vehicle safety; consumer product safety and product liability; regulation of commercial practices, including sports-related matters; interstate commerce; consumer privacy and data security; and regulation of travel, tourism, and time. The subcommittee oversees the National Highway Traffic Safety Administration, the Consumer Product Safety Commission, the Federal Trade Commission, the Bureau of Consumer Financial Protection, among others.\n\nThe position requires the handling of substantive legislative and administrative tasks, including staffing hearings and markups, conducting oversight, and drafting legislation. Qualified candidates must have strong writing, analytical, legislative, and organizational skills; a proven ability to perform under pressure while juggling multiple tasks with competing priorities; a willingness to work long hours and weekends; and sound political judgment. Candidates should have experience working with relevant public interest groups, relevant agencies, Congress, and industry. Law degree preferred but not required.",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation"
    ],
    "qualifications": [
      "Strong writing, analytical, legislative, and organizational skills",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Willingness to work long hours and weekends",
      "Sound political judgment",
      "Experience working with relevant public interest groups, relevant agencies, Congress, and industry",
      "Law degree preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line Consumer Protection PSM/Counsel Candidate.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age. Women, minority, and veteran candidates are highly encouraged to apply."
  },
  {
    "id": "MEM-505-18",
    "position_title": "Professional Staff Member or Counsel",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-14",
    "description": "The Energy & Commerce Committee, Democratic Staff seeks dedicated, organized and enthusiastic candidates to join the Communications and Technology Subcommittee staff as Professional Staff Member or Counsel. The jurisdiction of the subcommittee includes traditional and emerging communications technologies generally and as they relate to emergency and public safety communications, consumer protection, cybersecurity, privacy, and data security. The subcommittee oversees the Federal Communications Commission, the National Telecommunications and Information Administration, the Office of Emergency Communications in the Department of Homeland Security, and all aspects of the above-referenced jurisdiction related to the Department of Homeland Security.\n\nThe position requires the handling of substantive legislative and administrative tasks, including staffing hearings and markups, conducting oversight, and drafting legislation. Qualified candidates must have strong writing, analytical, legislative, and organizational skills; a proven ability to perform under pressure while juggling multiple tasks with competing priorities; a willingness to work long hours and weekends; and sound political judgment. Candidates should have experience working with relevant public interest groups, the FCC, Congress, and industry. Law degree preferred but not required.",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation",
      "Handling substantive legislative and administrative tasks"
    ],
    "qualifications": [
      "Strong writing, analytical, legislative, and organizational skills",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Willingness to work long hours and weekends",
      "Sound political judgment",
      "Experience working with relevant public interest groups, the FCC, Congress, and industry",
      "Law degree preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line C&T PSM/Counsel Candidate.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age. Women, minority, and veteran candidates are highly encouraged to apply."
  },
  {
    "id": "MEM-504-18",
    "position_title": "Events Coordinator/Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2019-01-14",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible constituent services staff.\n\nThe Events Coordinator is also a caseworker who helps constituents with federal issues but spends a good part of the time managing and directing very diverse city-wide and neighborhood events that relate to the Congresswoman’s congressional and constituent responsibilities, including staying on top of everyday events in the Member’s district that keep the community connected to the Member’s work. The Events Coordinator takes the lead in our frequent Norton-In-Your Neighborhood meetings with constituents and in developing major events, among them, the Small Business Fair and Job Fair.",
    "responsibilities": [],
    "qualifications": [
      "Candidate must be able to handle multiple tasks.",
      "The office prizes staff able to think outside the box and work independently while also being available to assist in co-worker projects where necessary or requested.",
      "Prior community or event planning experience is desirable.",
      "The ideal candidate will have a bachelor’s degree, excellent writing and communication skills, experience interacting with the public and leadership qualities.",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to DC if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter and references to dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-499-18",
    "position_title": "Constituent Service Representative",
    "office": "Maryland Democrat",
    "location": "District Office",
    "posting_date": "2019-01-14",
    "description": "A Maryland Democrat seeks a high-energy, highly-organized, and detailoriented Constituent Service Representative for his District Office.",
    "responsibilities": [
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Serve as the official representative for the Member at community events in the District.",
      "Provide logistical support for scheduled district meetings and events for the Member."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Thorough knowledge of agencies and casework processes.",
      "Strong oral and written communication skills.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to md06.jobs@gmail.com with “Constituent Service Representative” in the subject line. No phone calls or walk ins.",
    "salary_info": null,
    "contact": "md06.jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-498-18",
    "position_title": "Field Representative",
    "office": "Maryland Democrat",
    "location": "District Office",
    "posting_date": "2019-01-14",
    "description": "A Maryland Democrat seeks a high-energy, highly-organized, and detailoriented Field Representative for his District Office.",
    "responsibilities": [
      "Serve as the official representative for the Member in the community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Director on district and local issues of importance.",
      "Staff and provide logistical support for scheduled district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Answer casework correspondence and verbal communications with constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to md06.jobs@gmail.com with “Field Representative” in the subject line. No phone calls or walk ins.",
    "salary_info": null,
    "contact": "md06.jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-481-18",
    "position_title": "Communications Director",
    "office": "House Committee on Veterans' Affairs Incoming Majority (Democratic) Staff",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "House Committee on Veterans' Affairs Incoming Majority (Democratic) Staff seeks Communications Director to serve as spokesperson and primary communications advisor to the incoming Democratic Chairman. Qualified candidates will have significant on-the-record press experience, a demonstrated understanding of veterans’ issues, superior written communications skills, and a demonstrated ability to craft and execute a strategic communications plan. The office is an equal opportunity employer and encourages women, minorities, and LGBTQ candidates to apply. Veterans are also strongly encouraged to apply.",
    "responsibilities": [
      "The Communications Director will serve as the spokesperson and primary communications advisor to the incoming Democratic Chairman. They will be responsible for managing the execution of the committee’s strategic communications plan and overseeing day-to-day press activities, which include responding to media inquiries, booking the Chairman for interviews, pitching news stories to media outlets, working with policy leads to develop core messaging and talking points, and producing press releases, speeches, and op-eds that are at or near finished product. The Communications Director will also oversee other Committee press staff.",
      "Craft and execute the committee’s strategic communications plan and core message",
      "Speak to the media on the record, while maintaining a good working relationships with veterans reporters, and pitch members of the press promoting the Chairman’s agenda",
      "Remain abreast of current legislative and non-legislative issues about which the Chairman may be questioned",
      "Evaluate current events and news reports across the country for their impact on the Chairman",
      "Provide ideas and advice on the optics of the Chairman’s actions and legislative activities",
      "Produce press releases, media advisories, briefing materials, talking points, op-eds, and speeches",
      "Work closely with Chairman’s personal office staff to get official press statements out the door",
      "Be innovative, think outside of the box for messaging opportunities, be willing and capable of engaging new media (YouTube, video news platforms like NowThis, podcasts, etc.) as well as traditional press",
      "Be able to see a thorough press roll out of legislation or high profile committee hearings through completion (including traditional press releases, digital messaging, and story placements)",
      "Develop proactive press events in conjunction with legislative staff to convey the Chairman’s message and engage key constituencies",
      "Staff the Chairman at press events",
      "Oversee the collection and tracking of press clips",
      "Track communications goals",
      "Manage communications budget",
      "Support staff in developing their own communications skills",
      "Oversee the Press Assistant and Digital Assistant"
    ],
    "qualifications": [
      "3-4+ years’ experience as a Communications Director, Press Secretary, or similar public relations role",
      "Ability to engage with stakeholders/VSOs to get the Chairman’s/Committee message out there and keep the public informed and work hand in hand with policy team to move legislative priorities forward.",
      "Experience crafting and executing an effective, fast-paced communications strategy",
      "Previous on-the-record press experience",
      "Superior writing, editing, and proofing skills",
      "Demonstrated ability to dissect complex topics and make them relevant to a wide audience",
      "Previous military service and/or strong familiarity with veterans’ issues",
      "Willing to execute day-to-day tasks and work successfully within a team",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response"
    ],
    "how_to_apply": "Please submit cover letter and resume to hvactransition@gmail.com with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "hvactransition@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages women, minorities, and LGBTQ candidates to apply. Veterans are also strongly encouraged to apply."
  },
  {
    "id": "MEM-465-18",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Northeast Democrat",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "Northeast Democrat seeks legislative staffer to handle diverse policy portfolio. Candidates should be accomplished at drafting, advancing, and analyzing legislation, monitoring legislative developments, conducting research, and drafting vote recommendations. Ideal candidates will have strong organizational and time management skills; excellent written and verbal communication skills; positive attitude and disposition suited to the work environment; solid knowledge of the legislative process; and an ability to work under pressure and meet deadlines in an unpredictable work environment. This is not an entry-level legislative position. New Jersey ties are a plus but not required.",
    "responsibilities": [
      "drafting, advancing, and analyzing legislation",
      "monitoring legislative developments",
      "conducting research",
      "drafting vote recommendations"
    ],
    "qualifications": [
      "strong organizational and time management skills",
      "excellent written and verbal communication skills",
      "positive attitude and disposition suited to the work environment",
      "solid knowledge of the legislative process",
      "ability to work under pressure and meet deadlines in an unpredictable work environment"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to NJ10resumes@gmail.com with the following subject line: First name Last Name - Legislative Assistant. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "NJ10resumes@gmail.com",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-460-18",
    "position_title": "Press Assistant",
    "office": "Energy and Commerce Committee Democratic Staff",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Energy and Commerce Committee Democratic Staff seeks a motivated and hardworking communications professional to join fast-paced communications team as a press assistant. Responsibilities include drafting news releases, social media posts, op-eds and talking points; designing graphics for both social media and web content; monitoring social media for trending topics; maintaining and updating press lists; and compiling daily press clips. Qualified candidates must have excellent written and oral communication skills, a proven ability to perform under pressure while juggling multiple tasks and sound political judgment. Prior Hill or campaign communications experience, as well as professional social media and digital experience (including graphic design and photo and video editing), is preferred. Women and minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "drafting news releases",
      "social media posts",
      "op-eds and talking points",
      "designing graphics for both social media and web content",
      "monitoring social media for trending topics",
      "maintaining and updating press lists",
      "compiling daily press clips"
    ],
    "qualifications": [
      "excellent written and oral communication skills",
      "a proven ability to perform under pressure while juggling multiple tasks",
      "sound political judgment",
      "Prior Hill or campaign communications experience, as well as professional social media and digital experience (including graphic design and photo and video editing), is preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to ecdjobs@mail.house.gov. Please no walk ins or phone calls.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-459-18",
    "position_title": "Press Secretary",
    "office": "The Energy and Commerce Committee Democratic Staff",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Energy and Commerce Committee Democratic Staff seeks a motivated\nand hardworking communications professional to join fast-paced\ncommunications team to manage communications for our Energy and\nEnvironment subcommittees. Responsibilities include writing\ncommunications materials (news releases, statements, op-eds, and talking\npoints); managing press inquiries; maintaining strong relationships with\nreporters who cover the committee; and coordinating with the\ncommunications staff of committee members.",
    "responsibilities": [
      "Writing communications materials (news releases, statements, op-eds, and talking points)",
      "Managing press inquiries",
      "Maintaining strong relationships with reporters who cover the committee",
      "Coordinating with the communications staff of committee members"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "The ability to comprehend and summarize complex legislation quickly",
      "A proven ability to perform under pressure while juggling multiple tasks",
      "Sound political judgment",
      "At least 3 years of experience in a relevant field",
      "Prior Hill, energy/environmental communications, or campaign experience is preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and three writing samples to ecdjobs@mail.house.gov. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-457-18",
    "position_title": "Staff Assistant",
    "office": "Democratic full committee office",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "This individual will be responsible for answering phones, sorting mail, greeting visitors, and other duties as assigned.",
    "responsibilities": [
      "Answering phones",
      "Sorting mail",
      "Greeting visitors",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Outgoing personality",
      "Ability to multi-task",
      "Strong organizational skills",
      "Proficiency in Spanish is required"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-456-18",
    "position_title": "Deputy Clerk",
    "office": "Committee on Education and the Workforce, Democratic Staff",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Committee on Education and the Workforce, Democratic Staff is\ncurrently seeking a Deputy Clerk to assist the Chief Clerk in the 116th\nCongress. Duties include, but are not limited to archiving and records\nkeeping, notices and circulations, official filings, editing letters and reports,\nhearing, markup and conference logistics and proceeding, bill drops and floor\nlogistics, redlines, updates to the website, managing intern and fellowship\nprogram, maintaining the documents room, updating and maintaining the\nCommittee Calendar and all other duties as assigned. Candidates should\npossess exceptional organizational skills, be comfortable with public\nspeaking, and have excellent writing and research skills. The Deputy clerk\nwill be required to assume all clerking duties in the absence of the Chief\nClerk. Previous congressional experience is highly encouraged.",
    "responsibilities": [
      "Archiving and records keeping",
      "Notices and circulations",
      "Official filings",
      "Editing letters and reports",
      "Hearing, markup and conference logistics and proceeding",
      "Bill drops and floor logistics",
      "Redlines",
      "Updates to the website",
      "Managing intern and fellowship program",
      "Maintaining the documents room",
      "Updating and maintaining the Committee Calendar",
      "All other duties as assigned"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Comfortable with public speaking",
      "Excellent writing and research skills",
      "Previous congressional experience is highly encouraged"
    ],
    "how_to_apply": "Interested applicants should email their cover\nletter, resume and writing sample to jobs_ewdems@mail.house.gov. To\nensure proper identification, please put “DEPUTY CLERK APPLICATION”\nin the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "jobs_ewdems@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-454-18",
    "position_title": "Digital Media Manager",
    "office": "House Committee on Judiciary Democrats",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "House Committee on Judiciary Democrats seek a motivated, creative, digitalsavvy strategist to serve as Digital Media Manager.",
    "responsibilities": [
      "Developing the Committee’s social media strategy",
      "Drafting social media posts",
      "Maintaining and updating the website",
      "Creating graphics",
      "Creating videos",
      "Compiling and distributing news clips",
      "And working on special projects"
    ],
    "qualifications": [
      "Candidates must have strong writing skills, experience working in digital media, and the ability to work under tight deadlines."
    ],
    "how_to_apply": "Please send a writing and graphic sample, along with a resume and cover letter to HouseJudDemsJob@mail.house.gov.",
    "salary_info": null,
    "contact": "HouseJudDemsJob@mail.house.gov",
    "equal_opportunity": "Minorities, women, and LGBTQ persons are strongly encouraged to apply."
  },
  {
    "id": "MEM-448-18",
    "position_title": "Press Secretary",
    "office": "New York Congressman",
    "location": "DC",
    "posting_date": "2019-01-14",
    "description": "The press secretary is responsible for developing and executing a media strategy, which includes writing press releases, talking points, and opeds, while also managing the Member's social media pages, web site, pitching story ideas and working closely with reporters. Must have on-the-record experience and strong writing skills. Candidates with NY ties a plus. This is not an entry level position.",
    "responsibilities": [
      "Developing and executing a media strategy",
      "Writing press releases, talking points, and opeds",
      "Managing the Member's social media pages",
      "Managing the Member's web site",
      "Pitching story ideas",
      "Working closely with reporters"
    ],
    "qualifications": [
      "Must have on-the-record experience",
      "Strong writing skills",
      "Candidates with NY ties a plus",
      "Not an entry level position"
    ],
    "how_to_apply": "Please send resume and writing sample to ny03.resumes@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "ny03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-443-18",
    "position_title": "Climate Change and Environment Legislative Assistant",
    "office": "Senior Energy and Commerce Democrat",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The primary responsibilities for this position will be leading the Member’s existing climate initiatives, identifying new areas for legislative action, and coordinating with other Members and outside stakeholders. Additional duties will be based on experience and include other environmental and natural resources priorities.\n\nThis is not an entry level position. Significant experience working on climate policy is required and previous Hill experience is preferred. The ideal candidate will be creative and proactive, possess a strong work ethic, and be able to have fun while maintaining a busy schedule.",
    "responsibilities": [
      "Leading the Member’s existing climate initiatives",
      "Identifying new areas for legislative action",
      "Coordinating with other Members and outside stakeholders",
      "Additional duties will be based on experience and include other environmental and natural resources priorities."
    ],
    "qualifications": [
      "Significant experience working on climate policy is required",
      "Previous Hill experience is preferred",
      "The ideal candidate will be creative and proactive",
      "Possess a strong work ethic",
      "Be able to have fun while maintaining a busy schedule"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and writing sample to seniordemclimatejob@gmail.com.",
    "salary_info": null,
    "contact": "seniordemclimatejob@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-439-18",
    "position_title": "Staff Assistant",
    "office": "Rep. Justin Amash (MI)",
    "location": "Washington, DC",
    "posting_date": "2019-01-14",
    "description": "The staff assistant will be responsible for answering phones, processing mail, assisting with constituent requests for information, coordinating tours, drafting correspondence, and other administrative duties and projects as needed.\n\nThe person also will handle some light press assistant duties, including compiling press clips, monitoring media, drafting e-newsletters and press releases, updating the website, and fielding some media inquiries.\n\nThe successful applicant will be personable, organized, and committed to individual liberty, economic freedom, the Rule of Law, and the Constitution.",
    "responsibilities": [
      "Answering phones",
      "Processing mail",
      "Assisting with constituent requests for information",
      "Coordinating tours",
      "Drafting correspondence",
      "Other administrative duties and projects as needed",
      "Compiling press clips",
      "Monitoring media",
      "Drafting e-newsletters and press releases",
      "Updating the website",
      "Fielding some media inquiries"
    ],
    "qualifications": [
      "Excellent communication and time-management skills",
      "The ability to exercise sound, independent judgment",
      "The ability to work cooperatively and courteously with others",
      "BA or equivalent",
      "Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"staff assistant applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-438-18",
    "position_title": "Communications Director",
    "office": "Senior Democratic Member",
    "location": "Capitol Hill",
    "posting_date": "2019-01-14",
    "description": "Senior Democratic Member seeks a Communications Director to lead a fastpaced press shop. The ideal candidate must be a talented writer, capable of producing speeches, op-eds, floor statements, press responses, briefing memoranda, and talking points under tight timelines. The Communications Director will also manage the Member’s national media profile and coordinate with the Digital Media Manager to implement a robust digital media strategy.\n\nCandidates should have previous Capitol Hill experience and a proven record of securing national press coverage for their boss’ work.",
    "responsibilities": [
      "Producing speeches",
      "Producing op-eds",
      "Producing floor statements",
      "Producing press responses",
      "Producing briefing memoranda",
      "Producing talking points",
      "Manage the Member’s national media profile",
      "Coordinate with the Digital Media Manager to implement a robust digital media strategy"
    ],
    "qualifications": [
      "Understanding of the legislative process",
      "Ability to quickly grasp and distill policy issues",
      "Excellent oral and written communications skills",
      "Team player who work well with others",
      "Previous Capitol Hill experience",
      "Proven record of securing national press coverage"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and writing sample to seniordemcommsjob@gmail.com.",
    "salary_info": null,
    "contact": "seniordemcommsjob@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-437-18",
    "position_title": "Legislative Director",
    "office": "Member",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "CORE RESPONSIBILITIES:\n\n*   to advise the Member on all legislative areas;\n*   to assist in development of policy positions and legislative initiatives; and\n*   to manage and supervise the office's legislative staff.\n\nMINIMUM QUALIFICATIONS:\n\n*   at least 3 years of legislative experience;\n*   at least 1 years of management experience;\n*   strong academic credentials;\n*   strong leadership and organizational skills;\n*   excellent oral and written communication skills;\n*   ability to work well under pressure;\n*   thorough knowledge of the legislative process; and\n*   availability to work long hours and at night.\n\nPREFFERED QUALIFICATIONS\n\n*   at least 5 years of legislative experience\n*   at least 2 years of management experience\n*   completion of an advanced degree\n*   experience in and/or knowledge of New York state government and politics; particularly upstate New York\n\nDUTIES:\n\n*   ensures that the legislative staff is properly focused on the Member's legislative goals;\n*   works to formulate positions on legislative issues;\n*   monitors legislative activity on the House floor and handles long-term and short-term legislative planning for the Member;\n*   oversees the progression of bills with which the Member is involved as they move from Committee to the floor;\n*   recommends strategies and tactics on bills and positions; * assigns legislative staff areas of responsibility;\n*   trains and supervises legislative staff;\n*   schedules and directs legislative staff meetings;\n*   meets with groups of key constituents or other office visitors, as necessary;\n*   recommends co-sponsorships of legislation to the Member;\n*   writes and reviews legislative memos;\n*   hires legislative staff, with approval of the Chief of Staff/Administrative Assistant and the Member, when necessary;\n*   oversees activities of the office in the absence of the Chief of Staff/Administrative Assistant;\n*   maintains up-to-date status reports on all legislation affecting the district, legislation in which the Member is a principal sponsor, or legislation which the Member is a cosponsor;\n*   monitors and reports on floor action to the Member and the Chief of Staff/Administrative Assistant;\n*   coordinates responses to all legislative mail;\n*   assists organizations and constituents in the district with federal matters; and\n*   performs other duties as assigned.",
    "responsibilities": [
      "to advise the Member on all legislative areas",
      "to assist in development of policy positions and legislative initiatives",
      "to manage and supervise the office's legislative staff",
      "ensures that the legislative staff is properly focused on the Member's legislative goals",
      "works to formulate positions on legislative issues",
      "monitors legislative activity on the House floor and handles long-term and short-term legislative planning for the Member",
      "oversees the progression of bills with which the Member is involved as they move from Committee to the floor",
      "recommends strategies and tactics on bills and positions",
      "assigns legislative staff areas of responsibility",
      "trains and supervises legislative staff",
      "schedules and directs legislative staff meetings",
      "meets with groups of key constituents or other office visitors, as necessary",
      "recommends co-sponsorships of legislation to the Member",
      "writes and reviews legislative memos",
      "hires legislative staff, with approval of the Chief of Staff/Administrative Assistant and the Member, when necessary",
      "oversees activities of the office in the absence of the Chief of Staff/Administrative Assistant",
      "maintains up-to-date status reports on all legislation affecting the district, legislation in which the Member is a principal sponsor, or legislation which the Member is a cosponsor",
      "monitors and reports on floor action to the Member and the Chief of Staff/Administrative Assistant",
      "coordinates responses to all legislative mail",
      "assists organizations and constituents in the district with federal matters",
      "performs other duties as assigned"
    ],
    "qualifications": [
      "at least 3 years of legislative experience",
      "at least 1 years of management experience",
      "strong academic credentials",
      "strong leadership and organizational skills",
      "excellent oral and written communication skills",
      "ability to work well under pressure",
      "thorough knowledge of the legislative process",
      "availability to work long hours and at night"
    ],
    "how_to_apply": "Please respond with position you are applying for in the subject line with resume and writing sample to nyresume2@gmail.com",
    "salary_info": null,
    "contact": "nyresume2@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-436-18",
    "position_title": "Staff Assistant",
    "office": null,
    "location": null,
    "posting_date": "2019-01-14",
    "description": "DUTIES:\n•answers and screens telephone calls for the Member and other staff members and takes messages;\n•greets and screens visitors;\n•assists persons who have appointments with the Member or other staff members. Works closely with the Member's Scheduler to ensure that the Member's appointments are on time and that the Scheduler is aware of the visitors' arrival;\n•responds to constituent requests for flags, tours and other information;\n•maintains handout literature regarding the district and the House;\n•signs for deliveries and forwards all materials delivered to the office to appropriate staff members in a timely manner;\n•maintains the office answering machine or voice mail;\n•ensures that requests for assistance are directed to the appropriate staff member in a timely manner;\n•writes down visitor opinions, including full name, address, and all relevant information;\n•logs in mail;\n•tracks library books from the Library of Congress;\n•performs general typing and administrative assignments;\n•sends, receives, and distributes materials via the facsimile machine; and\n•performs other administrative and legislative duties as assigned.",
    "responsibilities": [
      "to answer the telephones",
      "to greet visitors to the office",
      "to answer constituent requests for general information, tours, and other inquiries",
      "to monitor delivery and pickup of materials",
      "to maintain front office",
      "to assist with various administrative and legislative duties",
      "occasionally driving the member to and from events"
    ],
    "qualifications": [
      "minimum of 1 year office experience; congressional internship experience preferred",
      "professional telephone manner",
      "proficiency in word processing",
      "excellent organizational and proofreading skills",
      "ability to use photocopier, facsimile machine and other office equipment",
      "ability to work cooperatively and courteously with others",
      "availability to work long hours, if necessary",
      "valid drivers license"
    ],
    "how_to_apply": "Please respond with position you are applying for in the subject line with resume and writing sample to nyresume2@gmail.com",
    "salary_info": null,
    "contact": "nyresume2@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-430-18",
    "position_title": "Communications Director",
    "office": "Southern Democrat",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "A Southern Democrat seeks a Communications Director to manage an\nactive communications operation. Successful candidates will have superb\nwritten and verbal communication skills, be comfortable multi-tasking, have\nexcellent attention to detail, and work well under pressure. The Communications Director will work closely with the\nPress Assistant and other press team members to finalize\npress/communication products and strategy. The Communications Director\nwill staff the member during press events, media interviews, and other events\nas needed. Candidates must be available nights and weekends as situations\nrequire. This is not an entry-level position, experience is required.",
    "responsibilities": [
      "managing press releases, speeches, op-eds, and letters to the editor, and other written material for the Member",
      "managing an active social media presence",
      "managing e-newsletters",
      "graphic design"
    ],
    "qualifications": [
      "superb written and verbal communication skills",
      "comfortable multi-tasking",
      "excellent attention to detail",
      "work well under pressure",
      "experience is required"
    ],
    "how_to_apply": "apply at nchousejobs@gmail.com",
    "salary_info": null,
    "contact": "nchousejobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and diverse candidates are encouraged to apply"
  },
  {
    "id": "MEM-422-18",
    "position_title": "Legislative Assistant, or Senior Legislative Assistant",
    "office": "Senior Democrat",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "Senior Democrat seeks Legislative Assistant, or Senior Legislative Assistant depending on qualifications, to handle work on the Financial Services Committee and other issues. Candidates should have substantial experience with financial services issues and substantial Congressional experience. The successful applicant will possess strong writing and oral communication skills, work well with others, be comfortable in a fast-paced environment, and understand the legislative process.",
    "responsibilities": [],
    "qualifications": [
      "Substantial experience with financial services issues",
      "Substantial Congressional experience",
      "Strong writing and oral communication skills",
      "Ability to work well with others",
      "Comfortable in a fast-paced environment",
      "Understand the legislative process"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter, resume, and three writing samples to financeservicesla@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "financeservicesla@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-411-18",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives. Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff.\n\nThe ideal candidate will be an attorney with several years of investigative or litigation experience. Candidates with diverse backgrounds and experiences are strongly encouraged to apply. Candidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Attorney with several years of investigative or litigation experience",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line. No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-404-18",
    "position_title": "Staffer",
    "office": "House Small Business Committee (Democratic staff)",
    "location": null,
    "posting_date": "2019-01-14",
    "description": "The House Small Business Committee (Democratic staff) seeks a staffer to work on issues related to small business technology, telecommunications, and trade policy. Candidate must be an outstanding writer, have a demonstrated capacity to generate new ideas, and the proven ability to analyze legislation.\n\nThis is not an entry level position. A graduate degree is strongly preferred. Exceptional writing and analytical skills are a must. Prior Hill, federal agency, private sector or policy think tank experience is preferred. The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply.",
    "responsibilities": [],
    "qualifications": [
      "Outstanding writer",
      "Demonstrated capacity to generate new ideas",
      "Proven ability to analyze legislation",
      "Exceptional writing and analytical skills"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  }
]