[
  {
    "id": "MEM-442-24",
    "position_title": "Legislative Assistant",
    "office": "Congressman Jason Crow (CO-06)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Jason Crow (CO-06) seeks a highly motivated, hard-working Legislative\nAssistant, based in our Washington, D.C. oAice. This position reports to the Legislative\nDirector. The LA will handle a domestic-facing portfolio, including animals, arts, postal,\nsmall business, housing, and telecom.\n\nIdeal candidates will have strong written and oral communications skills and be\ndetail-oriented, organized, and creative.",
    "responsibilities": [
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio\nof issue areas",
      "Working with external stakeholders, CRS, Legislative Counsel, and committee staA\nto draft legislation based on the Member’s priorities",
      "Preparing and staAing the Member for meetings, and assisting in the drafting of\nremarks, as needed",
      "Communicating clearly and consistently with the Member, Legislative Director, and\nlegislative, communications, and district teams on legislative updates"
    ],
    "qualifications": [
      "Commitment to a collaborative work environment",
      "Ability to work in a fast-paced environment and manage competing priorities",
      "Ability to communicate up and down within the team",
      "Ability to learn the Congressman’s voice and legislative priorities",
      "Interest in identifying and pursuing new opportunities and the ability to anticipate\nand adapt to challenges",
      "Colorado ties are a plus and prior Hill experience is preferred."
    ],
    "how_to_apply": "Qualiﬁed applicants should submit a resume, cover letter, and writing sample (no more\nthan 3 pages) as one combined PDF to co06.resumes@mail.house.gov. Include\n“Legislative Assistant – [Full Name]” in the subject line. Applications will be considered on\na rolling basis as received. No phone calls or drop-ins please.",
    "salary_info": "Compensation is competitive and commensurate with level of experience.",
    "contact": "co06.resumes@mail.house.gov",
    "equal_opportunity": "This oAice is committed to building a diverse and inclusive team: candidates of color,\nwomen, and LGBTQIA+ candidates are encouraged to apply. This oAice is an equalopportunity employer and does not discriminate on the basis of race, color, religion, sex,\nsexual orientation, gender identity, national origin, disability, military status, age, marital\nstatus, or parental status."
  },
  {
    "id": "MEM-438-24",
    "position_title": "District Director",
    "office": "Office of Congresswoman Jill Tokuda",
    "location": "District Office",
    "posting_date": "2024-10-21",
    "description": "Rep. Jill Tokuda is looking for a highly motivated individual to manage her Hawaii staff and oversee operations and objectives to ensure community and constituent needs are met fully and in a timely manner. This position develops outreach and constituent service strategies, represents the Congresswoman in meetings and at events, supervises district staff, and plans/assigns work. The ideal candidate would have supervisory experience and leadership skills, the ability to manage multiple tasks, and extremely strong written and verbal communication skills. Attention to detail and ability to work collaboratively is required.",
    "responsibilities": [
      "Works with staff to put together the Congresswoman’s district schedule.",
      "Ensures casework is being handled in a timely manner and that messages, commendations, and correspondence are being delivered before deadlines. Proofs documents sent out from the district office.",
      "Oversees the annual congressional competitions for art & computer applications, as well as the military academy nominations process.",
      "Directly oversees district staff including field representatives.",
      "Maintains communication with the Congresswoman and the Chief of Staff, ensuring they are abreast of local concerns and any Hawaii staff issues, suggests strategies for handling when needed."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates are requested to submit a cover letter, resume, and three references to HI02jobs@gmail.com.",
    "salary_info": null,
    "contact": "HI02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-431-24",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Alma Adams, member of the House Education and the Workforce Committee",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congresswoman Alma Adams, member of the House Education and the Workforce Committee, seeks an experienced Legislative Assistant to join her team. The policy\n\nportfolio and areas of responsibility for this position is mostly focused on Education and Workforce Committee work. The portfolio of work will include other issues however they will be assigned based on experience and need.\n\nThis position reports to the Legislative Director and Chief of StaA and will include extensive work with the Congresswoman and the rest of her team. Qualiﬁed candidates should have knowledge of the legislative process and demonstrate an ability to take initiative.\nHill experience is required.",
    "responsibilities": [
      "Preparing and staAing Member for meetings, committee hearings and markups, ﬂoor votes, and related events;",
      "Representing Member in meetings with constituents and both national- and local-level advocacy groups, think thanks, and other groups relevant to policy portfolio;",
      "Tracking legislation and other developments in assigned issue area(s), monitor relevant committee and ﬂoor activity, track developing local/international news events, make recommendations for votes, cosponsor ships and letters for Member to sign;",
      "Building and maintaining positive relationships with congressional staA, district and national stakeholders, advocacy organizations, Executive Branch oAicials, and other key stakeholders relevant to policy portfolio;",
      "Building support for Member’s policy priorities and developing/implementing ideas for new initiatives (legislation, letters, events, press, etc.)",
      "Drafting legislation, letters, ﬂoor/committee remarks, talking points, press related materials, and other written material related to policy portfolio; and",
      "Other duties as assigned by senior staA."
    ],
    "qualifications": [
      "Hill experience is required.",
      "Knowledge of the legislative process",
      "Ability to take initiative"
    ],
    "how_to_apply": "To apply, please submit a cover letter, resume, and writing sample to NC12.Resume@mail.hosue.gov with “Legislative Assistant” in the subject line. Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": "NC12.Resume@mail.hosue.gov",
    "equal_opportunity": "The OAice of Representative Alma Adams is an equal opportunity employer, committed to developing an organization that is reﬂective of and attentive to the needs of the diverse community we serve. The oAice does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-425-24",
    "position_title": "Legislative Correspondent",
    "office": "Office of Rep. Greg Landsman",
    "location": "DC office",
    "posting_date": "2024-10-21",
    "description": "The oAice of Rep. Greg Landsman seeks a highly motivated, energetic, and organized individual to serve as a Legislative Correspondent, based in our DC oAice.\n\nThe LC reports to the Legislative Director and works in close collaboration with the Member, Chief of StaA, and communications and district teams. The LC will manage the Congressman’s constituent mail program and provide support to the full legislative team.",
    "responsibilities": [
      "Drafting tailored letters in response to constituent inquiries",
      "Maintain and update current response letter library",
      "Sorts/batches incoming constituent mail by issue area",
      "Ensures accurate batching and a timely response to all constituents",
      "Meeting with constituents, stakeholders, and advocacy groups as needed",
      "Communicating clearly and consistently with the Legislative Director, Chief of StaA, and Member"
    ],
    "qualifications": [
      "Strong verbal and written communications skills and ability to communicate both up and down within the team",
      "Excellent organizational skills and ability to prioritize assignments",
      "Ability to work in a fast-paced environment and quickly respond to requests from the Member and the team",
      "Commitment to a collaborative work environment",
      "Ability to quickly learn and adapt to the Congressman’s voice, style, and legislative priorities",
      "Comfort with receiving and delivering feedback",
      "Attention to detail, creativity, and most of all, hustle."
    ],
    "how_to_apply": "To apply, please email jobs.landsman@mail.house.gov with “Legislative Correspondent” in the subject line and the following application materials attached as one combined PDF:\nCover letter\nRésumé\nBrief writing sample\nTwo references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\nNo phone calls or drop bys, please.",
    "salary_info": "Salary range is $50,000 - $55,000, commensurate with experience. Title commensurate with experience.",
    "contact": "jobs.landsman@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. Ohio ties are a plus. The oAice is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-424-24",
    "position_title": "Legislative Aide",
    "office": "Office of Rep. Greg Landsman",
    "location": "DC Office",
    "posting_date": "2024-10-21",
    "description": "The oAice of Rep. Greg Landsman seeks a highly motivated, energetic, and detail-oriented individual to serve as a Legislative Aide, based in our DC oAice.\n\nThe Legislative Aide reports to the Legislative Director and works in close collaboration with the Member, Chief of StaA, and communications and district teams. Exact issue area portfolio is ﬂexible, and applicants with backgrounds in any issue area are encouraged to apply.",
    "responsibilities": [
      "Preparing and staAing the Member for meetings",
      "Working with committee staA, external stakeholders, Legislative Counsel, and the Congressional Research Service to draft legislation based on the Member’s priorities",
      "Creating vote recommendations on legislation coming to the Floor within a given issue area",
      "Meeting with constituents, stakeholders, and advocacy groups within the portfolio of issue areas",
      "Communicating clearly and consistently with the Member, Chief of StaA, and legislative, communications, and district teams on legislative updates",
      "Overseeing special projects, that may include drafting letters of support, and researching and advising local stakeholders on federal funding/grant opportunities"
    ],
    "qualifications": [
      "Strong verbal and written communications skills and ability to communicate both up and down within the team",
      "Ability to work in a fast-paced environment and quickly respond to requests from the Member and the team",
      "Commitment to a collaborative work environment",
      "Ability to quickly learn and adapt to the Congressman’s voice, style, and legislative priorities",
      "Comfort with receiving and delivering feedback",
      "Attention to detail, creativity, and most of all, hustle"
    ],
    "how_to_apply": "To apply, please email jobs.landsman@mail.house.gov with “Legislative Aide” in the subject line and attach the following application materials as one combined PDF:\n\nCover letter\nRésumé\nTwo references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without reaching out to you for your approval)\nNo phone calls or drop bys, please.",
    "salary_info": "$65,000",
    "contact": "jobs.landsman@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. Ohio ties are a plus. The oAice is an equal-opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-422-24",
    "position_title": "Legislative Correspondent",
    "office": "U.S. Rep. Max Miller (OH-07)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The Legislative Correspondent will research legislative issues and draft correspondence to explain the Member’s position to constituents and other stakeholders on a variety of public policy matters. The Legislative Correspondent will also attend meetings with constituents and provide support for Committee hearings and markups.",
    "responsibilities": [
      "Research legislative issues and draft correspondence to explain the Member's position on public policy matters to constituents and other stakeholders",
      "Collaborate with the legislative staA to design and implement the Member's legislative strategy",
      "Consult with the Legislative Director and Legislative Assistants to ensure the Member's library of legislative letters are accurate, up to date, and reﬂective of the Member's policy positions",
      "Create and maintain a collection of prepared responses to address general legislative inquiries",
      "Draft and edit tailored responses to answer constituent inquiries",
      "Ensure that legislative responses are completed timely to maintain outstanding constituent relations",
      "Attend legislative meetings with constituents to assist with Committee hearings and markups",
      "Organize workload to prioritize tasks and ensure work is completed in an eAicient and eAective manner",
      "Track legislation through committees, House ﬂoor, Senate, and conference committee processes",
      "Coordinate with the legislative staA to act as a liaison with constituents, interest groups, committees, and agency staA.",
      "Complete special projects as assigned by senior staA"
    ],
    "qualifications": [
      "Adaptability: Adapts quickly to change or unexpected obstacles; easily considers new approaches.",
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Constituent / Stakeholder Service Driven: Anticipates and meets the needs of constituents. Delivers high-quality products and services.",
      "Interpersonal Skills: Develops and maintains eAective relationships with others from diverse backgrounds and in diAerent situations. Shows understanding, courtesy, tact, empathy, and politeness.",
      "Verbal Communication: Makes clear and convincing oral presentations that are appropriate to listeners and situations. Listens eAectively, attends to nonverbal cues, and responds appropriately.",
      "Written Communication: Writes cogently and succinctly to convey information in the most eAicient and eAective manner possible for use by the Member, other staA, and stakeholders",
      "Bachelor's degree",
      "Demonstrated interest in public service",
      "Tie to Ohio"
    ],
    "how_to_apply": "Interested applicants should e-mail a resume and cover letter to MaxMillerOhioResumes@gmail.com with the speciﬁc subject line: “[Applicant name] – Legislative Correspondent Application.” Resumes submitted by other means will not be considered. Applicants who advance during the recruitment process will be required to submit a writing sample, the topic of which will be provided by the oAice.",
    "salary_info": "Dependent upon skills and experience.",
    "contact": "MaxMillerOhioResumes@gmail.com",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-415-24",
    "position_title": "Communications Director",
    "office": "Office of Rep. Maxine Waters (D-CA-43)",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The OAice of Rep. Maxine Waters (D-CA-43) seeks a dynamic and experienced Communications Director to lead the development and implementation of communication strategies that promote the Member's priorities and initiatives. The ideal candidate will have a strong background in media relations, public aAairs, and strategic messaging, as well as the ability to work collaboratively with legislative and district teams.",
    "responsibilities": [
      "Develop and implement comprehensive communication strategies for the Member.",
      "Oversee media relations, including drafting press releases and managing inquiries.",
      "Coordinate communications eAorts with legislative initiatives.",
      "Craft speeches, op-eds, and other written materials.",
      "Manage social media presence and digital communications.",
      "Work closely with the Chief of StaA and Legislative Director to align messaging.",
      "Monitor and analyze media coverage of the Member and relevant issues.",
      "Serve as the primary spokesperson for the Member.",
      "Train and prepare the Member for public appearances and interviews."
    ],
    "qualifications": [
      "Bachelor’s degree in Communications, Public Relations, or a related ﬁeld.",
      "5+ years of experience in communications, media relations, or public aAairs.",
      "Strong writing and editing skills with attention to detail.",
      "Experience working in a fast-paced political environment.",
      "Familiarity with social media platforms and digital communication strategies.",
      "Ability to manage multiple projects and deadlines eAectively.",
      "Strong interpersonal and team collaboration skills.",
      "Knowledge of current legislative issues and their impact on constituents.",
      "Familiarity with California and/or District 43 preferred."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter, and at least 3 references to ellis.mcginnis@mail.house.gov with “Communications Director” in the subject line. Applications will be accepted until the position is ﬁlled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "ellis.mcginnis@mail.house.gov",
    "equal_opportunity": "This oAice is an equal opportunity employer."
  },
  {
    "id": "MEM-410-24",
    "position_title": "Constituent Services Representative",
    "office": "Congressional Staff",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The Constituent Services Representative position acts as a liaison to federal, district, and local agencies for the Member/constituents and answers casework correspondence and verbal communications with constituents. Candidates must be a selfstarter, excited to problem solve, hardworking, dependable, and organized as well as possess strong oral and written communication skills. This position requires the ability to work well under pressure, good judgment, strong customer service skills, and a commitment to public service. Availability to work some evenings and weekends is required. Ability to communicate in multiple languages is also highly desirable. A vehicle to travel to evening and weekend events is also recommended.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Handles casework assignments and special projects at the direction of the Director of Constituent Services;",
      "Continually screens active cases/ constituent service requests and acts as a liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Attends and monitors scheduled district meetings on behalf of the Member with constituents and groups during regular office hours, some evenings and weekends;",
      "Logging incoming and outgoing correspondence, handling visitors & telephone calls;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework and constituent concerns in Congressional Management System Database;",
      "Performs cross functional tasks with other departments, as needed.",
      "Meets attendance requirements as established by the office; Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;"
    ],
    "qualifications": [
      "Strong customer service, oral and written communication skills;",
      "Familiarity with local, state and federal agencies; Strong knowledge of issues and events in the district in which the Member is involved;",
      "Professional telephone manner and excellent customer and client service skills;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge and proficiency in Microsoft office suite and other office computer applications."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter and resume to ny08team@gmail.com with the Subject Line: Constituent Services Representative Position.",
    "salary_info": null,
    "contact": "ny08team@gmail.com",
    "equal_opportunity": "Women, people of color, and LGBTQ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-402-24",
    "position_title": "Constituent Advocate (District O8ice)",
    "office": "Office of Congresswoman Jill Tokuda",
    "location": "Honolulu Office",
    "posting_date": "2024-10-21",
    "description": "Rep. Jill Tokuda is looking for an enthusiastic and highly motivated individual to join her district staA in her Honolulu OAice. This position works with constituents who request assistance and acts as a liaison to federal, state, and local agencies. The ideal candidate would have strong customer service skills and the ability to write quickly and eAectively. Attention to detail and the ability to work in a fast-paced environment is required.",
    "responsibilities": [
      "Works with constituents who request assistance and maintains up-to-date files on all cases.",
      "Manages casework through a constituent management system and handles cases in a timely and responsible manner, which includes working with federal, state, and local agencies.",
      "Answers phones, checks voicemail, and responds to calls or refers calls to appropriate staA. Greets and assists visitors.",
      "Reviews, processes, and distributes mail.",
      "Prepares written responses to constituent inquiries and congratulatory messages."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates are requested to submit a cover letter and resume to hawaii02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-392-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Emilia Sykes",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congresswoman Emilia Sykes seeks a Communications Director to serve in their Washington, D.C. office. Candidates must be proactive, possess superior written and oral communication skills, and be able to execute a robust communications strategy. This is not an entry-level position. Only candidates with prior political or legislative communications experience will be considered.",
    "responsibilities": [
      "Creating and executing a robust communications plan",
      "Establishing and maintaining relationships with Ohio, national, and D.C.-based media",
      "Advancing press events and staffing the Member as needed, including occasional night and weekend commitments",
      "Drafting and distributing press releases, statements, and media advisories",
      "Creating, editing, and strategically placing op-eds",
      "Overseeing the development of social media content creation, including rapid response",
      "Managing a franked communications plan including text messages, e-newsletters, digital ads, radio ads, 499s, mailers, etc",
      "Pitching to reporters and producers, responding to press inquiries, and serving as the main point-of-contact for media",
      "Updating the website as needed",
      "Managing the Press Secretary",
      "Performing other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, three references, and two writing samples in one pdf to JoinTeamSykes@mail.house.gov with the following subject line: Full Name – Communications Director.",
    "salary_info": "$90,000-$100,000 based on experience",
    "contact": "JoinTeamSykes@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-382-24",
    "position_title": "Military and Veterans Affairs Liaison",
    "office": "Congressman Max Miller",
    "location": "Medina and Parma, Ohio",
    "posting_date": "2024-10-21",
    "description": "The Military and Veterans Affairs Liaison is responsible for maintaining relationships with veterans, military members, military installations and organizations, veterans organizations and offices, and other like entities within the district. Additionally, the liaison will be responsible for all military and veterans related casework and lead the office’s service academy nomination process.",
    "responsibilities": [
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents, organizations, etc;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Acts as a liaison to and notifies the appropriate media when the Member will be in the liaison’s area and works with the Member’s Scheduler and Press Secretary to ensure appropriate media participation;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Director of Constituent Services;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Assists with the handling of office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Bachelor's degree or equivalent combination of education and experience preferred;",
      "Previous office experience is preferred;",
      "Previous experience working for a Member of Congress, elected official, or government agency preferred;",
      "Meets attendance requirements as established by the office;",
      "Accepts performance based criticism and directions;",
      "Strong oral and written communication skills;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including some nights and weekends;",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter and resume to Raymond.Paoletta@mail.house.gov.",
    "salary_info": null,
    "contact": "Raymond.Paoletta@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-135-24",
    "position_title": "PRESS SECRETARY",
    "office": "Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. oAice. Candidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\n\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staA the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the oAice’s larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The OAice of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-10-21",
    "description": "The Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to ellis.mcginnis@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "ellis.mcginnis@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-443-24",
    "position_title": "Spring 2025 Congressional Internship",
    "office": "Congressman Glenn Grothman (WI-06)",
    "location": "Washington, DC",
    "posting_date": "2024-10-21",
    "description": "The oAice of Congressman Glenn Grothman (WI-06) is now accepting applicants for Spring 2025 Congressional Internships in our Washington, DC oAice. Successful applicants will be motivated, detail-oriented, display a strong work ethic, and interact well with constituents. In addition, applicants should have a strong interest in the legislative process and the function of Congress. A monthly stipend will be provided to individuals selected for the internship.",
    "responsibilities": [
      "Answering constituent phone calls and directing them appropriately",
      "Researching legislation for the Member and legislative staA",
      "Attending congressional hearings and policy brieﬁngs",
      "Answering constituent letters on various issues before the House",
      "Helping the communications/press team",
      "Conducting Capitol tours for constituents and other guests",
      "Other projects as assigned by the staA"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please email your resume to WisconsinResumes@mail.house.gov. Ties to the state of Wisconsin are preferred, but not required.",
    "salary_info": "A monthly stipend will be provided to individuals selected for the internship.",
    "contact": "WisconsinResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-441-24",
    "position_title": "Digital/Press Intern",
    "office": "Congressman Jim Costa (CA-21)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congressman Jim Costa (CA-21) seeks a highly motivated and creative Digital/Press Intern to join a fast-paced communications operation based in Rep. Costa’s Washington, D.C. oAice for the Winter/Spring 2025 intern class.\n\nThis internship program prides itself on its educational aspects. Press interns will immerse themselves in fast-paced press operations and learn the ins and outs of a congressional communications shop. They will have an opportunity to learn and engage on various digital platforms while learning how to connect people to policy.\n\nQualiﬁed candidates should have strong writing, editing, and digital skills to assist with time-sensitive assignments, as well as basic familiarity with graphic design/video editing software, such as Adobe, Canva, and Photoshop. Candidates with experience in a press or digital media role (including internships) are preferred but not required. California or Central Valley ties are a plus. The intern will be under the supervision of the Communications Director and Internship Coordinator.",
    "responsibilities": [
      "Assist the Communications Director and Press Assistant with drafting social media content, e-newsletters, targeted mailing, and website content.",
      "Edit photos and create engaging graphics in line with the Congressman’s brand.",
      "Clipping, editing, and compiling videos.",
      "Assist with the creation and maintenance of press lists.",
      "Compile daily press clips and reports about social media analytics.",
      "Other oAice tasks such as answering phones, drafting correspondence, conducting tours, and other duties as required."
    ],
    "qualifications": [
      "Strong writing, editing, and digital skills",
      "Basic familiarity with graphic design/video editing software, such as Adobe, Canva, and Photoshop.",
      "Experience in a press or digital media role (including internships) are preferred but not required.",
      "California or Central Valley ties are a plus."
    ],
    "how_to_apply": "Interested applicants should ﬁll out the internship application via our website: Internships | Congressman Jim Costa (house.gov), (https://costa.house.gov/services/internships) specifying in their application their desire to be a press intern.",
    "salary_info": null,
    "contact": "Please reach out to our intern coordinator, Grant Menolascino, with any questions regarding the application process at Grant.menolascino@mail.house.gov.",
    "equal_opportunity": "The OAice of Rep. Jim Costa is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-440-24",
    "position_title": "Legislative Intern",
    "office": "Congressman Josh Harder (CA-9)",
    "location": "Washington, DC",
    "posting_date": "2024-10-21",
    "description": "Congressman Josh Harder (CA-9) is seeking motivated legislative interns for the Spring Session in his Washington, DC oAice. Interns will participate in the daily operations, assisting with congressional hearings, writing memos, answering phones, sorting mail, and supporting staA. Candidates should exhibit strong work ethic, attention to detail, punctuality, and excellent writing skills. District ties are preferred but not required. This paid internship provides valuable experience in government and politics.",
    "responsibilities": [
      "Participate in the daily operations",
      "Assisting with congressional hearings",
      "Writing memos",
      "Answering phones",
      "Sorting mail",
      "Supporting staff"
    ],
    "qualifications": [
      "Strong work ethic",
      "Attention to detail",
      "Punctuality",
      "Excellent writing skills",
      "District ties are preferred but not required"
    ],
    "how_to_apply": "To apply, send your resume, cover letter, and a 1-2 page writing sample as a PDF to Eli.Aguayo@mail.house.gov by COB on November 22nd, 2024.",
    "salary_info": "paid internship",
    "contact": "Eli.Aguayo@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-439-24",
    "position_title": "Legislative Internship",
    "office": "Office of Congresswoman Susan Wild (PA-07)",
    "location": "Washington D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congresswoman Susan Wild (PA-07) is seeking full-time interns to assist her legislative team in Washington D.C. for Spring 2025. Candidates should be motivated, ﬂexible, and detail-oriented individuals with availability beginning in January.\n\nIntern responsibilities include answering constituent phone calls, assisting with the constituent mail program, drafting memos, attending committee hearings and brieﬁngs, giving tours, and assisting staA with projects in a wide array of issue areas. Candidates should possess strong oral and written communication skills, an ability to multitask in a fast-paced environment, a team-player mentality, and a good sense of humor. Candidates with Pennsylvania ties are strongly encouraged to apply.",
    "responsibilities": [
      "Answering constituent phone calls",
      "Assisting with the constituent mail program",
      "Drafting memos",
      "Attending committee hearings and brieﬁngs",
      "Giving tours",
      "Assisting staA with projects in a wide array of issue areas"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Ability to multitask in a fast-paced environment",
      "Team-player mentality",
      "Good sense of humor"
    ],
    "how_to_apply": "To apply, please e-mail a resume, cover letter, and one-page writing sample to wildinterns@gmail.com with the subject line LASTNAME- Legislative Internship. Also include policy areas of interest, desired start and end dates, and availability. Applications will be considered on a rolling basis; deadline to apply is Friday, November 8th at 5pm. Late applications will not be considered.",
    "salary_info": null,
    "contact": "wildinterns@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-437-24",
    "position_title": "Digital/Press Intern",
    "office": "Congressman Jim Costa (CA-21)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congressman Jim Costa (CA-21) seeks a highly motivated and creative Digital/Press Intern to join a fast-paced communications operation based in Rep. Costa’s Washington, D.C. oAice for the Winter/Spring 2025 intern class.\n\nThis internship program prides itself on its educational aspects. Press interns will immerse themselves in fast-paced press operations and learn the ins and outs of a congressional communications shop. They will have an opportunity to learn and engage on various digital platforms while learning how to connect people to policy.\n",
    "responsibilities": [
      "Assist the Communications Director and Press Assistant with drafting social media content, e-newsletters, targeted mailing, and website content.",
      "Edit photos and create engaging graphics in line with the Congressman’s brand.",
      "Clipping, editing, and compiling videos.",
      "Assist with the creation and maintenance of press lists.",
      "Compile daily press clips and reports about social media analytics.",
      "Other oAice tasks such as answering phones, drafting correspondence, conducting tours, and other duties as required."
    ],
    "qualifications": [
      "Qualiﬁed candidates should have strong writing, editing, and digital skills to assist with time-sensitive assignments, as well as basic familiarity with graphic design/video editing software, such as Adobe, Canva, and Photoshop.",
      "Candidates with experience in a press or digital media role (including internships) are preferred but not required.",
      "California or Central Valley ties are a plus."
    ],
    "how_to_apply": "Interested applicants should ﬁll out the internship application via our website: Internships | Congressman Jim Costa (house.gov), specifying in their application their desire to be a press intern.\n\nNo phone calls, or walk-ins, please.",
    "salary_info": null,
    "contact": "Please reach out to our intern coordinator, Grant Menolascino, with any questions regarding the application process at Grant.menolascino@mail.house.gov.",
    "equal_opportunity": "The OAice of Rep. Jim Costa is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-436-24",
    "position_title": "Legislative Internship",
    "office": "Office of Congressman Matt Cartwright (PA-08)",
    "location": "Washington, DC",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congressman Matt Cartwright (PA-08) seeks motivated, detail-oriented, and energetic individuals for legislative internships in Washington, DC for January-May. Please indicate availability in the ﬁrst sentence of the cover letter.\n\nAs a result, interns learn about the legislative process and the many other functions of a congressional oAice.",
    "responsibilities": [
      "Logging constituent concerns",
      "Drafting constituent correspondence on a variety of issues",
      "Attending legislative brieﬁngs",
      "Greeting constituents and visitors when in the oAice",
      "Assisting staA with research and special projects",
      "Tracking media coverage",
      "Performing administrative duties"
    ],
    "qualifications": [
      "Strong interpersonal skills",
      "The ability to manage multiple tasks",
      "Strong writing skills",
      "Demonstrate a solid work ethic"
    ],
    "how_to_apply": "To apply for an internship in the OAice of Congressman Cartwright, please submit an application, including a resume, cover letter, and a short writing sample at the following link: https://cartwright.house.gov/services/internships.htm.\nNo phone calls or drop-ins please.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-435-24",
    "position_title": "Legislative Intern",
    "office": "House Energy and Commerce Committee",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The Democratic Sta8 of the House Energy and Commerce Committee seeks qualiﬁed\nundergrad students and recent graduates for Legislative Interns for the Spring 2025\nsession.\n\nAn internship with the Energy and Commerce Democrats is designed to give students a\nthorough understanding of a Congressional committee’s role in the legislative process.\nThroughout the course of the program, interns will assist staA with administrative tasks\nsuch as answering phones, conducting legislative research, and preparing materials for\nstaA and member brieﬁngs. In addition, interns will have the opportunity to shadow staA at\nhearings and markups, as well as attend brieﬁngs on subjects within the Committee’s\nbroad jurisdiction.\n\nOur ideal candidates are organized and committed students eager to join a fast-paced\nenvironment and build upon their knowledge of how Congress works—in particular, the\nrole that congressional committees play in the federal legislative process. Superior writing\nand communication skills, attention to detail, and a sense of humor are required. Full-time\navailability is preferred, but part-time candidates are eligible as well.",
    "responsibilities": [
      "assisting staA with administrative tasks such as answering phones",
      "conducting legislative research",
      "preparing materials for staA and member brieﬁngs"
    ],
    "qualifications": [
      "organized and committed students",
      "eager to join a fast-paced environment",
      "build upon their knowledge of how Congress works",
      "Superior writing and communication skills",
      "attention to detail",
      "sense of humor"
    ],
    "how_to_apply": "Interested applicants should submit their resume, cover letter, and one writing sample (two pages max.) to InternshipResume.EC@mail.house.gov. In your cover letter, please indicate preferred start/end dates for scheduling purposes and whether you are available to work full-time or part-time. Please put “Spring 2025 Legislative Intern Application” in the subject line. The deadline for applications is November 15, 2024. Please no phone calls or dropins.",
    "salary_info": "Interns will receive a stipend, and applicants may request the Committee’s assistance to receive credit from their educational institution.",
    "contact": "InternshipResume.EC@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, or age. Women, minority, and veteran candidates are highly encouraged to apply."
  },
  {
    "id": "MEM-434-24",
    "position_title": "Spring Intern",
    "office": "Congressman Emanuel Cleaver’s Washington, D.C. office",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Emanuel Cleaver’s Washington, D.C. office is seeking spring interns from January through May. Intern responsibilities vary daily but typically include sorting constituent mail, answering the phones, attending hearings and briefings, leading tours, drafting constituent response letters, and assisting the legislative staff. Qualified candidates will have strong written and interpersonal skills, a positive work ethic, and the ability to manage multiple tasks at once. The ideal candidate can work a full-time schedule.",
    "responsibilities": [
      "Sorting constituent mail",
      "Answering the phones",
      "Attending hearings and briefings",
      "Leading tours",
      "Drafting constituent response letters",
      "Assisting the legislative staff"
    ],
    "qualifications": [
      "Strong written and interpersonal skills",
      "A positive work ethic",
      "Ability to manage multiple tasks at once"
    ],
    "how_to_apply": "To apply, please submit a single PDF containing a cover letter with intended start and end dates, a resume, and a writing sample to MO5internships@mail.house.gov. Applications for the spring semester are due on Friday, November 1, by 11:59 pm.",
    "salary_info": null,
    "contact": "MO5internships@mail.house.gov",
    "equal_opportunity": "The office is an equal-opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-433-24",
    "position_title": "Press Internship",
    "office": "Office of Representative Brad Schneider (D-IL-10)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Representative Brad Schneider (D-IL-10) is now accepting applications for Spring 2025 Press Interns in the Washington, D.C., oAice. This paid internship runs from early January through late May and is open to both undergraduate and graduate students. Hours are ﬂexible to accommodate academic schedules, with general hours from 9:00 a.m. to 6:00 p.m. when Congress is in session and 9:00 a.m. to 5:00 p.m. when not.\n\nAs a press intern, you will collaborate closely with the communications team to create engaging graphics, edit videos, and draft social media content. You may also have the opportunity to join staAers alongside the Congressman at events or during meetings to capture pictures and draft content on-site. Additional responsibilities include some legislative internship duties, such as answering constituent calls, leading Capitol tours, and assisting with front oAice administrative tasks.",
    "responsibilities": [
      "Collaborate closely with the communications team to create engaging graphics, edit videos, and draft social media content.",
      "Join staff alongside the Congressman at events or during meetings to capture pictures and draft content on-site.",
      "Answering constituent calls",
      "Leading Capitol tours",
      "Assisting with front office administrative tasks."
    ],
    "qualifications": [
      "Adaptable",
      "Detail-oriented",
      "Thrives in a fast-paced, deadline-driven environment.",
      "Strong writing skills",
      "Ability to communicate effectively with both internal and external stakeholders.",
      "Experience with graphic design platforms like Canva, as well as photo and video editing software, is a plus."
    ],
    "how_to_apply": "Interested applicants should submit one PDF file containing a cover letter, resume, two references, a 1–3-page writing sample, and one example of digital work (video, graphic, or photo). These materials should be sent to Matthew.Rodriguez@mail.house.gov with the subject line “Spring 2025 Press Internship Application – [Your Name]. Please submit your application by 11:59 p.m. EST on November 12th, 2024.",
    "salary_info": null,
    "contact": "Matthew.Rodriguez@mail.house.gov",
    "equal_opportunity": "This oAice is an equal-opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identiﬁcation, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-432-24",
    "position_title": "Spring 2025 Legislative Intern",
    "office": "Office of Representative Brad Schneider (D-IL-10)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Representative Brad Schneider (D-IL-10) is now accepting applications for Spring 2025 legislative interns in the Washington, D.C., oAice. This paid internship runs from early January through late May and is open to both undergraduate and graduate students. Hours are ﬂexible to accommodate academic schedules, with general hours from 9:00 a.m. to 6:00 p.m. when Congress is in session and 9:00 a.m. to 5:00 p.m. when not.\n\nAs a legislative intern, you will play a key role in ensuring the smooth operation of the oAice while gaining valuable experience working with the legislative team on policy matters.",
    "responsibilities": [
      "Answering phones",
      "Managing errands",
      "Researching legislation for the congressman and staA",
      "Attending hearings and brieﬁngs",
      "Leading Capitol tours",
      "Responding to constituent inquiries"
    ],
    "qualifications": [
      "Adaptable",
      "Detail-oriented",
      "Thrives in a fast-paced, deadline-driven environment",
      "Strong writing skills",
      "Ability to communicate eAectively with both internal and external stakeholders",
      "Experience in a professional environment and knowledge of basic congressional operations are a plus."
    ],
    "how_to_apply": "To apply for a legislative internship with Congressman Schneider, please complete the internship application form on our website (https://schneider.house.gov/students/internships) by 11:59 p.m. EST on November 12, 2024.",
    "salary_info": "This paid internship runs from early January through late May",
    "contact": "Matthew.Rodriguez@mail.house.gov",
    "equal_opportunity": "This oAice is an equal-opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identiﬁcation, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-430-24",
    "position_title": "Spring 2025 semester internship",
    "office": "Congressman Ed Case (HI-01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The Washington, D.C. OAice of Congressman Ed Case (HI-01) is seeking motivated\ncandidates for a Spring 2025 semester internship.\n\nInterns will have the chance to engage directly with the legislative process and contribute\nto the functions of a congressional oAice. Application Deadline: November 1, 2024",
    "responsibilities": [
      "Answering phones and managing correspondence",
      "Leading constituent tours of the Capitol",
      "Conducting research on legislation for the Member and legislative staA",
      "Attending hearings and brieﬁngs",
      "Assisting with various oAice tasks"
    ],
    "qualifications": [],
    "how_to_apply": "To Apply: Interested candidates should submit the following materials:\n• Resume\n• Cover letter (including interest in the internship, availability, and ties to Hawaii)\n• Three references (academic and work-related)\n• Two short writing samples (maximum of 5 pages)",
    "salary_info": null,
    "contact": "HI01.Internships@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-429-24",
    "position_title": "Digital Media and Traditional Press Intern",
    "office": "House Committee on Oversight and Accountability Democratic Staff",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The House Committee on Oversight and Accountability Democratic StaA seeks a motivated and reliable undergraduate or graduate student to fill a full-time digital media and traditional press intern position this winter. The intern responsibilities include, but are not limited to, written content creation, graphic design, video editing, and performing other press and administrative tasks as necessary.",
    "responsibilities": [
      "Written content creation",
      "Graphic design",
      "Video editing",
      "Performing other press and administrative tasks as necessary"
    ],
    "qualifications": [
      "Familiarity with programs such as Adobe Premiere Pro, Adobe Photoshop, Adobe InDesign, Canva, as well as compiling and interpreting social media analytics.",
      "Ability to work in a fast-paced, rapid response environment",
      "Willingness to learn are a must.",
      "This position reports to the Communications Director."
    ],
    "how_to_apply": "To apply, please send a resume and portfolio to oversightpress@mail.house.gov.",
    "salary_info": null,
    "contact": "oversightpress@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-428-24",
    "position_title": "Intern",
    "office": "Congresswoman Doris Matsui, representing the 7th Congressional District of California",
    "location": "Washington, D.C. and District (Sacramento)",
    "posting_date": "2024-10-21",
    "description": "Congresswoman Doris Matsui, representing the 7th Congressional District of California, seeks interns for her Washington, D.C. and District (Sacramento) oAices for the Spring 2025 term. Interns will have a unique opportunity to learn about the legislative process ﬁrst-hand and the many functions of a Congressional oAice.",
    "responsibilities": [
      "Answering phones and data entry.",
      "Washington DC interns may be asked to assist in researching legislation for the Member and legislative staA, attending brieﬁngs, hearings, and markups; and answering constituent letters on various issues.",
      "Interns based in California may also be asked to assist on a variety of constituent casework or in-district projects, as needed."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please visit the “Internships” page of Congresswomen Matsui’s oAicial website and complete the application form: https://matsui.house.gov/services/internships. As part of the application, a cover letter, resume, and 2 writing samples are required. Ties to California’s 7th District are preferred, but not required. All applications are considered on a rolling basis.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-427-24",
    "position_title": "Legal Intern",
    "office": "Democratic Staff of the U.S. House Judiciary Committee",
    "location": "Washington, DC",
    "posting_date": "2024-10-21",
    "description": "The Democratic Staff of the U.S. House Judiciary Committee, under the leadership of Ranking Member Jerrold Nadler (NY-12), seeks legal interns for the Spring 2025 internship program. This program offers the opportunity to experience the operation of a congressional committee firsthand and learn about the important role that our committee plays in the legislative processes of the United States Congress.\n\nThe U.S. House Judiciary Committee has legislative and oversight jurisdiction across a wide range of issues, including oversight of the U.S. Department of Justice and Federal Bureau of Investigation, constitutional law, federal criminal law, voting rights, immigration and naturalization, administrative law, intellectual property law, and antitrust law. Interns work closely with committee staff, including subcommittee and oversight staff, on a range of issues.",
    "responsibilities": [
      "Researching legal and policy issues under the committee’s jurisdiction",
      "Tracking relevant legislation, hearings, briefings, and media",
      "Drafting internal and external memoranda",
      "Supporting oversight counsels in transcribed interviews and depositions",
      "Supporting committee clerks and professional staff members during hearings and markups",
      "Providing administrative support, including answering calls, delivering correspondence, and preparing the committee’s hearing room."
    ],
    "qualifications": [
      "Open to qualified undergraduate, graduate, and law students."
    ],
    "how_to_apply": "Applications must be submitted at the following website: https://democrats-judiciary.house.gov/about/internship-opportunities.htm",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": "The Democratic Staff of the U.S. House Judiciary Committee strives to ensure that our internship class reflects the country’s diversity. Candidates from minority backgrounds are strongly encouraged to apply. The committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-426-24",
    "position_title": "Press Fellow",
    "office": "The OAice of Congressman Tim Kennedy (NY-26)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congressman Tim Kennedy (NY-26) is seeking a highly motivated Press Fellow to work in the Washington, D.C. oAice for the Spring Session. Press Fellows are an integral part of day-to-day operations and gain hands-on experience, including attending brieﬁngs, meetings, press conferences, and networking events.",
    "responsibilities": [
      "Draft and edit press releases, statements, op-eds, and other communication materials",
      "Compile press clips and monitor emerging news stories",
      "Maintain and update media contact lists and databases",
      "Prepare press reports for internal distribution",
      "Draft social media and contribute to digital strategy",
      "Edit videos, and design graphics and posters",
      "Support the communications team with administrative tasks and project coordination",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Strong attention to detail and organizational abilities",
      "Ability to multitask and prioritize in a fast-paced environment",
      "Familiarity with social media platforms and digital communication tools",
      "Major in Communications, Journalism, or a related ﬁeld is a plus",
      "A proactive and collaborative attitude",
      "A sense of humor"
    ],
    "how_to_apply": "Please submit your application to KennedyNY26.Press@mail.house.gov with the subject line “FULL NAME Press Fellow Application,” with a resume, cover letter, and writing sample by COB November 1, 2024. Applications will be reviewed on a rolling basis.",
    "salary_info": "This is a paid opportunity.",
    "contact": "KennedyNY26.Press@mail.house.gov",
    "equal_opportunity": "We do not discriminate based on race, ethnicity, gender, sexual orientation, gender identity, religion, national origin, age, disability, or socioeconomic status. All are welcome and encouraged to apply."
  },
  {
    "id": "MEM-423-24",
    "position_title": "Spring 2025 Internship",
    "office": "Office of Representative Donald Norcross (NJ-01)",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The OAice of Representative Donald Norcross (NJ-01) is seeking motivated candidates for the Spring 2025 Internship program. Applications are considered on a rolling basis.\n\nIntern responsibilities will include but are not limited to assisting staA with legislative, administrative, constituent relations, scheduling, and communications activities. Interns will answer phones; sort, distribute, and respond to constituent mail; attend hearings and brieﬁngs; assist with legislative research; compile daily clips; and participate in professional development activities.\n\nSuccessful candidates will demonstrate that they are organized, detail-oriented, and professional. Strong written and oral communication skills are essential.\n\nInterns receive a stipend. The spring internship will span early January to early May, but start/end dates are ﬂexible based on semester schedule.\n\nPlease send a resume, cover letter, three professional references and a brief writing sample to andrew.skurnik@mail.house.gov. No phone calls or drop-ins, please. Applications will be reviewed on a rolling basis and applicants are encouraged to apply early. Incomplete applications will not be reviewed.\n\nWhen emailing over your completed application materials, please include a resume, cover letter. And 2-3 references in one combined PDF.",
    "responsibilities": [
      "Assisting staA with legislative, administrative, constituent relations, scheduling, and communications activities",
      "Answering phones",
      "Sorting, distributing, and responding to constituent mail",
      "Attending hearings and brieﬁngs",
      "Assisting with legislative research",
      "Compiling daily clips",
      "Participating in professional development activities"
    ],
    "qualifications": [
      "Organized",
      "Detail-oriented",
      "Professional",
      "Strong written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume, cover letter, three professional references and a brief writing sample to andrew.skurnik@mail.house.gov. No phone calls or drop-ins, please. Applications will be reviewed on a rolling basis and applicants are encouraged to apply early. Incomplete applications will not be reviewed.\n\nWhen emailing over your completed application materials, please include a resume, cover letter. And 2-3 references in one combined PDF.",
    "salary_info": "Interns receive a stipend.",
    "contact": "andrew.skurnik@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-421-24",
    "position_title": "Legislative Intern Spring 2025",
    "office": "Democratic Staff of the Committee on Rules",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The Democratic Staff of the Committee on Rules is seeking full- and part-time, energetic interns for the spring (January - May). Our interns work closely with Committee staff to prepare materials for Committee meetings, conduct research projects, learn about the Rules of the House and the various procedures for legislation to reach the House Floor, and complete a variety of other administrative tasks. Ideal candidates have strong writing skills, a good work ethic, an interest in learning about House floor procedures, and are detail-oriented. Interns will gain experience in legislative analysis, political communications, and institutional processes.\n\nA stipend will be available for qualified candidates. No calls or drop-ins please. Massachusetts ties are a plus. All offers are conditional on completion of a federal criminal background check. The office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds or with untraditional experience to apply.",
    "responsibilities": [
      "Prepare materials for Committee meetings",
      "Conduct research projects",
      "Learn about the Rules of the House and the various procedures for legislation to reach the House Floor",
      "Complete a variety of other administrative tasks"
    ],
    "qualifications": [
      "Strong writing skills",
      "Good work ethic",
      "Interest in learning about House floor procedures",
      "Detail-oriented"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume with the subject line: \"Legislative Intern Spring 2025 – Last Name, First Name\" explaining why you want to join the Democratic staff of the House Rules Committee to RulesInternDem.Application@mail.house.gov. Please apply by November 8, 2024.\n\nNote: Students on quarter systems or with unusual schedules are still encouraged to apply—please detail your particular situation in your cover letter.",
    "salary_info": "A stipend will be available for qualified candidates.",
    "contact": "RulesInternDem.Application@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds or with untraditional experience to apply."
  },
  {
    "id": "MEM-420-24",
    "position_title": "Fall 2024 Internship Program",
    "office": "Congresswoman Rosa L. DeLauro (CT-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The office of Congresswoman DeLauro runs an internship program intended for current undergraduate students, recent college graduates, and students currently enrolled in graduate school. Internships in Congresswoman DeLauro's office combine administrative and legislative work. Interns are involved in all aspects of the office including constituent services, correspondence, and legislative research, in addition to providing general staff support.",
    "responsibilities": [
      "Interns are involved in all aspects of the office including constituent services",
      "Correspondence",
      "Legislative research",
      "Providing general staff support"
    ],
    "qualifications": [
      "Applicants should have an ability to work in a fast-paced environment",
      "Possess excellent writing skills",
      "An enthusiastic attitude",
      "Interning in Congresswoman DeLauro's office is a great opportunity to work in a highly active legislative office."
    ],
    "how_to_apply": "Please email your completed intern application form (also located on delauro.house.gov/services/internships), cover letter, resume, brief writing sample (1-2 pages), and two reference contacts in a single PDF file to Lydia.McCarty@mail.house.gov with the subject line “Spring 2024 Internship” by November 15.",
    "salary_info": null,
    "contact": "Lydia.McCarty@mail.house.gov",
    "equal_opportunity": "Applicants and employees shall not be discriminated against with respect to compensation, terms, conditions, or privileges of employment, because of such person’s race, color, religion, sex, age, national origin, service in the military, disability, or sexual orientation."
  },
  {
    "id": "MEM-418-24",
    "position_title": "Intern",
    "office": "Congressman Rob Menendez (NJ-08)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Rob Menendez (NJ-08) seeks interns for his Washington, D.C. oAice for Spring 2024.\n\nIdeal candidates are organized and passionate undergraduate students, graduate students, or recent graduates with an interest in public service. They should be self-starters with excellent writing and organizational skills.",
    "responsibilities": [
      "Greeting guests and assisting with front oAice operations",
      "Answering phones, recording constituent opinions, and correctly processing other inquiries",
      "Legislative work: attending hearing and brieﬁngs, writing memos, composing cosponsor recommendations, and drafting letters to be sent to constituents",
      "Organizing incoming mail",
      "Assisting with press clips and communications tasks"
    ],
    "qualifications": [
      "Organized and passionate undergraduate students, graduate students, or recent graduates with an interest in public service.",
      "Self-starters with excellent writing and organizational skills."
    ],
    "how_to_apply": "To apply, please ﬁll out the application and submit a resume and cover letter through this link: menendez.house.gov/services/internships. Please indicate your availability in your cover letter and format the ﬁles [LastName_CoverLetter] and [LastName_Resume].",
    "salary_info": "a stipend will be provided",
    "contact": null,
    "equal_opportunity": "Our oAice is an equal opportunity employer, and we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, military status, sexual orientation, or gender identity or expression. Special consideration will be given to candidates with New Jersey ties and to those from backgrounds that are traditionally underrepresented in Congress."
  },
  {
    "id": "MEM-417-24",
    "position_title": "Legislative and Press Interns",
    "office": "Rep. Troy Nehls (TX-22)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Troy E. Nehls' (TX-22) Washington, D.C oAice is currently seeking qualiﬁed individuals who have a passion for federal policy and America First priorities to serve in his Washington, D.C. oAice for the Spring of 2025. This internship provides students with a ﬁrsthand understanding of our nation’s legislative process. Interns will contribute to the daily operations of the oAice.",
    "responsibilities": [
      "Greeting visitors",
      "Answering phones",
      "Leading tours of the Capitol",
      "Attending brieﬁngs and hearings",
      "Performing legislative research",
      "Assisting both legislative and communications staA."
    ],
    "qualifications": [],
    "how_to_apply": "Those interested should send their resume and cover letter to jacqueline.camuy@mail.house.gov with \"Spring 2025 Internship\" in the subject line. Applications are reviewed on a rolling basis until November 2nd. Texas ties are preferred.",
    "salary_info": "This is a paid internship. Please include availability, previous experience and information about yourself and your education. Texas ties preferred.",
    "contact": "jacqueline.camuy@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-416-24",
    "position_title": "Congressional Internship",
    "office": "Office of Congresswoman Summer Lee",
    "location": "Washington, DC, and District Office",
    "posting_date": "2024-10-21",
    "description": "The Office of Congresswoman Summer Lee is committed to investing in the next generation of public leaders and citizen activists. Congressional internships offer a comprehensive learning opportunity to understand better how congressional offices and the legislative process work. Both in the Washington, DC, and District Office, the internship program is designed to be a learning experience in which students are exposed to various areas including constituent services, scheduling, office administration, press and communications, and legislative policy.\n\nTypical duties will include answering phones, leading Capitol tours (Washington, D.C.-based), researching legislation for the Member and legislative staff, attending hearings and briefings, and answering constituent letters on a variety of issues. The ideal candidate for this paid, part-time internship will be team-oriented and have strong written and verbal communication skills.\n\nStudents and recent graduates who are interested in the legislative process are highly encouraged to apply. The Congresswoman is on the Oversight and Accountability Committee and the Space, Science, and Technology Committee. Ties to Pennsylvania's 12th Congressional District are preferred, but not necessary.",
    "responsibilities": [
      "Answering phones",
      "Leading Capitol tours (Washington, D.C.-based)",
      "Researching legislation for the Member and legislative staff",
      "Attending hearings and briefings",
      "Answering constituent letters on a variety of issues"
    ],
    "qualifications": [
      "Team-oriented",
      "Strong written and verbal communication skills",
      "Interested in the legislative process",
      "Ties to Pennsylvania's 12th Congressional District are preferred, but not necessary."
    ],
    "how_to_apply": "All applicants should apply by November 15, 2024, at: https://summerlee.house.gov/internships.",
    "salary_info": "paid, part-time internship",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-414-24",
    "position_title": "Intern",
    "office": "Office of Congresswoman Sydney Kamlager-Dove (CA-37)",
    "location": "Washington, D.C. and Los Angeles",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congresswoman Sydney Kamlager-Dove (CA-37) is seeking interns for our\nWashington, D.C. and Los Angeles oAices for the Spring 2025 term.\nOur oAice values open communication, hard work, and creating a collegial environment.\nWe are looking for interns with a can-do attitude who are eager to grow. Interns will have\ngreat opportunities to learn from oAice staA and network with others to make the most of\ntheir time with our oAice!",
    "responsibilities": [
      "Answer phones and assist in correspondence with constituents",
      "Greet constituents and oAice visitors",
      "Process tour requests and lead Capitol tours",
      "Handle mail",
      "Assist in processing casework",
      "Perform legislative research",
      "Work on other administrative tasks as directed",
      "Assist the Communications Director and Press Assistant in drafting social media content and other materials like press releases, website content, and newsletters",
      "Create graphic design posts for social media",
      "Compile daily press clips",
      "Edit video clips",
      "Maintain press lists",
      "Answer phones and assist in correspondence as needed."
    ],
    "qualifications": [
      "Candidates should have an interest in the legislative process and civic service; possess excellent writing, research, organization, time management, and communication skills; work well in a team environment; and have a general understanding of the US political system."
    ],
    "how_to_apply": "Interested applicants should send their resume and a brief cover letter (in one document) to:\n* CA37.internships@mail.house.gov for DC oAice internship.\n  * Use the subject line “First name Last name [legislative] OR [press] – Spring 2025 internship”\n* ca37.DOinternships@mail.house.gov for Los Angeles oAice internship\n  * Use the subject line “First name Last name – Spring 2025 Internship” in your email.",
    "salary_info": null,
    "contact": "Please reach out our intern coordinator, Madilyn Brandon, with any questions at Madilyn.Brandon@mail.house.gov.",
    "equal_opportunity": null
  },
  {
    "id": "MEM-413-24",
    "position_title": "Communications Intern",
    "office": "Congresswoman's Office",
    "location": "DC",
    "posting_date": "2024-10-21",
    "description": "Communications Interns assist the communications staff by compiling media clips, drafting social media posts and press releases, creating digital content, answering phones, inputting casework inquiries, and aiding the Congresswoman’s communications efforts.\n\nIdeal candidates for this internship are diligent, detail-oriented, and can excel in a fastpaced environment. Applicants should possess strong written and verbal communication skills, an eye for and ability to create engaging digital content, and a good sense of humor.\n\nTies to Washington State are preferred, but not required. Applicants are encouraged to include any previous customer service experience (retail, food service, hospitality, etc.) on their resumes.",
    "responsibilities": [
      "Compiling media clips",
      "Drafting social media posts and press releases",
      "Creating digital content",
      "Answering phones",
      "Inputting casework inquiries",
      "Aiding the Congresswoman’s communications efforts"
    ],
    "qualifications": [
      "Experience working in communications is a plus",
      "Diligent and detail-oriented",
      "Ability to excel in a fast-paced environment",
      "Strong written and verbal communication skills",
      "Ability to create engaging digital content",
      "Good sense of humor",
      "Ties to Washington State are preferred"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, a one-page writing sample, and a sample social media post with relevant written and visual components in a single PDF document to WA10resumes@gmail.com with “DC Spring Communications Internship[LAST NAME]” in the subject line. Please indicate in the cover letter which internship you are applying for and your dates of availability.\n\nThe deadline for applications is Thursday, October 31, 2024, at 5 PM ET, but applicants are encouraged to submit their application early. Applications that are incomplete or submitted after the deadline will not be considered.",
    "salary_info": null,
    "contact": "WA10resumes@gmail.com",
    "equal_opportunity": "This office is an Equal Employment Opportunity Office and does not discriminate in employment based on race, color, religion, sex, gender identity, national origin, sexual orientation, marital status, disability, genetic information, age, military service, or other non-merit factors. Individuals from underrepresented communities are encouraged to apply. Please no unsolicited phone calls or drop-ins."
  },
  {
    "id": "MEM-412-24",
    "position_title": "Legislative Intern",
    "office": "Congresswoman's Legislative Office",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Legislative Interns assist the legislative staff by preparing briefing notes and memos, researching legislation, tracking legislative activity, providing mail program support, answering phones, inputting casework inquiries, attending hearings, and advancing the Congresswoman's legislative agenda.\n\nIdeal candidates for this internship are diligent, detail-oriented, and can excel in a fastpaced environment. Applicants should possess strong written and verbal communication skills, an ability to manage multiple short-term and stretch assignments, and a good sense of humor. Ties to Washington State are preferred, but not required. Applicants are encouraged to include any previous customer service experience (retail, food service, hospitality, etc.) on their resumes.",
    "responsibilities": [
      "Preparing briefing notes and memos",
      "Researching legislation",
      "Tracking legislative activity",
      "Providing mail program support",
      "Answering phones",
      "Inputting casework inquiries",
      "Attending hearings",
      "Advancing the Congresswoman's legislative agenda"
    ],
    "qualifications": [
      "Diligent",
      "Detail-oriented",
      "Ability to excel in a fast-paced environment",
      "Strong written and verbal communication skills",
      "Ability to manage multiple short-term and stretch assignments",
      "Good sense of humor",
      "Ties to Washington State are preferred, but not required",
      "Previous customer service experience (retail, food service, hospitality, etc.) is encouraged"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and a writing sample not to exceed one page in length in a single PDF document to WA10resumes@gmail.com with “DC Spring Legislative Internship-[LAST NAME]” in the subject line. Please indicate in the cover letter which internship you are applying for and your dates of availability.\n\nThe deadline for applications is Thursday, October 31, 2024, at 5 PM ET, but applicants are encouraged to submit their applications early. Applications that are incomplete or submitted after the deadline will not be considered.",
    "salary_info": null,
    "contact": "WA10resumes@gmail.com",
    "equal_opportunity": "This office is an Equal Employment Opportunity Office and does not discriminate in employment based on race, color, religion, sex, gender identity, national origin, sexual orientation, marital status, disability, genetic information, age, military service, or other non-merit factors. Individuals from underrepresented communities are encouraged to apply. Please no unsolicited phone calls or drop-ins."
  },
  {
    "id": "MEM-409-24",
    "position_title": "Intern",
    "office": "Congresswoman Suzan DelBene, representing the 1st Congressional District of Washington state",
    "location": "Washington, D.C. and District (Kirkland)",
    "posting_date": "2024-10-21",
    "description": "Interns will work in a fast-paced congressional office, gaining valuable experience and knowledge of the United States Congress.\n\nIntern responsibilities include greeting constituents and handling constituent phone calls, assisting staff with administrative tasks, conducting research, and assisting with constituent correspondence. Kirkland, WA interns will have the opportunity to attend community events and tours with the Congresswoman and staff. Washington, D.C. interns will have the opportunity to lead tours of the U.S. Capitol as well as attend hearings and briefings for the legislative staff.",
    "responsibilities": [
      "Greeting constituents and handling constituent phone calls",
      "Assisting staff with administrative tasks",
      "Conducting research",
      "Assisting with constituent correspondence",
      "Kirkland, WA interns will have the opportunity to attend community events and tours with the Congresswoman and staff",
      "Washington, D.C. interns will have the opportunity to lead tours of the U.S. Capitol as well as attend hearings and briefings for the legislative staff"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a cover letter, resume, and short writing sample (1 to 2 pages) through our web form here: https://airtable.com/appNK10LkiweHjE79/shrKQyVOSs0khwKCp. The deadline for Spring 2025 internship applications is Friday, November 8th at 11:59 PM.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-407-24",
    "position_title": "Spring DC Fellowship",
    "office": "Congressman Shri Thanedar",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The Washington, D.C. Office of Congressman Shri Thanedar (MI-13) is now accepting applications for a legislative fellowship during the Spring 2025 term. This fellowship is a great opportunity for individuals in professional programs who seek to gain an in-depth legislative experience. This is a full-time, in-person position.\n\nFellows assist the legislative team with drafting legislation, assisting with stakeholder meetings, and helping with committee assignments.",
    "responsibilities": [
      "Performing Research (CRS, the Library of Congress, MIN, or other available resources)",
      "Attending meetings on behalf of the office",
      "Drafting talking points, proclamations, and various briefings",
      "Staffing the Congressman at various events",
      "Tracking and responding to constituent requests and letters",
      "Helping find legislative opportunities for sponsorship and co-sponsorship",
      "Performing tasks and duties as needed to help day to day activities of the office",
      "Other duties will be based on the fellow's interests."
    ],
    "qualifications": [
      "We are looking for candidates with an eagerness to learn, research skills, and strong writing skills.",
      "Start and end dates are flexible.",
      "MI-13 ties and research experience are pluses.",
      "Must be in a program that sponsors your fellowship."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and a 1-3 page writing sample in one combined document to HR.Thanedar@mail.house.gov with the subject line “Last Name Spring DC Fellow Application.” The application deadline is November 15, 2024. No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "HR.Thanedar@mail.house.gov",
    "equal_opportunity": "This office is an Equal Opportunity Employment Office and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, or age. We strongly encourage BIPOC-identifying individuals and members of other underrepresented communities to apply."
  },
  {
    "id": "MEM-406-24",
    "position_title": "Spring DC Internship",
    "office": "Congressman Shri Thanedar",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The Washington, D.C. Office of Congressman Shri Thanedar (MI-13) is now accepting\napplications for press and legislative internships during the Spring 2025 term. This\n\ninternship is a great opportunity for individuals who seek to gain public service experience\nand insight into Capitol Hill. This is a full-time, in-person position.",
    "responsibilities": [
      "Answering phone calls",
      "Greeting office visitors",
      "Drafting constituent correspondence",
      "Coordinating tour requests and leading tours of the Capitol",
      "Attending congressional briefings, hearings and other professional development events",
      "Drafting press releases to be posted on the website and social media accounts",
      "Researching legislation and writing cosponsor memos for the legislative team",
      "Assisting operations, communications, and legislative staffers with various tasks",
      "Other duties will be based on the intern's interests."
    ],
    "qualifications": [
      "An eagerness to learn",
      "Customer service skills",
      "Strong writing skills",
      "MI-13 ties and service industry experience are pluses."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and a 1-3 page writing sample in one\ncombined document to HR.Thanedar@mail.house.gov with the subject line “Last Name Spring DC Press or Legislative Intern Application.” The application deadline is November 15, 2024. No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "HR.Thanedar@mail.house.gov",
    "equal_opportunity": "This office is an Equal Opportunity Employment Office and does not discriminate on the\nbasis of race, color, religion, sex, gender identity, sexual orientation, or age. We strongly\nencourage BIPOC-identifying individuals and members of other underrepresented\ncommunities to apply."
  },
  {
    "id": "MEM-404-24",
    "position_title": "FERN HOLLAND INTERNATIONAL AFFAIRS FELLOWSHIP",
    "office": "Congressman Moulton",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Moulton oAers a full-time, paid foreign policy fellowship in our Washington, D.C. oAice. This opportunity is only open to candidates who are currently Pell Grant-eligible or who were Pell Grant-eligible while pursuing their bachelor's degree. Current undergraduate students, current graduate students, and recent college graduates are welcome to apply, though preference is given to graduate students. The fellow will work on assignments on foreign policy and national security, in addition to some regularly assigned intern responsibilities.\nThe full fellowship description can be found here.",
    "responsibilities": [
      "Conducting legislative research.",
      "Taking notes at brieﬁngs and hearings.",
      "Organizing research from Members of Congress and outside organizations.",
      "Writing brieﬁngs for the Congressman.",
      "Drafting questions for House Armed Services Committee and Select Committee on China hearings."
    ],
    "qualifications": [
      "Candidates must be currently Pell Grant-eligible or who were Pell Grant-eligible while pursuing their bachelor's degree.",
      "Current undergraduate students, current graduate students, and recent college graduates are welcome to apply, though preference is given to graduate students."
    ],
    "how_to_apply": "Please email MA06.Resumes@mail.house.gov with your resume and cover letter using the subject line: FHF: LAST NAME.\n\n* If you are selected for an interview, a staA member will contact you\n* Applications are reviewed on a rolling basis\n* If selected, you will be required to submit a FAFSA form.",
    "salary_info": "paid",
    "contact": "Emerson Jacobson (Emerson.Jacobson@mail.house.gov)",
    "equal_opportunity": null
  },
  {
    "id": "MEM-403-24",
    "position_title": "Intern",
    "office": "House Natural Resources Committee Democrats",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The House Natural Resources Committee Democrats seek full-time interns for Spring 2025 (beginning of February – end of May). Applicants must be organized, detail oriented, and dependable. Above all, we seek candidates who are passionate about issues within the Natural Resources Committee’s jurisdiction, demonstrate exceptional interpersonal skills, and are eager to learn about committee process. Interns will conduct legislative research, prepare for hearings, assist with administrative duties, perform outreach, and aid communications.",
    "responsibilities": [
      "Conduct legislative research",
      "Prepare for hearings",
      "Assist with administrative duties",
      "Perform outreach",
      "Aid communications"
    ],
    "qualifications": [
      "Organized, detail oriented, and dependable",
      "Passionate about issues within the Natural Resources Committee’s jurisdiction",
      "Demonstrate exceptional interpersonal skills",
      "Eager to learn about committee process",
      "Demonstrates an awareness of and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.",
      "Understands how HNRC issues intersect with racism, economic and social inequality in the United States, and has a passion for working to dismantle these systems."
    ],
    "how_to_apply": "Interested candidates should apply by visiting the House Natural Resources Committee Democrats website at https://democratsnaturalresources.house.gov/internships.",
    "salary_info": "$3,200 monthly stipend plus transit benefits",
    "contact": null,
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law.\nApplicants with disabilities who require reasonable accommodation to participate in the application or hiring process are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-401-24",
    "position_title": "Intern",
    "office": "Congressman Kevin Kiley",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The oAice of Congressman Kevin Kiley is seeking full or part-time interns for the FALL 2024 term. Position duties include attending Congressional hearings, scheduling/leading Capitol tours, answering phones, sorting mail, and assisting legislative staA with research.",
    "responsibilities": [
      "Attending Congressional hearings",
      "Scheduling/leading Capitol tours",
      "Answering phones",
      "Sorting mail",
      "Assisting legislative staA with research"
    ],
    "qualifications": [
      "Applicants should possess conservative values and hold strong written and verbal communication skills.",
      "Recent graduates are welcome to apply."
    ],
    "how_to_apply": "Interested applicants should send their resume and availability. Please use “Kevin Kiley Internship” in the subject line. Please send resumes to Anthony.euceda@mail.house.gov",
    "salary_info": null,
    "contact": "Anthony.euceda@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-400-24",
    "position_title": "In-Person Internship",
    "office": "Representative Brad Sherman CA-32",
    "location": "Washington D.C.",
    "posting_date": "2024-10-21",
    "description": "The Washington D.C. OAice of Representative Brad Sherman CA-32 will be accepting applications for an in-person internship during the Spring Semester 2025.\n\nAs a result, interns will learn about the functions of a congressional oAice, congressional communications, and the legislative process.",
    "responsibilities": [
      "Greeting guests and assisting with front oAice operations",
      "Answering phones, recording constituent opinions, and correctly processing other inquiries",
      "Conducting Capitol tours for constituents and other guests",
      "Day-to-day oAice work to assist with the functioning of the congressional oAice and other duties as delegated by members of the staA",
      "Supporting the Legislative Correspondent with sorting mail and drafting constituent letters",
      "Attending hearings and brieﬁngs, as requested by senior staA",
      "Researching legislation for the Member and legislative team",
      "Other administrative tasks as assigned"
    ],
    "qualifications": [
      "Ideal candidates should be a self-starter with strong attention to detail, the ability to work in a fast-paced environment, and a good sense of humor.",
      "CA-32 ties are preferred but not required."
    ],
    "how_to_apply": "Interested applicants should submit the following in one PDF document:\n• Resume\n• Cover letter\n• One-page writing sample\n• Dates of availability\nApplications should be sent in PDF format to brads.interns@mail.house.gov with “CA-32 Spring 2025 Internship” in the subject line.\nFor more information on the internship please visit: https://sherman.house.gov/contact/internships",
    "salary_info": null,
    "contact": "brads.interns@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-398-24",
    "position_title": "Intern",
    "office": "Congressman Mike Levin (CA-49)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Mike Levin (CA-49) seeks interns for his Washington, D.C., oAice for the Winter/Spring 2025 term.\n\nThese internships provide an opportunity for undergraduate students, graduate students, and recent graduates to learn more about the workings of a Congressional oAice and the legislative process. Interns should have a general understanding of the U.S. political system, value open communication, be eager to grow, and bring a can-do attitude.\n\nInternships last approximately three to four months and are intended to be an educational experience. Internships are oAered for either academic credit or a stipend. Internship applicants must be high school graduates. Current students and recent graduates will be given ﬁrst priority for the internship program.",
    "responsibilities": [
      "Attending committee hearings and congressional brieﬁngs",
      "Conducting policy research and drafting legislative materials",
      "Authoring constituent correspondence on a range of policy issues",
      "Answering phones and processing mail",
      "Leading constituents on tours of the Capitol",
      "Working on other administrative and legislative tasks, as directed."
    ],
    "qualifications": [],
    "how_to_apply": "To apply for an internship with Representative Levin, please email a cover letter, resume, three references, and a brief writing sample all in one pdf ﬁle, with the ﬁle name including internship class, year, last name, and ﬁrst name (i.e. Spring2025.Doe.Jane.pdf) to CA49.DCInternships@mail.house.gov by November 15, 2024.\n\nPlease specify whether you are applying for the press internship or the legislative internship. Applicants with strong ties to the 49th District are given preference.",
    "salary_info": null,
    "contact": "CA49.DCInternships@mail.house.gov",
    "equal_opportunity": "This oAice is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-397-24",
    "position_title": "Internships",
    "office": "Office of Congressman Tim Kennedy",
    "location": "Washington, D.C. and the Buffalo District Office",
    "posting_date": "2024-10-21",
    "description": "Internships in the Office of Congressman Tim Kennedy are available for the fall, spring, and summer sessions for college students and recent graduates.\n\nStudents will gain invaluable experience working for a member of Congress alongside congressional staff. Hours can be flexible to accommodate academic schedules.\n\nIn Washington, D.C. and the Buffalo District Office, intern responsibilities vary, but typically include answering phones, administrative duties, legislative research, attending hearings, meetings, and briefings, drafting correspondence, letters, and Congressional Extensions of Remarks, and assisting with media monitoring. In addition, interns may be assigned to assist in various constituent casework or assist with district-based projects.\n\nAs a result, interns learn about the legislative process and the many other functions of a congressional office.",
    "responsibilities": [
      "Answering phones",
      "Administrative duties",
      "Legislative research",
      "Attending hearings, meetings, and briefings",
      "Drafting correspondence, letters, and Congressional Extensions of Remarks",
      "Assisting with media monitoring",
      "Assisting in various constituent casework",
      "Assisting with district-based projects"
    ],
    "qualifications": [],
    "how_to_apply": "To apply for an internship, please email <<ny26internapplication@kennedyny26.com>> with the subject line [Name], [DC or District Intern], and [Session (Spring, Summer, Fall)]. Please include a resume, cover letter, and three references as attachments. Applications will be reviewed on a rolling basis, and you will be notified if and when the position has been filled.",
    "salary_info": null,
    "contact": "ny26internapplication@kennedyny26.com",
    "equal_opportunity": "We do not discriminate based on race, ethnicity, gender, sexual orientation, religion, national origin, age, or socioeconomic status. All are welcome and encouraged to apply."
  },
  {
    "id": "MEM-396-24",
    "position_title": "Intern",
    "office": "The oAice of Congressman Kevin Hern (OK-01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The oAice of Congressman Kevin Hern (OK-01) seeks motivated and teamoriented Interns to assist with various oAice duties based in his Washington, D.C. oAice for the 2025 Spring Term (January – April/May). Internships are intended to current undergraduate students, recent college graduates, and students currently enrolled in graduate school.",
    "responsibilities": [
      "answering constituent phone calls",
      "taking notes at brieﬁngs and hearings",
      "conducting tours of the Capitol",
      "drafting correspondence letters",
      "assembling press and news clips",
      "assisting staA with other research and administrative duties"
    ],
    "qualifications": [
      "strong interest in public policy",
      "demonstrated responsibility",
      "respectable personal conduct",
      "committed to serving the constituents of Oklahoma’s 1st Congressional District with the utmost diligence"
    ],
    "how_to_apply": "Interested candidates should visit https://hern.house.gov/services/internship.htm for application instructions.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-394-24",
    "position_title": "In-Person Internship",
    "office": "Representative Joseph Morelle, NY-25",
    "location": "Rochester, NY",
    "posting_date": "2024-10-21",
    "description": "The District OAice of Representative Joseph Morelle, NY-25 in Rochester, NY, will be accepting applications for an in-person internship during the Spring Semester 2025.\n\nAs a result, interns will learn about the functions of a congressional oAice, congressional communications, and the legislative process.",
    "responsibilities": [
      "Completing constituent calls",
      "Writing letters, certiﬁcates, and proclamations",
      "Day-to-day oAice work",
      "Interacting with members of staA in the Rochester oAice and virtually in the D.C. oAice",
      "Other duties delegated by members of staA including various constituent case work or work on District-based projects of importance"
    ],
    "qualifications": [
      "Excellent communication skills",
      "Strong attention to detail",
      "The ability to work in a fast-paced environment",
      "A good sense of humor",
      "New York State ties are preferred but not required."
    ],
    "how_to_apply": "Interested applicants should submit the following in one PDF document:\n• Resume\n• Cover letter\n• One-page writing sample\n• Dates of availability\nApplications should be sent in PDF format to Eric.Gros@mail.house.gov with “NY-25 Spring 2025 District Internship” in the subject line.\nThe deadline for this internship application is November 1st, 2024, but applicants are encouraged to submit their application early. Interview requests will be sent out following the November 1st deadline.\nFor more information on the district internship please visit:\nhttps://morelle.house.gov/congressional-internships",
    "salary_info": null,
    "contact": "Eric.Gros@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-393-24",
    "position_title": "Intern",
    "office": "Office of Congresswoman Kim Schrier (WA-08)",
    "location": "Issaquah and Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The OAice of Congresswoman Kim Schrier (WA-08) is seeking interns in its\nIssaquah and Washington, D.C. oAices for spring 2025.\n\nApplicants should be eager to learn more about the legislative process and\nwant to be part of a hardworking team dedicated to serving Washington’s 8th\nCongressional District. Interns will work in a fast-paced Congressional oAice,\ngaining valuable experience and knowledge of the United States Congress.\nIn Washington, D.C., intern responsibilities will include greeting constituents,\nanswering constituent phone calls, supporting staA with administrative\ntasks, conducting legislative research, assisting with constituent\ncorrespondence, and other miscellaneous tasks as assigned.\nInterns in Washington, D.C. also have the opportunity to lead tours of the U.S. Capitol, as well as attend brieﬁngs for the legislative staA.\nIn the District oAice, interns will assist with a variety of tasks, including dayto-day oAice work such as answering phones, writing letters, and assisting\nwith media clips. District oAice interns may also help with constituent\ncasework or other District-based projects of importance.",
    "responsibilities": [
      "Greeting constituents",
      "Answering constituent phone calls",
      "Supporting staA with administrative tasks",
      "Conducting legislative research",
      "Assisting with constituent correspondence",
      "Other miscellaneous tasks as assigned",
      "Lead tours of the U.S. Capitol",
      "Attend brieﬁngs for the legislative staA",
      "Answering phones",
      "Writing letters",
      "Assisting with media clips",
      "Assist with constituent casework",
      "Assist with other District-based projects of importance"
    ],
    "qualifications": [
      "Exceptional written and oral communication skills",
      "A high degree of professionalism",
      "A strong interest in public service",
      "The ability to multi-task and work with a team are a plus",
      "Washington state ties are a plus, but not required",
      "Prospective interns should be able to commit at least 20 hours per week during business hours",
      "Congressional internships are open to all majors and designed for undergraduate and graduate students, as well as recent graduates with an interest in public service"
    ],
    "how_to_apply": "Please apply by November 15, 2024, at 11:59 p.m. ET.\nPlease be prepared to submit a cover letter, resume, three references and relevant information at https://schrier.house.gov/services/internships. If you have issues with this form, please email relevant application materials to DistrictInternshipsWA08@mail.house.gov.",
    "salary_info": "Stipends or academic credit are available.",
    "contact": "DistrictInternshipsWA08@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-391-24",
    "position_title": "Internship",
    "office": "Representative Jim Baird (IN-4)",
    "location": "Washington, DC",
    "posting_date": "2024-10-21",
    "description": "Representative Jim Baird (IN-4) is seeking internship applicants for Spring 2025 in his Washington, DC office. This is a paid, in-person, invaluable opportunity to experience the legislative process hands-on through a wide range of tasks and responsibilities providing support with office administration, communications, and legislative work.",
    "responsibilities": [
      "Answering phones",
      "Greeting office visitors",
      "Sorting mail",
      "Conducting legislative research",
      "Attending hearings and briefings",
      "Giving tours of the U.S. Capitol",
      "Assisting communications staff with press releases and social media",
      "Drafting constituent letters"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Detail oriented, motivated, and flexible",
      "Address all work with a positive attitude",
      "Prior constituent or customer service experience",
      "Demonstrated interest in public service",
      "District/Indiana ties are preferred"
    ],
    "how_to_apply": "Interested applicants should apply and upload a resume through the website at: https://baird.house.gov/services/internships.htm.",
    "salary_info": "paid",
    "contact": "baird.intern@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-390-24",
    "position_title": "Intern",
    "office": "Congressman Moulton",
    "location": "Salem and Washington D.C.",
    "posting_date": "2024-10-21",
    "description": "Congressman Moulton is seeking hard-working individuals who are passionate, driven, and committed to public service for an internship in his Salem oAice and Washington D.C. oAice. Internships are intended for current undergraduate students, current graduate students, and recent college graduates. Interns receive a stipend distributed based on total hours worked.",
    "responsibilities": [
      "Answering constituent phone calls and greeting constituents at the front desk.",
      "Categorizing and responding to constituent mail.",
      "Drafting form letters and cosponsor requests for the Congressman.",
      "Taking notes at brieﬁngs and hearings.",
      "Conducting tours of the Capitol for constituents.",
      "Assembling press and news clips.",
      "Performing a variety of other duties as assigned, such as conducting legislative research.",
      "Answering constituent phone calls and greeting constituents at the front desk.",
      "Assisting the Casework Team on a variety of casework requests involving federal agencies.",
      "Taking notes at brieﬁngs and hearings.",
      "Assembling press and news clips.",
      "Performing a variety of other duties as assigned, such as conducting legislative research and attending community events."
    ],
    "qualifications": [
      "Current undergraduate students",
      "Current graduate students",
      "Recent college graduates"
    ],
    "how_to_apply": "Applicants can ﬁnd more information on the internship portal at moulton.house.gov under the ‘Services’ tab. All applications are due on November 10th, 2024, and will be reviewed after the application period closes.",
    "salary_info": "Interns receive a stipend distributed based on total hours worked.",
    "contact": "If you have trouble accessing the application form above or have other questions, please email Emerson Jacobson (Emerson.Jacobson@mail.house.gov.)",
    "equal_opportunity": null
  },
  {
    "id": "MEM-388-24",
    "position_title": "Intern",
    "office": "Office of Congressman Tom McClintock",
    "location": null,
    "posting_date": "2024-10-21",
    "description": "The oAice of Congressman Tom McClintock is seeking full or part-time interns. Position duties include: attending Congressional hearings, scheduling/leading Capitol tours, answering phones, sorting mail, and assisting legislative staA with research.",
    "responsibilities": [
      "Attending Congressional hearings",
      "Scheduling/leading Capitol tours",
      "Answering phones",
      "Sorting mail",
      "Assisting legislative staA with research"
    ],
    "qualifications": [
      "Applicants should possess conservative values and hold strong written and verbal communication skills.",
      "Recent graduates are welcome to apply."
    ],
    "how_to_apply": "Interested applicants should send their resume, availability, and a brief cover letter to gopwestcoastjobs@gmail.com. Please use “McClintock Internship” in the subject line. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "gopwestcoastjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-384-24",
    "position_title": "Intern",
    "office": "Congressman Steve Cohen (D-TN-09)",
    "location": "Washington, D.C.",
    "posting_date": "2024-10-21",
    "description": "The Washington, D.C. OAice of Congressman Steve Cohen (D-TN-09) is seeking interns for the spring of 2025. This is an in-person opportunity with limited hybrid hours possible. A majority of the program is spent in the oAice.\n\nThis position oAers an opportunity to learn about the U.S. House of Representatives and gain substantive work experience in an exciting and fast-paced oAice. Internships are oAered on a full-time and part-time basis, and stipends are oAered based on need. Full-time availability is preferred. Ties to Tennessee’s 9th District are preferred but not required. Start dates are ﬂexible. Applications are reviewed on a rolling basis.",
    "responsibilities": [
      "Assist with constituent correspondence and draft email blasts and other forms of outreach.",
      "Attend virtual brieﬁngs and track virtual hearings.",
      "Conduct weekly legislative assignments.",
      "Conduct legislative research on an as-needed basis."
    ],
    "qualifications": [
      "Demonstrated interest in politics, policy and/or public service.",
      "Strong communications and writing skills.",
      "Hard-working, dependable, detail-oriented and professional.",
      "Self-motivated (especially given that all work is remote).",
      "Ties to Tennessee’s 9th District are a bonus, but not required."
    ],
    "how_to_apply": "To apply, applicants must complete the form and submit the following materials on https://cohen.house.gov/services/internships:\n\n· Resume.\n· Cover letter.\n· Three references.",
    "salary_info": "stipends are oAered based on need",
    "contact": null,
    "equal_opportunity": null
  }
]