[
  {
    "id": "MEM-070-18",
    "position_title": "Press Secretary",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington",
    "posting_date": "2018-02-26",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a press secretary for his Washington office. Spanish skills and Hill experience a plus.",
    "responsibilities": [],
    "qualifications": [
      "Spanish skills a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-064-18",
    "position_title": "Legislative Assistant",
    "office": "Senior Rocky Mountain Democrat",
    "location": null,
    "posting_date": "2018-02-26",
    "description": "Senior Rocky Mountain Democrat is seeking a legislative assistant to manage a very active health care portfolio, including the Member's leadership of two high-profile caucuses.",
    "responsibilities": [],
    "qualifications": [
      "Candidates should have at least three years of experience developing and implementing legislative strategies in a Congressional office.",
      "Strong research, writing, and negotiation skills are essential.",
      "An advanced degree in a health field is preferred.",
      "The ideal candidate will be creative and proactive, possess a strong work ethic, and be able to have fun while maintaining a busy schedule."
    ],
    "how_to_apply": "Interested applicants should send a cover letter and resume to rockymountainhealthla@gmail.com.",
    "salary_info": null,
    "contact": "rockymountainhealthla@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-056-18",
    "position_title": "Executive Director",
    "office": "U.S.-China Economic and Security Review Commission",
    "location": null,
    "posting_date": "2018-02-26",
    "description": "The position is responsible for the overall management of the USCC staff, as well as providing advice to Commissioners regarding Commission hearings, research topics, and contents of the Commission's Annual Report to Congress. Candidates should demonstrate firsthand knowledge and senior level experience in organization management, ability to establish program/policy goals and implement them, knowledge of how to manage a budget, and the highest degree of judgement, initiative, and objectivity. Candidates are expected to have substantive knowledge of USChina policy and China's economic, trade, military and security policies and practices.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "A full list of requirements, responsibilities, and information on how to apply can be obtained by emailing a request to contact@uscc.gov or can be found on the Commission website at www.uscc.gov/about/job-opportunities.",
    "salary_info": null,
    "contact": "contact@uscc.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-055-18",
    "position_title": "Speechwriter",
    "office": "Northeastern progressive Democrat, Senior Member of Democratic Leadership, and Member of the Appropriations Committee",
    "location": null,
    "posting_date": "2018-02-26",
    "description": "The individual will work closely with the legislative staff and take the lead on crafting speeches and op-ed columns.",
    "responsibilities": [],
    "qualifications": [
      "Excellent and proven writing and organizational skills",
      "Ability to grasp complex policy concepts",
      "Think strategically",
      "Multitask effectively under tight deadlines",
      "Command of the legislative process",
      "Sound political judgment",
      "Sense of humor"
    ],
    "how_to_apply": "Please send cover letter, resume, and 2-3 writing samples to: ctspeechwriter@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ctspeechwriter@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-051-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Democratic Member of Congress",
    "location": null,
    "posting_date": "2018-02-26",
    "description": "Duties include managing the daily schedule for a Democratic Member of Congress; reviewing invitations and meeting requests with the Chief of Staff and other staff members; and organizing all the logistical aspects of the Member’s schedule. Duties also include overseeing the front office reception area and a very active intern program. This position requires exceptional organization, strong interpersonal skills, attention to detail and the ability to multitask and prioritize.",
    "responsibilities": [
      "Managing the daily schedule",
      "Reviewing invitations and meeting requests with the Chief of Staff and other staff members",
      "Organizing all the logistical aspects of the Member’s schedule",
      "Overseeing the front office reception area",
      "Overseeing a very active intern program"
    ],
    "qualifications": [
      "Exceptional organization",
      "Strong interpersonal skills",
      "Attention to detail",
      "Ability to multitask and prioritize"
    ],
    "how_to_apply": "Please send resume and cover letter to Employment@mail.house.gov.",
    "salary_info": "Salary commensurate with experience. An expanded portfolio to include financial administration is possible for qualified candidates.",
    "contact": "Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-047-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": null,
    "location": "Washington, DC",
    "posting_date": "2018-02-26",
    "description": "CORE RESPONSIBILITIES:\n\nto maintain the Member's official schedule, travel plans, and related records; and\nto act as liaison for the Member with the staff, public and other Members.",
    "responsibilities": [
      "Prepares the daily schedule for the Member, and distributes copies to the Washington, DC, and district offices",
      "Prepares detailed itineraries for the Member, including important numbers, location and contact names",
      "Prepares monthly projected schedules for the Member",
      "Briefs the Member on all scheduling activities of the Washington, DC, and district offices and makes recommendations on proposed future meetings",
      "Schedules all staff meetings and briefings",
      "Coordinates scheduling of press, interviews, radio and T.V. time with the Press Secretary",
      "Coordinates photo opportunities with constituents",
      "Makes reservations for the Member's air travel, ground transportation, and lodging",
      "Submits vouchers for travel and expense reimbursement",
      "Reviews the Member's mail and invitations",
      "Responds to all invitations, either by written correspondence or by personal telephone call",
      "Maintains files of invitations that have been declined, accepted, or that are tentative/pending",
      "Ensures that the Member is provided with briefing materials for each event",
      "Monitors the Member's incoming telephone calls in a telephone log, takes messages, and returns calls as requested",
      "Places outgoing calls for the Member and maintains a record of calls",
      "Maintains the Member's files, including notes, correspondence, and all information relating to travel",
      "Organizes documentation and materials for the Member's annual financial disclosure report",
      "Acts as a liaison for constituents and other visitors that drop by to see the Member",
      "Acts as a liaison between the Member and other Members, committee staff, White House, and government offices and agencies to arrange for the Member's attendance at meetings or to coordinate travel plans",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "At least 1-2 years of office experience",
      "Strong telephone skills",
      "Strong oral and written communication skills",
      "Ability to exercise discretion and independent judgment with respect to prioritization of and recommendations on Member appointments",
      "Strong organizational and filing skills",
      "Thoroughness and careful attention to detail",
      "Experience making travel reservations and arrangements",
      "Ability to work cooperatively and courteously with others",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Availability to work long hours and at night"
    ],
    "how_to_apply": "Please send all resumes to nyrepjobs@gmail.com.",
    "salary_info": null,
    "contact": "nyrepjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-046-18",
    "position_title": "Press Secretary",
    "office": "Senior Democratic Congressman",
    "location": "Capitol Hill",
    "posting_date": "2018-02-26",
    "description": "Senior Democratic Congressman who serves as Ranking Member on a full\ncommittee seeks an experienced, energetic and creative Press Secretary to\nwork in a fast-paced press operation. The ideal candidate should be\nentrepreneurial and aggressive in generating ideas that yield media coverage,\npromoting the Member’s agenda through traditional and social media, and\nraising the Member’s national profile. The Press Secretary will be\nresponsible for all facets of daily press operation including: media strategy\ndevelopment and implementation; serving as primary spokesperson for\nnational and local media; coordinating press conferences; pitching story ideas;\nmanaging coverage of legislative action and events; and drafting statements,\nreleases, speeches, opinion editorials and responses to articles. This is not an\nentry-level position. The candidate must have previous Capitol Hill\nexperience, extensive media contacts and background working with both print\nand electronic media. The Press Secretary must also seek innovative ways to\nincrease the Member’s visibility, including expanding the use of the\nMember’s website and other on-line resources and developing/maintaining\neffective relationships with national and local media. Excellent oral and\nwritten communications skills and the ability to work in a high pressure,\nteam-oriented environment while juggling multiple tasks are required. Onthe-record experience preferred.",
    "responsibilities": [
      "media strategy development and implementation",
      "serving as primary spokesperson for national and local media",
      "coordinating press conferences",
      "pitching story ideas",
      "managing coverage of legislative action and events",
      "drafting statements, releases, speeches, opinion editorials and responses to articles"
    ],
    "qualifications": [
      "previous Capitol Hill experience",
      "extensive media contacts",
      "background working with both print and electronic media",
      "Excellent oral and written communications skills",
      "ability to work in a high pressure, team-oriented environment while juggling multiple tasks",
      "On-the-record experience preferred"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter and resume with the words “Press Secretary” in the subject line to job_09@live.com.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-045-18",
    "position_title": "Communications Director",
    "office": "Congressman Erik Paulsen’s office",
    "location": null,
    "posting_date": "2018-02-26",
    "description": "Congressman Erik Paulsen’s office seeks a Communications Director to craft a relevant, compelling communications strategy that engages a variety of audiences. The ideal candidate would have a knack for personalizing a message and breaking down complicated issues. The candidate must be proactive and creative while possessing a clear, concise writing style.",
    "responsibilities": [
      "Implementing and managing a communications strategy",
      "Working with the legislative team to highlight a policy agenda",
      "Writing press releases and op-eds",
      "Drafting speeches",
      "Creating talking points",
      "Pitching, and building relationships with reporters"
    ],
    "qualifications": [],
    "how_to_apply": "If interested, please submit a cover letter, resume, references and two short writing samples to MN03Jobs@gmail.com with the subject line “Communications Director.”",
    "salary_info": null,
    "contact": "MN03Jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-044-18",
    "position_title": "Legislative Director",
    "office": "Southern Democratic Member",
    "location": "D.C.",
    "posting_date": "2018-02-26",
    "description": "This individual is responsible for drafting legislation and amendments, tracking the floor, developing legislative initiatives, staffing committees, and representing the Member in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking the floor",
      "Developing legislative initiatives",
      "Staffing committees",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Ability to work well under pressure in a fast-paced environment",
      "Background in transportation is a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and two brief writing samples along with three references to southernhousedem@gmail.com. No drop-ins or phone calls.",
    "salary_info": null,
    "contact": "southernhousedem@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-041-18",
    "position_title": "Social Media Manager & Press Assistant",
    "office": "The press office of Rep. Louise Slaughter (NY-25) and the House Rules Committee",
    "location": null,
    "posting_date": "2018-02-26",
    "description": "The press office of Rep. Louise Slaughter (NY-25) and the House Rules Committee is seeking a social media manager & press assistant to join an aggressive communications team. Responsibilities include managing the congresswoman’s digital media channels, including website and social media accounts, developing engaging online content, writing e-newsletters, and taking photos and video. The social media manager & press assistant will also compile press clips, copy-edit press releases and talking points, and other projects as necessary. Must be comfortable working collaboratively to execute a broad communications strategy. Prior press and/or digital experience and familiarity with both graphic design and video editing is preferred. Ideal candidates must also have strong written and verbal communications skills and be able to work demanding hours in a fast-paced environment.",
    "responsibilities": [
      "Managing the congresswoman’s digital media channels, including website and social media accounts",
      "Developing engaging online content",
      "Writing e-newsletters",
      "Taking photos and video",
      "Compile press clips",
      "Copy-edit press releases and talking points",
      "Other projects as necessary"
    ],
    "qualifications": [
      "Prior press and/or digital experience and familiarity with both graphic design and video editing is preferred.",
      "Must have strong written and verbal communications skills",
      "Must be able to work demanding hours in a fast-paced environment."
    ],
    "how_to_apply": "Interested candidates must submit a resume, cover letter, two writing samples, and two examples of social media or digital media work to digitalpressposting@mail.house.gov. Candidates will be considered on a rolling basis until the position is filled.",
    "salary_info": null,
    "contact": "digitalpressposting@mail.house.gov",
    "equal_opportunity": null
  }
]