[
  {
    "id": "MEM-411-18",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": "U.S. House of Representatives",
    "posting_date": "2018-11-14",
    "description": "The Committee on Oversight and Government Reform is the principal\ninvestigative body for the U.S. House of Representatives. Ranking Member\nElijah Cummings seeks to fill a Counsel position on the Democratic staff.\nThe ideal candidate will be an attorney with several years of investigative or\nlitigation experience.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with\n“Counsel” in the subject line. No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse\nbackgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-410-18",
    "position_title": "Health Policy Advisor",
    "office": "Congressman Roger Marshall, M.D. (KS-01)",
    "location": null,
    "posting_date": "2018-11-14",
    "description": "Congressman Roger Marshall, M.D. (KS-01) seeks an experienced, resultsoriented Health Policy Advisor to work on health policy. This is not an entry level position. Expertise in health care pricing, transparency, and insurance markets preferred. Successful candidate will be detail-oriented, possess strong strategic thinking skills and have the ability to identify and prioritize opportunities to influence health care policy.",
    "responsibilities": [
      "Staffing congressional hearings",
      "Work with health-related federal agencies",
      "Conducting policy research",
      "Drafting health care legislation",
      "Coalition building"
    ],
    "qualifications": [
      "Minimum of four years professional experience in health policy required.",
      "Expertise in health care pricing, transparency, and insurance markets preferred.",
      "Detail-oriented",
      "Strong strategic thinking skills",
      "Ability to identify and prioritize opportunities to influence health care policy."
    ],
    "how_to_apply": "Please send resume, cover letter, and at least two professional references. Use subject in email “Health Policy Advisor”",
    "salary_info": null,
    "contact": "Dalton.henry@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-405-18",
    "position_title": "Economic Policy Staffer",
    "office": "House Small Business Committee Democrats",
    "location": null,
    "posting_date": "2018-11-14",
    "description": "House Small Business Committee Democrats seek an Economic Policy Staffer to manage a broad policy portfolio including, tax, health, retirement, and other economic issues. Core responsibilities include developing and advancing legislation, planning events on key policy priorities, coordinating hearings, staffing Member, and drafting reports. Exceptional writing and analytical skills are a must. Prior Hill, federal agency, private sector or policy think tank experience is preferred. An advanced degree is a plus.",
    "responsibilities": [
      "Developing and advancing legislation",
      "Planning events on key policy priorities",
      "Coordinating hearings",
      "Staffing Member",
      "Drafting reports"
    ],
    "qualifications": [
      "Exceptional writing and analytical skills are a must.",
      "Prior Hill, federal agency, private sector or policy think tank experience is preferred.",
      "An advanced degree is a plus."
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-404-18",
    "position_title": "Staffer",
    "office": "House Small Business Committee (Democratic staff)",
    "location": null,
    "posting_date": "2018-11-14",
    "description": "The House Small Business Committee (Democratic staff) seeks a staffer to work on issues related to small business technology, telecommunications, and trade policy. Candidate must be an outstanding writer, have a demonstrated capacity to generate new ideas, and the proven ability to analyze legislation. This is not an entry level position. A graduate degree is strongly preferred. Exceptional writing and analytical skills are a must. Prior Hill, federal agency, private sector or policy think tank experience is preferred. The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply.",
    "responsibilities": [],
    "qualifications": [
      "Outstanding writer",
      "Demonstrated capacity to generate new ideas",
      "Proven ability to analyze legislation",
      "Graduate degree is strongly preferred",
      "Exceptional writing and analytical skills are a must",
      "Prior Hill, federal agency, private sector or policy think tank experience is preferred"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-403-18",
    "position_title": "Oversight and Regulatory Counsel",
    "office": "House Small Business Committee (Democratic Staff)",
    "location": null,
    "posting_date": "2018-11-14",
    "description": "Responsibilities include planning and conducting congressional oversight and advising in policy matters related to oversight of issues within the committee's jurisdiction. Additional duties include reviewing and monitoring regulatory issues across the federal government as it pertains to small businesses and drafting comments and official correspondence as necessary.",
    "responsibilities": [
      "Planning and conducting congressional oversight",
      "Advising in policy matters related to oversight of issues within the committee's jurisdiction",
      "Reviewing and monitoring regulatory issues across the federal government as it pertains to small businesses",
      "Drafting comments and official correspondence as necessary"
    ],
    "qualifications": [
      "Relevant legal experience",
      "Excellent research and writing skills",
      "Strong analytical and communication skills",
      "Team player",
      "Able to work well under pressure and with quick deadlines",
      "Experience with congressional oversight and regulations preferred",
      "Hill experience is a plus",
      "J.D. is required; please no recent graduates. This is not an entry level position."
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-402-18",
    "position_title": "Policy Director",
    "office": "House Committee on Small Business (Democratic staff)",
    "location": null,
    "posting_date": "2018-11-14",
    "description": "The House Committee on Small Business (Democratic staff) seeks a Policy Director to assist in the daily operations and management of policy staff and assist in coordinating committee activities, such as hearings and roundtables.\n\nThis position involves day-to-day management responsibilities and requires significant management experience. Candidate must be an outstanding writer, have a demonstrated capacity to generate new ideas, the proven ability to work under pressure and tight deadlines, and sound judgment necessary to evaluate matters that arise before the committee. Only candidates with experience and a comprehensive knowledge in the substantive policy areas within the Committee's jurisdiction will be considered. This is not an entry level position. Previous hill experience is required and an advanced degree is a plus.",
    "responsibilities": [],
    "qualifications": [
      "Significant management experience",
      "Outstanding writer",
      "Demonstrated capacity to generate new ideas",
      "Proven ability to work under pressure and tight deadlines",
      "Sound judgment necessary to evaluate matters that arise before the committee",
      "Experience and a comprehensive knowledge in the substantive policy areas within the Committee's jurisdiction",
      "Previous hill experience is required",
      "Advanced degree is a plus"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-394-18",
    "position_title": "Staff Assistant",
    "office": "Republican Congressman",
    "location": null,
    "posting_date": "2018-11-14",
    "description": "Republican Congressman seeks Staff Assistant to manage day-to-day office\noperations, process flag and tour requests, and act as primary front office\nstaff. Duties will include answering phone calls, greeting visitors, overseeing\ninternship program, and ordering office supplies.",
    "responsibilities": [
      "Manage day-to-day office operations",
      "Process flag and tour requests",
      "Act as primary front office staff",
      "Answering phone calls",
      "Greeting visitors",
      "Overseeing internship program",
      "Ordering office supplies"
    ],
    "qualifications": [
      "Professional and friendly",
      "Demonstrate ability to quickly address and solve problems",
      "Exceptional organizational skills and attention to detail",
      "Able to work quickly in a fast-paced environment"
    ],
    "how_to_apply": "Please send resume and\ncover letter to gopwesternjob@gmail.com. No walk ins or phone calls.",
    "salary_info": null,
    "contact": "gopwesternjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-388-18",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2018-11-14",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if District Director finds staff assistant can take on such work)",
      "Intern coordinator: recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov .",
    "salary_info": null,
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-379-18",
    "position_title": "Senior Legislative Aide",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Hill",
    "posting_date": "2018-11-14",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a Senior Legislative Aide with a minimum of three years of Hill experience. This is not an entry level position. Excellent written and oral communication skills required. Advanced degree a plus. Spanish ability a plus. Texas ties are a plus though not necessary.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of three years of Hill experience",
      "Excellent written and oral communication skills required",
      "Advanced degree a plus",
      "Spanish ability a plus",
      "Texas ties are a plus though not necessary"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use title on your email: Senior LA Position. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-375-18",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Southern Republican Congressman",
    "location": "Washington, D.C.",
    "posting_date": "2018-11-14",
    "description": "Southern Republican Congressman is seeking a Staff Assistant/Legislative Correspondent to join a fast-paced, hardworking team. The ideal candidate will be detail oriented, well organized and must have exceptional interpersonal skills and excellent oral and written communication skills.\n\nResponsibilities include, but are not limited to answering constituent phone calls, greeting visitors, leading Capitol tours and assisting the staff by performing various tasks. This position requires an ability to multi-task, prioritize duties, and perform under pressure - all with a keen attention to detail. A car and Tennessee ties are required.",
    "responsibilities": [
      "Answering constituent phone calls",
      "Greeting visitors",
      "Leading Capitol tours",
      "Assisting the staff by performing various tasks"
    ],
    "qualifications": [
      "Detail oriented",
      "Well organized",
      "Exceptional interpersonal skills",
      "Excellent oral and written communication skills",
      "Ability to multi-task",
      "Ability to prioritize duties",
      "Ability to perform under pressure",
      "Keen attention to detail",
      "A car",
      "Tennessee ties"
    ],
    "how_to_apply": "Please send resumes to tngopapplications@gmail.com. Phone calls and drop-ins not accepted.",
    "salary_info": null,
    "contact": "tngopapplications@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-371-18",
    "position_title": "Legislative Director",
    "office": "Congresswoman Frederica S. Wilson",
    "location": "Washington, D.C.",
    "posting_date": "2018-11-14",
    "description": "The office of Congresswoman Frederica S. Wilson seeks a Legislative Director in her Washington, D.C. office. Responsibilities will include developing and implementing the Member's legislative priorities, advising her on various issues, and managing the legislative agenda. A well matched candidate will have substantive legislative experience, strong academic credentials and proven leadership and organizational skills. Moreover, the candidate should possess excellent oral and written communication skills, strong editing and proofreading skills, the ability to work well under pressure, an extensive knowledge of the legislative process, and the availability to work long hours.\nThis is not an entry-level position; only candidates with previous Hill experience and proven knowledge of legislative and political processes will be considered. Law degree, previous capitol hill experience in a leadership position and Florida ties are strongly preferred.",
    "responsibilities": [
      "Developing and implementing the Member's legislative priorities",
      "Advising her on various issues",
      "Managing the legislative agenda"
    ],
    "qualifications": [
      "Substantive legislative experience",
      "Strong academic credentials",
      "Proven leadership and organizational skills",
      "Excellent oral and written communication skills",
      "Strong editing and proofreading skills",
      "Ability to work well under pressure",
      "Extensive knowledge of the legislative process",
      "Availability to work long hours",
      "Previous Hill experience",
      "Proven knowledge of legislative and political processes",
      "Law degree (preferred)",
      "Previous capitol hill experience in a leadership position (preferred)",
      "Florida ties (preferred)"
    ],
    "how_to_apply": "To apply, please submit cover letter and resume in one single pdf to FL24.Resumes@mail.house.gov and include “Legislative Director” in the subject line by October 31, 2018.\nNo phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  }
]