[
  {
    "id": "MEM-175-20",
    "position_title": "Digital Manager",
    "office": "Democratic Leadership office",
    "location": null,
    "posting_date": "2020-06-29",
    "description": "The Digital Manager is responsible for crafting social media content along with managing digital projects with a focus on opportunities for growth and expansion. The Digital Manager will also assist and serve as a thought partner on implementation of social media, design, cross-departmental projects as-needed and other critical Caucus projects.\n\nThe Digital Manager will also supervise the Digital Assistant and department interns including reviewing and editing content, providing feedback and serving as a cross-team editor on digital and written content. The Digital Manager will report directly to the Digital Director. Candidates must be proactive project managers, excellent writers, meticulous proofreaders and have at least two years of experience managing digital campaigns and/or social media programs in a fast-paced environment.",
    "responsibilities": [
      "Create, manage and track the success of digital and social media campaigns and messaging",
      "Maintain a weekly posting schedule for all social media platforms",
      "Assist the Digital Director as-needed",
      "Craft social media content",
      "Manage digital projects with a focus on opportunities for growth and expansion",
      "Assist and serve as a thought partner on implementation of social media, design, cross-departmental projects as-needed and other critical Caucus projects",
      "Supervise the Digital Assistant and department interns including reviewing and editing content, providing feedback and serving as a cross-team editor on digital and written content"
    ],
    "qualifications": [
      "Proactive project managers",
      "Excellent writers",
      "Meticulous proofreaders",
      "At least two years of experience managing digital campaigns and/or social media programs in a fast-paced environment",
      "Strong proficiency in photography, audio/video editing, Adobe Creative Suite products (e.g. InDesign, Photoshop, Premiere Pro and Illustrator) are strongly encouraged to apply.",
      "Fluency with social media platforms including Twitter, Facebook, Instagram and Snapchat is required."
    ],
    "how_to_apply": "To apply, please send PDFs of resume, cover letter, social media writing sample and digital portfolio / website links and three professional references to DemCaucus.Jobs@mail.house.gov with name and “2020 Digital Manager Application” in the subject line.\nAbsolutely no phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "DemCaucus.Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to a diverse and inclusive workforce and does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity or disability. Women and minority applicants are encouraged to apply."
  },
  {
    "id": "MEM-171-20",
    "position_title": "Field Representative",
    "office": "Orange County Democrat",
    "location": "District",
    "posting_date": "2020-06-29",
    "description": "The Field Representative will serve as the Congresswoman’s in-district liaison for a broad portfolio of issue areas and constituency groups.\n\nThe Field Representative will be required to work some evenings and portions of weekends to accommodate community events and constituent needs. Reliable car transportation is needed to travel within the district; mileage is reimbursed.",
    "responsibilities": [
      "Write, develop, and execute a strategic plan to build connections between community members and the Congresswoman",
      "Establish and maintain in-district stakeholder relationships",
      "Be knowledgeable on issue areas regarding the district and the Congresswoman’s priorities",
      "Plan and execute in-district events, including preparing written briefs and memos",
      "Conduct outreach to constituents to inform and promote office services",
      "Write constituent correspondence relating to issue areas",
      "Regularly communicate with DC counterparts on issues, events, and communications"
    ],
    "qualifications": [
      "The ideal candidate is proactive, highly- organized, detail-oriented, friendly, and has strong written and verbal communication skills in both English and a second language.",
      "Preference will be given to candidates who are fluent in Spanish, Farsi, Mandarin, or Korean."
    ],
    "how_to_apply": "Candidates should submit a cover letter and resume to dd45lb@gmail.com with “Field Representative” in the subject line.",
    "salary_info": null,
    "contact": "dd45lb@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and all qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-168-20",
    "position_title": "Legislative Aide/Professional Staff Member",
    "office": "House Judiciary Committee’s Subcommittee on Immigration and Citizenship (Majority)",
    "location": "Washington, DC",
    "posting_date": "2020-06-29",
    "description": "The House Judiciary Committee’s Subcommittee on Immigration and\nCitizenship (Majority) seeks a Legislative Aide/Professional Staff Member\nto handle clerking responsibilities; provide support to Subcommittee Counsels\non legislative, procedural, and policy matters; and complete administrative\ntasks.",
    "responsibilities": [
      "Preparing and circulating official notices and materials, maintaining official\nhearing records, and staffing Subcommittee hearings and markups.",
      "Preparing for hearings and markups by assisting Subcommittee Counsels\nwith written materials for Members, vetting and preparing witnesses, and\ncoordinating with Subcommittee Member offices on hearing and markup\nlogistics.",
      "Providing support to Subcommittee Counsels and Democratic Member\noffices on immigration-related legislative and policy matters, as well as\nprocedural issues relating to Committee business.",
      "Assisting with Subcommittee investigations and other oversight activities,\nincluding by maintaining and analyzing document productions provided by\ngovernment and nongovernmental entities.",
      "Providing administrative assistance to the Subcommittee, including\nanswering phone calls, managing incoming and outgoing correspondence, and\nlogging and tracking bills referred to the Subcommittee."
    ],
    "qualifications": [
      "Candidates must be highly organized, detail-oriented, and capable of thriving\nin a fast-paced and rapidly changing environment.",
      "Candidates should have\nprior Hill experience, ideally with a Congressional Committee.",
      "Previous\nimmigration policy experience is a plus, but not required."
    ],
    "how_to_apply": "Please send a resume and cover letter to JDEM.job@mail.house.gov and\ninclude “Legislative Aide” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff reflects the diversity of the\ncountry’s population; candidates from minority backgrounds are strongly\nencouraged to apply.\n\nThe Committee does not discriminate on the basis of race, color, religion, sex\n(including marital or parental status, sexual orientation, and gender identity),\ndisability, age, or national origin."
  },
  {
    "id": "MEM-167-20",
    "position_title": "Communications Director",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": "VA-01",
    "posting_date": "2020-06-29",
    "description": "The Office of Congressman Rob Wittman (VA-01) is seeking a Communications Director to manage a proactive, robust operation.\nThe Communications Director will develop and implement media, communications, and public relations strategy for the Member’s legislative and outreach items, identify and message to strategic constituencies in VA-01, and develop a proactive constituent communications strategy and plan to creatively and effectively communicate the Member’s messages through traditional, as well as digital venues.\nCandidate will work as part of a two-person communications team and will work closely with legislative staff. The ideal candidate is a proactive communicator who can work under tight deadlines and on both short and long-term projects simultaneously.\nCandidate must be prepared to work in a collaborative environment that requires a high level of writing and content generation.",
    "responsibilities": [
      "Messaging prep for the Member",
      "Producing talking points for speeches and appearances",
      "Developing mass mail plan and content",
      "Coordinating defense press strategy and op-eds",
      "Producing weekly update",
      "Overseeing proactive constituent coalitions email and 499 program",
      "Managing telephone town hall and town hall program",
      "Overseeing Member’s website and social media sites"
    ],
    "qualifications": [
      "Previous congressional or political communications experience",
      "Virginia ties are helpful but not required"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Carolyn.King@mail.house.gov with “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-165-20",
    "position_title": "Staff Assistant",
    "office": "Southern Member",
    "location": "Washington, D.C.",
    "posting_date": "2020-06-29",
    "description": "Qualified applicants should be motivated self-starters, highly organized, detail-oriented, able to multitask, have exceptional interpersonal skills, and ability to thrive in a fast-paced environment.\nCandidates must demonstrate excellent “people skills,” most importantly displaying personability in all interactions, and a strong commitment to providing outstanding constituent service.\nThe ideal candidate should: be able to think on their feet, be a problem-solver, show keen attention to detail and an ability to multi-task, demonstrate excellent oral and written skills, maintain a positive demeanor, and demonstrate resilience in a busy environment.",
    "responsibilities": [
      "Managing the front office, including answering, appropriately logging, and directing telephone calls",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Distributing hard and electronic mail",
      "Other administrative duties",
      "Serve as the office tour coordinator",
      "Responsible for managing constituent requests for Capitol and White House tours",
      "Responsible for constituent requests for flags flown over the Capitol"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Highly organized",
      "Detail-oriented",
      "Able to multitask",
      "Exceptional interpersonal skills",
      "Ability to thrive in a fast-paced environment",
      "Excellent “people skills,” displaying personability in all interactions",
      "Strong commitment to providing outstanding constituent service",
      "Able to think on their feet",
      "Problem-solver",
      "Keen attention to detail",
      "Ability to multi-task",
      "Excellent oral and written skills",
      "Maintain a positive demeanor",
      "Demonstrate resilience in a busy environment"
    ],
    "how_to_apply": "Please submit a resume as well as a list of references to congressionaljobs2805@gmail.com with “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-164-20",
    "position_title": "Press Assistant",
    "office": "West Coast Progressive",
    "location": "Washington, DC",
    "posting_date": "2020-06-29",
    "description": "Responsibilities will include compiling press clips, drafting press materials, updating the website, staffing the member, and assisting in management of high-profile social media accounts.\n\nCandidates should have a passion for progressive politics and enjoy working in a collaborative environment. Experience with graphic design, video production and photography is a plus. Hill experience preferred.",
    "responsibilities": [
      "compiling press clips",
      "drafting press materials",
      "updating the website",
      "staffing the member",
      "assisting in management of high-profile social media accounts"
    ],
    "qualifications": [
      "passion for progressive politics",
      "enjoy working in a collaborative environment",
      "experience with graphic design, video production and photography is a plus",
      "Hill experience preferred"
    ],
    "how_to_apply": "To apply, send a cover letter, resume and short writing sample to lee.resumes@mail.house.gov with “Press Assistant” in the subject line.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation.\nWe strongly value the diversity of our employees."
  },
  {
    "id": "MEM-162-20",
    "position_title": "Legislative Assistant and Professional Staff Member",
    "office": "Chairman Gerald E. Connolly, Committee on Oversight and Reform, Subcommittee on Government Operations",
    "location": null,
    "posting_date": "2020-06-29",
    "description": "Chairman Gerald E. Connolly seeks an exceptional, self-motivated candidate to staff Mr. Connolly on all Committee on Oversight and Reform activities.\nThe position is shared between the personal office and the Subcommittee on Government Operations.\nThe position offers the opportunity to help lead an effective and fast-paced Subcommittee with a broad jurisdiction and significant legislative authority.\nThe Subcommittee has a wide reach and seeks to improve government across the entire enterprise of its operations.\nThe Chairman is particularly interested in candidates with a deep knowledge of and an interest in engaging:\noFederal information technology modernization and improvement;\noSafe agency adaptation of new technologies and IT security practices, including cloud computing;\noIssues of federalism and engaging state, local, and tribal governments;\noEnsuring the federal workforce, including civil servants and contractors, have the resources they need to serve the nation;\noWays to prevent the Trump Administration from damaging a merit-based civil service and our federal oversight infrastructure of federal inspectors general.\nThe individual who fills this role will have the opportunity to influence federal IT policy across the government and to help the Chairman find new ways to use oversight to encourage agencies to improve their technology postures and ensure the acquisition of technologies that can improve every operation of our federal government.\nThe right candidate will serve as a critical leader of a close-knit team and will have the opportunity to work both with the full Committee and with Chairman Connolly’s personal office staff.\nThis person will keep Chairman Connolly fully informed of and staff all Oversight and Reform Committee events and activities and be an integral member of the personal office and subcommittee staff.",
    "responsibilities": [
      "designing and preparing congressional hearings",
      "working with multiple stakeholders to design legislative solutions to address complex national policy concerns",
      "writing statements and speeches",
      "conducting legal and factual research",
      "drafting memoranda",
      "ensuring Government Operations priorities are reflected in appropriations and defense authorization bills",
      "engaging the Chairman’s constituents and ensuring their needs and priorities are reflected in Committee oversight and legislation",
      "and leading oversight initiatives"
    ],
    "qualifications": [
      "an interest in public service",
      "expertise in some of the areas described above",
      "the ability to work closely with a team and remain entrepreneurial",
      "superior attention to detail",
      "work well under pressure",
      "be self-motivated",
      "possess excellent written and oral communication skills",
      "Applicants should be willing to be in the office full time and be able to attend work duties on some evenings and weekends."
    ],
    "how_to_apply": "Interested applicants should apply to this position by emailing a cover letter and resume to Government.Operations@mail.house.gov with “Oversight” in the subject line.\nNo phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "Government.Operations@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-159-20",
    "position_title": "Legislative Assistant",
    "office": "House office",
    "location": "Washington, DC",
    "posting_date": "2020-06-29",
    "description": "Progressive Southern California Democrat seeks a highly talented and\nmotivated individual to serve as a Legislative Assistant in Washington, DC\nHouse office - with the primary responsibilities of handling the Member’s\nimmigration and housing portfolio, Homeland Security Committee work, and\nserve as Member’s liaison to Congressional Hispanic Caucus. Candidates\nmust have a proven record of proposing legislation, developing amendments,\nand leading on letters.\n",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various\nlegislative vehicles",
      "Preparing hearing binders and questions for witnesses for Homeland Security\nCommittee hearings",
      "Drafting talking points, vote recommendations and other materials",
      "Monitoring and analyzing legislative developments, committee proceedings,\nnews stories and other relevant info",
      "Representing the Member in meetings with constituents and stakeholders."
    ],
    "qualifications": [
      "Ability to work under pressure and meet deadlines in\na fast-paced work environment.",
      "Strong organizational and time management\nskills, excellent written and verbal communication skills, and a keen attention\nto detail are required.",
      "Spanish language skills strongly preferred."
    ],
    "how_to_apply": "Please e-mail a resume, cover\nletter including salary requirements, and writing sample to:",
    "salary_info": null,
    "contact": "Resume.Inbox44@mail.house.gov",
    "equal_opportunity": "The Office is an Equal Employment Opportunity employer and all qualified\ncandidates are encouraged to apply."
  },
  {
    "id": "MEM-157-20",
    "position_title": "Research and Data Analyst",
    "office": "House Office of Diversity and Inclusion",
    "location": null,
    "posting_date": "2020-06-29",
    "description": "The House Office of Diversity and Inclusion is seeking to hire a Research and Data Analyst. In this capacity the Analyst will be responsible for leading data and research collection and analysis for the Office of Diversity and Inclusion.\n\nThis individual will lead the development of the required diversity report, maintain key metrics and key performance indicators for the Office, and serve as a resource for external and internal diversity best practices.\nThis individual will also serve as the project manager for any consultants and/or contractors with whom the Office may engage to support the completion of the diversity report and to develop relevant diversity and inclusion-based training, in collaboration with the Congressional Staff Academy.",
    "responsibilities": [
      "This staffer will assist in the translation of research findings into materials that staff can effectively utilize in their engagements with Members and Member offices.",
      "Provide research support on diversity and inclusion studies, techniques and tools.",
      "Serve as project manager for the diversity report and, where necessary, direct and coordinate activities of external consultants.",
      "Research and study best practices for retention and growth in House employing offices.",
      "Lead data tracking and reporting with a focus on performance and results.",
      "Prepare regular updates and briefing documents on research that is relevant to House employing offices.",
      "Assist with the development and delivery of training sessions and, as needed, conduct presentations at professional conferences and meetings."
    ],
    "qualifications": [
      "Master’s degree in social or behavioral sciences or related field; or equivalent level of experience providing technical assistance, data collections and/or research.",
      "Must have knowledge and experience in diversity, equity, and inclusion research efforts, ideally with a strong background in curriculum development.",
      "Current working knowledge of coalition functioning, evaluation and research.",
      "Quantitative and qualitative evaluation and research skills.",
      "Expertise using relevant software.",
      "Customer-service orientation and ability to work harmoniously with a diverse team.",
      "Ability to work under deadline pressure and extra hours if needed on assignment.",
      "Demonstrated ability to self-motivate, initiate project activities, and work on multiple assignments simultaneously.",
      "Extensive computer skills, including data input."
    ],
    "how_to_apply": "Interested candidates should send an email to Diverse.House@mail.house.gov with “Research and Data Analyst” in the subject line and.",
    "salary_info": null,
    "contact": "Diverse.House@mail.house.gov",
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please."
  },
  {
    "id": "MEM-155-20",
    "position_title": "Professional Staffer",
    "office": "House Office of Diversity and Inclusion",
    "location": "Capitol Hill",
    "posting_date": "2020-06-29",
    "description": "The House Office of Diversity and Inclusion is seeking to hire two (2) Professional Staffers of Member and Candidate Services. The professional staffers will be responsible for corresponding and providing direct support to House employing offices in the areas of diversity and inclusion training, consulting and applicant placement.\n\nThese individuals will also be responsible for corresponding and providing direct support to candidates by providing applicant coaching and preparedness services.\n\nPosition requires exceptional interpersonal skills, a hospitality-minded approach, excellent organizational skills and attention to detail. The ideal candidate will have experience working on Capitol Hill and will bring experience in office administration, database system management, program management and event planning.",
    "responsibilities": [
      "Establish relationships with House employing offices.",
      "Determine Member office staffing needs through initial assessment and ongoing meetings.",
      "Drive increased participation in programs and services.",
      "Create and maintain diversity and inclusion resource materials (diversity and inclusion handbook, best practice documents, etc.) for dissemination to House employing offices.",
      "Database management for candidate selection and placement.",
      "Conduct initial assessment for applicants including resume reviews and advising.",
      "Conduct mock interviews and exit interviews for applicants.",
      "Represent the Office at internal and external engagements as needed."
    ],
    "qualifications": [
      "Bachelor’s degree and a combination of knowledge and experience in diversity and inclusion issues in the public and/or private sectors. The individual must be a self-starter with a history of working collaboratively with a diverse cross section of stakeholders. Experience in building consensus and gaining support around challenging issues.",
      "Experience with program management and implementation.",
      "Experience with computers and working knowledge of Word, Excel, and social media.",
      "Management experience in hiring, and supervision of staff."
    ],
    "how_to_apply": "Interested candidates should apply by following the instructions here https://house.csod.com/ux/ats/careersite/1/home/requisition/84?c=house\nCandidates will be asked to upload a cover letter, resume, and two writing samples.",
    "salary_info": "Salary commensurate with experience.",
    "contact": null,
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please."
  },
  {
    "id": "MEM-154-20",
    "position_title": "Communications Manager",
    "office": "House Office of Diversity and Inclusion",
    "location": null,
    "posting_date": "2020-06-29",
    "description": "The House Office of Diversity and Inclusion is seeking a Communications\nManager. The communications manager will be responsible for helping to\n“tell the story” of the office with internal and external audiences.\nThis individual will develop and drive communications and outreach efforts\ntargeting House Offices, ensuring that they are aware of the ways in which the\nHouse Office of Diversity and Inclusion can support diversity objectives.\nThis individual will also help to communicate the diversity “business case,”\nand support writing and creative needs for the Office.\nSuccessful candidate must be results-driven and proactive in the application\nof innovative and creative approaches to drive engagement with House\nOffices.",
    "responsibilities": [
      "Responsible for the development/production of content across multiple platforms including photography, videos, infographics, and other creative executions for Member offices, events, trainings and research products.",
      "Manage the Office of Diversity and Inclusion web site, newsletter, and social media platforms. Activity includes drafting and scheduling content, monitoring for mentions, identifying opportunities for engagement, updating follower lists, and keeping up with social media trends.",
      "Repurpose existing content and find opportunities for new content.",
      "Support the House D&I program with writing and implementation as needed.",
      "Perform other duties and projects as assigned"
    ],
    "qualifications": [
      "Bachelor's degree or equivalent experience in Digital Communications, Publishing, or Content Production.",
      "Have a strong knowledge of social media and content trends, and emerging technologies and platforms. Have a working knowledge of digital and social media metrics.",
      "The ideal candidate will have a background in photography and video production and editing and have a strong focus on storytelling.",
      "Experience with social media community management required",
      "Excellent writing skills required",
      "Design knowledge strongly preferred",
      "Extensive experience handling multiple projects from ideation to final delivery",
      "Knowledge and understanding of Canva, Adobe Creative Cloud apps including Premiere Pro, Photoshop, Illustrator, Media Encoder and After Effects are preferred."
    ],
    "how_to_apply": "Interested candidates should send an email to Diverse.House@mail.house.gov with “Communications Manager” in the subject line and include a cover letter, resume, a writing sample, and digital portfolio.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "Diverse.House@mail.house.gov",
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2020-06-29",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others.\n\nThe ideal candidate will have 3-5 years of experience, ideally 2-3 on the Hill, as well as a solid grasp of House procedures and a deep understanding of relevant policy. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references.\nPlease send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2020-06-29",
    "description": "Qualified candidates should have a minimum of 2 years' experience managing a team, possess excellent oral and written communications skills, highly organized, meet deadlines, and manage multiple projects.\n\nA flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 2 years' experience managing a team",
      "Excellent oral and written communications skills",
      "Highly organized",
      "Ability to meet deadlines",
      "Ability to manage multiple projects",
      "Flexible schedule",
      "Ability to travel throughout the district"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to cademhouseoffice@gmail.com please include Senior Staff in the subject line.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]