[
  {
    "id": "MEM-353-23",
    "position_title": "Intern",
    "office": "Democratic Staff of the Committee on Science, Space, and Technology",
    "location": "Washington, DC",
    "posting_date": "2023-07-10",
    "description": "The Democratic Staff of the Committee on Science, Space, and Technology seeks full or part-time paid interns for Fall 2023. This position will include a combination of telework and in-office work as safety and logistics permit.",
    "responsibilities": [
      "Interns will work on substantive projects under the direction of Committee Staff while also serving a general administrative function.",
      "Interns will help staff prepare for hearings and markups, take notes on relevant committee activities, and work on research, oversight, and press-related projects.",
      "Interns will also perform administrative tasks such as answering phones, greeting visitors, and filing official documents."
    ],
    "qualifications": [
      "Candidate should be detail-oriented and possess strong oral and written communication skills.",
      "The position requires an ability to multitask and adapt to a fast-paced environment.",
      "A background and/or interest in subject areas within the committee's jurisdiction is strongly preferred."
    ],
    "how_to_apply": "Interested applicants should email a resume and cover letter to sstdeminterns@mail.house.gov. Applicants will be accepted on a rolling basis. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "sstdeminterns@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-352-23",
    "position_title": "Press Assistant",
    "office": "Rep. Ruben Gallego (AZ-03)",
    "location": "Phoenix, Arizona",
    "posting_date": "2023-07-10",
    "description": "The Office of Rep. Ruben Gallego (AZ-03) is seeking a talented and highly motivated bilingual (English/Spanish) press assistant with strong writing skills and a comfortability with social media drafting.\n\nQualified candidates will assist with ensuring the objectives and achievements of the Congressman are communicated effectively utilizing print, digital, and social media. This position is based in Phoenix, Arizona and will work closely with the Communications Director.\n\nOccasional weekend work is required. Candidates must have outstanding writing and communication skills and be willing to collaborate with various departments to accomplish objectives while juggling multiple deadlines and projects.",
    "responsibilities": [
      "Drafting press releases for distribution",
      "Writing talking points/speeches/scripts",
      "Creating social media content",
      "Staffing at media events",
      "Assisting with other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should email their resume and cover letter to ResumesAZ03@mail.house.gov",
    "salary_info": null,
    "contact": "ResumesAZ03@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-342-23",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Congresswoman Yvette D. Clarke (NY-09)",
    "location": "Washington, DC; Brooklyn, N.Y.",
    "posting_date": "2023-07-10",
    "description": "Congresswoman Yvette D. Clarke (NY-09) is seeking an exceptionally wellorganized Scheduler/Executive Assistant with strong oral and written communication and excellent interpersonal skills. Applicants must have the ability to multi-task, a positive attitude, and the ability to thrive in a fast-paced environment.\n\nThe ideal scheduler possesses a strong work ethic, excellent attention to detail, the ability to work well with different teams and the ability to keep calm under pressure.\n\nResponsibilities include working with the senior staff to manage and maintain the Member’s daily and long-term schedule; organizing and evaluating all meeting requests and invitations with senior staff; compiling and managing the Member’s daily materials; making travel arrangements; staffing and driving the Member, and other duties as assigned.",
    "responsibilities": [
      "to maintain the Member's official schedule, travel plans, and related records; and",
      "to act as liaison for the Member with the staff, public and other Members."
    ],
    "qualifications": [
      "at least 1 year of office experience;",
      "strong telephone skills;",
      "strong oral and written communication skills;",
      "ability to exercise discretion and independent judgment with respect to prioritization of and recommendations on Member appointments;",
      "proficiency in word processing;",
      "strong organizational and filing skills;",
      "thoroughness and careful attention to detail;",
      "experience making travel reservations and arrangements;",
      "ability to work cooperatively and courteously with others;",
      "temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "availability to work long hours and at night; and",
      "a great sense of humor."
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to ny09resume@mail.house.gov with “Scheduler/Executive Assistant” in the subject line. Applications will be accepted on a rolling basis.",
    "salary_info": null,
    "contact": "ny09resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-340-23",
    "position_title": "Staff Assistant",
    "office": "Congressman Jeff Jackson",
    "location": "Washington, DC",
    "posting_date": "2023-07-10",
    "description": "The Office of Congressman Jeff Jackson is interviewing candidates for a staff assistant role in Washington, DC.",
    "responsibilities": [],
    "qualifications": [
      "Interested applicants from North Carolina or with experience working with Democratic offices are welcome to apply"
    ],
    "how_to_apply": "email Laney.oshea@mail.house.gov for consideration.",
    "salary_info": null,
    "contact": "Laney.oshea@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-339-23",
    "position_title": "Press Secretary/Digital Manager",
    "office": "Congressman Mike Levin (D-CA)",
    "location": "Oceanside/Dana Point, CA or Washington, D.C.",
    "posting_date": "2023-07-10",
    "description": "Congressman Mike Levin (D-CA) is seeking a Press Secretary/Digital Manager to assist in executing a robust communications strategy and maintain his presence online and across all social media platforms.\n\nThe individual will work closely with the Communications Director on day-to-day operations of the Communications team.",
    "responsibilities": [
      "Drafting press materials",
      "Writing remarks",
      "Pitching stories",
      "Crafting and executing a social media strategy",
      "Creating and managing social media content",
      "Designing graphics and print materials",
      "Recording and editing video",
      "Writing email newsletters",
      "Writing daily clips emails"
    ],
    "qualifications": [
      "1-2 years of press related experience",
      "Strong writing skills",
      "Proficiency in graphic design",
      "Experience with both videography and photography",
      "Ability to work well with others, manage competing priorities, and turn around high-quality products under tight deadlines are a must",
      "Prior experience on Capitol Hill or with advocacy campaigns are a plus"
    ],
    "how_to_apply": "To apply, please send a resume, a cover letter, a writing sample, and 1-3 digital work samples to ca49.applications@mail.house.gov with “Press Secretary/Digital Manager” in the subject line. Applications will be accepted on a rolling basis.",
    "salary_info": "$60,000-$70,000, commensurate with experience.",
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-335-23",
    "position_title": "Legislative Assistant",
    "office": "Moderate Financial Services Committee member",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "Moderate Financial Services Committee member seeks legislative assistant to\nmanage work including:",
    "responsibilities": [
      "Financial Service Committee",
      "Issue areas including: economic policy, banking, taxation, trade, small business, and social security",
      "Drafting and editing legislation, amendments, resolutions, letters, and memos",
      "Building relationships with relevant stakeholders",
      "Working with the communications team to highlight the Congressman’s work"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a cover letter, resume, and three references with “FSC\nLegislative Assistant – LastName, FirstName” in the subject line\nto nj5jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "nj5jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis\nof race, color, religion, sex, national origin, age, disability, gender identity or\nexpression, or sexual orientation."
  },
  {
    "id": "MEM-332-23",
    "position_title": "Office Administrator/District Staff Assistant",
    "office": "Representative Spanberger",
    "location": "Prince William County, Virginia",
    "posting_date": "2023-07-10",
    "description": "Qualified applicants should be motivated self-starters, highly organized, detailoriented, able to multitask, have exceptional interpersonal skills, and eager to join\na mission-oriented team that thrives in a fast-paced environment.\nCandidates must demonstrate excellent \"people skills\" and a strong commitment\nto providing outstanding constituent service. The ideal candidate should: be able\nto think on their feet and be a problem solver, show keen attention to detail and\nan ability to multi-task, demonstrate excellent oral and written skills, maintain a\npositive demeanor, and demonstrate resilience in a busy environment.\nPrimary responsibilities include managing the front office, answering and logging\ntelephone calls, greeting visitors, monitoring office deliveries, distributing hard\nand electronic mail, creating briefs and memos, drafting constituent\ncorrespondence, and other administrative duties.\nThe staff assistant may also assist with constituent services and manage special\nprojects as needed.",
    "responsibilities": [
      "Managing the front office",
      "Answering and logging telephone calls",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Distributing hard and electronic mail",
      "Creating briefs and memos",
      "Drafting constituent correspondence",
      "Other administrative duties",
      "Assist with constituent services",
      "Manage special projects as needed"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Highly organized",
      "Detail-oriented",
      "Able to multitask",
      "Exceptional interpersonal skills",
      "Eager to join a mission-oriented team that thrives in a fast-paced environment",
      "Excellent “people skills”",
      "A strong commitment to providing outstanding constituent service",
      "Be able to think on their feet and be a problem solver",
      "Show keen attention to detail",
      "Ability to multi-task",
      "Demonstrate excellent oral and written skills",
      "Maintain a positive demeanor",
      "Demonstrate resilience in a busy environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and writing sample (3 pages or less) to spanberger.inquiries@mail.house.gov with “District Office Administrator” in the subject line.",
    "salary_info": "$50,000",
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-329-23",
    "position_title": "Legislative Director",
    "office": "Congressman Chris Pappas (NH-01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-07-10",
    "description": "Responsibilities include working to develop, coordinate, and oversee the Member’s legislative agenda; advising the Member on legislative activities; and leading and mentoring legislative staff while managing a substantial legislative portfolio of your own.\n\nQualified candidates will write well, have a strong understanding of the legislative process, possess excellent communication and organizational skills, and be very responsive to constituents and outside stakeholders. Must have 3+ years of Hill experience. The salary range for this position is $90,000 to $105,000 (depending on experience), plus benefits including student loan repayment program (if eligible).\n\nNew Hampshire or New England ties and experience working with the Transportation and Infrastructure Committee are considered plusses.",
    "responsibilities": [
      "working to develop, coordinate, and oversee the Member’s legislative agenda",
      "advising the Member on legislative activities",
      "leading and mentoring legislative staff while managing a substantial legislative portfolio of your own"
    ],
    "qualifications": [
      "write well",
      "have a strong understanding of the legislative process",
      "possess excellent communication and organizational skills",
      "be very responsive to constituents and outside stakeholders",
      "Must have 3+ years of Hill experience"
    ],
    "how_to_apply": "Please email nh01jobs@gmail.com with “Legislative Director – Last Name, First Name” as the subject line along with:\n1. a resume;\n2. cover letter;\n3. 2 short (1-2 page) writing samples; and\n4. three references (with name, title and organization, phone number and email).",
    "salary_info": "$90,000 to $105,000 (depending on experience), plus benefits including student loan repayment program (if eligible)",
    "contact": "nh01jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-328-23",
    "position_title": "Correspondence Manager",
    "office": "Congressman Frank J. Mrvan",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "The Office of Congressman Frank J. Mrvan seeks a Correspondence Manager to handle general mail program operations, issue-specific constituent communications, and legislative research.\n\nResponsibilities include, but are not limited to, drafting and editing constituent correspondence, tracking legislation, meeting with constituents and interest groups, briefing the Congressman, and generally ensuring a timely and accurate constituent mail program. Candidate must be highly dependable, detail-focused, value responsiveness to constituents, and have superior organizational and writing skills. Knowledge of the legislative process and Indiana ties a plus. Female and minority candidates are encouraged to apply.",
    "responsibilities": [
      "In a timely fashion, completes research, drafting, and editing responses to constituents letters on federal matters;",
      "Tracks legislation through the Committee, House floor, Senate and conference committee processes in designated issue areas, and briefs the Congressman;",
      "Collaborates with other members of the legislative and communication staff to edit and draft correspondence; acts as a liaison with constituents, interest groups, committee and agency staffs in designated issue areas;",
      "Ensures that inquiries and requests for assistance are directed to the appropriate staff member and responded to in a timely manner;",
      "Documents, organizes, and summarizes constituent opinions on issues communicated to the office;",
      "Prepares weekly correspondence drafts and summaries for review by the Member,",
      "Performs special projects as assigned by the Chief of Staff or Legislative Director."
    ],
    "qualifications": [
      "Superior oral and written communication skills;",
      "Excellent organizational and proofreading skills;",
      "Ability to work cooperatively and courteously with others;",
      "Knowledge of Internet Quorum and adhering consistency to a letter writing standard and guide is a plus."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and two writing samples to Kevin.Spicer@mail.house.gov with “Correspondence Manager” in the subject line.",
    "salary_info": null,
    "contact": "Kevin.Spicer@mail.house.gov",
    "equal_opportunity": "Female and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-326-23",
    "position_title": "Constituent Service Representative",
    "office": "Congressman David Trone (MD06)",
    "location": "Germantown, MD",
    "posting_date": "2023-07-10",
    "description": "Congressman David Trone (MD06) is seeking a high-energy, highly-organized, and detail-oriented Constituent Service Representative for his office in Germantown, MD.\n\nIdeal candidates will have 1-2 years of work experience in a relevant field. (public service, political campaigns, issue advocacy, community organizing, etc.)",
    "responsibilities": [
      "Staffer will primarily staff the District Office located in Germantown, MD. Occasional travel to other offices in the district as needed.",
      "Serve as the official representative for the Member in the community.",
      "Act as liaison with federal, state, and local government agencies, political officials, community leaders, and other community organizations to form effective relationships for the Member.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Monitor and update the Member and District Director on local issues of importance.",
      "Staff and provide logistical support for district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Answer correspondence and verbal communications with constituents in a timely manner.",
      "Office administrative duties as needed."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of the legislative process.",
      "Knowledge of all issues in the district in which the Member is involved.",
      "Maryland ties are a plus.",
      "Ability to speak Spanish is a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to MD06.jobs@gmail.com with “Constituent Service Representative - Germantown” in the subject line. No phone calls or walk-ins.",
    "salary_info": "Starting salary for this position will be between 50-55k plus full benefits depending on experience.",
    "contact": "MD06.jobs@gmail.com",
    "equal_opportunity": "The Office of Congressman David Trone strongly values the diversity of our employees and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-325-23",
    "position_title": "Professional Staff Member (PSM)",
    "office": "House Natural Resources Committee (HNRC), Subcommittee on Federal Lands",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "The Democratic staff of the House Natural Resources Committee (HNRC), Subcommittee on Federal Lands, seeks a Professional Staff Member (PSM) to play a lead role in planning, coordinating, and executing the legislative and oversight agenda of Ranking Member Grijalva and HNRC Democrats.\n\nThe ideal candidate is a creative thinker with a sophisticated understanding of the subcommittee’s jurisdiction, including but not limited to the National Park Service, the Bureau of Land Management, and the U.S Forest Service.\nThe PSM will work directly with the Staff Director of the Subcommittee on Federal Lands to assist Natural Resources Committee lawmakers and their staff to develop legislation on a broad range of issues, including public land management priorities, historic preservation, and conservation matters.",
    "responsibilities": [],
    "qualifications": [
      "Demonstrates a clear understanding of the policies, laws, and politics of U.S. public land management, with a particular emphasis on the U.S. Forest Service.",
      "Thorough understanding of the legislative process, House organization and procedure, and the overall jurisdiction of HNRC.",
      "The strongest candidate will be able to prepare briefing materials, questions, and statements for hearings, markups, and other committee business and to develop communications materials succinctly explaining the work of the subcommittee.",
      "Demonstrates an awareness of and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations.",
      "Understands how HNRC issues intersect with racism, economic and social inequality in the U.S. and has a passion for working to dismantle these systems."
    ],
    "how_to_apply": "Full job description and instructions on how to apply can be found on our website https://democrats-naturalresources.house.gov/contact/job-postings",
    "salary_info": "Salary is commensurate with experience, plus benefits.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-323-23",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2023-07-10",
    "description": "Senior Democratic Member of Congress seeks an\nenergetic, organized, creative, self-starter to join the District Office of her very\nactive and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues\nand problems with federal agencies, staying on top of everyday events in the\nMember's district, and keeping the community connected to the Member's work.\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems\nof constituents and handle multiple tasks and issues effectively while making sure\nagencies respond in a timely manner and assuring our office responds to\nconstituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the\nbox about various constituent issues and community events. Prior community or\ncasework experience is helpful. The ideal candidate will have significant\nexperience interacting with the public, excellent writing and communication\nskills and a working knowledge or strong interest in the District of Columbia and\nits local government. Candidate must possess a bachelor's degree and be, or be\nwilling to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member's district",
      "Keeping the community connected to the Member's work",
      "Helping with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Ability to work independently",
      "Ability to think outside the box about various constituent issues and community events",
      "Prior community or casework experience is helpful",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor's degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-321-23",
    "position_title": "Press/Digital Assistant",
    "office": "Congresswoman Abigail Spanberger (VA-07)",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "The ideal candidate is an excellent writer, works well in a team, has a keen attention to detail, and can meet tight deadlines under pressure. This position is responsible for drafting social media copy, creating graphics, producing videos highlighting the work of Rep. Spanberger for Virginia's Seventh District, editing photos and videos, drafting advisories, assisting with media monitoring, and overseeing clips collection and distribution. This position may require work outside standard office hours.",
    "responsibilities": [
      "Drafting social media copy",
      "Creating graphics",
      "Producing videos highlighting the work of Rep. Spanberger for Virginia's Seventh District",
      "Editing photos and videos",
      "Drafting advisories",
      "Assisting with media monitoring",
      "Overseeing clips collection and distribution"
    ],
    "qualifications": [
      "Excellent writer",
      "Works well in a team",
      "Keen attention to detail",
      "Can meet tight deadlines under pressure"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to spanbergerpressva07@gmail.com. We also recommend applicants submit 1-2 sample writing samples or sample graphics/videos.",
    "salary_info": null,
    "contact": "spanbergerpressva07@gmail.com",
    "equal_opportunity": "Rep. Spanberger's office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-319-23",
    "position_title": "Chief of Staff",
    "office": "Congresswoman Andrea Salinas (OR-06)",
    "location": "Washington, DC",
    "posting_date": "2023-07-10",
    "description": "The Chief of Staff will provide all necessary organization, supervisory leadership, and motivation to staff as they work towards the Member’s goals across the DC and district offices; approving strategies and tactics on legislative issues; keeping Member up to date on all important emerging and ongoing issues as it pertains to office and district; and oversee the administration of office goals, policies and procedures.",
    "responsibilities": [],
    "qualifications": [
      "Strong oral and written communication skills",
      "Thorough knowledge of the legislative process and of House organization and procedures",
      "Knowledge of local, state, and federal agencies and departments",
      "An understanding of all issues and events in the district in which the Member is involved",
      "Political acumen",
      "The ability to manage and lead a team"
    ],
    "how_to_apply": "Please email a cover letter, resume, and two writing samples to OR06resumes@mail.house.gov with subject line: Chief of Staff. This position will be open until filled.",
    "salary_info": null,
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and as such is committed to building and maintaining an inclusive and diverse work environment. All qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-313-23",
    "position_title": "Senior Legislative Assistant",
    "office": "Congressman Donald M. Payne, Jr.",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "The Office of Congressman Donald M. Payne, Jr. seeks a highly motivated, organized, and creative Senior Legislative Assistant to handle the Homeland Security Committee, judiciary, defense, science, and foreign affairs portfolios.\n\nResponsibilities include identifying and developing legislative initiatives, briefing and staffing the member for stakeholder meetings, managing the member's work on the House Committee on Homeland Security, and other responsibilities as needed.",
    "responsibilities": [
      "Identifying and developing legislative initiatives",
      "Briefing and staffing the member for stakeholder meetings",
      "Managing the member's work on the House Committee on Homeland Security",
      "Other responsibilities as needed"
    ],
    "qualifications": [
      "At least three years of policy experience",
      "Excellent written and oral communications skills",
      "An understanding of the legislative process",
      "A strong knowledge of issues related to the House Committee on Homeland Security"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples in a single PDF to resumes.nj10@gmail.com. Applications will be accepted on a rolling basis.",
    "salary_info": null,
    "contact": "resumes.nj10@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-310-23",
    "position_title": "Staff Director, Subcommittee on Disability Assistance and Memorial Affairs",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "Core Responsibilities:\nServe as the principal advisor to the full Committee Chairman, subcommittee Chairman, and Republican Members for issues under the jurisdiction of the Subcommittee.\nProvide in-depth policy analysis and political strategy for issues that fall under the jurisdiction of the Subcommittee.\nLead and supervise the implementation of the Subcommittee’s legislative initiatives including the formulation, drafting, introduction, passage, negotiation, and enactment of all legislation under the jurisdiction of the Subcommittee.\nSupervise the Subcommittee staff in the organization of, and preparation for, hearings, to include determination of the Republican agenda, briefing of witnesses and Members, and drafting remarks and questions for Chairman.\nConduct informational and oversight meetings with Administration officials, VA and other agencies, Veteran Service Organizations, non-profit organizations, industry experts, and veterans on all issues under the jurisdiction of the Subcommittee.\nPlan and supervise implementation of the Subcommittee’s oversight agenda of issues within its jurisdiction, including sending requests for information, writing oversight letters, conducting oversight visits, reviewing document productions, cultivating sources of information, determining the veracity of information received, and other oversight measures, as needed.\nBuild relationships with internal and external partners, including Veteran Service Organizations, member offices, industry, and contacts within the Department of Veterans Affairs and other government agencies to promote and enact the legislative and oversight agenda of the Subcommittee, and that of the full Committee Chairman.\nRepresent and discuss the full Committee or Subcommittee Chairman’s views at various conferences and speaking events.\nResponsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; as needed.",
    "responsibilities": [
      "Serve as the principal advisor to the full Committee Chairman, subcommittee Chairman, and Republican Members for issues under the jurisdiction of the Subcommittee.",
      "Provide in-depth policy analysis and political strategy for issues that fall under the jurisdiction of the Subcommittee.",
      "Lead and supervise the implementation of the Subcommittee’s legislative initiatives including the formulation, drafting, introduction, passage, negotiation, and enactment of all legislation under the jurisdiction of the Subcommittee.",
      "Supervise the Subcommittee staff in the organization of, and preparation for, hearings, to include determination of the Republican agenda, briefing of witnesses and Members, and drafting remarks and questions for Chairman.",
      "Conduct informational and oversight meetings with Administration officials, VA and other agencies, Veteran Service Organizations, non-profit organizations, industry experts, and veterans on all issues under the jurisdiction of the Subcommittee.",
      "Plan and supervise implementation of the Subcommittee’s oversight agenda of issues within its jurisdiction, including sending requests for information, writing oversight letters, conducting oversight visits, reviewing document productions, cultivating sources of information, determining the veracity of information received, and other oversight measures, as needed.",
      "Build relationships with internal and external partners, including Veteran Service Organizations, member offices, industry, and contacts within the Department of Veterans Affairs and other government agencies to promote and enact the legislative and oversight agenda of the Subcommittee, and that of the full Committee Chairman.",
      "Represent and discuss the full Committee or Subcommittee Chairman’s views at various conferences and speaking events.",
      "Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "At least five to seven years of relevant policy or legislative experience."
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references, and three writing samples to VAR.Resumes@mail.house.gov with “DAMA Staff Director” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-309-23",
    "position_title": "Senior Counsel",
    "office": "House Select Subcommittee on the Coronavirus Pandemic",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "Rep. Raul Ruiz, M.D., the Ranking Member of the House Select Subcommittee\non the Coronavirus Pandemic, is seeking a Senior Counsel to join the\nDemocratic staff of the Select Subcommittee.\n\nThe Select Subcommittee on the Coronavirus Pandemic is authorized to\ninvestigate a broad range of matters pertaining to the coronavirus pandemic under\nH. Res. 5. The Select Subcommittee was established within the Committee on\nOversight and Accountability, which is the primary investigative committee of\nthe United States House of Representatives, with jurisdiction to investigate “any\nmatter” at “any time” under House Rule X.",
    "responsibilities": [
      "Conducting depositions and transcribed interviews",
      "Drafting reports and memoranda",
      "Negotiating with counsel",
      "Preparing for congressional hearings"
    ],
    "qualifications": [
      "A minimum of four years of legal experience is required",
      "Prior experience in direct investigations or congressional oversight strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter as PDFs to SSCPJobs@mail.house.gov, with “Senior Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format:\n“LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No\nunsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "SSCPJobs@mail.house.gov",
    "equal_opportunity": "Women, LGBTQI+, and BIPOC candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-305-23",
    "position_title": "DPCC COMMUNICATIONS DIRECTOR",
    "office": "House Democratic Policy and Communications Committee",
    "location": "Capitol Hill",
    "posting_date": "2023-07-10",
    "description": "The House Democratic Policy and Communications Committee seeks an experienced Communications Director.\n\nThe Communications Director will work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats; create messaging guidance, event suggestions, sample releases, and other communications tools; help Democratic offices pitch stories, hold strong local press events, and position Members in the media; and assist in bolstering paid communications programs in Democratic offices.\n\nThe Communications Director is also expected to assist with the planning and execution of regular DPCC message meetings and policy dinners; support DPCC outreach initiatives; and assist with daily tasks and long-term planning. Spanish language fluency and experience with constituency media is strongly preferred.",
    "responsibilities": [
      "Work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats",
      "Create messaging guidance, event suggestions, sample releases, and other communications tools",
      "Help Democratic offices pitch stories, hold strong local press events, and position Members in the media",
      "Assist in bolstering paid communications programs in Democratic offices",
      "Assist with the planning and execution of regular DPCC message meetings and policy dinners",
      "Support DPCC outreach initiatives",
      "Assist with daily tasks and long-term planning"
    ],
    "qualifications": [
      "A strong background in communications on Capitol Hill is required.",
      "Spanish language fluency and experience with constituency media is strongly preferred."
    ],
    "how_to_apply": "To apply, please email jobs.DPCC@mail.house.gov with the following application materials attached as one combined PDF: 1. Cover letter; 2. Resume; 3. Two writing samples, with one coming from work on Capitol Hill; and 4. Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without contacting you first).",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-301-23",
    "position_title": "Deputy Chief of Staff of Operations",
    "office": "Rep. Josh Gottheimer",
    "location": "DC",
    "posting_date": "2023-07-10",
    "description": "Rep. Josh Gottheimer seeks qualified candidates for the position of Deputy Chief of Staff of Operations in his DC office.",
    "responsibilities": [
      "Ability to perform each of the essential job functions set forth below.",
      "Serving as a member of the Congressman’s senior staff.",
      "Supervising the Scheduler and Staff Assistants including providing feedback and conducting performance reviews.",
      "Knowledge of and adherence to office policies, procedures, and practices",
      "Managing the scheduling and operations process end to end with minimal direct involvement from the Chief of Staff and other senior staff including:",
      "Working with a variety of stakeholders to balance the Member’s time between commitments.",
      "Working with the Scheduler to evaluate and schedule incoming requests and invitations in DC and the District.",
      "Working with the operations team to ensure that briefing materials are provided for each event and meeting and ensuring that staff have appropriate advance notice of needs.",
      "Ensuring office policies are followed.",
      "Ensuring office supplies and routine office purchases are kept up to date.",
      "Ensuring travel arrangements are properly coordinated.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "A Bachelor’s degree or related job experience",
      "3-5 years of operations experience in a Congressional office, on a political campaign, or in another fast-paced administrative environment.",
      "At least one year of management experience.",
      "Excellent attention to detail and strong organizational skills.",
      "Sound judgment.",
      "Strong communication skills.",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner.",
      "Willingness to accept direction and guidance on performance and process improvements from the Chief of Staff and Member.",
      "The ability to anticipate challenges and proactively offer solutions.",
      "The ability to thrive in a fast-paced environment.",
      "The ability to work flexible hours including long hours, nights, and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Deputy Chief of Staff of Operations - Last Name” as the subject line to NJ5Jobs@mail.house.gov",
    "salary_info": "$80,000 $100,000, commensurate with experience.",
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "Notice: This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law.\nApplicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-300-23",
    "position_title": "Legislative Director",
    "office": "Congressman Steven Horsford (NV-O4)",
    "location": "Capitol Hill",
    "posting_date": "2023-07-10",
    "description": "Congressman Steven Horsford (NV-O4) seeks a highly motivated, hard-working, skilled and experienced Legislative Director to help shape and manage a robust legislative portfolio.\n\nCongressman Horsford is a member of the Armed Services and Financial Services Committees, Chair of the Congressional Black Caucus, and an active frontline member. Previous legislative experience on Capitol Hill is required, and Nevada ties are a plus. Ideal candidates will have experience managing and mentoring staff, thinking strategically and will possess a sophisticated understanding of the legislative process, along with excellent writing, organizational and time management skills. The ideal candidate will primarily be responsible for managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues.\n\nCandidates should be creative, proactive and self-motivated, and have an ability to operate effectively under pressure and work closely in a team atmosphere in this fast-moving, dynamic office.",
    "responsibilities": [
      "Managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues."
    ],
    "qualifications": [
      "Previous legislative experience on Capitol Hill is required.",
      "Nevada ties are a plus.",
      "Experience managing and mentoring staff.",
      "Ability to think strategically.",
      "Sophisticated understanding of the legislative process.",
      "Excellent writing skills.",
      "Excellent organizational skills.",
      "Excellent time management skills.",
      "Creative.",
      "Proactive.",
      "Self-motivated.",
      "Ability to operate effectively under pressure.",
      "Ability to work closely in a team atmosphere."
    ],
    "how_to_apply": "Interested candidates must include a cover letter, resume, two page max writing sample and three professional references in a single PDF file.\nEmail submissions to the Director of Administration, Selena Harvey at nv04resumes@mail.house.gov. Subject line must read",
    "salary_info": "Salary is competitive and commensurate with experience, along with generous benefits and professional development opportunities.",
    "contact": "Selena Harvey at nv04resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color and LGBTQAI+ candidates are strongly encouraged to apply, as are candidates with Nevada ties."
  },
  {
    "id": "MEM-NV04-23",
    "position_title": "Legislative Director",
    "office": "Office of Congressman Steven Horsford",
    "location": "Washington, DC",
    "posting_date": "2023-07-10",
    "description": "Congressman Steven Horsford (NV-04) is seeking a Legislative Director to manage the legislative team and the Congressman's legislative portfolio. Responsibilities include, but are not limited to:",
    "responsibilities": [
      "Managing a legislative team of legislative assistants and legislative correspondents.",
      "Overseeing the Congressman's legislative portfolio, including setting the legislative agenda and advising the Congressman on policy issues.",
      "Working with the Congressman, Chief of Staff, and Communications Director to develop and implement a legislative strategy.",
      "Tracking legislation moving through the House and Senate.",
      "Briefing the Congressman on legislation and policy issues.",
      "Representing the Congressman at meetings with constituents, stakeholders, and other members of Congress.",
      "Maintaining relationships with House and Senate staff, committee staff, and outside groups."
    ],
    "qualifications": [
      "Extensive knowledge of the legislative process.",
      "Experience managing a legislative team.",
      "Strong understanding of policy issues.",
      "Excellent communication and interpersonal skills.",
      "Ability to work independently and as part of a team."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter, and three references to NV04.resume@mail.house.gov with the subject line \"MEM-NV04-LD-23_last name\". No calls please. Individuals selected for an interview will be contacted.",
    "salary_info": null,
    "contact": "NV04.resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-284-23",
    "position_title": "Investigator, U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "office": "U.S. House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "Core Responsibilities:\nUnder the guidance of the Subcommittee Staff Director, conduct investigations into the Department of Veterans Affairs.\nConduct oversight of Subcommittee issue areas, including Department implementation of laws, regulations, and programs.\nDevelop investigative strategies and implementing investigative plans\nReview evidence and data to analyze, develop, and provide detailed written and oral reports of findings\nInterview witnesses and subjects\nAssist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives\nDraft hearing, markup, and floor statements for the Full Committee leadership and Subcommittee leadership\nAssist in determining Full Committee and Subcommittee hearing topics and prepare for hearings\nMeet with congressional staff and internal/external organizations on behalf of the Committee\nPerform other duties as assigned by the Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director",
    "responsibilities": [
      "Under the guidance of the Subcommittee Staff Director, conduct investigations into the Department of Veterans Affairs.",
      "Conduct oversight of Subcommittee issue areas, including Department implementation of laws, regulations, and programs.",
      "Develop investigative strategies and implementing investigative plans",
      "Review evidence and data to analyze, develop, and provide detailed written and oral reports of findings",
      "Interview witnesses and subjects",
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Draft hearing, markup, and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings",
      "Meet with congressional staff and internal/external organizations on behalf of the Committee",
      "Perform other duties as assigned by the Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "Undergraduate degree required",
      "At least three years of relevant work experience, including experience leading or working on investigations",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and careful attention to detail",
      "Demonstrate ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions",
      "Knowledge of current issues and events in which the Full Committee leadership is involved",
      "Ability to work long hours, under pressure, and be cooperative and courteous with others",
      "Domestic travel will be required (up to 40% of the time), with the possibility of international travel.",
      "Work independently or as part of an investigative team"
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume to james.whittaker@mail.house.gov “O&I Investigator” in the subject line.",
    "salary_info": null,
    "contact": "james.whittaker@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-276-23",
    "position_title": "Research Assistant, Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs, Majority Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-07-10",
    "description": "CORE RESPONSIBILITIES:\nProvides administrative, legislative, and research support to Subcommittee staff, and assists with duties as assigned.",
    "responsibilities": [
      "Answering the telephone and responding to caller inquiries",
      "Reviewing incoming mail and preparation of correspondence",
      "Maintaining Subcommittee archive, activities report, and relevant publications",
      "Assisting with full Committee hearings on matters within Subcommittee jurisdiction",
      "Maintaining the Subcommittee’s outstanding deliverable requests made to the Department of Veterans Affairs (VA)",
      "Determining and tracking the status of pending legislation",
      "Reviewing the Congressional Record, Federal Register, House Calendar, and other publications for matters of interest to subcommittee Members and staff",
      "Participating in staff-level negotiations, to include knowledge of background information on legislation being considered",
      "Assisting Subcommittee staff in organization of, and preparation for, hearings, to include determination of Majority agenda, briefing of Members, and development of questions",
      "Conducting meetings with VA, veteran service organizations or other scheduled parties",
      "Drafting remarks for Chairman and suggested questions for hearings",
      "Preparation of memorandums for the full Committee and Subcommittee Chairman on matters under the jurisdiction of the Subcommittee",
      "Research preparation of hearings by reviewing previous hearing transcripts, relevant statutes, and VA policy",
      "Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; and assist other Committee staff, as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "Work, internship, or other experience in a professional environment"
    ],
    "how_to_apply": "Qualified candidates please send their cover letter, resume, and three writing samples to the following e-mail address: VAR.Resumes@mail.house.gov with “DAMA Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-272-23",
    "position_title": "Digital Outreach Aide",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-07-10",
    "description": "Congressman Glenn Ivey (MD-04) seeks a creative, driven, and graphically minded communications professional who is enthusiastic to help grow the Congressman’s social-media presence and online outreach working out of the Washington, D.C., office.\n\nThe ideal candidate is a self-starter with an aesthetic eye and technical skill with video recording and editing, photography, iconography, branding, and developing a new-media strategy. We are seeking a strong writer, particularly one adept at crafting punchy, eye-catching soundbites and witticisms that tend to draw online attention, as well as the traditional, long-form exposition that together constitute a robust communications operation. Successful candidates can use Canva and Adobe Creative Suite programs to create high-quality, professional-looking products.",
    "responsibilities": [
      "Developing all digital content, including copy, graphics, and videos",
      "Managing and creating content for social-media platforms",
      "Tracking digital-outreach analytics",
      "Overseeing the franked communications program, including spots online, over the phone, over text, on the radio, and in print",
      "Designing and drafting a recurrent e-newsletter",
      "Building out and updating the Web site",
      "Assisting the Communications Director with media requests and press obligations, as needed"
    ],
    "qualifications": [],
    "how_to_apply": "Please submit a cover letter; a resume, including two-to-three references; and a digital sample (either a graphic or video clip you generated and edited – or preferably both – previously or in response to this job opening) to md04resumes@gmail.com with the subject line: “Full Name – Digital Outreach Aide.” We will accept applications until the position is filled.",
    "salary_info": "Title – from press assistant to digital manager or director – and pay will be commensurate with work experience. Candidates at all levels of experience are encouraged to apply so long as they possess the skills, talent, and knowledge needed to execute the job well.",
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an equal-opportunity employer that does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-267-23",
    "position_title": "Legislative Director",
    "office": "Congresswoman Andrea Salinas (OR-06)",
    "location": "Washington, DC",
    "posting_date": "2023-07-10",
    "description": "Congresswoman Andrea Salinas (OR-06) seeks a Legislative Director based in her Washington, DC office. She is a freshman member in a battleground district who serves on the House Agriculture Committee, the House Science, Space, and Technology Committee, and the Congressional Executive Commission on China. She also serves in leadership for the Congressional Hispanic Caucus and the Democratic Women’s Caucus and is a member of the New Democrat Coalition and the Congressional Progressive Caucus.\n\nThe Legislative Director oversees the development of policy positions and legislative initiatives and supervises the office's legislative staff. This position also meets with constituents and stakeholders on behalf of the Member and serves as the primary contact for legislative issues with caucuses and committees. The Legislative Director will advise the Member on all legislative areas.",
    "responsibilities": [
      "Managing a legislative portfolio",
      "Monitoring legislative activity on the House floor and overseeing long-term and short-term legislative planning for the Member",
      "Supervising the mail program and working closely with the Legislative Correspondent and legislative team to build a letter library and facilitate constituent correspondence",
      "Managing the progression of bills with which the Member is involved as they move from Committee to the floor",
      "Recommending strategies and tactics on bills and positions and overseeing the Community Project Funding process"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Thorough knowledge of the legislative process and of House organization and procedures",
      "Knowledge of local, state, and federal agencies and departments",
      "An understanding of all issues and events in the district in which the Member is involved",
      "Political acumen",
      "The ability to manage and lead a team",
      "Previous Hill experience is required",
      "Candidates with health care and/or agricultural policy and knowledge of or ties to Oregon is a plus"
    ],
    "how_to_apply": "Please email a cover letter, resume, and two writing samples to OR06resumes@mail.house.gov with subject line: Legislative Director. This position will be open until filled.",
    "salary_info": "$100,000 to $110,000 + benefits",
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and as such is committed to building and maintaining an inclusive and diverse work environment. All qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-259-23",
    "position_title": "Communications Assistant",
    "office": "The office of a conservative, mid-western Member of Congress",
    "location": "DC",
    "posting_date": "2023-07-10",
    "description": "The office of a conservative, mid-western Member of Congress seeks a Communications Assistant to work in the DC office and help develop and execute an effective communications strategy.\n\nThis position is for someone early in their career with one to four years of experience working in a professional setting with at least some exposure to communications-related work.\n\nApplicants must complete a writing sample as part of the interview process.",
    "responsibilities": [
      "compiling and distributing daily press clips",
      "producing content for social media and the official website",
      "writing speeches, opinion editorials, talking points, press releases, and similar content",
      "preparing the Member for media opportunities and public appearances",
      "photographing events, hearings, and other public functions",
      "research to support communications activities",
      "monitoring national, state, and local news for stories relevant for the office",
      "assisting with all other communications-related tasks that are necessary to execute a communications strategy."
    ],
    "qualifications": [
      "innovative, confident, and detail-oriented",
      "a strong and effective verbal and written communicator",
      "capable of consistently producing high-quality work product",
      "able to effectively communicate with a variety of audiences using social media and other platforms",
      "willing to work long hours, including some time on weekends, and under tight deadlines",
      "able to react to unanticipated circumstances requiring fast and effective response",
      "interested in political and government topics and news from a variety of sources",
      "committed to contributing to a team dynamic based on respect, collaboration, and transparency."
    ],
    "how_to_apply": "Interested applicants should email CommsApplicants@gmail.com with:\n\na cover letter,\nresume,\nat least three professional references, and\nany relevant work samples (e.g. - writing, video, creative)",
    "salary_info": null,
    "contact": "CommsApplicants@gmail.com",
    "equal_opportunity": null
  }
]