[
  {
    "id": "MEM-261-22",
    "position_title": "Scheduler",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": "Washington, DC",
    "posting_date": "2022-05-16",
    "description": "Congressman Mark Pocan (WI-02), member of both the House Appropriations and Education & Labor Committees, is seeking a highly motivated, detail-orientated, and energetic individual with excellent oral and written communications skills for a scheduler position in the Washington, DC office.\n\nDaily tasks include managing and maintaining the Member’s daily and long-term DC, state and national schedule; coordinating travel, booking flight reservations, and managing logistics for events; evaluating and organizing all incoming meeting and event requests; communicating key information regarding the Member and the Member’s schedule to staff; and working closely with both DC and District staff to ensure smooth daily office operations. Candidates must be available to assist the member outside of regular business hours.\n\nThis position requires candidates with proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member, Chief of Staff and District Director. Experience drafting correspondence letters welcomed. Excellent writing, verbal and strong organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. A sense of humor is greatly appreciated.\n\nPrevious Capitol Hill or scheduling experience is required; this is not an entry level position and title could also include “Office Manager” if candidate has previous experience in that area.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long-term DC, state and national schedule",
      "Coordinating travel, booking flight reservations, and managing logistics for events",
      "Evaluating and organizing all incoming meeting and event requests",
      "Communicating key information regarding the Member and the Member’s schedule to staff",
      "Working closely with both DC and District staff to ensure smooth daily office operations",
      "Assist the member outside of regular business hours"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member, Chief of Staff and District Director",
      "Experience drafting correspondence letters welcomed",
      "Excellent writing, verbal and strong organizational skills are essential",
      "Ability to be a self-starter while working in a fast paced environment",
      "Previous Capitol Hill or scheduling experience is required"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and one writing sample to WI02JobOpening@gmail.com with “Scheduler” in the Subject Line. Job opening closes at the end of business on Friday, May 27th. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-260-22",
    "position_title": "Digital Director/Press Assistant",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-16",
    "description": "Congressman Andy Kim (NJ-03), a member of the House Armed Services Committee, House Foreign Affairs Committee, and House Small Business Committee seeks a hard-working Digital Director/Press Assistant to serve in his Washington, D.C. office.\n\nPrevious political communications and/or Capitol Hill experience is required. Ideal candidates will be team-oriented, self-motivated, empathetic, and collaborative. Successful applicants will write well and quickly in a fast-paced environment, understand how to take and edit photos and videos effectively, be creative with a keen sense of visual and graphic design, demonstrate particular attention-to-detail, and be capable of building and executing a plan. This staff position reports to the Communications Director and works closely with the entire senior staff team. This is not an entry level position.",
    "responsibilities": [
      "Work closely with the legislative, outreach, casework, and grants teams to draft copy, edit, and manage the office’s social media accounts",
      "Manage the office’s franked digital communications program",
      "Create weekly social media plans and monthly social media reports",
      "Create graphics for outgoing social media, newsletters, and mail that effectively communicates an idea or policy clearly and with visual appeal",
      "Take and edit photos and videos of the Congressman in Washington D.C. and the district, coordinate with all staff to manage the photo and video library",
      "Draft copy for widely read e-newsletters",
      "Assist with press releases, media advisories, franked mailings, op-eds, and other responsibilities as assigned",
      "Monitors social media, media reports, and has an eye for legislative matters and hot topics about which the Congressman may be asked or interested in"
    ],
    "qualifications": [
      "1+ years of political/Capitol Hill communications experience",
      "2+ years of digital communications experience",
      "Candidates with ties to New Jersey are strongly encouraged to apply"
    ],
    "how_to_apply": "TO APPLY: Email cover letter, resume, two writing samples, two graphic design samples, and 2-3 references to NJ03resumes@mail.house.gov with the subject line “Digital Director/Press Assistant: [NAME].” Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-259-22",
    "position_title": "Scheduler",
    "office": "Congressman Tom McClintock (CA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-16",
    "description": "The Scheduler will be expected to work closely with the Chief of Staff to coordinate the Member’s DC schedule, arrange travel plans, and manage day to day logistics. Additionally, this role will oversee the office’s intern program.",
    "responsibilities": [
      "Works with the Member, Chief of Staff, and District Director to determine and finalize the Member’s daily and long-term schedule.",
      "Manage all incoming meeting requests and invitations.",
      "Coordinates all travel arrangements.",
      "Process/schedule all incoming tour requests.",
      "Manage the office’s internship program."
    ],
    "qualifications": [
      "Able to coordinate and manage several scheduling activities with multiple parties",
      "Able to manage varying priorities and adapt to rapidly changing situations impacting the schedule",
      "Experience handling sensitive information and maintaining confidentiality",
      "Adaptable and organized with a keen attention to detail",
      "Strong decision-making skills and comfortable navigating challenging situations",
      "Works well under pressure"
    ],
    "how_to_apply": "Interested candidates should send resumes and cover letters to gopwesternjobs1776@gmail.com.",
    "salary_info": null,
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-258-22",
    "position_title": "Staff Assistant",
    "office": "OFFICE OF REPRESENTATIVE MIKE LEVIN",
    "location": "Oceanside, CA",
    "posting_date": "2022-05-16",
    "description": "This position is responsible for managing the front desk and all administrative duties of the Oceanside office. The staff member in this role interacts regularly with constituents and responds to correspondence and verbal communications with constituents. This staff member is located primarily in the Oceanside office but may be required to travel on occasion to the Dana Point office.",
    "responsibilities": [
      "Manages the front desk",
      "Collaborates with Dana Point and Washington, D.C. Staff Assistants to log all incoming mail and correspondence",
      "Tracks office supplies",
      "Assists with recruiting, interviewing, training, and management of Oceanside interns",
      "Oversees production and tracking of certificates and proclamations",
      "Manages the Congressional App Challenge program and other projects, as assigned",
      "Screens phone calls and refers cases, when appropriate, to other district office",
      "Sorts incoming mail",
      "Scans and sends invoices to DC office",
      "Logs all incoming and outgoing mail and incoming telephone calls relating to casework in IQ",
      "Maintains records of incoming grants, constituent recognition and thank you letters",
      "Prepares material for the Weekly Report",
      "Meets attendance requirements as established by the office",
      "Maintains a good working relationship with the Congressman, staff, and constituents",
      "Performs other duties as assigned",
      "Takes initiative to identify needs and takes action to complete tasks required",
      "Knowledge of office policies, practices, and procedures"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Familiarity with local, state, and federal agencies and departments",
      "Familiarity with all issues and events in the district in which the Congressman is involved",
      "Proficiency with word processing and spreadsheets",
      "Professional telephone manner",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Ability to perform the essential job functions above",
      "Ability to work cooperatively and courteously with others",
      "Thoroughness and careful attention to detail"
    ],
    "how_to_apply": "Please send resume, cover letter, and three professional references to:",
    "salary_info": null,
    "contact": "CA49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-257-22",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Congressman Jamaal Bowman (NY-16)",
    "location": "Washington, DC",
    "posting_date": "2022-05-16",
    "description": "We are seeking a highly motivated and hardworking Staff Assistant/Legislative Correspondent based in our Washington, DC office. This candidate will be responsible for managing the DC front office, answer phones and track calls, process flag and tour requests, oversee the internship program, and manage our high-volume mail program.\n\nThis individual will work closely with the legislative team to ensure constituent letters are completed in a timely manner and handle the Congressman's correspondence. This individual will also share driving responsibilities with the Director of Operations and Chief of Staff.",
    "responsibilities": [
      "Managing the DC front office",
      "Answer phones and track calls",
      "Process flag and tour requests",
      "Oversee the internship program",
      "Manage our high-volume mail program",
      "Work closely with the legislative team to ensure constituent letters are completed in a timely manner",
      "Handle the Congressman's correspondence",
      "Share driving responsibilities with the Director of Operations and Chief of Staff"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Keen attention to detail",
      "Excellent writing skills",
      "Knowledge of the legislative process",
      "Ability to work in a fast-paced environment while managing multiple tasks",
      "Be a self-starter able to problem-solve",
      "Must have access to a car and drive",
      "Familiarity with Westchester County/ The Bronx preferred"
    ],
    "how_to_apply": "Interested candidates should apply using the airtable form and upload a resume & cover letter.",
    "salary_info": "$55,000",
    "contact": "Bowman.Jobs@mail.house.gov with the subject line “Staff Assistant/ Legislative Correspondent”",
    "equal_opportunity": "Our office is an equal opportunity employer and women, people of color, members of the LGBTQ+ community, and members of other traditionally underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-256-22",
    "position_title": "Legislative Correspondent/Legislative Aide",
    "office": "OFFICE OF CONGRESSMAN SETH MOULTON",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "Congressman Seth Moulton (MA-06) is seeking a legislative staffer to handle both the mail program and a policy portfolio including agriculture, food security, animal welfare, modernization, and other issues as determined by the office’s needs and in consultation with the applicant’s interests. This office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply.",
    "responsibilities": [
      "Managing the mail program, responding to thousands of pieces of constituent per week",
      "Presenting data-driven biweekly reports on the state of the mail program",
      "Drafting new letters in the Member’s voice which reflect his policy positions on emergent topics of interest to our constituents",
      "Assisting the legislative staff in developing vote recommendations for bills up for a vote on the House floor",
      "Finding new legislation for the Member to cosponsor and which aligns with his values and views",
      "Drafting letters and original pieces of legislation",
      "Meeting with constituents and various groups, representing the Member’s views and communicating his priorities",
      "Helping, in conjunction with the staff assistant, to manage the interns, providing both real-time feedback on their work and mentorship"
    ],
    "qualifications": [
      "At least 1 year of Hill experience",
      "Strong writing capabilities, including the ability to quickly adopt the Member’s voice",
      "Ability to accurately represent the Member’s views in meetings with various groups",
      "Preferred: Strong mastery of the Google Suite, especially Google Sheets and Forms",
      "Preferred: Massachusetts ties"
    ],
    "how_to_apply": "Please provide a resume and cover letter to ma06.resumes@mail.house.gov, with the subject line “LC/LA” by Tuesday, May 24, 2022 at 11:59pm.",
    "salary_info": null,
    "contact": "ma06.resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-255-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Doris Matsui (D-CA-06)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-16",
    "description": "This position will handle the Congresswoman’s Energy and Commerce Energy Subcommittee work and her role as co-chair of the House Sustainable Energy and Environment Coalition (SEEC) and co-chair of the SEEC Nature and Oceans Task Force. The portfolio will be focused on natural climate solutions, clean energy, clean transportation, environmental justice, and energy equity policy; it will also likely include women’s issues, immigration work, and potentially a few other issues.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience is strongly preferred, but not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and references in a single PDF to seniordemresumes@gmail.com. Please use “Energy/Enviro LA” as the subject.",
    "salary_info": null,
    "contact": "seniordemresumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Veterans, women, LGBTQ+ persons, and minority applicants are strongly encouraged to apply."
  },
  {
    "id": "MEM-254-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Doris Matsui (D-CA-06)",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "Congresswoman Doris Matsui (D-CA-06) seeks a Legislative Assistant to focus\non a portfolio that may include appropriations, housing, education, civil rights,\nfinancial services, foreign affairs, and AmeriCorps among other issues.\n\nResponsibilities will include managing the Member’s existing legislative\ninitiatives within the portfolio; identifying and developing new areas for\nlegislative and other action; briefing and staffing the Member for meetings and\nevents; and other responsibilities as necessary.\n\nThis is not an entry-level position. Excellent writing and communication skills,\nsound political and policy judgment, and the ability both to work independently\nand to collaborate with others in a fast-paced environment is essential.",
    "responsibilities": [
      "Managing the Member’s existing legislative initiatives within the portfolio",
      "Identifying and developing new areas for legislative and other action",
      "Briefing and staffing the Member for meetings and events",
      "Other responsibilities as necessary"
    ],
    "qualifications": [
      "Not an entry-level position",
      "Excellent writing and communication skills",
      "Sound political and policy judgment",
      "The ability both to work independently and to collaborate with others in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and references in a single PDF\nto seniordemresumes@gmail.com. Please use “Appropriations/Housing LA” as\nthe subject.",
    "salary_info": null,
    "contact": "seniordemresumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. Veterans, women, LGBTQ+ persons, and minority applicants are\nstrongly encouraged to apply."
  },
  {
    "id": "MEM-253-22",
    "position_title": "District Office Staff Assistant",
    "office": "Representative Casten's Office",
    "location": "District Office",
    "posting_date": "2022-05-16",
    "description": "The District Office Staff Assistant shall be responsible for managing the district office administrative functions. They shall manage incoming constituent communications, organize, and maintain correspondence and outreach material and handle all Congressional greeting requests. The Staff Assistant shall report directly to the District Director.",
    "responsibilities": [
      "Answers and logs incoming phone calls, conducts casework intake, and greets office visitors",
      "Manages and tracks all incoming and outgoing mail to include timely submission of monthly reports",
      "Manages district written outreach efforts by drafting and preparing certificates and letters",
      "Identifies event and correspondence opportunities",
      "Maintains organized filing system of newsletters, brochures, and reports",
      "Manages office supply requisitions and inventory lists",
      "Staffs the Congressman and serves as staff representative for the Congressman at meetings and events.",
      "Supervises the District Office intern program to include recruitment, training, and management",
      "Assists with planning, organizing, and executing district outreach efforts.",
      "Plans, organizes, and leads execution of the Congressional Art Competition."
    ],
    "qualifications": [
      "Bachelor's degree (B.A.) in Political Science, Public Relations, Communications, or relevant studies preferred but not required.",
      "Strong oral and written communication skills",
      "Highly organized with strict attention to detail",
      "Congressional Office or similar experience preferred but not required",
      "Microsoft Office Suite, Outlook, or similar experience preferred"
    ],
    "how_to_apply": "To apply please submit a cover letter, resume, and a short statement of no more than 300 words about why you're a good fit for this role to Constituent.ServicesIL06@mail.house.gov. Subject Line: District Staff Assistant",
    "salary_info": null,
    "contact": "Constituent.ServicesIL06@mail.house.gov",
    "equal_opportunity": "Representative Casten's Office is an affirmative action/equal opportunity employer dedicated to building a community of excellence, equity, and diversity. It welcomes applications from women, underrepresented minorities, individuals with disabilities, protected veterans, sexual minority groups and other candidates who will lead and contribute to the diversification and enrichment of ideas and perspectives."
  },
  {
    "id": "MEM-251-22",
    "position_title": "Press Assistant or Press Secretary",
    "office": "Rep. Ritchie Torres (NY-15)",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "Rep. Ritchie Torres (NY-15) is seeking an organized and creative communications staffer to join a fast-paced team.\n\nDuties will include assisting the Communications Director in developing and implementing a communications and digital media strategy, working closely with the District team to amplify local events, media monitoring, maintenance of the Member’s social media accounts, drafting and posting content for social media, producing graphics and videos, editing photos and videos, compiling daily press clips, and assisting with the drafting of press releases and media advisories, e-newsletters, franked mailings, op-eds, and other responsibilities as assigned.",
    "responsibilities": [
      "Assist with management of social media platforms and developing a creative digital strategy",
      "Design graphics and producing videos for social media",
      "Generate ideas for press, mass mailings, and newsletters",
      "Draft press releases, advisories, talking points, and brief remarks",
      "Assist with communications outreach to district stakeholders and Member offices",
      "Oversee press intern(s)"
    ],
    "qualifications": [
      "graphic design experience",
      "a knowledge of video editing software",
      "strong writing skills",
      "a familiarity with social media management",
      "attention to detail",
      "strong written and oral communication skills",
      "ability to work collaboratively in a fast-paced, team environment",
      "New York ties and Spanish-language skills are strongly preferred"
    ],
    "how_to_apply": "Please send a resume, cover letter, and two writing and one digital sample to: reptorresjobs@gmail.com “Communications Staffer” in the subject line.",
    "salary_info": "Title is commensurate with level of experience.",
    "contact": "reptorresjobs@gmail.com",
    "equal_opportunity": "Equal Employment Opportunity Employer."
  },
  {
    "id": "MEM-246-22",
    "position_title": "Press Secretary/Digital Manager",
    "office": "Congressional LGBTQ+ Equality Caucus",
    "location": "Washington, DC",
    "posting_date": "2022-05-16",
    "description": "The Congressional LGBTQ+ Equality Caucus seeks a hardworking, organized, and detail-oriented Press Secretary/Digital Manager.\nThe Congressional LGBTQ+ Equality Caucus, which is Chaired by Rep. David Cicilline (RI-01), works to promote equality for all, regardless of sexual orientation or gender identity, and is committed to achieving the full enjoyment of human rights for LGBTQ+ people in the U.S. and around the world. The Equality Caucus serves as a resource to Members of Congress, their staff, and the public on LGBTQ+ issues at the federal level.\nIdeal candidates will be excellent writers, detail-oriented, organized, self-starters, team players, and able to produce high quality work in a fast-paced environment under tight deadlines.\nIdeal candidates will also have experience working with the press and creating social media content, including graphics. Experience on Capitol Hill or working on LGBTQ+ issues is a plus but not required. This is not an entry-level position. Candidates should have 2-3 years of communications experience. Salary is commensurate with experience.",
    "responsibilities": [
      "Developing communication plans, in coordination with the Executive Director, to increase the Caucus’ reach in the news and on digital platforms and to highlight the work of Caucus members;",
      "Managing the Caucus’ website and social media channels, including updating the website, drafting Facebook posts, tweets, and Instagram posts, and creating graphics and videos;",
      "Creating communication resources for Caucus Member offices, including social media toolkits, messaging guidance, and talking points;",
      "Drafting press releases, communicating with the press, and organizing press conferences;",
      "Drafting the Caucus’ weekly newsletter;",
      "Building and maintaining relationships with Caucus Members’ communications staff;",
      "Assisting the Executive Director, as needed, with coordinating events and briefs, membership outreach, tracking LGBTQ+ legislation, and policy work; and",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Excellent writers",
      "Detail-oriented",
      "Organized",
      "Self-starters",
      "Team players",
      "Able to produce high quality work in a fast-paced environment under tight deadlines",
      "Experience working with the press",
      "Experience creating social media content, including graphics",
      "2-3 years of communications experience",
      "Experience on Capitol Hill or working on LGBTQ+ issues is a plus but not required"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and a short writing sample, as a single PDF, to equality.caucushire@mail.house.gov. Please put “Press Secretary/Digital Manager – [Your First and Last Name]” in the subject line.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "equality.caucushire@mail.house.gov",
    "equal_opportunity": "The LGBTQ+ Equality Caucus is an Equal Opportunity Employer. The caucus benefits from a staff that reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The caucus does not discriminate on the basis of race, color, religion, sex (including marital or parental status), sexual orientation, gender identity and expression, disability, age, or national origin."
  },
  {
    "id": "MEM-245-22",
    "position_title": "Caseworker",
    "office": "Congressman Ted Lieu",
    "location": "Los Angeles District Office",
    "posting_date": "2022-05-16",
    "description": "Congressman Ted Lieu has an immediate opening for a Caseworker in his Los\nAngeles District Office. Primary responsibilities include assisting constituents\nwith federal casework, assisting the Casework Supervisor with casework\noutreach, intake, and processing.\n\nThe Caseworker would also attend community events and conduct casework\noutreach directly with constituents. Caseworkers meet frequently with\nconstituents and liaise with federal agencies and help organize outreach events for\nthe Congressman’s office.\n\nThe successful applicant should have experience working on federal casework,\nmust have a positive attitude and the ability to work and set priorities in a fastpaced and challenging environment. Strong writing and verbal communications\nskills are essential. At least one year of experience working for an elected official\nor community-based organization is strongly preferred. A valid California Driver\nLicense and automobile are required. Bilingual skills are a plus.",
    "responsibilities": [
      "Assisting constituents with federal casework",
      "Assisting the Casework Supervisor with casework outreach, intake, and processing.",
      "Attend community events and conduct casework outreach directly with constituents.",
      "Meet frequently with constituents and liaise with federal agencies",
      "Help organize outreach events for the Congressman’s office."
    ],
    "qualifications": [
      "Experience working on federal casework",
      "Positive attitude and the ability to work and set priorities in a fast-paced and challenging environment.",
      "Strong writing and verbal communications skills are essential.",
      "At least one year of experience working for an elected official or community-based organization is strongly preferred.",
      "A valid California Driver License and automobile are required.",
      "Bilingual skills are a plus."
    ],
    "how_to_apply": "If interested, please send a resume, cover letter, and two short writing samples no\nlater than May 20, 2022 to:\n\nNICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33) 1645 Corinth Avenue, Suite #101 Los Angeles,\nCA 90025\nLieu.Staff@mail.house.gov",
    "salary_info": "full-time with federal benefits",
    "contact": "NICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33) 1645 Corinth Avenue, Suite #101 Los Angeles,\nCA 90025\nLieu.Staff@mail.house.gov",
    "equal_opportunity": "This office is an Equal Opportunity Employer."
  },
  {
    "id": "MEM-244-22",
    "position_title": "Staff Assistant",
    "office": "Representative Spanberger",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-16",
    "description": "Representative Spanberger seeks a Staff Assistant for her Washington, D.C.\noffice. Qualified applicants should be motivated self-starters, highly organized,\ndetail-oriented, able to multitask, have exceptional interpersonal skills, and ability\nto thrive in a fast-paced environment.\n\nCandidates must demonstrate excellent “people skills,” most importantly\ndisplaying compassion in all interactions, and a strong commitment to providing\noutstanding constituent service.\n\nThe ideal candidate should: be able to think on their feet, be a problem-solver,\ndemonstrate excellent oral and written skills, maintain a positive demeanor, and\ndemonstrate resilience in a busy environment.",
    "responsibilities": [
      "Managing the front office, including answering, appropriately logging, and directing telephone calls",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Distributing hard and electronic mail",
      "Other administrative duties",
      "Serve as the office tour coordinator",
      "Managing constituent requests for Capitol and White House tours, as well as constituent requests for flags flown over the Capitol"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Highly organized",
      "Detail-oriented",
      "Able to multitask",
      "Exceptional interpersonal skills",
      "Ability to thrive in a fast-paced environment",
      "Excellent “people skills,” most importantly displaying compassion in all interactions",
      "Strong commitment to providing outstanding constituent service",
      "Able to think on their feet",
      "Problem-solver",
      "Excellent oral and written skills",
      "Maintain a positive demeanor",
      "Demonstrate resilience in a busy environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, 1-page writing sample, and two references to spanberger.inquiries@mail.house.gov with “DC Staff Assistant” in the subject line. Applications will be reviewed on a rolling basis.",
    "salary_info": "$50,000",
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-242-22",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-16",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a Legislative Assistant with Hill experience. This is not an entry level position. Excellent written and oral communication skills required. Advanced degree a plus.",
    "responsibilities": [],
    "qualifications": [
      "Hill experience",
      "Excellent written and oral communication skills required",
      "Advanced degree a plus"
    ],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. Use this title on your email: “Legislative Assistant Application” No drop-ins or calls please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-241-22",
    "position_title": "Press Assistant/Deputy Press Secretary",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "The Democratic staff of the House Committee on Veterans’ Affairs seeks a Press Assistant/Deputy Press Secretary to work closely with the Communications Director to implement the Committee Communications Strategy.\nThey will lead the drafting of press materials, monitor media and issues relevant to the Committee, primarily handle press inquiries and media relationships, and largely be responsible for day-to-day press operations. On occasion, and in consultation with the Communications Director or Senior Staff, they will serve as the on-the-record spokesperson.\nIn an effort to build a diverse and more inclusive work environment, the committee strongly encourages veterans, minorities, women, people with disabilities, and LGBTQ+ candidates to apply.",
    "responsibilities": [
      "Lead the development of talking points, remarks, statements, press releases, advisories, and caucus messaging guides",
      "Lead the coordination, preparation, and execution of media interviews, speaking engagements, and press conferences",
      "Monitor and track media appearances, manage media relationships, and work with policy subject matter experts to identify opportunities for media engagement",
      "Assist with rapid response efforts",
      "Assist Committee Member offices with any press related needs",
      "Hire, manage, and supervise press interns",
      "Staff Chairman at press events"
    ],
    "qualifications": [
      "3+ years’ experience working in communications or related field",
      "Excellent written and verbal communications skills",
      "Willing to execute day-to-day tasks and work successfully within a team",
      "Ability to work in a fast-paced environment, prioritize tasks, and adapt quickly and easily for rapid response"
    ],
    "how_to_apply": "All candidates are required to complete an Online Application via https://docs.google.com/forms/d/e/1FAIpQLScLDNEck7GezSWFthWkageU5X4EG9JmGIaxSTeJfOhLDt4BZw/viewform to be considered. There you can upload your resume, cover letter, and writing sample.",
    "salary_info": "Title and salary negotiable depending on experience. Starting salary is $55K.",
    "contact": null,
    "equal_opportunity": "In an effort to build a diverse and more inclusive work environment, the committee strongly encourages veterans, minorities, women, people with disabilities, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-240-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2022-05-16",
    "description": "The Legislative Assistant will be responsible for handling a broad range of domestic policy issues, including the member’s Science and Technology Committee work. The Legislative Assistant will be responsible for drafting and monitoring legislation, preparing materials for committee hearings and markups, representing the Member in meetings/briefings, working with constituent organizations, and performing other tasks as assigned.\n\nThe ideal candidate will have a strong understanding of the legislative process, excellent writing and communication skills, and a demonstrated ability to work effectively in a fast-paced office. Press and communications experience is also a plus, but not required.",
    "responsibilities": [
      "Handling a broad range of domestic policy issues, including the member’s Science and Technology Committee work.",
      "Drafting and monitoring legislation",
      "Preparing materials for committee hearings and markups",
      "Representing the Member in meetings/briefings",
      "Working with constituent organizations",
      "Performing other tasks as assigned"
    ],
    "qualifications": [
      "Hill experience in a legislative role or comparable experience is required.",
      "A strong understanding of the legislative process",
      "Excellent writing and communication skills",
      "A demonstrated ability to work effectively in a fast-paced office",
      "Press and communications experience is a plus, but not required."
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to legislativeposition2022@gmail.com",
    "salary_info": null,
    "contact": "legislativeposition2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-237-22",
    "position_title": "Digital Director / Press Secretary",
    "office": "Congressman Jake Auchincloss (D, MA-04)",
    "location": "Washington, DC or Massachusetts",
    "posting_date": "2022-05-16",
    "description": "The office of Congressman Jake Auchincloss (D, MA-04) is seeking a Digital Director / Press Secretary to work closely with the Communications Director to elevate the Member’s communications operation and strategically run a social media program.\n\nDuties will include staffing the Member at open press events in the District and DC and working closely with the District team to amplify local events, media monitoring, maintenance of the Member’s social media accounts, drafting and posting content for social media, producing graphics and videos, editing photos and videos, maintaining the website, compiling daily press clips, and assisting with the drafting of press releases and media advisories, e-newsletters, franked mailings, opeds, and other responsibilities as assigned.\n\nThe ideal candidate will be organized, detail-oriented, tech-savvy, able to work long hours in a fast-paced environment, have superior writing and proofreading skills, and the ability to work closely and collaborate with Senior Staff both in the District and in DC.",
    "responsibilities": [
      "Staffing the Member at open press events in the District and DC",
      "Working closely with the District team to amplify local events",
      "Media monitoring",
      "Maintenance of the Member’s social media accounts",
      "Drafting and posting content for social media",
      "Producing graphics and videos",
      "Editing photos and videos",
      "Maintaining the website",
      "Compiling daily press clips",
      "Assisting with the drafting of press releases and media advisories, e-newsletters, franked mailings, opeds, and other responsibilities as assigned"
    ],
    "qualifications": [
      "Previous experience building audiences online and maintaining social media accounts",
      "Excellent writing skills",
      "Ability to work well on a team",
      "Experience in principal management",
      "Experience meeting tight deadlines under pressure",
      "Previous congressional or campaign experience and photography/videography/graphic design skills are strongly preferred",
      "Indicate in the application if you have on-the-record experience"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and 1-2 writing samples or sample graphics/videos or tweets to AuchinclossJobs@gmail.com.",
    "salary_info": "Title and salary are competitive and negotiable based on previous experience.",
    "contact": "AuchinclossJobs@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identity, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-236-22",
    "position_title": "LEGISLATIVE ASSISTANT",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "Congressman Mark Pocan (WI-02), member of both the House Appropriations and Education & Labor Committees, is seeking an experienced and enthusiastic Legislative Assistant. Ideal candidate will have 2-3 years of Hill experience, a good understanding of House procedures, an understanding of developing and tracking legislative initiatives and political awareness. This is not an entry level position.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. Job responsibilities will include drafting legislation, writing hearing statements, legislative memos, constituent correspondence and preparing briefing materials.\n\nA sense of humor is greatly appreciated.",
    "responsibilities": [
      "drafting legislation",
      "writing hearing statements",
      "legislative memos",
      "constituent correspondence",
      "preparing briefing materials"
    ],
    "qualifications": [
      "2-3 years of Hill experience",
      "a good understanding of House procedures",
      "an understanding of developing and tracking legislative initiatives",
      "political awareness",
      "Excellent writing, verbal and organizational skills",
      "ability to be a self-starter",
      "ability to work in a fast paced environment"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to WI02JobOpening@gmail.com with “Legislative Assistant” in the Subject Line. Job opening closes at the end of business on Friday, May 20th. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-234-22",
    "position_title": "Research Assistant, Subcommittee on Economic Opportunity, House Committee on Veterans’ Affairs, Republican Staff",
    "office": "Subcommittee on Economic Opportunity, House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "CORE RESPONSIBILITIES:\nProvides administrative, legislative, and research support to Subcommittee staff, and assists with other duties as assigned.",
    "responsibilities": [
      "Provides administrative, legislative, and research support to Subcommittee staff, and assists with other duties as assigned."
    ],
    "qualifications": [
      "Bachelor of Arts or Science;",
      "Work, internship, or other experience in a professional environment;",
      "Strong writing skills;",
      "Proficiency in Microsoft Office;",
      "Organizational skills;",
      "Problem solving skills;",
      "Strong verbal communication;",
      "Team oriented;",
      "Ability to work well under pressure;",
      "Strong attention to detail."
    ],
    "how_to_apply": "Qualified candidates please send resumes and cover letter only to the following email address: VAR.Resumes@mail.house.gov with “EO Republican Research Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-232-22",
    "position_title": "Counsel or Professional Staff",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation's response to the coronavirus crisis is efficient, effective, and equitable.\nChairman James E. Clyburn seeks to fill a Counsel or Professional Staff position on the Majority staff. The ideal candidate will be an attorney or policy professional with several years of investigative or litigation experience. Recent law school graduates with relevant professional experience prior to attending law school may be considered on a case-by-case basis.",
    "responsibilities": [
      "Leading investigations",
      "Conducting depositions and transcribed interviews",
      "Preparing for hearings",
      "Drafting reports"
    ],
    "qualifications": [
      "Candidates must have superior attention to detail",
      "Candidates must work well under pressure",
      "Candidates must be self-motivated",
      "Candidates must possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Counsel / Professional Staff” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-231-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-05-16",
    "description": "Constituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work.\n\nIn addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.\n\nThe ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor’s degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Helping with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-230-22",
    "position_title": "Chief of Staff",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": "Washington D.C. and district office(s)",
    "posting_date": "2022-05-16",
    "description": "The Office of Congresswoman Alma S. Adams, Ph.D. is seeking a Chief of Staff to act as the Member's chief policy advisor.\n\nThis position develops and implements all policy objectives, strategies and operating plans for the Member's offices and manages and directs all activities and staff of the Member's Washington D.C. and district office(s), as well as coordinates the activities of the Member with Leadership and committee office(s).",
    "responsibilities": [
      "Supervisory: Directly supervises up to eighteen full time employees and up to four part-time and temporary employees; carries out responsibilities in accordance with office policy and applicable laws. Responsibilities include interviewing, hiring and training employees; planning, assigning and directing work; appraising performances; rewarding and disciplining employees; addressing complaints; and resolving problems;",
      "Manages the Washington, D.C. and district office staffs;",
      "Sets and oversees the administration of office goals, policies and procedures and has oversight responsibility for all personnel matters including hiring, salary, and disciplinary decisions;",
      "Manages long-term legislative plan of the Member;",
      "Coordinates and supervises the efforts of all employees including the press and constituent service staffs;",
      "Conducts staff meetings;",
      "Approves strategies and tactics on legislative issues;",
      "Acts as the Member's principal liaison and responds to office visits and telephone inquiries from constituents and various interest groups;",
      "Maintains a good working relationship with the Member, staff, constituents, stakeholders, and other political offices;",
      "Speaks to local and national groups, as well as the press, when the Member is unavailable;",
      "Oversees the office budget;",
      "Accepts performance-based criticism and direction;",
      "Works well under pressure and handles stress;",
      "Meets attendance requirements as established by the office;",
      "Works a flexible schedule including long hours, nights and weekends;",
      "Performs other duties as assigned by the Member."
    ],
    "qualifications": [
      "A minimum of a bachelor’s degree in political science or related field, including strong academic credentials is preferred. Alternatively, five years of related experience or training in management and/or legislation or equivalent experience.",
      "Thorough knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Thorough knowledge of the Members' Congressional Handbook and House Rules;",
      "An understanding of the district and federal political process;",
      "Provides necessary organization, supervisory leadership, and motivation to manage a House office;",
      "Ability to perform essential job functions above;",
      "Ability to maintain a good working relationship with the Congresswoman, staff and constituents;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Excellent oral and written communication skills;",
      "Knowledge of the office policies, practices, and procedures;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing.",
      "Work is mainly performed in an office environment. Noise levels are usually moderate; and;",
      "Ability to work in a small workstation without an expectation of privacy."
    ],
    "how_to_apply": "Qualified applicants should send a cover letter and resume, along with three references to nc12.resume@mail.house.gov. Please use CHIEF OF STAFF in the subject line when submitting your materials.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-229-22",
    "position_title": "Scheduler",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "DC and the District",
    "posting_date": "2022-05-16",
    "description": "Main responsibilities include maintaining the Member’s daily and long-term schedules for both DC and the District; organizing and evaluating all incoming meeting requests and invitations; keeping the Member on schedule throughout the day; working with legislative and communications staff to ensure the Member is prepared for events/meetings; coordinating travel arrangements; processing and managing expenses and reimbursements for the Member; and communicating with constituents by phone and email to address requests, concerns, and questions.\n\nAdditional responsibilities include other administrative tasks.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedules for both DC and the District",
      "Organizing and evaluating all incoming meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Coordinating travel arrangements",
      "Processing and managing expenses and reimbursements for the Member",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented and able to multi-task",
      "Resourceful",
      "Team-oriented",
      "Have a positive attitude",
      "Availability outside of regular business hours including some weekend availability as needed",
      "Previous scheduling experience (at least one year in a similar position)",
      "Southern California | Los Angeles Metro area ties and Spanish fluency are a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three references with “SCHEDULER” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-228-22",
    "position_title": "Press Secretary|Digital Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "Representative Nanette Diaz Barragan (CA-44) is seeking a talented and highly\nmotivated individual to assume the role of Press Secretary|Digital Director.\nThe person chosen for the position will work closely with the Communications\nDirector to develop and execute the Congresswoman’s long-term\ncommunications plan. They will be charged with overseeing the communications\nschedule, managing the Member’s digital media accounts, and working with local\nand national reporters.\n\nThe Press Secretary|Digital Director will be responsible for a wide range of\ncritical functions, including developing original social media content, designing\ngraphics, editing and posting videos, maintaining the office’s website, and\nmanaging media lists. Additionally, they will assist the Communications Director\nwith drafting news releases, advisories, talking points, op-eds and other materials.\n\nQualified applicants must have strong writing, editing, proofreading skills and be\nproficient in photography, video recording and editing. They must be detailoriented, news savvy and able to work in a fast-paced, demanding work setting -a sense of humor and ability to be a team player is a must.\n\nSpanish fluency preferred.\n\nThis is not an entry-level position. Previous experience in press or relevant social\nmedia experience is required. Experience with Adobe Creative Cloud Products\nare a plus. Southern California|Los Angeles ties are a plus.\n\nSuccessful applicants will need to demonstrate their writing ability by completing\na writing and editing test.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics",
      "Editing and posting videos",
      "Maintaining the office’s website",
      "Managing media lists",
      "Assisting the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials."
    ],
    "qualifications": [
      "Strong writing, editing, proofreading skills",
      "Proficient in photography, video recording and editing",
      "Detail-oriented, news savvy and able to work in a fast-paced, demanding work setting",
      "Ability to be a team player",
      "Previous experience in press or relevant social media experience is required.",
      "Experience with Adobe Creative Cloud Products are a plus.",
      "Southern California|Los Angeles ties are a plus.",
      "Spanish fluency preferred."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and\ntwo writing samples with “Press Secretary” in the subject line\nto CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status."
  },
  {
    "id": "MEM-227-22",
    "position_title": "Legislative Assistant|CHC Liaison",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC House office",
    "posting_date": "2022-05-16",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks a highly talented and motivated individual to serve as a Legislative Assistant|CHC Liaison in Washington, DC House office - with the primary responsibilities of handling the Member’s immigration, foreign affairs, military, and criminal justice, Homeland Security Committee work, and serve as Member’s liaison to the Congressional Hispanic Caucus (CHC).\n\nCandidates must have a proven record of proposing legislation, developing amendments, and leading on letters.",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various legislative vehicles;",
      "Preparing hearing binders and questions for witnesses for Homeland Security Committee hearings;",
      "Drafting talking points, vote recommendations and other materials;",
      "Monitoring and analyzing legislative developments, committee proceedings, news stories and other relevant info; and",
      "Representing the Member in meetings with constituents and stakeholders."
    ],
    "qualifications": [
      "Candidates must have an ability to work under pressure and meet deadlines in a fast-paced work environment.",
      "Strong organizational and time management skills, excellent written and verbal communication skills, and a keen attention to detail are required.",
      "Spanish language skills preferred.",
      "Southern California ties a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-226-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "San Pedro, CA",
    "posting_date": "2022-05-16",
    "description": "Candidate should possess excellent verbal and written communication skills, have the proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests, highly organized, and the ability to manage multiple tasks and competing deadlines simultaneously.\n\nResponsibilities for this community focused position include: answer and log incoming phone calls, conducts casework intake, and work on casework through completion; identify event and correspondence opportunities in their geographic and issue areas; staff the Congresswoman and serves as staff representative for the Congresswoman at community meetings and events; lead or assist with planning, organizing, and executing district outreach efforts in their geographic and issue areas; identifying issues related to federal programs for possible legislation and|or letters; managing correspondence and acknowledgements from the office; meeting with constituent and community leaders and developing relationships and networks in their geographic and issue areas; working with community groups and organizations, local elected officials, and others in the District to identify potential opportunities for federal funding; and serving as a liaison with federal, state, and local agencies, and committees.",
    "responsibilities": [
      "answer and log incoming phone calls",
      "conducts casework intake, and work on casework through completion",
      "identify event and correspondence opportunities in their geographic and issue areas",
      "staff the Congresswoman and serves as staff representative for the Congresswoman at community meetings and events",
      "lead or assist with planning, organizing, and executing district outreach efforts in their geographic and issue areas",
      "identifying issues related to federal programs for possible legislation and|or letters",
      "managing correspondence and acknowledgements from the office",
      "meeting with constituent and community leaders and developing relationships and networks in their geographic and issue areas",
      "working with community groups and organizations, local elected officials, and others in the District to identify potential opportunities for federal funding",
      "serving as a liaison with federal, state, and local agencies, and committees"
    ],
    "qualifications": [
      "excellent verbal and written communication skills",
      "proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests",
      "highly organized",
      "ability to manage multiple tasks and competing deadlines simultaneously",
      "knowledge of communities within California's 44th District preferred",
      "Spanish fluency preferred",
      "A car and good driving record required",
      "able to work a flexible schedule, including some nights and weekends as required"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with “CA44 Field Rep” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-225-22",
    "position_title": "District Staff Assistant",
    "office": "Congresswoman Nanette Diaz Barragan (CA-44)",
    "location": "San Pedro, CA",
    "posting_date": "2022-05-16",
    "description": "The District Staff Assistant greets visitors, answers the telephone, supervises the district internship program, and responds to constituent requests for general information and other inquiries. This position maintains the front office and assists district office staff with various administrative duties while maintaining an external agenda that interacts frequently with constituents. The position will also support aspects of the Office’s outreach function.\n\nThe District Staff Assistant will also be integrated into the Congresswoman’s scheduling team to assist in the various aspects of District Scheduling.",
    "responsibilities": [],
    "qualifications": [
      "Excellent verbal and written communication skills",
      "Strong interpersonal skills",
      "Proper demeanor and a comfort in dealing directly with constituents to resolve challenging requests",
      "Highly organized",
      "Ability to manage multiple tasks and competing deadlines simultaneously",
      "Able to work in a fast-paced environment",
      "Familiarity with communities in California’s 44th District.",
      "Spanish fluency and a car (with good driving record) preferred.",
      "Candidates must also be able to work a flexible schedule, including some nights and weekends as required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three references with “CA44 Staff Assistant” in the subject line to CA44Resumes@mail.house.gov",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-224-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, D.C.",
    "posting_date": "2022-05-16",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, and energetic.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director will oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member’s social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters and franked mailings.\n\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging. The Communications Director is responsible for maintaining the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill. They must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Develop and execute an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member’s social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters and franked mailings.",
      "Work with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
      "Maintain the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base."
    ],
    "qualifications": [
      "Must have previous press-related experience either on or off Capitol Hill.",
      "Must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Fluency in Spanish is a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus.",
      "Additionally, the Communications Director must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-221-22",
    "position_title": "Digital/Press Assistant",
    "office": "Congresswoman Gwen Moore (WI-04)",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "Congresswoman Moore is a member of the Ways and Means Committee, Science, Space, and Technology Committee, and the Select Committee on Economic Disparity and Fairness in Growth, and her office is looking to expand its communications team and digital outreach.\n\nThe Digital/Press Assistant position will collaborate in a supportive team. This position reports to the Chief of Staff and the Communications Director. Their responsibilities will include drafting newsletters, creating digital content for social media platforms, such as videos and graphics, and assisting with press events and media interviews.\n\nA strong candidate will be creative, a self-starter, and adaptable in a fast-paced environment. Great writing skills, experience in graphic design, and a strong work ethic are essential for this position. Wisconsin ties are a plus.",
    "responsibilities": [
      "drafting newsletters",
      "creating digital content for social media platforms, such as videos and graphics",
      "assisting with press events and media interviews"
    ],
    "qualifications": [
      "creative",
      "a self-starter",
      "adaptable in a fast-paced environment",
      "Great writing skills",
      "experience in graphic design",
      "a strong work ethic",
      "Wisconsin ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples, and an example of previous digital media or graphic design projects to WI04Resume@mail.house.gov with “Digital/Press Assistant” in the subject line. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "WI04Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-217-22",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-05-16",
    "description": "Senior Democratic Member of Congress seeks a bilingual English/Spanish speaker who is an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member's district, and keeping the community connected to the Member's work. Importantly, constituent services staff also assist with neighborhood events and visits community groups in the district.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and in handling multiple tasks and issues effectively while making sure federal agencies respond in a timely manner and assuring our office responds promptly to constituent requests and concerns while meeting deadlines.\n\nA successful candidate will be able to communicate fluently in Spanish and English, work independently, and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.\n\nThe ideal candidate will have significant experience interacting with the public, excellent writing and communication skills and a working knowledge or strong interest in the District of Columbia and its local government. Candidate must possess a bachelor's degree and be, or be willing to become, a resident of the District of Columbia.",
    "responsibilities": [
      "Assists the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member's district",
      "Keeping the community connected to the Member's work",
      "Assist with neighborhood events",
      "Visits community groups in the district",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively",
      "Making sure federal agencies respond in a timely manner",
      "Assuring our office responds promptly to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Communicate fluently in Spanish and English",
      "Work independently",
      "Think outside the box about various constituent issues and community events",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "A working knowledge or strong interest in the District of Columbia and its local government",
      "Candidate must possess a bachelor's degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": null,
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-216-22",
    "position_title": "Policy Aide",
    "office": "House Small Business Committee Democrats",
    "location": null,
    "posting_date": "2022-05-16",
    "description": "House Small Business Committee Democrats seeks a policy aide to assist senior staff on wide ranging policy issues, including, tax, health, retirement, agriculture, procurement, technology, and other issues.",
    "responsibilities": [
      "Researching",
      "Drafting memos, and questions to support senior staff",
      "Drafting reports",
      "Assisting in the drafting of legislation",
      "Other assignments"
    ],
    "qualifications": [
      "Exceptional writing and analytical skills are a must.",
      "Prior Hill or federal agency experience is preferred."
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-213-22",
    "position_title": "Wounded Warrior Fellow",
    "office": "Congressman David Trone (MD06)",
    "location": "District Office (Gaithersburg, Frederick, Hagerstown, or Cumberland, MD)",
    "posting_date": "2022-05-16",
    "description": "This position is limited to veterans desiring to serve a two-year paid congressional Fellowship as part of the House of Representatives Wounded Warrior Fellowship Program.\n\nSelected Fellows will work directly for Congressman Trone as part of his District Office staff, located in once of his District Offices. (Gaithersburg, Frederick, Hagerstown, or Cumberland, MD)",
    "responsibilities": [
      "Serve as the official representative for the Member in the Veterans community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations in the Veterans community to form effective relationships for the Member.",
      "Monitor and update the Member and District Director on issues facing military members and veterans in the district.",
      "Provide direct casework assistance to military members and veterans in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Assess veterans issues that constituents are facing for problems requiring possible legislative action; make recommendations to the District and Legislative Directors.",
      "Answer casework correspondence and verbal communications with constituents."
    ],
    "qualifications": [
      "Detail oriented; excellent organization skills; excellent communication skills; strong computer skills; ability to complete projects within timelines and under minimal supervision.",
      "Ability to work well under pressure and maintain a professional and courteous work disposition; ability to exercise discretion and independent judgment in handling sensitive information; ability to manage multiple tasks simultaneously.",
      "High School Diploma required.",
      "Some college level classes are preferred but not required.",
      "ALL CANDIDATES MUST BE:",
      "1) Honorably discharged",
      "2) Released from active duty within the last six years.",
      "3) Pay grades at or below E-5/O-3/W-2 4. Veterans promoted to pay grades of E6/O-4/W-3 WITHIN 6-MONTHS OF SEPARATION from active duty are eligible."
    ],
    "how_to_apply": "To apply, please go to the following link to submit your application:\nhttps://house.csod.com/ux/ats/careersite/1/home/requisition/478?c=house&source=USAJobs.\nNo phone calls or walk-ins.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-208-22",
    "position_title": "Communications Director",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-05-16",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks an experienced Communications Director based in the DC office to develop and execute the Congressman’s communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.\nThe Communications Director will serve as the spokesperson and primary communications advisor to Congressman Horsford and will supervise the work of junior communications staff. They will be responsible for executing an aggressive communications plan that generates positive local and national media coverage, reaches diverse communities, and expands the Congressman’s reach to new audiences.",
    "responsibilities": [
      "Working with Congressman Horsford, the Chief of Staff, the Deputy Chief of Staff, and the District Director to develop strategic messaging priorities.",
      "Managing all day-to-day external communications from the office, including press releases, remarks, floor speeches, interview memos, newsletters, op-eds, and social media.",
      "Proactively identifying opportunities to expand Congressman Horsford’s local and national media profile and working closely with the Congressional Black Caucus, the House Labor Caucus, and other affiliated caucuses on shared priorities.",
      "Pitching stories to local and national press and planning press conferences, press calls, and other press events.",
      "Developing a strategic plan and budget for all communications programs.",
      "Designing and implementing a creative digital communications program, including both paid advertising and organic social media. The Communications Director will also be responsible for keeping the Congressman’s website up-to-date.",
      "Overseeing franked communications and a robust 499 program."
    ],
    "qualifications": [
      "This is not an entry-level position, and candidates must have previous press experience on or off Capitol Hill.",
      "Strong oral and written communications skills are required.",
      "Prior experience managing franked communications is a plus.",
      "The ideal candidate must be collaborative, creative, energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours in a fastpaced and demanding setting.",
      "Experience with video editing and graphic design is also a plus and Nevada ties a plus."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Communications Director” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-149-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-05-16",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks)",
      "Serving as intern coordinator by recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing, and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Office of Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-05-16",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media Secretary based in the DC office to work closely with the Communications Director, based in the district office to develop and execute the Congressman’s communications strategy as a member of the House Ways and Means, Armed Services, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital, technical, and social media trends. Able to express the Congressman's voice creatively and promote social media presence, ensuring high web traffic and constituent engagement.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines. This position serves as a part of the Communications team and reports directly to the Director of Communications based in the district, however, this person will be the main point of contact in the D.C. office.\n\nThe candidate will report to the Communications Director and work closely with legislative and district staff. The ideal candidate will have experience in or interest in learning about aspects of the office’s traditional press operations, including writing press releases, drafting talking points and speeches, forming relationships with members of the media, and pitching stories.\n\nThis is an ideal position for someone with 1-2 years of communications or digital experience. Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman’s social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman’s website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman’s media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada’s Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford’s digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "Applicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.",
      "Ideal candidate will have experience in or interest in learning about aspects of the office’s traditional press operations, including writing press releases, drafting talking points and speeches, forming relationships with members of the media, and pitching stories.",
      "Ideal position for someone with 1-2 years of communications or digital experience.",
      "Applicants must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus.",
      "Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  }
]