[
  {
    "id": "MEM-049-15",
    "position_title": "Press Secretary",
    "office": "Pennsylvania Republican",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-09",
    "description": "Duties include performing day-to-day operations of an active press office, including new media, drafting press releases, e-newsletters, talking points, and columns.",
    "responsibilities": [
      "Performing day-to-day operations of an active press office",
      "New media",
      "Drafting press releases",
      "Drafting e-newsletters",
      "Drafting talking points",
      "Drafting columns"
    ],
    "qualifications": [
      "Hill or campaign experience",
      "PA ties preferred"
    ],
    "how_to_apply": "Send resume, writing sample, and cover letter to PA.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "PA.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-048-15",
    "position_title": "Communications Director",
    "office": "North Carolina Democratic Congresswoman",
    "location": null,
    "posting_date": "2015-02-09",
    "description": "North Carolina Democratic Congresswoman seeks an experienced Communications Director. The ideal applicant will be an excellent writer and editor with a proven ability to prioritize and handle multiple tasks in a fastpaced environment, while meeting tight deadlines.",
    "responsibilities": [
      "planning and implementing national and local media strategies",
      "managing social media platforms",
      "writing press releases, talking points, op-eds and other materials",
      "build and maintain excellent relationships with members of the national and local media and editorial boards",
      "on-the-record experience"
    ],
    "qualifications": [
      "Hill experience is highly desired"
    ],
    "how_to_apply": "Please send resume and two writing samples to NCCongressionalJobs@gmail.com. No phone calls, e-mails or walk-ins, please.",
    "salary_info": null,
    "contact": "NCCongressionalJobs@gmail.com",
    "equal_opportunity": "Minorities and women encouraged to apply, North Carolina ties preferred."
  },
  {
    "id": "MEM-044-15",
    "position_title": "Communications Director",
    "office": "Florida Democrat",
    "location": "D.C.",
    "posting_date": "2015-02-09",
    "description": "The Communications Director will coordinate all press activities, serve as the primary spokesperson for the Representative, and manage national media. The Communications Director will work with the Orlando-based Press Secretary to execute messaging strategies and media activities in the district.\n\nCandidates should be proactive, and possess superior written and oral communication skills (including strong writing, editing, and proofreading capabilities). The ideal candidate will have prior political experience and at least two years of professional communications work with national media experience.",
    "responsibilities": [
      "Establishing and maintaining relationships with national and D.C.-based media",
      "Coordinating all media efforts and communications-related events",
      "Drafting and distributing press releases and media advisories; drafting, editing, and placing op-eds",
      "Pitching stories to reporters, responding to press inquiries, and serving as the point-of-contact for national press",
      "Monitoring media narratives and identifying opportunities to promote the Member",
      "Overseeing franked communications strategy, including: the drafting, design, and distribution of franked mail content; executing telephone town hall events; and managing congressional e-newsletter",
      "Managing the congressional website and ensuring that it features timely content",
      "Coordinating and staffing the Congressman for interviews and events (including night and weekend commitments)"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a current resume, cover letter, salary requirement, two writing samples (not to exceed one page each), and three references to FL09job@gmail.com. No calls, emails or walk-ins, please.",
    "salary_info": null,
    "contact": "FL09job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-043-15",
    "position_title": "Scheduler/Executive Assistant",
    "office": "New Mexico Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-09",
    "description": "Responsibilities will include maintaining the Member’s daily and long-term schedule in D.C. and District Office, organizing and tracking invitations, speaking engagements and scheduling requests, and coordinating travel arrangements. In addition, the scheduler/executive assistant will be responsible for coordinating with staff to ensure the timely completion of speeches and meeting memos, handling the Member’s personal correspondence, occasional driving of the member in D.C. and various additional duties as assigned by the Member or Chief of Staff.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedule in D.C. and District Office",
      "Organizing and tracking invitations, speaking engagements and scheduling requests",
      "Coordinating travel arrangements",
      "Coordinating with staff to ensure the timely completion of speeches and meeting memos",
      "Handling the Member’s personal correspondence",
      "Occasional driving of the member in D.C.",
      "Various additional duties as assigned by the Member or Chief of Staff"
    ],
    "qualifications": [
      "Highly organized and detail-oriented",
      "Excellent verbal and written communication skills",
      "Able to multitask and work well in a team-oriented environment",
      "Previous Capitol Hill scheduling or full-time executive assistant experience (or equivalent) is preferred",
      "New Mexico ties are a plus",
      "Willing to work extended hours at times",
      "Driving duties are required",
      "Some travel to the district is expected"
    ],
    "how_to_apply": "To apply, please email, with the subject line “Scheduler/Executive Assistant,” to NM01.Resumes@mail.house.gov with your resume and cover letter in a single document (word or .pdf only.) Only complete applications will be considered.",
    "salary_info": "Salary is commensurate with experience and within the structure of House Office Budgets.",
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-041-15",
    "position_title": "Communications Director",
    "office": "Joint Economic Committee Democratic staff",
    "location": null,
    "posting_date": "2015-02-09",
    "description": "The Joint Economic Committee Democratic staff seeks a Communications Director with 5 or more years of experience in political communications or a closely-related field. He or she must have a proven ability to work with national print and broadcast reporters – a deep rolodex is a big plus. A successful candidate must be an innovative thinker with an ability to turn complex issues into stories suitable for print, television and radio. He or she must demonstrate excellent writing and editing skills and must possess a strong portfolio of press releases, statements, op-eds and other pieces. Knowledge of economic issues as well as significant coursework in economics is strongly desired. Experience with social media and graphics design is helpful but not required.",
    "responsibilities": [],
    "qualifications": [
      "5 or more years of experience in political communications or a closely-related field",
      "Proven ability to work with national print and broadcast reporters",
      "Excellent writing and editing skills",
      "Strong portfolio of press releases, statements, op-eds and other pieces",
      "Knowledge of economic issues as well as significant coursework in economics is strongly desired.",
      "Experience with social media and graphics design is helpful but not required."
    ],
    "how_to_apply": "Please submit a cover letter, resume and two short writing samples to: joint_economic_committee-dems_press@jec.senate.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "joint_economic_committee-dems_press@jec.senate.gov",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-040-15",
    "position_title": "Field Director",
    "office": "Congresswoman Lucille Roybal-Allard",
    "location": "Los Angeles-area district office in the City of Commerce",
    "posting_date": "2015-02-09",
    "description": "Responsibilities include supervising field staff, a portfolio of issue and geographic areas, working w/ the District Chief of Staff in developing an aggressive constituent outreach plan, monitoring the district and updating the Member, Chief of Staff and District Chief on district and local issues.",
    "responsibilities": [
      "Supervising field staff",
      "Managing a portfolio of issue and geographic areas",
      "Working with the District Chief of Staff in developing an aggressive constituent outreach plan",
      "Monitoring the district and updating the Member, Chief of Staff and District Chief on district and local issues"
    ],
    "qualifications": [
      "Previous supervisory experience",
      "Excellent organizational and communication skills",
      "Ability to work under pressure and meet deadlines",
      "Flexibility with priorities and ever changing deadlines",
      "Detail orientation",
      "Ability to meet attendance requirements including a varied and often unpredictable work schedule",
      "Knowledge of immigration (plus)",
      "Spanish proficiency (plus)",
      "Familiarity with South LA (plus)"
    ],
    "how_to_apply": "Interested applicants should submit their cover letter, resume and one writing sample via email to: CA40Resumes@mail.house.gov",
    "salary_info": "Salary commensurate with experience.",
    "contact": "CA40Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-038-15",
    "position_title": "Legislative Correspondent",
    "office": "Congresswoman Donna F. Edwards",
    "location": "Hill",
    "posting_date": "2015-02-09",
    "description": "Congresswoman Donna F. Edwards seeks a Legislative Correspondent for an active mail program. Individual will be responsible for drafting all constituent correspondence and potentially providing policy support to the Legislative Assistants. Candidate should have excellent writing ability, superior researching skills, and understanding of the legislative process in order to provide thoughtful and substantive responses to constituent correspondence. Hill background, experience with Intranet Quorum, and Maryland ties a plus.",
    "responsibilities": [
      "Drafting all constituent correspondence",
      "Potentially providing policy support to the Legislative Assistants"
    ],
    "qualifications": [
      "Excellent writing ability",
      "Superior researching skills",
      "Understanding of the legislative process",
      "Hill background (plus)",
      "Experience with Intranet Quorum (plus)",
      "Maryland ties (plus)"
    ],
    "how_to_apply": "Please send your resume, a cover letter (include salary requirements), two writing samples (maximum of two-pages each), and a list of three references to chris.schloesser@mail.house.gov with “Legislative Correspondent Position” in the subject line. No phone calls or drop bys, please.",
    "salary_info": null,
    "contact": "chris.schloesser@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-034-15",
    "position_title": "Legislative Assistant",
    "office": "Office of Rep. Justin Amash (R-MI)",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-09",
    "description": "The Office of Rep. Justin Amash (R-MI) seeks a bright, creative, and hardworking legislative assistant to join our Washington, D.C.-based policy team.\n\nThe legislative assistant will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The legislative assistant will be expected to handle a diverse portfolio of policy issues, which can be tailored somewhat to the staffer's expertise and interests.\n\nThe successful candidate will demonstrate a strong commitment to individual liberty, economic freedom, and the defense of the Constitution. He or she also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. Candidates who prefer staid and steady work or who avoid challenges (and the occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters"
    ],
    "qualifications": [
      "B.A. or equivalent",
      "Some policy experience preferred",
      "Strong commitment to individual liberty, economic freedom, and the defense of the Constitution",
      "Excellent writer and clear thinker"
    ],
    "how_to_apply": "To apply, please send a resume and cover letter to mi03.apply@gmail.com.",
    "salary_info": null,
    "contact": "mi03.apply@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-030-15",
    "position_title": "Legislative Assistant for Small Business & Finance",
    "office": null,
    "location": "Washington, DC",
    "posting_date": "2015-02-09",
    "description": "CORE RESPONSIBILITIES:\n\nDUTIES:",
    "responsibilities": [
      "to develop and plan legislative initiatives especially around small business and tax issues",
      "to monitor legislative developments within Committees and on the House floor",
      "to write floor speeches for the Member",
      "extensive knowledge of federal/state workforce issues and organized labor",
      "ability to draft statements for the Member",
      "to draft constituent correspondence for the Member",
      "to meet with constituents and special interest groups on behalf of the Member"
    ],
    "qualifications": [
      "at least two (2) years of legislative experience not including internships",
      "strong academic credentials focused on business, tax and/or energy",
      "excellent oral and written communication skills",
      "thorough knowledge of the legislative process",
      "ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions for the Member on small business, federal tax and/or energy issues",
      "ability to work cooperatively and courteously with others",
      "ability to work well under pressure",
      "able to support a progressive caucus agenda",
      "reliable transportation",
      "ability to work in, and support a team environment",
      "thoroughness and careful attention to detail",
      "availability to work long hours during the week and occasionally on weekends"
    ],
    "how_to_apply": "SEND RESUMES AND ONE WRITING SAMPLE TO: CapitolHill14@gmail.com",
    "salary_info": null,
    "contact": "CapitolHill14@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-023-15",
    "position_title": "Legislative Assistant",
    "office": "Republican Committee Staff",
    "location": null,
    "posting_date": "2015-02-09",
    "description": "Republican Committee Staff is seeking applications for a Legislative Assistant position to serve as the junior member of the Committee's tax policy group. Primary responsibilities include administrative and clerking duties, active responsiveness to Member office requests, and contribution to materials for member meetings, hearings, markups, draft legislation, and other committee business.",
    "responsibilities": [
      "Administrative and clerking duties",
      "Active responsiveness to Member office requests",
      "Contribution to materials for member meetings, hearings, markups, draft legislation, and other committee business"
    ],
    "qualifications": [
      "JD, CPA, and/or tax experience preferred.",
      "Recent law school graduates with a strong interest in tax welcome to apply."
    ],
    "how_to_apply": "Please submit a resume and one brief writing sample to GOPTaxLA@gmail.com.",
    "salary_info": null,
    "contact": "GOPTaxLA@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-15",
    "position_title": "Tax and Finance Counsel/ Advisor",
    "office": "Ways and Means Committee Member",
    "location": null,
    "posting_date": "2015-02-09",
    "description": "Senior, Progressive, Democratic Ways and Means Committee Member has an\nopening for a Tax and Finance Counsel/ Advisor to handle tax, pension,\nfinancial services, small business, immigration, and homeland security policy.\nThis is not an entry-level position. Ideal candidates have Congressional\nexperience and substantive tax policy/ legal knowledge. Applicants should be\nstrong writers with the abilities to learn quickly, multi-task, and work\nindependently in a fluid environment. Great interpersonal skills and a good\nsense of humor are a requisite. Women and minorities are encouraged to\napply.",
    "responsibilities": [],
    "qualifications": [
      "Congressional experience",
      "Substantive tax policy/ legal knowledge",
      "Strong writing abilities",
      "Ability to learn quickly",
      "Ability to multi-task",
      "Ability to work independently in a fluid environment",
      "Great interpersonal skills",
      "Good sense of humor"
    ],
    "how_to_apply": "Please email a cover letter, resume, and references to leg.job@mail.house.gov. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "leg.job@mail.house.gov",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-018-15",
    "position_title": "Legislative Assistant",
    "office": "Progressive Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2015-02-09",
    "description": "Progressive Democratic Member seeks an organized, energetic and savvy Legislative Assistant to handle a broad portfolio focusing on issues concerning our domestic agenda - including health care, the economic development of America's legacy cities, and immigration. This position requires flexibility and the desire to learn about a number of diverse issues required to push the Member's goals forward. The selected individual will be joining a fast-paced, team-oriented Washington, D.C. office.",
    "responsibilities": [
      "Monitoring legislative developments on the House floor",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Contributing to floor speeches and other external communications",
      "Researching and advising the Member on bills and other issues",
      "Representing the Member in meetings",
      "Drafting constituent correspondence"
    ],
    "qualifications": [
      "Superior organizational skills",
      "Strong written and oral communication skills",
      "Strong interpersonal skills",
      "Ability to multi-task and thrive in a fast paced environment",
      "Poise, patience and a sense of humor",
      "Michigan ties a plus"
    ],
    "how_to_apply": "Please email a resume and cover letter to Michigan05jobs@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-009-15",
    "position_title": "Communications Director/Policy Advisor",
    "office": "Senior Democrat",
    "location": null,
    "posting_date": "2015-02-09",
    "description": "Senior Democrat seeks candidates for the position of Communications Director/Policy Advisor for a fast-paced and highly engaged office. The successful candidate will have excellent written and verbal skills, the proven ability to manage multiple communications projects, and the ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues. S/he will be responsible for developing, managing and coordinating all communications activities, including writing press releases, op-eds, mail pieces, talking points, organizing press events, maintaining the official website, implementing social media strategy, maintaining press database, writing e-newsletters & coordinating Tele-town halls. Duties will also include briefing the Member for interviews, writing and implementing PSAs, interacting with the press as the Member's principal spokesperson and coordinating the Member's overall press relations. The ideal candidate will have Hill experience, a depth of legislative and policy knowledge including that of the appropriations process, and Ohio connections of benefit. Candidates must be able to work extended hours and under time pressure, while maintaining a positive attitude and demeanor.",
    "responsibilities": [
      "Developing, managing and coordinating all communications activities",
      "Writing press releases, op-eds, mail pieces, talking points",
      "Organizing press events",
      "Maintaining the official website",
      "Implementing social media strategy",
      "Maintaining press database",
      "Writing e-newsletters",
      "Coordinating Tele-town halls",
      "Briefing the Member for interviews",
      "Writing and implementing PSAs",
      "Interacting with the press as the Member's principal spokesperson",
      "Coordinating the Member's overall press relations"
    ],
    "qualifications": [
      "Excellent written and verbal skills",
      "Proven ability to manage multiple communications projects",
      "Ability to exercise discretion and independent judgment in the representation of the Member's position on policy issues",
      "Hill experience",
      "Depth of legislative and policy knowledge including that of the appropriations process",
      "Ohio connections of benefit",
      "Ability to work extended hours and under time pressure, while maintaining a positive attitude and demeanor"
    ],
    "how_to_apply": "Please submit resume, cover letter, two writing samples, and salary requirements to Midwestern.Resume@mail.house.gov with “Communication Director/Policy Advisor” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-15",
    "position_title": "Legislative Director",
    "office": "Progressive Senior Appropriator",
    "location": "Washington, DC",
    "posting_date": "2015-02-09",
    "description": "Progressive Senior Appropriator seeks a Legislative Director to lead staff in a team-oriented office and serve as liaison to DHS appropriations subcommittee.",
    "responsibilities": [
      "Supervise day to day activity of legislative staff",
      "Contribute to office communications plan",
      "Proactively promote the office legislative agenda",
      "Manage a personal legislative issue portfolio which may include homeland security, defense, civil rights, judiciary, trade and foreign affairs among others",
      "Perform other related duties as assigned"
    ],
    "qualifications": [
      "Thorough knowledge of the legislative process and House procedures",
      "Previous supervisory experience",
      "Excellent organizational and communication skills",
      "Ability to work under pressure and meet deadlines",
      "Flexibility with priorities and ever changing deadlines",
      "Detail orientation",
      "Ability to meet attendance requirements including a varied and often unpredictable work schedule"
    ],
    "how_to_apply": "Interested applicants should submit via email the following documents: cover letter, resume and one writing sample. Care should be taken to include each document as a separate attachment in the same email",
    "salary_info": null,
    "contact": "SoCalDCstaffOpening@mail.house.gov",
    "equal_opportunity": "People of color, women and LGBT persons strongly encouraged to apply."
  },
  {
    "id": "MEM-414-14",
    "position_title": "Director of Investigations",
    "office": "Committee on Ethics",
    "location": "U.S. House of Representatives",
    "posting_date": "2015-02-09",
    "description": "The Committee on Ethics seeks an experienced attorney to serve as the Director of Investigations for the Committee. The Director will manage the Committee’s nonpartisan staff of attorneys and other professionals who are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess a minimum of 5 years of experience with complex investigations, outstanding analytical and written and oral communication skills, and the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is also desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and familiarity with Congress and its unique institutional prerogatives.",
      "Previous management experience preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Director of Investigations” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-409-14",
    "position_title": "Senior Field Deputy",
    "office": "Congressman Xavier Becerra",
    "location": "District Office",
    "posting_date": "2015-02-09",
    "description": "The Senior Field Deputy serves as the congressman's liaison with the community, local organizations and government agencies; staff and/or represent the congressman at events; advise the congressman about local issues; help organize community based meetings and events; implement proactive constituent outreach program; prepare Member for speeches and Meetings; draft correspondence. Supervise field team and district activities.\nThis position may require work hours beyond the normal 8-hour work day and may also include work on weekends and holidays.",
    "responsibilities": [
      "Serves as the congressman's liaison with the community, local organizations and government agencies",
      "Staff and/or represent the congressman at events",
      "Advise the congressman about local issues",
      "Help organize community based meetings and events",
      "Implement proactive constituent outreach program",
      "Prepare Member for speeches and Meetings",
      "Draft correspondence",
      "Supervise field team and district activities"
    ],
    "qualifications": [
      "Strong written, communication, analytical, and organization skills; an ability to relate well with individuals of diverse backgrounds; impeccable customer service manners; and superior public speaking skills.",
      "Prefer four years of experience working directly with the community at large. Supervisorial experience required.",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point.",
      "Bachelor's degree preferred.",
      "Candidate must have a thorough understanding of government agencies and structure (county, state and federal).",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines, balance multiple projects simultaneously and work under pressure. Attention to detail and accuracy is essential.",
      "Candidate should demonstrate a positive attitude, commitment to excellence, upbeat demeanor and flexibility.",
      "Candidate should expect weekend, some holidays, and after-hours assignments."
    ],
    "how_to_apply": "All interested individuals should email or fax a cover letter, resume (including salary history) to: Resume.California@mail.house.gov or fax (213) 481-1429. No phone calls please.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "Resume.California@mail.house.gov",
    "equal_opportunity": null
  }
]