[
  {
    "id": "MEM-332-14",
    "position_title": "Speechwriter",
    "office": "Northeastern progressive Democrat, Senior Member of Democratic Leadership, and Member of the Appropriations Committee",
    "location": null,
    "posting_date": "2014-10-17",
    "description": "The individual will work closely with the legislative staff and communications director and take the lead on crafting speeches and op-ed columns. Candidates must possess excellent and proven writing and organizational skills and the ability to grasp complex policy concepts, think strategically, and multitask effectively under tight deadlines. Applicants must also have command of the legislative process, sound political judgment, and a sense of humor.",
    "responsibilities": [
      "Crafting speeches",
      "Crafting op-ed columns"
    ],
    "qualifications": [
      "Excellent and proven writing skills",
      "Organizational skills",
      "Ability to grasp complex policy concepts",
      "Ability to think strategically",
      "Ability to multitask effectively under tight deadlines",
      "Command of the legislative process",
      "Sound political judgment",
      "Sense of humor"
    ],
    "how_to_apply": "Please send cover letter, resume, and 2-3 writing samples to: ct03speeches@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ct03speeches@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-331-14",
    "position_title": "Professional Staff Member",
    "office": "Republican Committee in the House of Representatives",
    "location": null,
    "posting_date": "2014-10-17",
    "description": "Republican Committee in the House of Representatives seeks candidate with extensive background in health care issues.",
    "responsibilities": [],
    "qualifications": [
      "Congressional experience desired.",
      "Good writing and research skills necessary."
    ],
    "how_to_apply": "Please send resumes to edandworkresumes@mail.house.gov.",
    "salary_info": null,
    "contact": "edandworkresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-325-14",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Republican Congressman",
    "location": "Capitol Hill",
    "posting_date": "2014-10-17",
    "description": "Manage all aspects of constituent correspondence and general day-to-day office operations. Duties will include sorting and tracking incoming mail, emails, and phone calls, and responding to mail using constituent management software to ensure timely responses. In addition, the position is responsible for front office reception duties, answering phone calls, greeting visitors, and other constituent services, such as flag and tour requests.",
    "responsibilities": [
      "Sorting and tracking incoming mail, emails, and phone calls",
      "Responding to mail using constituent management software",
      "Front office reception duties",
      "Answering phone calls",
      "Greeting visitors",
      "Providing other constituent services, such as flag and tour requests"
    ],
    "qualifications": [
      "Strong writing ability",
      "Exceptional organization skills",
      "Attention to detail",
      "Ability to work quickly in a fast paced environment",
      "Previous Capitol Hill experience is required",
      "Proficiency in Fireside and California ties are a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and two one-page writing samples to cagopjobs@gmail.com.",
    "salary_info": null,
    "contact": "cagopjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-321-14",
    "position_title": "Legislative Correspondent",
    "office": "Texas Republican",
    "location": "Washington, DC",
    "posting_date": "2014-10-17",
    "description": "Candidate must be an extremely strong writer, display a high degree of attention to detail, be familiar with digital media trends and be willing to assist on special projects. Primary responsibilities will include processing the incoming mail and assisting our communication team with proof reading, writing and updates to the website and newsletter. Hill experience and knowledge of Fireside is preferred, but not required.",
    "responsibilities": [
      "processing the incoming mail",
      "assisting our communication team with proof reading",
      "writing and updates to the website and newsletter"
    ],
    "qualifications": [
      "extremely strong writer",
      "high degree of attention to detail",
      "familiar with digital media trends",
      "willing to assist on special projects",
      "Hill experience and knowledge of Fireside is preferred, but not required"
    ],
    "how_to_apply": "submit a cover letter and resume to txgopjobs2@gmail.com",
    "salary_info": null,
    "contact": "txgopjobs2@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-318-14",
    "position_title": "Legislative Assistant",
    "office": "Texas Democrat",
    "location": "Hill",
    "posting_date": "2014-10-17",
    "description": "Texas Democrat seeks a hard-working and experienced legislative staffer to handle various legislative areas. A bachelor’s degree with at least 4 years of legislative experience on the Hill is required. Potential candidates should have excellent writing and verbal skills coupled with some knowledge of social media. The ideal candidate will have experience working under pressure, working as part of a team, a sense of humor and the ability to work flexible hours. Experience with iConstituent is a plus, but not required.",
    "responsibilities": [],
    "qualifications": [
      "A bachelor’s degree with at least 4 years of legislative experience on the Hill is required.",
      "Excellent writing and verbal skills",
      "Knowledge of social media",
      "Experience working under pressure",
      "Experience working as part of a team",
      "A sense of humor",
      "The ability to work flexible hours",
      "Experience with iConstituent is a plus, but not required."
    ],
    "how_to_apply": "Please send cover letter, resume and a writing sample to TXResumeInbox@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "TXResumeInbox@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-313-14",
    "position_title": "Analyst for Democratic Staff of Congressional Committee",
    "office": "Congressional committee",
    "location": null,
    "posting_date": "2014-10-17",
    "description": "Congressional committee seeks experienced analyst for health policy portfolio. The job requires strong skills in written and oral communication, policy analysis, and quantitative analysis, as well as the ability to work effectively under tight deadline. The ideal candidate will have several years of experience in federal budgeting, familiarity with the legislative process, background in federal health care policy, and a master’s degree in public policy or related field.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Email resume, two brief writing samples, and cover letter with subject line “analyst position” to Health.Analyst@mail.house.gov – no phone calls or walk-ins.",
    "salary_info": null,
    "contact": "Health.Analyst@mail.house.gov",
    "equal_opportunity": null
  }
]