[
  {
    "id": "MEM-044-18",
    "position_title": "Legislative Director",
    "office": "Southern Democratic Member",
    "location": "D.C.",
    "posting_date": "2018-02-05",
    "description": "This individual is responsible for drafting legislation and amendments, tracking the floor, developing legislative initiatives, staffing committees, and representing the Member in meetings with constituents and interested parties.",
    "responsibilities": [
      "Drafting legislation and amendments",
      "Tracking the floor",
      "Developing legislative initiatives",
      "Staffing committees",
      "Representing the Member in meetings with constituents and interested parties"
    ],
    "qualifications": [
      "Excellent written and verbal communication skills",
      "Ability to work well under pressure in a fast-paced environment",
      "Background in transportation is a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume, and two brief writing samples along with three references to southernhousedem@gmail.com. No drop-ins or phone calls.",
    "salary_info": null,
    "contact": "southernhousedem@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer."
  },
  {
    "id": "MEM-041-18",
    "position_title": "Social Media Manager & Press Assistant",
    "office": "The press office of Rep. Louise Slaughter (NY-25) and the House Rules Committee",
    "location": null,
    "posting_date": "2018-02-05",
    "description": "The press office of Rep. Louise Slaughter (NY-25) and the House Rules Committee is seeking a social media manager & press assistant to join an aggressive communications team. Responsibilities include managing the congresswoman's digital media channels, including website and social media accounts, developing engaging online content, writing e-newsletters, and taking photos and video. The social media manager & press assistant will also compile press clips, copy-edit press releases and talking points, and other projects as necessary. Must be comfortable working collaboratively to execute a broad communications strategy. Prior press and/or digital experience and familiarity with both graphic design and video editing is preferred. Ideal candidates must also have strong written and verbal communications skills and be able to work demanding hours in a fast-paced environment.",
    "responsibilities": [
      "Managing the congresswoman's digital media channels, including website and social media accounts",
      "Developing engaging online content",
      "Writing e-newsletters",
      "Taking photos and video",
      "Compile press clips",
      "Copy-edit press releases and talking points",
      "Other projects as necessary"
    ],
    "qualifications": [
      "Prior press and/or digital experience",
      "Familiarity with both graphic design and video editing",
      "Strong written and verbal communications skills",
      "Able to work demanding hours in a fast-paced environment"
    ],
    "how_to_apply": "Interested candidates must submit a resume, cover letter, two writing samples, and two examples of social media or digital media work to digitalpressposting@mail.house.gov. Candidates will be considered on a rolling basis until the position is filled.",
    "salary_info": null,
    "contact": "digitalpressposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-038-18",
    "position_title": "National Security Professional Staff Member",
    "office": "House Committee on Homeland Security",
    "location": null,
    "posting_date": "2018-02-05",
    "description": "The Majority staff of the House Committee on Homeland Security is currently seeking a National Security Professional Staff Member. This individual would be responsible for working with the Chairman and senior staff to identify and build up significant national security initiatives related to homeland security, counterterrorism and related matters. Other responsibilities include:",
    "responsibilities": [
      "Advancing the Chairman's national security portfolio through written and oral briefings, engagement with outside experts, national security roundtables and events, and assisting with speeches and op-eds.",
      "Identifying and writing significant national security legislation that fits into the broad set of policy goals as defined by Chairman and senior staff.",
      "Helping lead Committee efforts to advance the Chairman's policy vision across multiple platforms.",
      "Assisting with crisis response briefing, including in the wake of terrorist incidents, natural disasters, and other emergency situations."
    ],
    "qualifications": [
      "Previous Hill experience preferred."
    ],
    "how_to_apply": "Qualified applicants should email a resume, 2-3 references, and a writing sample to:",
    "salary_info": null,
    "contact": "resumes.chs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-037-18",
    "position_title": "Professional Staff Member",
    "office": "Committee on Homeland Security Subcommittee on Transportation and Protective Security Majority Staff",
    "location": "Capitol Hill",
    "posting_date": "2018-02-05",
    "description": "The Committee on Homeland Security Subcommittee on Transportation and Protective Security Majority Staff is seeking to fill a vacancy for a Professional Staff Member, who will assist in the Committee’s oversight of the Transportation Security Administration and United States Secret Service.",
    "responsibilities": [],
    "qualifications": [
      "At least three years of Capitol Hill experience in a legislative and/or oversight role.",
      "Specific experience in either transportation security of Secret Service oversight is strongly preferred.",
      "Advanced understanding of the policymaking and legislative processes.",
      "Must be able to hold a Top Secret security clearance."
    ],
    "how_to_apply": "Qualified applicants should email a resume, 2-3 references, and a writing sample to the provided email address. No calls or drop ins.",
    "salary_info": null,
    "contact": "resumes.chs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-032-18",
    "position_title": "Communications Director",
    "office": "Texas Democrat",
    "location": null,
    "posting_date": "2018-02-05",
    "description": "Texas Democrat is seeking an experienced Communications Director to plan and execute a proactive and aggressive media and community outreach strategy. Candidates should have excellent writing skills and work well in a fast-paced collaborative environment. Applicant should also have an extensive social media background. Texas ties and knowledge of TX media and political landscape are a plus and management experience is preferred. This is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [
      "Excellent writing skills",
      "Ability to work well in a fast-paced collaborative environment",
      "Extensive social media background",
      "Texas ties and knowledge of TX media and political landscape are a plus",
      "Management experience is preferred"
    ],
    "how_to_apply": "Qualified applicants should submit a resume, cover letter, and two writing samples, including a press release to TXResumeInbox@mail.house.gov.",
    "salary_info": null,
    "contact": "TXResumeInbox@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-031-18",
    "position_title": "Legislative Correspondent",
    "office": "Congresswoman Michelle Lujan Grisham",
    "location": "Washington, DC",
    "posting_date": "2018-02-05",
    "description": "Congresswoman Michelle Lujan Grisham is seeking a Legislative Correspondent to oversee her mail program. The ideal candidate will be an outstanding writer and editor, have excellent organizational skills as well as high attention to detail, and be able to work quickly under pressure in a fast paced work environment. This is a writing intensive position. Responsibilities include working with the legislative team to understand the Congresswoman's position on different issues, drafting letters to constituents, organizing the constituent correspondence, and sending out mail to constituents in a timely manner. Diverse candidates are encouraged to apply. New Mexico ties, Hill experience, and knowledge of IQ a plus.",
    "responsibilities": [
      "Working with the legislative team to understand the Congresswoman’s position on different issues",
      "Drafting letters to constituents",
      "Organizing the constituent correspondence",
      "Sending out mail to constituents in a timely manner"
    ],
    "qualifications": [
      "Outstanding writer and editor",
      "Excellent organizational skills",
      "High attention to detail",
      "Ability to work quickly under pressure in a fast paced work environment",
      "New Mexico ties (a plus)",
      "Hill experience (a plus)",
      "Knowledge of IQ (a plus)"
    ],
    "how_to_apply": "Interested candidates should submit a cover letter and resume in one attachment to NM01.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": "Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-025-18",
    "position_title": "Legislative Director",
    "office": "Southern member of the House",
    "location": "Hill",
    "posting_date": "2018-02-05",
    "description": "Senior Southern member of the House seeks hardworking, disciplined, experienced and creative attorney to serve as legislative director. Primary responsibilities include developing and implementing the office’s legislative agenda. The candidate will staff the Member on the Judiciary Committee assignments. Additionally, candidates should have significant Hill experience, excellent writing skills, progressive managerial and leadership experience, a good personality and sense of humor, strong organizational skills and knowledge of legislative procedure. LD will work closely with the Chief of Staff and Member. JD required.",
    "responsibilities": [
      "Developing and implementing the office’s legislative agenda",
      "Staff the Member on the Judiciary Committee assignments"
    ],
    "qualifications": [
      "Significant Hill experience",
      "Excellent writing skills",
      "Progressive managerial and leadership experience",
      "Good personality and sense of humor",
      "Strong organizational skills",
      "Knowledge of legislative procedure",
      "JD required"
    ],
    "how_to_apply": "Please send cover letter and resume to:",
    "salary_info": null,
    "contact": "costochj@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-023-18",
    "position_title": "Legislative Director",
    "office": "Rep. Anthony Brown (MD-04)",
    "location": "Washington, DC",
    "posting_date": "2018-02-05",
    "description": "Rep. Anthony Brown (MD-04) seeks hardworking, intellectually curious and creative thinker for Legislative Director position. Primary responsibilities include developing, implementing and successfully advancing the office's legislative agenda while handling policy portfolio in a fast-paced office. Qualified candidates should have significant Hill experience, previous managerial experience, strong organizational skills and knowledge of legislative procedure. If you enjoy working in a fast-paced, multi-tasking, deadline-oriented dynamic environment, then you should apply. JD or advanced degree in policy and Maryland ties are a plus.",
    "responsibilities": [
      "Developing, implementing and successfully advancing the office's legislative agenda",
      "Handling policy portfolio in a fast-paced office"
    ],
    "qualifications": [
      "Significant Hill experience",
      "Previous managerial experience",
      "Strong organizational skills",
      "Knowledge of legislative procedure",
      "JD or advanced degree in policy and Maryland ties are a plus."
    ],
    "how_to_apply": "Please send cover letter and resume to:",
    "salary_info": null,
    "contact": "md.jobposting@mail.house.gov with 'Legislative Director' in the subject line. No calls or walk-ins, please.",
    "equal_opportunity": "Women and minority applicants encouraged to apply."
  },
  {
    "id": "MEM-019-18",
    "position_title": "Deputy Press Secretary/Digital Manager",
    "office": "Maryland Democratic Congressman",
    "location": null,
    "posting_date": "2018-02-05",
    "description": "Responsibilities include managing social media channels and sharpening Congressman's digital voice; planning and pitching press events and responding to press inquiries; compiling press clips and media monitoring; writing press advisories, releases and speeches; updating website; taking photographs and making compelling graphics and multimedia content; and helping to develop and execute overall communication strategies.\n\nIdeal candidate will have strong written and verbal skills, be able to work demanding hours in a fast-paced environment, take initiative and display creativity, work well with a team and multi-task, be detail oriented and organized, and have a positive attitude and a sense of humor. Maryland ties, previous congressional or campaign experience, and photography and graphic design skills preferred.",
    "responsibilities": [
      "Managing social media channels and sharpening Congressman's digital voice",
      "Planning and pitching press events and responding to press inquiries",
      "Compiling press clips and media monitoring",
      "Writing press advisories, releases and speeches",
      "Updating website",
      "Taking photographs and making compelling graphics and multimedia content",
      "Helping to develop and execute overall communication strategies"
    ],
    "qualifications": [
      "Strong written and verbal skills",
      "Ability to work demanding hours in a fast-paced environment",
      "Take initiative and display creativity",
      "Work well with a team and multi-task",
      "Detail oriented and organized",
      "Positive attitude and a sense of humor",
      "Maryland ties (preferred)",
      "Previous congressional or campaign experience (preferred)",
      "Photography and graphic design skills (preferred)"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter describing their fit for the role, resume and if available writing or multimedia samples to md.jobposting@mail.house.gov with “Deputy Press Secretary/Digital Manager” in the subject line. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "md.jobposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-018-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Congresswoman Tulsi Gabbard",
    "location": "Washington D.C.",
    "posting_date": "2018-02-05",
    "description": "The office of Congresswoman Tulsi Gabbard seeks a Scheduler/Executive Assistant with strong organizational, communication, and writing skills.\n\nThis is not an entry level position. The selected applicant will be expected to operate in a fast-paced office and requires dedication and the ability to think outside the box. Opportunities to assist in other legislative areas are also available. Non-traditional work hours, occasional travel are required. Veteran applications are welcome!",
    "responsibilities": [
      "Maintaining the Member’s schedule for the Washington D.C. office",
      "Organizing, evaluating and tracking invitations and scheduling requests",
      "Coordinating travel arrangements",
      "Coordinating/drafting the Member’s personal correspondence",
      "Arranging and/or providing surface transportation for the Member in DC",
      "Coordinating with staff",
      "Other tasks as assigned by the Chief of Staff"
    ],
    "qualifications": [
      "Strong organizational, communication, and writing skills",
      "Can-do attitude",
      "High attention to detail",
      "Solution oriented",
      "Independent worker",
      "Self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment"
    ],
    "how_to_apply": "Please do not call or drop by to the office, qualified applicants may email a cover letter, resume and two writing samples with “Scheduler” in the email title to: hi02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-18",
    "position_title": "Constituent Engagement Officer (CEO)",
    "office": "Maryland Democratic Congressman",
    "location": "DC suburbs",
    "posting_date": "2018-02-05",
    "description": "Maryland Democratic Congressman looking for Constituent Engagement Officer (CEO) to serve as the grassroots extension of the member in his district located in the DC suburbs. They are his “eye and ears” for issues on the ground. They are a consistent presence at events in the district, develops and maintains relationships with local government officials and community leaders. They always reflect well on the member with their responsiveness, professionalism and courteousness. CEOs also provide excellent constituent service through the management of casework in assigned issue areas and work with federal and local agencies to ensure constituents receive a response to their inquiry. They may also be assigned to short-term or special projects, including planning events, authoring correspondence and other related duties. CEOs are hard-working and dedicated team players, committed to the goals of the office and to improving the lives of the residents of the district.",
    "responsibilities": [
      "to serve as a local representative for the member in defined geographic areas, which are subject to change based on the needs of the office;",
      "to manage casework within an assigned portfolio;",
      "to monitor and update the Member and District Director on district and local issues;"
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should submit their resume as soon as possible to md.jobposting@mail.house.gov. Applications are accepted on a rolling basis.",
    "salary_info": null,
    "contact": "md.jobposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-014-18",
    "position_title": "Press Assistant",
    "office": "Southern California Democrat",
    "location": null,
    "posting_date": "2018-02-05",
    "description": "Southern California Democrat is seeking a Press Assistant to work closely\nwith the Communications Director to elevate the Member's communications\noperation.",
    "responsibilities": [
      "compiling daily press clips",
      "monitoring social media",
      "producing graphics and videos",
      "maintaining the website",
      "managing press lists",
      "meticulously proofreading",
      "drafting/fact-checking written materials, including briefing memos, social media posts, press statements, newsletters, and talking points"
    ],
    "qualifications": [
      "organized",
      "detail-oriented",
      "have superior writing and proofreading skills",
      "be able to work long hours in a fast-paced and demanding setting",
      "exhibit situational awareness and discretion",
      "have the ability to multi-task without sacrificing quality",
      "work well with a team",
      "be proactive yet humble",
      "have a sense of humor",
      "Spanish fluency",
      "Southern California ties",
      "previous congressional or campaign experience",
      "photography/videography/graphic design skills preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter describing their fit for the\nrole, resume, short writing sample, and if available, graphic/video samples, to\nCA26PressJob@gmail.com with just “Press Assistant\" in the subject line. No\nphone calls, faxes, or drop-ins, please.",
    "salary_info": null,
    "contact": "CA26PressJob@gmail.com",
    "equal_opportunity": null
  }
]