[
  {
    "id": "MEM-303-15",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Republican Congressman",
    "location": null,
    "posting_date": "2015-10-05",
    "description": "Republican Congressman seeks Staff Assistant/Legislative Correspondent, with an interest communications and press, to manage all aspects of constituent correspondence and general day-to-day office operations.\n\nDuties will include sorting and tracking incoming mail, emails, and phone calls, and responding to mail in a timely manner, as well as assisting Communications Director when needed. In addition, the position is responsible for front office reception duties, answering phone calls, greeting visitors, and other constituent services. Successful candidates must demonstrate strong writing ability, exceptional organization skills, attention to detail and must be able to work quickly in a fast paced environment.\n\nProficiency in Fireside and California ties are a plus.",
    "responsibilities": [
      "Sorting and tracking incoming mail, emails, and phone calls",
      "Responding to mail in a timely manner",
      "Assisting Communications Director when needed",
      "Front office reception duties",
      "Answering phone calls",
      "Greeting visitors",
      "Other constituent services"
    ],
    "qualifications": [
      "Strong writing ability",
      "Exceptional organization skills",
      "Attention to detail",
      "Ability to work quickly in a fast paced environment",
      "Proficiency in Fireside (a plus)",
      "California ties (a plus)"
    ],
    "how_to_apply": "Please send resume and cover letter to cagopjobs@gmail.com.",
    "salary_info": null,
    "contact": "cagopjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-302-15",
    "position_title": "District Representative",
    "office": "Congresswoman Norma J. Torres",
    "location": "Ontario, CA District Office",
    "posting_date": "2015-10-05",
    "description": "The District Representative will act as a liaison between constituent groups and Congresswoman Torres, in addition to initiating community outreach projects. The District Representative will respond to in-person, written and telephone inquiries from constituents, as well as make legislative and ceremonial presentations on behalf of Congresswoman Torres. The District Representative will also maintain an awareness and involvement in district affairs, representing the Congresswoman at public events in the district. In addition, the District Representative will work with the Press Secretary to maintain Congresswoman Torres' social media accounts.",
    "responsibilities": [],
    "qualifications": [
      "Strong public speaking skills",
      "Flexible schedule; the ability to attend early morning, evening and weekend events",
      "The ability to handle difficult situations with courtesy, tact and compassion",
      "Strong writing skills",
      "Problem solving abilities",
      "The ability to exercise a high degree of initiative",
      "The ability to work independently and use good judgment",
      "The ability to maintain confidentiality",
      "Knowledge of the cities, communities and issues of concern to the 35th Congressional District"
    ],
    "how_to_apply": "Qualified candidates should send a cover letter and resume to caldemresumes@gmail.com with “District Representative” in the subject. No phone calls please.",
    "salary_info": null,
    "contact": "caldemresumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-292-15",
    "position_title": "Communications Director",
    "office": "Progressive Tennessee Member",
    "location": "DC",
    "posting_date": "2015-10-05",
    "description": "Progressive Tennessee Member seeks experienced, media-savvy, proactive Communications Director to manage a fast-paced communications operation. Responsibilities include developing and implementing a coordinated and strategic communications plan; identifying emerging press opportunities; writing press releases, talking points, speeches and op-eds; pitching stories and responding to press inquiries; booking interviews on radio and television; scheduling and organizing press events; managing congressional website, Facebook and Twitter accounts; producing a comprehensive weekly e-newsletter and regular print mailings to constituents; and fostering strong relationships with reporters to secure local and national coverage of the member's work.\n\nMust work closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively. Additionally, CD will be responsible for portions of the office's mail operation. Strong political judgment, good sense of humor and ability to work under short deadlines in a rapidly changing environment is required. Must be comfortable with and show good judgment speaking on the record with press. Ideal candidate will have an existing network of press contacts, strong writing skills, political savvy and ability to strategically connect DC policy with district press opportunities.\n\nIdeal candidate will have at least 3 years' experience in media relations or in journalism. Hill experience and Tennessee ties are a plus, as are knowledge of Judiciary and Transportation issues.",
    "responsibilities": [
      "Developing and implementing a coordinated and strategic communications plan",
      "Identifying emerging press opportunities",
      "Writing press releases, talking points, speeches and op-eds",
      "Pitching stories and responding to press inquiries",
      "Booking interviews on radio and television",
      "Scheduling and organizing press events",
      "Managing congressional website, Facebook and Twitter accounts",
      "Producing a comprehensive weekly e-newsletter and regular print mailings to constituents",
      "Fostering strong relationships with reporters to secure local and national coverage of the member's work"
    ],
    "qualifications": [
      "At least 3 years’ experience in media relations or in journalism",
      "Hill experience and Tennessee ties are a plus",
      "Knowledge of Judiciary and Transportation issues"
    ],
    "how_to_apply": "Interested parties should send a cover letter, resume and 2 writing samples to cohen.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "cohen.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-285-15",
    "position_title": "Staff Assistant",
    "office": "Senior California Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2015-10-05",
    "description": "Responsibilities include greeting visitors, answering the telephone, scheduling tours and responding to constituent requests for general information and other inquiries. This position also monitors delivery and pickup of materials, maintains the front office, and assists with various administrative duties. The Staff Assistant must maintain a good relationship with the Member, staff and constituents, accept performance based criticism and direction, and work well under pressure. The applicant must be prepared to work a flexible schedule. A valid Driver's License is required. Salary is commensurate with experience. Previous hill experience preferred but not required.",
    "responsibilities": [
      "Greeting visitors",
      "Answering the telephone",
      "Scheduling tours",
      "Responding to constituent requests for general information and other inquiries",
      "Monitoring delivery and pickup of materials",
      "Maintaining the front office",
      "Assisting with various administrative duties",
      "Maintaining a good relationship with the Member, staff and constituents",
      "Accepting performance based criticism and direction",
      "Working well under pressure",
      "Prepared to work a flexible schedule"
    ],
    "qualifications": [
      "Valid Driver's License is required",
      "Previous hill experience preferred but not required"
    ],
    "how_to_apply": "Please send cover letter and resume to CapHillPositions@gmail.com. No phones or drop-ins please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CapHillPositions@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-284-15",
    "position_title": "Office Administrator/Assistant Scheduler",
    "office": "Senior Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2015-10-05",
    "description": "The Office Administrator/Assistant Scheduler will work closely with the Scheduler to manage and prepare the Member’s schedule, respond to scheduling requests and proactively arrange meetings, arrange the Member’s travel, coordinate with district staff, assist with office budgeting and maintain various administrative demands.",
    "responsibilities": [
      "Manage and prepare the Member’s schedule",
      "Respond to scheduling requests and proactively arrange meetings",
      "Arrange the Member’s travel",
      "Coordinate with district staff",
      "Assist with office budgeting",
      "Maintain various administrative demands"
    ],
    "qualifications": [
      "Office/administrative experience",
      "Knowledge of the Congressional work setting",
      "Ability to juggle multiple demands under pressure",
      "Previous Capitol Hill experience preferred but not required",
      "A valid Driver’s License is required"
    ],
    "how_to_apply": "Please send cover letter and resume to CapHillGigs@yahoo.com. No phones or drop-ins please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CapHillGigs@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-276-15",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Colorado Republican",
    "location": "Washington, DC",
    "posting_date": "2015-10-05",
    "description": "Responsibilities include: management of constituent mail and social media accounts; execution of 499 program; drafting op-eds, press releases, and talking points; coordinating media efforts; and working directly with the Communications Director. Applicants should be able to write quickly and effectively in a fast paced environment. Colorado ties and Hill experience a plus.",
    "responsibilities": [
      "Management of constituent mail and social media accounts",
      "Execution of 499 program",
      "Drafting op-eds, press releases, and talking points",
      "Coordinating media efforts",
      "Working directly with the Communications Director"
    ],
    "qualifications": [
      "Ability to write quickly and effectively in a fast paced environment",
      "Colorado ties a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Please send a cover letter, writing sample, and resume to ColoradoRepublican06@gmail.com.",
    "salary_info": null,
    "contact": "ColoradoRepublican06@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-273-15",
    "position_title": "Legislative Director",
    "office": "Senior Member of Congress from the southern US",
    "location": "Washington, DC",
    "posting_date": "2015-10-05",
    "description": "Incumbent will be responsible for driving member legislative initiatives, briefing the member and Chief of Staff on all policy matters, meetings with relevant public interest groups and constituents, providing real time vote recommendations, and assisting the Chief of Staff on policy matters.\n\nPosition requires a comprehensive knowledge of House procedures as well as a working knowledge of all current issues debated in the House.",
    "responsibilities": [
      "Driving member legislative initiatives",
      "Briefing the member and Chief of Staff on all policy matters",
      "Meetings with relevant public interest groups and constituents",
      "Providing real time vote recommendations",
      "Assisting the Chief of Staff on policy matters"
    ],
    "qualifications": [
      "Comprehensive knowledge of House procedures",
      "Working knowledge of all current issues debated in the House",
      "Team-oriented skill",
      "Outgoing personality",
      "Sense of humor",
      "Strong written and oral communication and analytical skills",
      "Attention to detail",
      "Management skills"
    ],
    "how_to_apply": "Send a cover letter, resume, 2 writing samples, and salary requirements to HouseStaffOpening@gmail.com.",
    "salary_info": null,
    "contact": "HouseStaffOpening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-265-15",
    "position_title": "Legislative Assistant",
    "office": "Democratic Member",
    "location": null,
    "posting_date": "2015-10-05",
    "description": "Democratic Member has an opening for a Legislative Assistant to handle a portfolio of judiciary issues and health care, among other issues. Responsibilities will include developing and tracking legislative initiatives, preparing briefing materials, representing the member in meetings with interested parties, and writing constituent mail and floor statements. An ability to work well with others in a fast-paced team environment and strong writing skills, as well as a sense of humor, are a must.\nThe ideal candidate will have a law degree, previous Hill experience, and ties to Maryland.",
    "responsibilities": [
      "Developing and tracking legislative initiatives",
      "Preparing briefing materials",
      "Representing the member in meetings with interested parties",
      "Writing constituent mail and floor statements"
    ],
    "qualifications": [
      "An ability to work well with others in a fast-paced team environment",
      "Strong writing skills",
      "A sense of humor",
      "Law degree (ideal)",
      "Previous Hill experience (ideal)",
      "Ties to Maryland (ideal)"
    ],
    "how_to_apply": "Please send cover letter with salary expectations, resume, two short writing samples, and a list of references with subject line “Legislative Assistant” to 4mdresumes@mail.house.gov. No calls or drop bys, please.",
    "salary_info": null,
    "contact": "4mdresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-261-15",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Colorado Republican",
    "location": "Washington, DC",
    "posting_date": "2015-10-05",
    "description": "Responsibilities include: management of constituent mail and social media accounts; execution of 499 program; drafting op-eds, press releases, and talking points; coordinating media efforts; and working directly with the Communications Director. Applicants should be able to write quickly and effectively in a fast paced environment. Colorado ties and Hill experience a plus.",
    "responsibilities": [
      "Management of constituent mail and social media accounts",
      "Execution of 499 program",
      "Drafting op-eds, press releases, and talking points",
      "Coordinating media efforts",
      "Working directly with the Communications Director"
    ],
    "qualifications": [
      "Ability to write quickly and effectively in a fast paced environment",
      "Colorado ties a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Please send a cover letter, writing sample, and resume to ColoradoRepublican06@gmail.com.",
    "salary_info": null,
    "contact": "ColoradoRepublican06@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-249-15",
    "position_title": "Legislative Assistant",
    "office": "Texas Democrat",
    "location": "Hill",
    "posting_date": "2015-10-05",
    "description": "Active Texas Democrat seeking enthusiastic, well-organized Legislative Assistant in a fast-paced team-oriented office. Applicant must be able to multi-task, have strong work ethic and the ability to work flexible hours. Ideal candidate should have at least 1-2 years of Hill legislative experience coupled with some knowledge of finance and healthcare policy. This is NOT an entry-level position. Individual interested in this position must have strong written and oral communication skills and the ability to work under pressure to meet deadlines.\n\nJob description includes assisting the Legislative Director/Deputy Chief of Staff in managing the Congressman’s legislative agenda, drafting talking points, floor statements, Congressional Record entries, briefing memos, hearing questions as well as representing the Congressman at meetings both on and off the hill and in the district.\n\nTexas ties are a plus.",
    "responsibilities": [
      "Assisting the Legislative Director/Deputy Chief of Staff in managing the Congressman’s legislative agenda",
      "Drafting talking points",
      "Drafting floor statements",
      "Drafting Congressional Record entries",
      "Drafting briefing memos",
      "Drafting hearing questions",
      "Representing the Congressman at meetings both on and off the hill and in the district"
    ],
    "qualifications": [
      "Must be able to multi-task",
      "Must have strong work ethic",
      "Must have the ability to work flexible hours",
      "At least 1-2 years of Hill legislative experience",
      "Knowledge of finance and healthcare policy",
      "Strong written and oral communication skills",
      "Ability to work under pressure to meet deadlines"
    ],
    "how_to_apply": "Please e-mail resume and cover letter to TXLegislativeAssistant@Mail.House.Gov. NO PHONE CALLS OR DROP-BYS PLEASE.",
    "salary_info": null,
    "contact": "TXLegislativeAssistant@Mail.House.Gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-248-15",
    "position_title": "Scheduler",
    "office": "Republican Member",
    "location": "Capitol Hill",
    "posting_date": "2015-10-05",
    "description": "The scheduler will work closely with the Chief of Staff to manage and prepare the Member's schedule, respond to scheduling requests and proactively arrange meetings, arrange the Member's travel, coordinate with district staff, and maintain administrative demands. This is not an entry level position.",
    "responsibilities": [
      "Manage and prepare the Member's schedule",
      "Respond to scheduling requests",
      "Proactively arrange meetings",
      "Arrange the Member's travel",
      "Coordinate with district staff",
      "Maintain administrative demands"
    ],
    "qualifications": [
      "At least one year of Capitol Hill scheduling experience",
      "Knowledge of the Congressional work setting",
      "Ability to juggle multiple demands under pressure",
      "Maturity, confidentiality, and discretion are essential",
      "Owning or having consistent access to a car is preferred",
      "Ties to the Northeast"
    ],
    "how_to_apply": "POC for resumes submission: Matt.Hutson@mail.house.gov.",
    "salary_info": null,
    "contact": "Matt.Hutson@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-245-15",
    "position_title": "Legislative Director",
    "office": "West Coast Democrat",
    "location": null,
    "posting_date": "2015-10-05",
    "description": "West Coast Democrat is seeking highly organized, hard-working legislative\ndirector with extensive knowledge of the legislative process and House\nRules. Applicants must have LD experience or a minimum of 3 years Senior\nLA experience and demonstrate an ability to manage and mentor staff, think\nstrategically, develop and implement legislative plans and achieve results.\nA successful candidate will have excellent writing, analytical, and oral\ncommunications skills along with a good sense of humor.",
    "responsibilities": [],
    "qualifications": [
      "LD experience or a minimum of 3 years Senior LA experience",
      "Ability to manage and mentor staff",
      "Ability to think strategically",
      "Ability to develop and implement legislative plans",
      "Ability to achieve results",
      "Excellent writing skills",
      "Excellent analytical skills",
      "Excellent oral communications skills",
      "Good sense of humor"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume and two short writing samples to westcoastdem2015@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "westcoastdem2015@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-221-15",
    "position_title": "Staff Assistant",
    "office": "Tennessee Democratic Congressman",
    "location": "Washington, D.C.",
    "posting_date": "2015-10-05",
    "description": "Duties will include managing front desk, greeting visitors, answering telephones, conducting and organizing tours, processing flag requests, assisting the D.C. staff on various projects, maintaining office equipment and supplies, writing member’s correspondence, and serving as intern coordinator.",
    "responsibilities": [
      "Managing front desk",
      "Greeting visitors",
      "Answering telephones",
      "Conducting and organizing tours",
      "Processing flag requests",
      "Assisting the D.C. staff on various projects",
      "Maintaining office equipment and supplies",
      "Writing member’s correspondence",
      "Serving as intern coordinator"
    ],
    "qualifications": [
      "Extraordinary organizational skills",
      "Outstanding time management skills",
      "Excellent writing skills",
      "Superlative communications skills",
      "Familiarity with the Microsoft Office Suite",
      "A positive attitude",
      "A sense of humor"
    ],
    "how_to_apply": "Please e-mail cover letter and resume to cohen.jobs@mail.house.gov. Absolutely no phone calls, e-mails or walk-ins, please.",
    "salary_info": null,
    "contact": "cohen.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-213-15",
    "position_title": "Legislative Correspondent",
    "office": "Northern California Democrat",
    "location": "Washington, DC",
    "posting_date": "2015-10-05",
    "description": "Primary responsibilities include coordinating an active mail program with quick response time, researching legislative issues, and drafting responses to constituent inquires.",
    "responsibilities": [
      "Coordinating an active mail program with quick response time",
      "Researching legislative issues",
      "Drafting responses to constituent inquires"
    ],
    "qualifications": [
      "Excellent organizational and written skills",
      "Ability to work well as part of a team",
      "Previous Hill experience is preferred"
    ],
    "how_to_apply": "Please send a cover letter, resume, and two recent writing samples to CADemocratResumes@gmail.com.",
    "salary_info": null,
    "contact": "CADemocratResumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-207-15",
    "position_title": "Legislative Assistant",
    "office": "Conservative Texan",
    "location": "Washington, DC",
    "posting_date": "2015-10-05",
    "description": "Legislative responsibilities will include, but are not limited to, Agriculture, Energy, Taxes, Judiciary, Environment, and Veterans issues, as well as, drafting memos and providing voting recommendations.",
    "responsibilities": [
      "Agriculture",
      "Energy",
      "Taxes",
      "Judiciary",
      "Environment",
      "Veterans issues",
      "Drafting memos",
      "Providing voting recommendations"
    ],
    "qualifications": [
      "Strong writing and organizational skills",
      "Capitol Hill experience and Texas ties are strongly preferred"
    ],
    "how_to_apply": "All prospective applicants can email cover letter, resume, and writing sample to TXGOPJob@gmail.com.",
    "salary_info": null,
    "contact": "TXGOPJob@gmail.com",
    "equal_opportunity": null
  }
]