[
  {
    "id": "MEM-185-22",
    "position_title": "Digital Resident",
    "office": "House Democratic Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "The House Democratic Caucus is seeking a motivated, detail-oriented Digital Resident to work full-time in a fast-paced leadership office. Resident will be primarily responsible for assisting with the execution of digital campaigns and creating content for various social media platforms.\n\nThe residency program will also include an educational work component in which residents will attend and manage hybrid congressional events, conduct research, draft internal documents and participate in professional development sessions. Proficiency with social media platforms, graphic design, video editing software and other creative design programs (Adobe Creative Cloud, Canva, etc.) is required.\n\nIdeal applicants will have a professional and positive attitude, a demonstrated knowledge of House Democrats, proactive problem-solving abilities and strong writing skills. The term of this paid residency will be from May 2022 to September 2022. Applicants must be able to work full-time (40 hours per week) in-person in Washington, D.C. and may occasionally be asked to work additional morning/evening hours.",
    "responsibilities": [
      "Assisting with the execution of digital campaigns",
      "Creating content for various social media platforms",
      "Attend and manage hybrid congressional events",
      "Conduct research",
      "Draft internal documents",
      "Participate in professional development sessions"
    ],
    "qualifications": [
      "Proficiency with social media platforms, graphic design, video editing software and other creative design programs (Adobe Creative Cloud, Canva, etc.)",
      "Professional and positive attitude",
      "Demonstrated knowledge of House Democrats",
      "Proactive problem-solving abilities",
      "Strong writing skills",
      "Ability to work full-time (40 hours per week) in-person in Washington, D.C.",
      "Ability to work additional morning/evening hours"
    ],
    "how_to_apply": "Applicants should send one PDF file including their resume, cover letter, digital portfolio/samples along with three professional references to CaucusInternResume@mail.house.gov with the subject line “APPLICANT NAME Summer 2022 Digital Residency Application.”",
    "salary_info": null,
    "contact": "CaucusInternResume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQIA+ individuals, veterans and those with disabilities are encouraged to apply."
  },
  {
    "id": "MEM-184-22",
    "position_title": "District Office Outreach Coordinator",
    "office": "Member of Congress",
    "location": "Maryland 7th Congressional District",
    "posting_date": "2022-04-04",
    "description": "Field Representatives play a critical forward-facing role in the Member's district office. Their responsibilities include serving as the Member's community representative. This includes monitoring and updating the Member and District Director on important local issues, emerging trends, and critical developments. They work with Constituent Service Director and the broader field team to ensure effective communication with constituents.",
    "responsibilities": [
      "Builds and maintains relationships with identified constituents and key community leaders and stakeholders",
      "Maintains and manages the Engagement Database",
      "Ensures outreach efforts align with the Member's strategic vision and goals",
      "Serves as a representative for the Member on boards and commissions as determined by the District Director",
      "Coordinates closely with the District Director and D.C. staff to ensure district priorities are reflective in legislative priorities",
      "Informs the District Director and the Member on up-and-coming issues in the district"
    ],
    "qualifications": [
      "At least a bachelor's degree in Government Affairs, Business, Social Work, or related field OR in lieu of a Bachelor's degree, 3-5 years of relevant work experience.",
      "A demonstrated interest in public service",
      "Familiarity with Maryland 7th Congressional District",
      "Expertise in developing and maintaining relationships with constituents and community leaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong decision-making skills",
      "Strong written and verbal communication skills, including public speaking skills",
      "Work is mainly performed in an office environment. Noise levels are usually moderate",
      "Ability to work in a small workstation without an expectation of privacy",
      "Frequent In-District travel"
    ],
    "how_to_apply": "Applicants should submit resumes to md07resumes@mail.house.gov",
    "salary_info": null,
    "contact": "md07resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-183-22",
    "position_title": "District Office Constituent Service Representative",
    "office": "District Office",
    "location": "District Office",
    "posting_date": "2022-04-04",
    "description": "The District Office Caseworker acts a constituent liaison for the Member. This position also monitors and updates the Member and District Director on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Member and constituents and answers casework correspondence and verbal communications with constituents.",
    "responsibilities": [
      "Handles a dedicated portfolio of casework assignments;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Acts as the representative for the Member within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Acts as a liaison to local, state, and federal officials and other persons or groups to form effective relationships for the Member;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Legislative Director.",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Trains and supervises Staff Assistants, including interns, to handle office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework;",
      "Prepares periodic reports for the District Director on pending cases and district activities in his or her assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Accepts performance-based criticism and direction;",
      "Meets attendance requirements as established by the office;",
      "Works under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights, and weekends;",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Strong oral and written communication skills;",
      "Strong knowledge of local, state, and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone manner;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office computer applications;",
      "Proficiency in word processing."
    ],
    "how_to_apply": "Applicants should submit resumes to md07resumes@mail.house.gov",
    "salary_info": null,
    "contact": "md07resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-182-22",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives.\n\nThis is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives."
    ],
    "qualifications": [
      "Outstanding analytical skills",
      "Written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:",
      "Government ethics",
      "Campaign finance",
      "Criminal law",
      "Employment law, including the laws governing sexual harassment in the workplace",
      "Civil litigation",
      "Administrative investigations and adjudications",
      "Depositions",
      "Financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-180-22",
    "position_title": "Staff Assistant/Press Assistant",
    "office": "Democratic Congressman",
    "location": null,
    "posting_date": "2022-04-04",
    "description": "Staff Assistant responsibilities include: answering phones, greeting visitors when the office reopens, managing tour and flag requests, sorting/batching correspondence, drafting letters and providing administrative and legislative support as needed.\n\nPress Assistant responsibilities include: compiling press clips, drafting/monitoring social media posts, designing graphics and web content and other press duties as assigned. Applicants must have strong writing skills and be a detail oriented team player. Maryland ties and knowledge of Intertrac or IQ are a plus.",
    "responsibilities": [
      "Answering phones",
      "Greeting visitors when the office reopens",
      "Managing tour and flag requests",
      "Sorting/batching correspondence",
      "Drafting letters",
      "Providing administrative and legislative support as needed",
      "Compiling press clips",
      "Drafting/monitoring social media posts",
      "Designing graphics and web content",
      "Other press duties as assigned"
    ],
    "qualifications": [
      "Strong writing skills",
      "Detail oriented team player",
      "Maryland ties a plus",
      "Knowledge of Intertrac or IQ a plus"
    ],
    "how_to_apply": "Interested applicants should e-mail 1) a resume, 2) a cover letter, and 3) two brief writing samples to employment@mail.house.gov with the subject “Staff Assistant/Press Assistant: LAST NAME.”",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Women, veterans, people of color, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-179-22",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Honolulu district office",
    "posting_date": "2022-04-04",
    "description": "Duties include but are not limited to greeting visitors and answering constituent calls and requests for general information, tours and other inquiries. This position also is responsible for a wide variety of administrative duties and acts as a liaison to the federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues.\n\nDirect report to the Deputy Chief of Staff in the Honolulu office, although the position also interacts directly with the Congressman and his Washington, D.C. office.",
    "responsibilities": [
      "Greeting visitors",
      "Answering constituent calls and requests for general information, tours and other inquiries",
      "Responsible for a wide variety of administrative duties",
      "Acts as a liaison to the federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues."
    ],
    "qualifications": [
      "Prior experience, especially in comparable duties",
      "Hawai'i background/community involvement",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Work independently and effectively under pressure",
      "Make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Long and unpredictable hours"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-177-22",
    "position_title": "Staff Assistant/Digital Assistant",
    "office": "Office of Congressman Mark Takano",
    "location": "Riverside District Office",
    "posting_date": "2022-04-04",
    "description": "As Staff Assistant, this person will provide administrative support to the District Director, recruit and manage the office interns, greet visitors, answer phones, respond to constituent requests for services including casework claims, and staff the Congressman at events, some of which will be during the evening or weekend.\n\nAs Digital Assistant, they will help maintain the office's digital media presence, draft content, design graphics and edit video. An ideal candidate will have experience with graphic design software and video editing.",
    "responsibilities": [
      "Provide administrative support to the District Director",
      "Recruit and manage the office interns",
      "Greet visitors",
      "Answer phones",
      "Respond to constituent requests for services including casework claims",
      "Staff the Congressman at events, some of which will be during the evening or weekend",
      "Maintain the office's digital media presence",
      "Draft content",
      "Design graphics",
      "Edit video"
    ],
    "qualifications": [
      "Experience with graphic design software and video editing."
    ],
    "how_to_apply": "To apply, please send a resume to CA41.Jobs@mail.house.gov",
    "salary_info": "$42,000 to $50,000 commensurate with experience.",
    "contact": "CA41.Jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Mark Takano is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, religion, sex, national origin, age, disability, sexual orientation or gender identity."
  },
  {
    "id": "MEM-176-22",
    "position_title": "Press Secretary",
    "office": "House Judiciary Committee Democratic Staff",
    "location": null,
    "posting_date": "2022-04-04",
    "description": "The House Judiciary Committee Democratic Staff seeks a motivated and hardworking communications professional to join a fast-paced communications team to help manage communications for the full committee and subcommittees.\n\nResponsibilities include drafting communications materials (news releases, statements, talking points, etc.); managing public notices for the Committee and Subcommittee’s work, helping with press inquiries; maintaining media directories of reporters who cover the committee; and coordinating with the Committee’s communications team and staff of committee members.",
    "responsibilities": [
      "Drafting communications materials (news releases, statements, talking points, etc.)",
      "Managing public notices for the Committee and Subcommittee’s work",
      "Helping with press inquiries",
      "Maintaining media directories of reporters who cover the committee",
      "Coordinating with the Committee’s communications team and staff of committee members"
    ],
    "qualifications": [
      "Excellent written and oral communication skills",
      "The ability to comprehend and summarize complex legislation quickly",
      "A proven ability to perform under pressure while juggling multiple tasks",
      "Sound political judgment",
      "At least 2 years of relevant experience",
      "Prior Hill or campaign experience, as well as familiarity with judiciary issues is preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and three writing samples to Job.Jdem@mail.house.gov. Please include “Press Secretary” in the subject line.",
    "salary_info": null,
    "contact": "Job.Jdem@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-173-22",
    "position_title": "Field Representative/ Caseworker",
    "office": "Congressman Ruben Gallego (AZ-07)",
    "location": "Phoenix District Office",
    "posting_date": "2022-04-04",
    "description": "Responsibilities include, but are not limited to: establishing and maintaining relationships with local organizations, businesses and community leaders on behalf of the Congressman; monitoring District and local issues; acting as liaison to federal agencies; handling casework; managing special projects; and assisting with events and other activities as assigned.\n\nTravel throughout the district is required, thus the candidate must have a valid driver’s license, reliable transportation, and appropriate automobile insurance.\n\nThe Field Representative/ Caseworker must be a dedicated, hard-working, team player. Prior experience in government, the nonprofit sector, community or grassroots organizing is preferred.",
    "responsibilities": [
      "Establishing and maintaining relationships with local organizations, businesses and community leaders on behalf of the Congressman",
      "Monitoring District and local issues",
      "Acting as liaison to federal agencies",
      "Handling casework",
      "Managing special projects",
      "Assisting with events and other activities as assigned"
    ],
    "qualifications": [
      "Dedicated, hard-working, team player",
      "Prior experience in government, the nonprofit sector, community or grassroots organizing is preferred",
      "Service-oriented attitude",
      "Strong organizational skills",
      "Proficiency at prioritizing and managing multiple projects at one time",
      "Capacity to work both independently and as part of a team",
      "Strong written and oral communications skills",
      "Working knowledge of Arizona’s 7th Congressional District is preferred",
      "Spanish speaking and writing skills are a plus"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and a list of three references to: lynn.cordova@mail.house.gov.",
    "salary_info": null,
    "contact": "lynn.cordova@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. We do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-172-22",
    "position_title": "Digital Assistant",
    "office": "Rep. Kathy Castor (FL-14)",
    "location": "Tampa district office",
    "posting_date": "2022-04-04",
    "description": "Ideal candidates are team-oriented, self-motivated, and resourceful. Successful applicants will write well, be proficient in graphic design and video production, able to work under deadline, proactive and a strategic thinker who works well with others.\n\nThis staff position reports to the DC-based Communications Director.",
    "responsibilities": [
      "Create weekly social media plans in collaboration with Communications Director",
      "Create graphics for social media, newsletters, visual presentations and mail that effectively communicate an idea or policy clearly",
      "Manage livestreaming, photography and videography at district events",
      "Oversee regular updates to the Congresswoman’s website",
      "Monitor social media and media reports regarding legislative, national and local issues",
      "Produce video content to share on social media and with local stakeholders",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Proficiency in Adobe Creative Suite, Canva or other design programs required",
      "Candidates with ties to Florida are strongly encouraged to apply",
      "Spanish language proficiency is a plus but not required"
    ],
    "how_to_apply": "Email cover letter, resume, one writing sample, two graphic design samples, and 2-3 references to FLDem.Resume@gmail.com with the subject line “[Last Name, First Name] Digital Assistant.” Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "FLDem.Resume@gmail.com",
    "equal_opportunity": "The Office of Congresswoman Kathy Castor is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, religion, sex, national origin, age, disability, sexual orientation or gender identity. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community. Newly graduated college students with an interest in public service are encouraged to apply."
  },
  {
    "id": "MEM-171-22",
    "position_title": "Staff Assistant",
    "office": "Congressman Adam Smith (WA-09)",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "The Staff Assistant runs the front office of the Congressman’s D.C. Office and supports office operations. Primary duties include answering incoming calls, greeting visitors to the D.C. office, processing tour, flag, and other constituent requests, and administrative duties related to running the office.\n\nThe Staff Assistant will also assist the Legislative Correspondent with the constituent mail program, including processing and sorting incoming messages in Intranet Quorum (IQ).",
    "responsibilities": [
      "Answering incoming calls",
      "Greeting visitors to the D.C. office",
      "Processing tour, flag, and other constituent requests",
      "Administrative duties related to running the office",
      "Assisting the Legislative Correspondent with the constituent mail program",
      "Processing and sorting incoming messages in Intranet Quorum (IQ)"
    ],
    "qualifications": [
      "Excellent organizational and time-management skills",
      "Strong customer service skills, particularly for telephone and in-person conversations with constituents",
      "Ability to work cooperatively in a fast-paced environment"
    ],
    "how_to_apply": "Applicants must submit a cover letter and resume to WA09.jobs@mail.house.gov by April 8th with “Staff Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": "Salary range is $50k+, dependent on qualifications and experience, with Federal employee benefits including the student loan repayment program.",
    "contact": "WA09.jobs@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-170-22",
    "position_title": "DIGITAL DIRECTOR/PRESS SECRETARY",
    "office": "OFFICE OF CONGRESSMAN MONDAIRE JONES",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "Mondaire Jones is the 34-year-old Congressman from New York's 17th District, serving Rockland and Westchester Counties. He serves on the House Judiciary, Education and Labor, and Ethics Committees and is the first openly gay, Black member of Congress.\n\nHe also serves as Freshman Representative to Leadership, the youngest member of the Democratic House leadership team, Deputy Whip of the Congressional Progressive Caucus, and Co-Chair of the LGBTQ Equality Caucus. A product of East Ramapo public schools, Mondaire was raised in Section 8 housing and on food stamps in the Village of Spring Valley by a single mother who worked multiple jobs to provide for their family.\n\nHe later graduated from Stanford University, worked at the Department of Justice during the Obama Administration, and graduated from Harvard Law School. He is a co-founder of the nonprofit Rising Leaders, Inc. and has previously served on the NAACP's National Board of Directors and on the board of the New York Civil Liberties Union. Most recently, Mondaire worked as a litigator in the Westchester County Law Department. Mondaire was born and raised in Rockland and resides in Westchester.",
    "responsibilities": [
      "Monitor national and local media coverage",
      "Partner with the team to draft, post, and monitor social media accounts and messages",
      "Oversee digital media analytics and monitor social media performance",
      "Coordinate digital advertising",
      "Support the drafting of press releases, media advisories, op-eds, and newsletters",
      "Produce graphics, videos, and other digital media messages",
      "Liaise with local and national press",
      "Collaborate on short and long-term media strategy for the team"
    ],
    "qualifications": [
      "Strong commitment to Mondaire's mission and values",
      "Previous experience in digital communications",
      "Excellent organization",
      "Exceptional attention to detail",
      "Great communication skills",
      "Strong computer skills -- ability to learn and adopt new technologies and systems",
      "Ability to be discreet with sensitive information"
    ],
    "how_to_apply": "Please begin by filling out this form via the following link: Digital Director/Press Secretary Application (airtable.com)\n\nFrom there, the process is as follows:\n\n* Zoom Interview with the Chief of Staff and Communications Director (30 minutes)\n* Zoom Interview with Senior Staff (30 minutes)\n* Timed Written Exercise (1-2 hours)\n* Final Zoom Interview with Mondaire (30 minutes)\n\nPlease note that you will have time to ask questions during each of the interview stages -- we want to ensure that you have a chance to learn more about this role throughout the process!",
    "salary_info": "Salary ranges from $70-80,000, commensurate with experience. Benefits include health insurance coverage and up to $833 per month in student loan repayment.",
    "contact": null,
    "equal_opportunity": "Women, people of color, LGBTQ+ people, and members of other minority or marginalized groups are strongly encouraged to apply. We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status.\n\nWe are also committed to providing reasonable accommodations to individuals with disabilities throughout the interview and employment process, including using our online system to apply for a position."
  },
  {
    "id": "MEM-165-22",
    "position_title": "Senior Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2022-04-04",
    "description": "The Committee on Oversight and Government Reform is the principal\ninvestigative body for the U.S. House of Representatives. Chairwoman Carolyn\nMaloney (D-NY) seeks to fill a Senior Counsel position on the Democratic staff.\nSeveral years of investigative or litigation experience is required. Responsibilities\ninclude depositions, transcribed interviews, briefings, and managing\ncongressional investigations and hearings. Candidates with diverse backgrounds\nand experiences are strongly encouraged to apply. Candidates must have superior\nattention to detail, work well under pressure, be self-motivated, and possess\nexcellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Managing congressional investigations and hearings"
    ],
    "qualifications": [
      "Several years of investigative or litigation experience",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with\n“Senior Counsel” in the subject line. Please attach the resume and cover letter\nwith the file name using the following format: “LastName.FirstName.Resume”\nand “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or dropins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-164-22",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Reform",
    "location": "U.S. House of Representatives",
    "posting_date": "2022-04-04",
    "description": "The Committee on Oversight and Reform is the principal investigative body for\nthe U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) seeks\nan attorney with several years of investigative or litigation experience for a\nCounsel position on the Democratic staff.\n\nIn this role, you will work with a team of energetic and supportive colleagues and\nmanage all aspects of high-profile congressional investigations. Potential day-today work includes drafting letters, negotiating with counsel, conducting\ndepositions and transcribed interviews, preparing reports and memoranda,\nbriefing the Chairwoman and other Committee Members, and organizing\ncongressional hearings.\n\nPrevious Hill experience helpful but not required. Candidates with diverse\nbackgrounds and experiences are strongly encouraged to apply. Candidates must\nhave superior attention to detail, work well under pressure, be self-motivated, and\npossess excellent written and oral communication skills.",
    "responsibilities": [
      "Drafting letters",
      "Negotiating with counsel",
      "Conducting depositions and transcribed interviews",
      "Preparing reports and memoranda",
      "Briefing the Chairwoman and other Committee Members",
      "Organizing congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills",
      "Previous Hill experience helpful but not required",
      "Candidates with diverse backgrounds and experiences are strongly encouraged to apply"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-162-22",
    "position_title": "Staff Assistant",
    "office": "Representative Mike Levin (CA-49)",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "This position is responsible for managing the front desk, answering the DC office phones, operating the DC office internship program, coordinating constituents’ tour and flag requests, and handling other administrative duties of the office as needed.\n\nThe staff member in this role interacts regularly with constituents and should have a friendly, helpful demeanor. The ideal candidate should have strong written and verbal communications skills, extreme attention to detail, and a positive attitude.\n\nThis staff member should also be a self-starter who likes to solve problems and works well with a team. Strong organizational skills and a passion for helping others are essential to this role.",
    "responsibilities": [
      "Managing the front desk",
      "Answering the DC office phones",
      "Operating the DC office internship program",
      "Coordinating constituents’ tour and flag requests",
      "Handling other administrative duties of the office as needed"
    ],
    "qualifications": [
      "Friendly, helpful demeanor",
      "Strong written and verbal communications skills",
      "Extreme attention to detail",
      "Positive attitude",
      "Working knowledge of legislative issues is a plus",
      "Self-starter who likes to solve problems",
      "Works well with a team",
      "Strong organizational skills",
      "Passion for helping others"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, two writing samples, and a list of three references to ca49.applications@mail.house.gov. Please send all materials in one PDF document. Incomplete applications will not be considered.",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-161-22",
    "position_title": "Legislative Counsel",
    "office": "House Judiciary Subcommittee on Immigration and Citizenship",
    "location": "Capitol Hill",
    "posting_date": "2022-04-04",
    "description": "The House Judiciary Subcommittee on Immigration and Citizenship seeks a hardworking lawyer with significant experience in immigration and nationality law to serve as legislative counsel.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Judiciary Committee on matters involving immigration law and policy",
      "Drafting legislation",
      "Coordinating hearings and witnesses",
      "Preparing Members for hearings and markups",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to other offices within the Democratic Caucus on immigration-related matters"
    ],
    "qualifications": [
      "A strong background in immigration law and policy is required.",
      "Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are essential.",
      "The ideal candidate will have Capitol Hill experience and a minimum of five years of experience in immigration law."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Immigration Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-158-22",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks a Legislative Assistant to join her team in Washington, DC.\n\nIdeal candidates will have prior Hill experience; excellent written and verbal communication skills; strong organizational and time management skills; a positive attitude; solid knowledge of the legislative process; and an ability to work under pressure and meet deadlines in an fast-paced work environment. Experience with Intranet Quorum (IQ) is preferred.",
    "responsibilities": [
      "Formulating legislative initiatives for assigned issue areas",
      "Tracking legislation and other developments in assigned issue areas and briefing the Congresswoman for floor work, committee work, work in the district, and outside House-related activities",
      "Monitoring legislative developments within relevant committees",
      "Planning and coordinating cosponsorship and support of legislation",
      "Writing floor speeches for the Congresswoman",
      "Acting as liaison with committee and agency staffs",
      "Performing special projects assigned by the Congresswoman or Chief of Staff",
      "Meeting with constituents and interest groups",
      "Assisting with the preparation of weekly reports for the Congresswoman and staff on legislative activities in assigned issue areas",
      "Performing other duties as assigned"
    ],
    "qualifications": [
      "Prior Hill experience",
      "Excellent written and verbal communication skills",
      "Strong organizational and time management skills",
      "A positive attitude",
      "Solid knowledge of the legislative process",
      "Ability to work under pressure and meet deadlines in an fast-paced work environment",
      "Experience with Intranet Quorum (IQ) is preferred"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter, resume, two writing samples and two references in a single PDF to CT05jobs@mail.house.gov with the following subject line: Full name - Legislative Assistant. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Connecticut ties are a plus, but not required. Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-157-22",
    "position_title": "Director of Operations and Scheduler",
    "office": "Congressman Wittman",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "The Director of Operations position will guarantee continued excellence in constituent services through overseeing a collaborative and strategic scheduling operation, ensuring a one-stop-shop model for all DC constituent interactions, maximizing each dollar of the Members Representational Allowance (MRA) in serving the constituents of the First District, and through taking a larger role overall in office strategy and goalsetting.\n\nThe Director of Operations maintains the Congressman's schedule, travel plans, and related records. This position acts as a liaison for the Congressman with the staff, public, industry, Members of Congress, and Administration officials.\n\nThe Director of Operations is also the financial point of contact for the office responsible for: tracking bills and vendor contracts, creating vouchers for payment by the Finance office, tracking and submitted Member and staff reimbursements, keeping equipment inventory current and well documented, recommending year end equipment and supply purchases to the Chief and Member, maintaining and submitting all travel and purchase card statements, and making sure the office complies with all ethics criteria.\n\nThis position also supervises the staff assistant and front office operations and coordinates with the Staff Assistant on the hiring, training, and maintenance of the intern program. This is not an entry level position and previous Capitol Hill, or executive assistant experience is strongly preferred.",
    "responsibilities": [
      "Overseeing a collaborative and strategic scheduling operation.",
      "Ensuring a one-stop-shop model for all DC constituent interactions.",
      "Maximizing each dollar of the Members Representational Allowance (MRA) in serving the constituents of the First District.",
      "Taking a larger role overall in office strategy and goalsetting.",
      "Maintaining the Congressman's schedule, travel plans, and related records.",
      "Acting as a liaison for the Congressman with the staff, public, industry, Members of Congress, and Administration officials.",
      "Tracking bills and vendor contracts.",
      "Creating vouchers for payment by the Finance office.",
      "Tracking and submitted Member and staff reimbursements.",
      "Keeping equipment inventory current and well documented.",
      "Recommending year end equipment and supply purchases to the Chief and Member.",
      "Maintaining and submitting all travel and purchase card statements.",
      "Making sure the office complies with all ethics criteria.",
      "Supervising the staff assistant and front office operations",
      "Coordinating with the Staff Assistant on the hiring, training, and maintenance of the intern program."
    ],
    "qualifications": [
      "Organized with an exceptional attention to detail.",
      "Able to handle a fast-paced and demanding work environment.",
      "Possess strong people skills with the temperament to communicate with a variety of personalities in a pleasant and professional manner.",
      "Previous Capitol Hill, or executive assistant experience is strongly preferred.",
      "Virginia ties a plus."
    ],
    "how_to_apply": "Email resume and cover letter to with “Wittman Director of Operations” in the subject line to Carolyn.King@mail.house.gov.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-155-22",
    "position_title": "Scheduler",
    "office": "Office of Congressman Emanuel Cleaver",
    "location": "DC",
    "posting_date": "2022-04-04",
    "description": "The Office of Congressman Emanuel Cleaver is seeking a Scheduler for his DC office. This is not an entry-level position. Candidates must have exceptional organizational skills, meticulous attention to detail, the ability to prioritize and manage multiple tasks under tight deadlines and the ability to work under pressure in a fast-paced environment.\n\nThe DC Scheduler serves in an important advisory capacity for the Member and works closely with the Chief of Staff, District Scheduler, communications, and policy teams to coordinate the Member’s official schedule and arrange travel plans. This position is responsible for managing the Member’s daily and long-term DC schedule; evaluating, organizing and responding to all incoming DC meeting requests; creating and booking complex travel arrangements; coordinating with the campaign staff on political scheduling requests; and occasionally spearheading other projects as assigned.",
    "responsibilities": [
      "Managing the Member’s daily and long-term DC schedule",
      "Evaluating, organizing and responding to all incoming DC meeting requests",
      "Creating and booking complex travel arrangements",
      "Coordinating with the campaign staff on political scheduling requests",
      "Occasionally spearheading other projects as assigned"
    ],
    "qualifications": [
      "Strong written and verbal communication skills",
      "Proactive self-starter",
      "Ability to work collaboratively as part of a close-knit team",
      "Congressional work experience and prior scheduling experience (ideal)"
    ],
    "how_to_apply": "Please submit your resume and cover letter to midwest.jobs@mail.house.gov with Scheduler in the title. Applications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "midwest.jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-154-22",
    "position_title": "Communications Director",
    "office": "Congresswoman Rosa DeLauro (CT-03)",
    "location": "DC and the district",
    "posting_date": "2022-04-04",
    "description": "Responsibilities include planning and implementing a communications strategy across a broad portfolio, working closely with legislative, district, and appropriations staff to effectively communicate her message, handling daily media inquiries, maintaining relationships with national and local reporters, writing talking points and press releases, pitching op-eds, managing the website, producing videos and social media content, planning and pitching press events in DC and the district, overseeing daily clips, and keeping press lists up-to-date.\n\nThis office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment.",
    "responsibilities": [
      "Planning and implementing a communications strategy across a broad portfolio",
      "Working closely with legislative, district, and appropriations staff to effectively communicate her message",
      "Handling daily media inquiries",
      "Maintaining relationships with national and local reporters",
      "Writing talking points and press releases",
      "Pitching op-eds",
      "Managing the website",
      "Producing videos and social media content",
      "Planning and pitching press events in DC and the district",
      "Overseeing daily clips",
      "Keeping press lists up-to-date"
    ],
    "qualifications": [
      "Hill press experience",
      "Strong writing and oral communication skills",
      "The ability to multitask and prioritize under pressure",
      "A good sense of humor",
      "Connecticut ties are a plus"
    ],
    "how_to_apply": "Please send cover letter, resume, and a writing sample as one attachment to CTCommsJob@gmail.com.",
    "salary_info": null,
    "contact": "CTCommsJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-149-22",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2022-04-04",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nThe staff assistant is responsible for coordinating mail and casework distribution; answering the phones; and preparing letters of greetings, condolences and congratulations on behalf of the Member. Responsibilities may also include casework assignments if the District Director finds that the staff assistant can take on such work while paying the required attention to his/her already assigned tasks. The staff assistant also serves as intern coordinator by recruiting, training, scheduling and assigning duties.",
    "responsibilities": [
      "Coordinating mail and casework distribution",
      "Answering the phones",
      "Preparing letters of greetings, condolences and congratulations on behalf of the Member",
      "Casework assignments (if the District Director finds that the staff assistant can take on such work)",
      "Intern coordinator: recruiting, training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing, and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-148-22",
    "position_title": "Staff Director/Chief Counsel",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "The Energy & Commerce Committee, Democratic Staff, seeks a Staff Director/Chief Counsel for the Consumer Protection and Commerce Subcommittee.\n\nThe subcommittee’s jurisdiction comprises a diverse set of issues, including consumer affairs and consumer protection, tech accountability, consumer privacy and data security, auto safety, consumer product safety, regulation of commercial practices, including sports-related matters, among other issues.",
    "responsibilities": [
      "Managing a team to prepare and staff hearings and markups, draft legislation, and advise staff and Members of Congress on legislative and non-legislative matters - this includes review and approval of all written materials",
      "Working with the Chairman, Subcommittee Chair, and Senior Committee Staff to set and implement Subcommittee priorities, strategy, and messaging",
      "Advising Members of Congress and their staffs on the issues before the Subcommittee"
    ],
    "qualifications": [
      "Minimum of 6 years of Congressional experience or other relevant experience, including experience developing and managing a team",
      "Strong background and knowledge of issues within the Subcommittee’s jurisdiction, including current legislative and non-legislative issues before the Subcommittee",
      "Thorough understanding of the legislative process and the organization and procedures of the House of Representatives",
      "Superior writing, analytical, and legislative skills, including explaining policy issues in ways that people can easily understand",
      "Sound political judgment and the ability to think creatively to design and implement Subcommittee priorities and strategies",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities and excellent organizational and time management skills",
      "Willingness to work long hours and weekends",
      "Experience working with relevant public interest groups, agencies, Members of Congress and their staffs, and industry stakeholders"
    ],
    "how_to_apply": "Please submit a cover letter, resume, short writing sample, and at least three professional references to ecdjobs@mail.house.gov using the subject line: Consumer Protection Staff Director Candidate [Your Name].",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age."
  },
  {
    "id": "MEM-140-22",
    "position_title": "Legislative Correspondent",
    "office": "Office of Congresswoman Elissa Slotkin (D-MI)",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "The Office of Congresswoman Elissa Slotkin (D-MI) seeks a motivated, organized, and detail-oriented Legislative Correspondent with exceptional written and oral communication skills to join the team.\n\nProfessional development and advancement opportunities are a priority for Congresswoman Slotkin, so the position also presents opportunities to take on legislative or communications work, as the candidate grows in the job.",
    "responsibilities": [
      "Managing and organizing incoming communications from constituents, and drafting substantive written responses in a timely manner.",
      "Engaging with constituents directly to provide more specific responses when appropriate, and working with both the legislative and communications teams to manage a robust, proactive constituent outreach operation.",
      "Managing and recruiting the office’s interns."
    ],
    "qualifications": [
      "This office has a fast-paced, collegial environment and places an emphasis on ensuring that staff have a direct line of communication with the Congresswoman.",
      "Candidates must be able to work both collaboratively and individually, and be able to produce high quality work in a fast-paced environment. Must be selfmotivated.",
      "Responsiveness and engagement with constituents are a top priority for this office, so applicants should be prepared to manage an expansive mail program.",
      "Previous Capitol Hill experience and knowledge of Internet Quorum are preferred.",
      "Ties to Michigan are preferred."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and two writing samples to jobs.mi08@mail.house.gov. Please include “Legislative Correspondent, [YOUR NAME]” in the subject line.",
    "salary_info": "Salary will be between $43,500 and $50,000 per year, pursuant to candidates’ previous experience.",
    "contact": "jobs.mi08@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Elissa Slotkin is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status. Women, people of color, veterans, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-134-22",
    "position_title": "Press Secretary|Digital Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": null,
    "posting_date": "2022-04-04",
    "description": "Representative Nanette Diaz Barragan (CA-44) is seeking a talented and highly motivated individual to assume the role of Press Secretary|Digital Director. The person chosen for the position will work closely with the Communications Director to develop and execute the Congresswoman’s long-term communications plan. They will be charged with overseeing the communications schedule, managing the Member’s digital media accounts, and working with local and national reporters.\n\nThe Press Secretary|Digital Director will be responsible for a wide range of critical functions, including developing original social media content, designing graphics, editing and posting videos, maintaining the office’s website, and managing media lists. Additionally, they will assist the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics",
      "Editing and posting videos",
      "Maintaining the office’s website",
      "Managing media lists",
      "Assisting the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials."
    ],
    "qualifications": [
      "Must have strong writing, editing, proofreading skills",
      "Must be proficient in photography, video recording and editing",
      "Must be detail-oriented, news savvy and able to work in a fast-paced, demanding work setting",
      "A sense of humor and ability to be a team player is a must.",
      "Spanish fluency preferred.",
      "Previous experience in press or relevant social media experience is required.",
      "Experience with Adobe Creative Cloud Products are a plus.",
      "Southern California|Los Angeles ties are a plus."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples with “Press Secretary” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-133-22",
    "position_title": "Legislative Assistant|CHC Liaison",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": "Washington, DC House office",
    "posting_date": "2022-04-04",
    "description": "Representative Nanette Diaz Barragán (CA-44) seeks a highly talented and motivated individual to serve as a Legislative Assistant|CHC Liaison in Washington, DC House office - with the primary responsibilities of handling the Member’s immigration, foreign affairs, military, and criminal justice, Homeland Security Committee work, and serve as Member’s liaison to the Congressional Hispanic Caucus (CHC). Candidates must have a proven record of proposing legislation, developing amendments, and leading on letters.",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various legislative vehicles",
      "Preparing hearing binders and questions for witnesses for Homeland Security Committee hearings",
      "Drafting talking points, vote recommendations and other materials",
      "Monitoring and analyzing legislative developments, committee proceedings, news stories and other relevant info",
      "Representing the Member in meetings with constituents and stakeholders"
    ],
    "qualifications": [
      "Candidates must have an ability to work under pressure and meet deadlines in a fast-paced work environment.",
      "Strong organizational and time management skills, excellent written and verbal communication skills, and a keen attention to detail are required.",
      "Spanish language skills preferred.",
      "Southern California ties a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-132-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, and energetic.\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\nThe Communications Director will oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member's social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters and franked mailings.\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging. The Communications Director is responsible for maintaining the Congresswoman's voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman's values and advocacy to a diverse constituent base.\nThis is NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill. They must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.\nAdditionally, the Communications Director must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member",
      "Develop and execute an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets",
      "Oversee day-to-day press operations, including coordinating and managing the press team",
      "Respond to media inquiries",
      "Book the Member for interviews",
      "Pitch news opportunities to media outlets",
      "Plan press conferences and in-district events",
      "Manage the Member’s social media accounts and official website",
      "Edit/draft speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Create and distribute e-newsletters and franked mailings",
      "Work with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging",
      "Maintain the Congresswoman’s voice across all communications materials"
    ],
    "qualifications": [
      "Previous press-related experience either on or off Capitol Hill",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political judgment and instincts",
      "Superior writing, editing, and proofreading skills",
      "Los Angeles Metro|Southern California ties are a plus",
      "Fluency in Spanish is a plus",
      "Experience with video editing and graphic design are a plus",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus"
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-131-22",
    "position_title": "Scheduler",
    "office": "Congresswoman Nanette Diaz Barragán (CA-44)",
    "location": "DC and the District",
    "posting_date": "2022-04-04",
    "description": "Main responsibilities include maintaining the Member’s daily and long-term schedules for both DC and the District; organizing and evaluating all incoming meeting requests and invitations; keeping the Member on schedule throughout the day; working with legislative and communications staff to ensure the Member is prepared for events/meetings; coordinating travel arrangements; processing and managing expenses and reimbursements for the Member; and communicating with constituents by phone and email to address requests, concerns, and questions.\n\nAdditional responsibilities include other administrative tasks.\n\nCandidates should be highly organized, detail-oriented and able to multi-task, resourceful, team-oriented, and have a positive attitude.\n\nThis position requires availability outside of regular business hours including some weekend availability as needed.\n\nThis is NOT an entry-level position. Applicants should have previous scheduling experience (at least one year in a similar position). Salary is commensurate with experience.\n\nSouthern California | Los Angeles Metro area ties and Spanish fluency are a plus.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedules for both DC and the District",
      "Organizing and evaluating all incoming meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Coordinating travel arrangements",
      "Processing and managing expenses and reimbursements for the Member",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented and able to multi-task",
      "Resourceful",
      "Team-oriented",
      "Positive attitude",
      "Availability outside of regular business hours including some weekend availability as needed",
      "Previous scheduling experience (at least one year in a similar position)",
      "Southern California | Los Angeles Metro area ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three references with “SCHEDULER” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-127-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee (MI-05)",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "The legislative assistant will be responsible for important issues areas such as worker and family support, education, labor, transportation, among other issues, in a fast-paced congressional office for a member of House Democratic Leadership on the Ways and Means, Budget, and Science, Space and Technology Committees.",
    "responsibilities": [
      "Drafting bills and amendments",
      "Developing strategic plans to advance legislation through Congress",
      "Staffing committee meetings",
      "Interacting with constituents, district stakeholders, committee/leadership committee staff and federal agencies",
      "Writing policy briefing memos and talking points"
    ],
    "qualifications": [
      "Self-starting personality",
      "Strong written and verbal communication skills",
      "A desire to continually learn and grow",
      "An eagerness to work on a team in a collaborative office environment",
      "A minimum two years of relevant experience is required",
      "Michigan ties preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to Michigan05jobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-115-22",
    "position_title": "Body Person/District Scheduler",
    "office": "Office of Congresswoman Sara Jacobs (CA-53)",
    "location": "San Diego",
    "posting_date": "2022-04-04",
    "description": "The Office of Congresswoman Sara Jacobs (CA-53) is looking for a calm, quickthinking, and detail-oriented Body Person/District Scheduler for the San Diego office.\n\nIdeal candidates will have good judgment, common sense, an eye for detail, and a good sense of humor. They will be able to anticipate the needs of the principal and problem-solve on their feet. They will also be calm under pressure and closely follow San Diego government and politics.\n\nThis is not a 9-5 job; some nights and weekends will be required. Bilingual skills are preferred; a valid driver’s license, daily access to a vehicle, and a good driving record are required.",
    "responsibilities": [
      "Driving and staffing the Congresswoman while she is in San Diego.",
      "Assisting the Director of Scheduling and Operations with scheduling events in San Diego.",
      "Helping to manage the Congresswoman’s calendar.",
      "Event planning.",
      "Relaying necessary information from events to the district team.",
      "Other administrative duties as assigned."
    ],
    "qualifications": [
      "Good judgment, common sense, an eye for detail, and a good sense of humor.",
      "Ability to anticipate the needs of the principal and problem-solve on their feet.",
      "Calm under pressure.",
      "Closely follow San Diego government and politics.",
      "Bilingual skills are preferred.",
      "Valid driver’s license, daily access to a vehicle, and a good driving record are required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume with “Jacobs - Body Person” in the subject line to SaraJacobs.Resumes@mail.house.gov. Applications will be considered on a rolling basis, with priority given to earlier applicants.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Jacobs is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-109-22",
    "position_title": "Scheduler/Administrative Assistant",
    "office": "U.S. Congressman Ed Case (Hawai’i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "Scheduling duties include but are not limited to managing all aspects of the Congressman’s daily and long-term schedule in D.C., Hawai‘i and elsewhere. \n\nOther duties include coordinating and implementing administrative functions of the D.C. office, including constituent mail, tours requests, inventory management and records management. Direct report is to the Chief of Staff, although the individual will work closely with the Deputy Chief of Staff and the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Managing all aspects of the Congressman’s daily and long-term schedule in D.C., Hawai‘i and elsewhere.",
      "Coordinating and implementing administrative functions of the D.C. office, including constituent mail, tours requests, inventory management and records management."
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Prior scheduling experience",
      "Hawai’i background",
      "Initiative",
      "Strong interpersonal skills",
      "Multitasking",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Scheduler/Administrative Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-108-22",
    "position_title": "Legislative Assistant",
    "office": "Representative Kilmer",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "Representative Kilmer seeks a Legislative Assistant to support his work on\ninterior, environment, and related issues, including his work on the\nAppropriations Subcommittee on Interior and Environment.\nThe portfolio will also include managing an active and diverse policy portfolio\nthat includes Energy, Environment, Fisheries/Oceans, Natural Resources/ Public\nLands, and Native American issues.\nThis is not an entry-level position and prior Hill experience is strongly preferred.\nCandidates must have excellent written and verbal communication skills, be\nentrepreneurial and adept at multitasking, and enjoy working as part of a\ncollaborative team in an active and fast-paced office. The ideal candidate will\nhave experience working on natural resource and tribal issues in the Pacific\nNorthwest and a clear understanding of the appropriations process.\nDiverse candidates, women, and LGBTQ persons are strongly encouraged to\napply. This office is an equal opportunity employer and does not discriminate on\nthe basis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. Washington state ties are a plus but not required.",
    "responsibilities": [
      "managing appropriations requests",
      "staffing committee hearings and markups",
      "developing and advancing legislative priorities",
      "drafting cosponsor and vote recommendations",
      "writing policy memos and talking points",
      "working directly with stakeholders and constituents"
    ],
    "qualifications": [
      "prior Hill experience is strongly preferred",
      "excellent written and verbal communication skills",
      "be entrepreneurial and adept at multitasking",
      "enjoy working as part of a collaborative team in an active and fast-paced office",
      "experience working on natural resource and tribal issues in the Pacific Northwest",
      "a clear understanding of the appropriations process"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two short writing samples, three references, and if willing your best joke, to Kilmer.Resumes@mail.house.gov with the subject line “LAST NAME Natural Resources LA.”",
    "salary_info": null,
    "contact": "Kilmer.Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-080-22",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Problem Solvers Caucus (PSC)",
    "location": "Washington, D.C.",
    "posting_date": "2022-04-04",
    "description": "The bipartisan Problem Solvers Caucus (PSC) seeks an innovative, strategic, and experienced communications director based in Washington, D.C. The staff member in this position proactively promotes and helps build the Caucus’s national image and manage its press, social media, website, and communications operations.\n\nThe communications director works closely with the executive director, PSC cochairs, and member office staff to carry out assigned duties. This position is responsible for helping plan, draft, and coordinate communications activities to advance caucus priorities, including pitching stories, developing social media content, writing press releases, and maintaining positive working relationships with members of the media. The communications director organizes Caucus press conferences, coordinates outside speaking requests, produces caucus-oriented talking points, and works collaboratively with member offices.\n\nThis is not an entry-level position. Candidates should have at least two years of previous communications experience, including Capitol Hill experience and relationships with the congressional press corps. A disposition aligned with the caucus mission of breaking the gridlock in Congress by promoting bipartisan, bicameral collaboration and policies is essential.\n\nCandidates must possess strong writing, communication, and organizational skills, digital and social media savviness, creativity, and the ability to work with members and their staff under tight deadlines. Candidates should also be familiar with graphic design, website and social media design, videography, and constructing and conveying messages to a national audience through print, television, and digital media.",
    "responsibilities": [
      "Helping plan, draft, and coordinate communications activities to advance caucus priorities, including pitching stories, developing social media content, writing press releases, and maintaining positive working relationships with members of the media.",
      "Organizing Caucus press conferences",
      "Coordinating outside speaking requests",
      "Producing caucus-oriented talking points",
      "Working collaboratively with member offices"
    ],
    "qualifications": [
      "At least two years of previous communications experience, including Capitol Hill experience and relationships with the congressional press corps.",
      "A disposition aligned with the caucus mission of breaking the gridlock in Congress by promoting bipartisan, bicameral collaboration and policies is essential.",
      "Strong writing, communication, and organizational skills",
      "Digital and social media savviness, creativity, and the ability to work with members and their staff under tight deadlines.",
      "Familiarity with graphic design, website and social media design, videography, and constructing and conveying messages to a national audience through print, television, and digital media."
    ],
    "how_to_apply": "Please submit a cover letter, resume, and at least two professional references to Jaclyn.ODay@mail.house.gov, with the subject line “PSC Communications Director.”",
    "salary_info": "$50,000 to $58,000 plus benefits",
    "contact": "Jaclyn.ODay@mail.house.gov",
    "equal_opportunity": "The Problem Solvers Caucus is an equal opportunity employer. All applicants will be considered without regard to race, color, religion, sex, sexual orientation, gender identity, disability, age, national origin, or military status."
  },
  {
    "id": "MEM-069-22",
    "position_title": "Press Media Secretary",
    "office": "Congressman Steven Horsford (D-NV-04)",
    "location": "DC",
    "posting_date": "2022-04-04",
    "description": "The Office of Congressman Steven Horsford (D-NV-04) seeks a Press Media\nSecretary based in the DC office to work closely with the Communications\nDirector, based in the district office to develop and execute the Congressman’s\ncommunications strategy as a member of the House Ways and Means, Armed\nServices, and Budget committees.\n\nThe Press Media Secretary must be and stay up to date with the latest digital,\ntechnical, and social media trends. Able to express the Congressman's voice\ncreatively and promote social media presence, ensuring high web traffic and\nconstituent engagement.\n\nApplicants must be creative, detail-oriented, and comfortable working long hours\nand producing high-quality work under tight deadlines. This position serves as a\npart of the Communications team and reports directly to the Director of\nCommunications based in the district, however, this person will be the main point\nof contact in the D.C. office.\n\nThe candidate will report to the Communications Director and work closely with\nlegislative and district staff. The ideal candidate will have experience in or\ninterest in learning about aspects of the office’s traditional press operations,\nincluding writing press releases, drafting talking points and speeches, forming\nrelationships with members of the media, and pitching stories.\n\nThis is an ideal position for someone with 1-2 years of communications or digital\nexperience. Applicants must be passionate about public service, well-organized,\nand have the ability to work on weekends and holidays when necessary.",
    "responsibilities": [
      "Acts as a formal spokesperson and media liaison for the Member;",
      "Managing the Congressman’s social media platforms, developing a weekly content calendar, and drafting rapid response content during breaking news moments.",
      "Maintaining the Congressman’s website and drafting new website content covering key policy issues.",
      "Preparing daily press clip summaries and monitoring the Congressman’s media mentions.",
      "Writing a weekly newsletter, creating digital ads, and participating in other efforts to keep constituents of Nevada’s Fourth District informed about the work of a busy Congressional office.",
      "Helping to plan and staff communications-focused events for the Congressman, both in-district and in Washington D.C.",
      "Writing short-form speeches and video scripts and preparing video clips of the Congressman for public distribution.",
      "Building relationships with allies and online influencers to amplify Congressman Horsford’s digital message and expand his online reach.",
      "Perform all other duties as required"
    ],
    "qualifications": [
      "Applicants must be creative, detail-oriented, and comfortable working long hours and producing high-quality work under tight deadlines.",
      "Must be passionate about public service, well-organized, and have the ability to work on weekends and holidays when necessary.",
      "Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply.",
      "Experience with video editing and graphic design is also a plus.",
      "Nevada ties are a plus, but not required."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, three writing samples, and three professional references to NV04Resume@mail.house.gov with “Press/Media Secretary” in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-594-21",
    "position_title": "Field Representative",
    "office": "Southern California Republican Member of the House",
    "location": "Southern California",
    "posting_date": "2022-04-04",
    "description": "Are you looking for an exciting and fast-paced career in public service? A Southern California Republican has an immediate need to hire a full-time Field Representative. We are looking for an enthusiastic and motivated individual to join our high-energy team.\n\nBasic Functions\n\nThe Field Representative serves an important role in the Member's Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member's strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfort navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including nights and weekends",
      "Constituent service oriented; patient empathetic, with a desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director\nStephanie.Hu@mail.house.gov",
    "salary_info": "Salary starts at $3,500 per month. Salary commensurate with experience.",
    "contact": "Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-539-21",
    "position_title": "Staff Assistant",
    "office": "Nevada’s 4th District Democratic Member of Congress",
    "location": "North Las Vegas, Nevada District office",
    "posting_date": "2022-04-04",
    "description": "Nevada’s 4th District Democratic Member of Congress seeks a highly organized, passionate, team-oriented Staff Assistant for a position in our North Las Vegas, Nevada District office. Candidates must be comfortable working with the public, have excellent oral and written communication skills, problem solving abilities.",
    "responsibilities": [
      "Managing the front desk, greeting visitors, processing flag requests, answering phones, conducting tours, overseeing an active mail program",
      "Sorting/batching correspondence, drafting correspondence and ensuring a swift turnaround time",
      "Responding to constituent mail, keeping abreast of legislative developments, and meeting with constituent groups",
      "Assisting District Representatives as needed",
      "Perform all other duties as assigned and required"
    ],
    "qualifications": [
      "Passionate about public service and committed to democratic values",
      "Strong writing, communication skills and be detail-oriented",
      "Have advanced experience with spreadsheets and forms",
      "A poised, confident, self-starter, and team-player with a sense of humor",
      "The ability to work in a high-paced environment",
      "The ability work weekends and holidays",
      "Have reliable transportation, auto insurance and a clean driving record",
      "Currently enrolled in an ungraduated degree program at a college or university or have a minimum of a bachelor’s degree in the related fields of human services or social work, and a minimum of one-year relevant experience in community or human services."
    ],
    "how_to_apply": "Qualified candidates must include a cover letter, resume, one writing sample and three professional references in a single PDF file. Email submissions to the Director of Administration, nv04resume@mail.house.gov. Subject line must read",
    "salary_info": null,
    "contact": "nv04resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Spanish language skills and District ties are a plus."
  },
  {
    "id": "MEM-NV04-2",
    "position_title": "Staff Assistant",
    "office": "Rep. Steven Horsford (NV-04)",
    "location": "Washington, DC",
    "posting_date": "2022-04-04",
    "description": "Rep. Steven Horsford (NV-04) is seeking a Staff Assistant to manage the front office, answer phones, sort mail, greet visitors, process flag requests, maintain office equipment and order supplies. The Staff Assistant will also assist with special projects as needed. Nevada ties are a plus. \n\nPlease submit a resume and cover letter to NV04.Resume@mail.house.gov.",
    "responsibilities": [
      "Manage the front office",
      "Answer phones",
      "Sort mail",
      "Greet visitors",
      "Process flag requests",
      "Maintain office equipment",
      "Order supplies",
      "Assist with special projects as needed"
    ],
    "qualifications": [],
    "how_to_apply": "Please submit a resume and cover letter to NV04.Resume@mail.house.gov.",
    "salary_info": null,
    "contact": "NV04.Resume@mail.house.gov",
    "equal_opportunity": null
  }
]