[
  {
    "id": "MEM-015-22",
    "position_title": "Digital Director",
    "office": "House Committee on Budget",
    "location": "Washington, D.C.",
    "posting_date": "2022-01-10",
    "description": "The Democratic Staff of the House Committee on Budget is seeking an experienced and motivated Digital Director to join the Communications team.\n\nThe individual selected will have strong writing skills and the ability to translate complex issues and topics for audiences across platforms and medias. This position is based in Washington, D.C. and will work closely with the Communications Director and help manage a Digital Press Secretary.\n\nThe position may require work outside standard office hours.",
    "responsibilities": [
      "Developing and honing a proactive digital strategy",
      "Crafting engaging content for all social media channels",
      "Creating social media toolkits for the caucus as needed",
      "Developing graphics and videos",
      "Tracking social media analytics",
      "Streaming live events",
      "Managing the committee’s website and social media pages",
      "Working with the Communications team to identify new ways to engage with press and digital audiences"
    ],
    "qualifications": [
      "At least 3 years of digital experience",
      "Excellent writing skills",
      "A keen attention to details",
      "Proficiency in graphic design",
      "An ability to leverage social media and news trends to take advantage of opportunities for social engagement",
      "A passion for thinking creatively about how to translate complex ideas into compelling visuals",
      "Experience with Adobe programs (Photoshop, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects)",
      "A working knowledge of HTML",
      "Ability to work well with others, manage competing priorities, and turn around high-quality products under tight deadlines"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter describing their fit for the role, a resume, a writing sample, and three digital work products to BudgetDemocrat.Jobs@mail.house.gov with “Digital Director” in the subject line. No calls or walk-ins please.",
    "salary_info": "The starting salary for this position is $70,000 but is commensurate with experience.",
    "contact": "BudgetDemocrat.Jobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-013-22",
    "position_title": "Scheduler",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2022-01-10",
    "description": "Primary responsibilities include managing the Member’s daily and long-term schedule in DC and in the district; evaluating and responding to all incoming meeting and event requests; booking travel; coordinating logistics for events; communicating key information regarding the schedule to staff; working closely with the Member and Chief of Staff to ensure smooth daily operations; and other administrative duties as assigned. The ideal candidate will be detail-oriented, able to multi-task, and have a positive attitude.\n\nThis is not an entry level position and previous scheduling experience is preferred. Connecticut ties are a plus, but not required. Minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "Managing the Member’s daily and long-term schedule in DC and in the district",
      "Evaluating and responding to all incoming meeting and event requests",
      "Booking travel",
      "Coordinating logistics for events",
      "Communicating key information regarding the schedule to staff",
      "Working closely with the Member and Chief of Staff to ensure smooth daily operations",
      "Other administrative duties as assigned"
    ],
    "qualifications": [
      "Detail-oriented",
      "Able to multi-task",
      "Positive attitude",
      "Previous scheduling experience is preferred",
      "Connecticut ties are a plus, but not required"
    ],
    "how_to_apply": "Interested parties should email a cover letter, resume, and two references in a single PDF to ct05jobs@mail.house.gov with the following subject line: Full name – Scheduler. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "ct05jobs@mail.house.gov",
    "equal_opportunity": "Minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-011-22",
    "position_title": "Communications Director",
    "office": "Republican Natural Resource and Judiciary Member office",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "Republican Natural Resource and Judiciary Member office seeking a\nCommunications Director to develop and lead a communications plan and\nmanage all media operations for the Member’s outreach and legislative items.\nThis includes but is not limited to pitching and booking local and national media.\nGrow strong local and national press relations. Formulate talking points and\nspeeches. Create daily social media content, statements, press releases, media\nadvisories, radio ad scripts, op-eds, and the newsletter. Maintain updates to\nMember’s website. Generate and oversee a communications budget strategy that\nconsists of digital ads, radio ads, mass mailers and telephone town halls.",
    "responsibilities": [
      "Develop and lead a communications plan",
      "Manage all media operations for the Member’s outreach and legislative items",
      "Pitching and booking local and national media",
      "Grow strong local and national press relations",
      "Formulate talking points and speeches",
      "Create daily social media content, statements, press releases, media advisories, radio ad scripts, op-eds, and the newsletter",
      "Maintain updates to Member’s website",
      "Generate and oversee a communications budget strategy that consists of digital ads, radio ads, mass mailers and telephone town halls"
    ],
    "qualifications": [
      "Detail-oriented",
      "Hands-on",
      "Strong writer",
      "Team player",
      "Ability to work under tight and simultaneously competing deadlines"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to: ResumesOR@mail.house.gov",
    "salary_info": null,
    "contact": "ResumesOR@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-009-22",
    "position_title": "Legislative Director",
    "office": "Congresswoman Katie Porter (CA-45)",
    "location": "Washington, DC",
    "posting_date": "2022-01-10",
    "description": "Congresswoman Katie Porter (CA-45) seeks a creative and hard-working Legislative Director to coordinate and oversee the office’s legislative agenda, advise the Member on legislative activities and lead our legislative team.\n\nQualified candidates must have a demonstrated ability to manage and mentor staff, think strategically, work collaboratively, and have experience in formulating strategic plans for advancing legislation. Extensive knowledge of House legislative processes and procedures, excellent organization and communication skills, and the ability to work under pressure and meet deadlines is required.\n\nThis position is based in Washington, DC with occasional required travel to the district and reports to the Chief of Staff. This is not an entry-level position, JD preferred.",
    "responsibilities": [
      "Manage and support legislative team",
      "Monitor House floor and Committee activity, including overseeing committee questioning",
      "Serve as primary legislative liaison to House Leadership offices and CPC",
      "Manage legislative portfolio for the Congresswoman that includes campaign finance, financial services, housing, consumer protection, antitrust, privacy, technology, small business, and taxes",
      "Provide the Congresswoman with vote recommendations and manage all voting decisions and voting processes",
      "Identify and pursue legislative opportunities for the Congresswoman, including sponsoring or co-sponsoring bills and drafting and co-signing letters",
      "Draft constituent correspondence, oversight letters, op-eds, talking points, legislation, and other written material related to issue area portfolio",
      "Communicate with the district staff to help them amplify legislative work locally",
      "Support the District Office in writing speeches and memos for in-district events",
      "Review and approve legislative correspondence written by the Legislative Correspondent and Staff Assistant",
      "Project manage projects and events, including in district and in issue portfolio",
      "Ability to work irregular hours and weekends, as needed, to accommodate the legislative calendar",
      "Other duties as assigned by the Chief of Staff"
    ],
    "qualifications": [
      "Demonstrated ability to manage and mentor staff",
      "Ability to think strategically and work collaboratively",
      "Experience in formulating strategic plans for advancing legislation",
      "Extensive knowledge of House legislative processes and procedures",
      "Excellent organization and communication skills",
      "Ability to work under pressure and meet deadlines",
      "JD preferred"
    ],
    "how_to_apply": "Interested parties should email a resume, cover letter, and references to ResumesCA45@mail.house.gov",
    "salary_info": null,
    "contact": "ResumesCA45@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Women, veterans, people of color, and LGBTQAI+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-008-22",
    "position_title": "Staff Assistant",
    "office": "Office of Congresswoman Sara Jacobs (CA-53)",
    "location": "Washington, D.C.",
    "posting_date": "2022-01-10",
    "description": "The Office of Congresswoman Sara Jacobs (CA-53) is looking for a detailoriented, efficient, and ambitious Staff Assistant for the Washington, D.C. office.\n\nIdeal candidates will have good judgment, common sense, a good sense of humor, and solid writing skills. They will be able to anticipate the needs of the principal and problem-solve on their feet. They will also be calm under pressure and around elected officials.\n\nThis is not a 9-5 job; some nights and weekends will be required. Ties to San Diego and bilingual skills are preferred; a valid driver’s license, daily access to a vehicle, and a good driving record are required.",
    "responsibilities": [
      "Driving and staffing the Congresswoman",
      "Managing the front office – answering phones, greeting visitors (when we are able), conducting and organizing tours (when we are able), and supervising interns",
      "Assisting the Director of Scheduling and Operations with daily tasks",
      "Assisting with the office mail program",
      "Other administrative duties as assigned"
    ],
    "qualifications": [
      "Good judgment",
      "Common sense",
      "A good sense of humor",
      "Solid writing skills",
      "Ability to anticipate the needs of the principal",
      "Ability to problem-solve",
      "Ability to remain calm under pressure and around elected officials",
      "Ties to San Diego and bilingual skills are preferred",
      "A valid driver’s license",
      "Daily access to a vehicle",
      "A good driving record"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume with “Jacobs - Staff Assistant” in the subject line to SaraJacobs.Resumes@mail.house.gov by 5pm ET on Wednesday, January 12, 2022. Priority will be given to earlier applications.",
    "salary_info": null,
    "contact": "SaraJacobs.Resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Jacobs is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-006-22",
    "position_title": "Staff Assistant",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2022-01-10",
    "description": "Responsibilities include managing the front office, greeting visitors, processing tour and flag requests, filtering incoming mail and social media messages, answering telephone calls and other constituent requests, supervising and coordinating the internship program, assisting the Chief of Staff in their official responsibilities, and other duties as assigned.\nCandidates must have strong written and verbal communication skills, a selfstarting personality, a desire to continually learn, and an eagerness to work in a collaborative office environment. Applicants should be detail-oriented and possess strong organizational skills. Michigan ties are a plus.",
    "responsibilities": [
      "Managing the front office",
      "Greeting visitors",
      "Processing tour and flag requests",
      "Filtering incoming mail and social media messages",
      "Answering telephone calls and other constituent requests",
      "Supervising and coordinating the internship program",
      "Assisting the Chief of Staff in their official responsibilities",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Strong written and verbal communication skills",
      "Self-starting personality",
      "Desire to continually learn",
      "Eagerness to work in a collaborative office environment",
      "Detail-oriented",
      "Strong organizational skills",
      "Michigan ties are a plus"
    ],
    "how_to_apply": "Please send a resume and cover letter to Michigan05jobs@gmail.com with the subject line \"Staff Assistant Application.\" Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages all qualified candidates to apply."
  },
  {
    "id": "MEM-005-22",
    "position_title": "LEGISLATIVE DIRECTOR/ECONOMIC POLICY ADVISOR",
    "office": "House Appropriations Committee",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "Senior Democrat on the House Appropriations Committee is looking for an\nexperienced LEGISLATIVE DIRECTOR/ECONOMIC POLICY ADVISOR\nto handle the day-to-day management of the Member’s legislative portfolio as\nwell as issues including agriculture, appropriations, energy, financial services,\nsmall business, taxation, telecommunication, and transportation.",
    "responsibilities": [],
    "qualifications": [
      "Excellent knowledge of the legislative process and at least five years of Hill experience in a policy-making role is required.",
      "Law degree preferred.",
      "Ideal applicants also should be creative, proactive, and self-motivated; possess outstanding writing, verbal, and interpersonal skills; and have the ability to operate effectively under pressure and work well as part of a team."
    ],
    "how_to_apply": "Please send your resume, cover letter, and brief writing sample (no more than two pages) to ga02.resume@mail.house.gov. Deadline for application is COB Friday, January 14, 2021. This is NOT an entry-level position.",
    "salary_info": null,
    "contact": "ga02.resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-004-22",
    "position_title": "Staff Assistant",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "DC office",
    "posting_date": "2022-01-10",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks highly-motivated, detailoriented staff assistant with excellent written and oral communication skills for DC office.",
    "responsibilities": [
      "Driving the member",
      "General reception duty",
      "Handling tour and flag requests",
      "Processing constituent correspondence",
      "Addressing constituent matters",
      "Assist in managing interns",
      "Assisting the Member and staff in all functions of the office"
    ],
    "qualifications": [
      "A valid driver’s license, daily access to an automobile and a good driving record are a necessity.",
      "Previous Hill experience as an intern or staff assistant preferred but not necessary.",
      "Southern California ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Staff Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-003-22",
    "position_title": "Press Secretary|Digital Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "Representative Nanette Diaz Barragan (CA-44) is seeking a talented and highly motivated individual to assume the role of Press Secretary|Digital Director. The person chosen for the position will work closely with the Communications Director to develop and execute the Congresswoman’s long-term communications plan. They will be charged with overseeing the communications schedule, managing the Member’s digital media accounts, and working with local and national reporters.\n\nThe Press Secretary|Digital Director will be responsible for a wide range of critical functions, including developing original social media content, designing graphics, editing and posting videos, maintaining the office’s website, and managing media lists. Additionally, they will assist the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics",
      "Editing and posting videos",
      "Maintaining the office’s website",
      "Managing media lists",
      "Assisting the Communications Director with drafting news releases, advisories, talking points, op-eds and other materials"
    ],
    "qualifications": [
      "Strong writing, editing, proofreading skills",
      "Proficient in photography, video recording and editing",
      "Detail-oriented, news savvy and able to work in a fast-paced, demanding work setting",
      "Sense of humor and ability to be a team player is a must",
      "Spanish fluency preferred",
      "Previous experience in press or relevant social media experience is required",
      "Experience with Adobe Creative Cloud Products are a plus",
      "Southern California|Los Angeles ties are a plus",
      "Successful applicants will need to demonstrate their writing ability by completing a writing and editing test"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples with “Press Secretary” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-002-22",
    "position_title": "Legislative Assistant|CHC Liaison",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC House office",
    "posting_date": "2022-01-10",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks a highly talented and motivated individual to serve as a Legislative Assistant|CHC Liaison in Washington, DC House office - with the primary responsibilities of handling the Member’s immigration, foreign affairs, military, and criminal justice, Homeland Security Committee work, and serve as Member’s liaison to the Congressional Hispanic Caucus (CHC). Candidates must have a proven record of proposing legislation, developing amendments, and leading on letters.\n\nCandidates must have an ability to work under pressure and meet deadlines in a fast-paced work environment. Strong organizational and time management skills, excellent written and verbal communication skills, and a keen attention to detail are required.\n\nSpanish language skills preferred. Southern California ties a plus.",
    "responsibilities": [
      "Drafting legislation and amendments and advancing them through various legislative vehicles",
      "Preparing hearing binders and questions for witnesses for Homeland Security Committee hearings",
      "Drafting talking points, vote recommendations and other materials",
      "Monitoring and analyzing legislative developments, committee proceedings, news stories and other relevant info",
      "Representing the Member in meetings with constituents and stakeholders"
    ],
    "qualifications": [
      "Ability to work under pressure and meet deadlines in a fast-paced work environment.",
      "Strong organizational and time management skills",
      "Excellent written and verbal communication skills",
      "Keen attention to detail",
      "Spanish language skills preferred",
      "Southern California ties a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two references with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-001-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "Representative Nanette Diaz Barragán (CA-44) seeks an experienced\nCommunications Director to lead a fast-paced and highly engaged press\noperation. Applicants must be creative, dynamic, proactive, and energetic.\nThe Communications Director will serve as the spokesperson and primary\ncommunications advisor to the Member. They will be responsible for developing\nand executing an aggressive strategic communications plan, including social\nmedia, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director will oversee day-to-day press operations,\nincluding coordinating and managing the press team; responding to media\ninquiries; booking the Member for interviews; pitching news opportunities to\nmedia outlets; planning press conferences and in-district events; managing the\nMember’s social media accounts and official website; editing/drafting speeches,\ntalking points, floor statements, press releases, op-eds, and e-newsletters; and\ncreating and distributing e-newsletters and franked mailings.\n\nThey are also responsible for working with the Member, Chief of Staff,\nLegislative Director, and District Director to develop and coordinate core\nmessaging. The Communications Director is responsible for maintaining the\nCongresswoman’s voice across all communications materials, with an emphasis\non clarity, relatability, authenticity, and connecting the Congresswoman’s values\nand advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related\nexperience either on or off Capitol Hill. They must be highly organized,\nproficient in multi-tasking, have strong political judgment and instincts, and\npossess superior writing, editing, and proofreading skills.\n\nAdditionally, the Communications Director must be willing to work extended\nhours and oftentimes under time constraints, while maintaining a positive\nattitude.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Develop and execute an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations, including coordinating and managing the press team",
      "Responding to media inquiries",
      "Booking the Member for interviews",
      "Pitching news opportunities to media outlets",
      "Planning press conferences and in-district events",
      "Managing the Member’s social media accounts and official website",
      "Editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters",
      "Creating and distributing e-newsletters and franked mailings.",
      "Working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
      "Maintaining the Congresswoman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman’s values and advocacy to a diverse constituent base."
    ],
    "qualifications": [
      "Previous press-related experience either on or off Capitol Hill.",
      "Highly organized",
      "Proficient in multi-tasking",
      "Strong political judgment and instincts",
      "Superior writing, editing, and proofreading skills",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Fluency in Spanish is a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus."
    ],
    "how_to_apply": "Candidate should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-596-21",
    "position_title": "Military Legislative Assistant",
    "office": "Senior Midwest Democratic Member",
    "location": "Washington, DC",
    "posting_date": "2022-01-10",
    "description": "Senior Midwest Democratic Member seeks a military legislative assistant to manage the member’s defense, homeland security, foreign affairs, and other issue areas as assigned.\n\nThis is not an entry-level position, at least 3 years of Hill experience is required. Experience in appropriations is highly preferred. Ohio connections a plus.\n\nCandidates must have excellent written and verbal communication skills, be a self-starter, and work well as part of a collaborative team in a fast-paced office.",
    "responsibilities": [
      "Developing and planning legislative initiatives",
      "Monitoring legislative developments in-portfolio",
      "Managing appropriations requests",
      "Implementing a robust foreign affairs caucus presence",
      "Staffing committee hearings and markups",
      "Drafting cosponsor and vote recommendations",
      "Writing policy memos and talking points",
      "Working directly with stakeholders and constituents",
      "Other duties as necessary"
    ],
    "qualifications": [
      "At least 3 years of Hill experience required",
      "Experience in appropriations is highly preferred",
      "Ohio connections a plus",
      "Excellent written and verbal communication skills",
      "Self-starter",
      "Ability to work well as part of a collaborative team in a fast-paced office"
    ],
    "how_to_apply": "Interested applicants should e-mail 1) a resume, 2) a cover letter, and 3) a 1-2 page writing sample to midwestern.resume@mail.house.gov with the subject “Kaptur MLA”.",
    "salary_info": null,
    "contact": "midwestern.resume@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Women, veterans, people of color, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-595-21",
    "position_title": "Legislative Assistant",
    "office": "Office of Congressman Steven Horsford (NV-04)",
    "location": "Washington, D.C.",
    "posting_date": "2022-01-10",
    "description": "The Office of Congressman Steven Horsford (NV-04), member of the Committees on Ways and Means, Armed Services, and Budget seeks highly motivated, experienced Legislative Assistant.\n\nThe Legislative Assistance will implement Member’s legislative agenda within the Ways and Means Health, Social Security and WorkFam Subcommittees, as well as manage a legislative portfolio including but not limited to immigration, and labor.",
    "responsibilities": [
      "Drafting and analyzing legislation",
      "conducting research;",
      "drafting policy memo, talking points, and remarks;",
      "meeting with constituents and stakeholders; and staffing hearings"
    ],
    "qualifications": [
      "Strong interpersonal skills with the ability to communicate effectively with people from diverse racial, ethnic, socioeconomic, and gender backgrounds",
      "Strong analytical writing skills and oral communication skills",
      "Ambitious, collaborative, self-starting, creative, thorough and inquisitive",
      "Strong organizational skills and ability to manage multiple priorities at once",
      "Ability to work well independently and as a member of a highly integrated and diverse team."
    ],
    "how_to_apply": "Applicants should send a resume, writing sample to NV04Resume@mail.house.gov with “NV-04 Legislative Assistant_Last name, First name” in the subject line.",
    "salary_info": null,
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "This is not and entry-level position; Hill experience is strongly preferred, but not required, Nevada ties are preferred. Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Individuals who can fluently read and write Spanish, Mandarin, Tagalog, or other languages beside English are strongly encouraged to apply."
  },
  {
    "id": "MEM-594-21",
    "position_title": "Field Representative",
    "office": "Southern California Republican Member of the House",
    "location": "Southern California",
    "posting_date": "2022-01-10",
    "description": "Are you looking for an exciting and fast-paced career in public service? A Southern California Republican has an immediate need to hire a full-time Field Representative. We are looking for an enthusiastic and motivated individual to join our high-energy team.\n\nThe Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfort navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including nights and weekends",
      "Constituent service oriented; patient empathetic, with a desire to help constituents",
      "Bachelor’s degree or related job experience is required.",
      "A demonstrated interest in public service and familiarity with Orange County is preferred."
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director\nStephanie.Hu@mail.house.gov",
    "salary_info": "Salary starts at $3,500 per month. Salary commensurate with experience.",
    "contact": "Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-591-21",
    "position_title": "Deputy Communications Director/Digital Director",
    "office": "Congresswoman Diana DeGette (D-CO)",
    "location": "Washington, D.C.",
    "posting_date": "2022-01-10",
    "description": "The position reports directly to the Communications Director and is responsible for assisting in all aspects of the press shop’s day-to-day responsibilities – including, but not limited to: compiling daily news clips, drafting speeches, talking points, op-eds, news releases and weekly newsletters, and pitching events to members of the media. The position is also responsible for managing the Congresswoman’s various social media accounts, developing creative new content to enhance her social media presence, including graphics and videos, and maintaining her website.\n\nThis is not an entry-level position, prior experience is required (2+ years of experience working with various digital platforms, maintaining websites, and managing social media accounts for a political candidate or elected official is preferred). Colorado ties are a plus.",
    "responsibilities": [
      "Assisting in all aspects of the press shop’s day-to-day responsibilities",
      "Compiling daily news clips",
      "Drafting speeches",
      "Drafting talking points",
      "Drafting op-eds",
      "Drafting news releases and weekly newsletters",
      "Pitching events to members of the media",
      "Managing the Congresswoman’s various social media accounts",
      "Developing creative new content to enhance her social media presence, including graphics and videos",
      "Maintaining her website"
    ],
    "qualifications": [
      "Prior experience is required (2+ years of experience working with various digital platforms, maintaining websites, and managing social media accounts for a political candidate or elected official is preferred)",
      "Colorado ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to DeGette.Employment@mail.house.gov. Please put “Deputy Communications Director/Digital Director” in the subject line. Deadline to apply is: January 20.",
    "salary_info": null,
    "contact": "DeGette.Employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-586-21",
    "position_title": "Professional Staff or Counsel",
    "office": "House Committee on Energy and Commerce Oversight and Investigations Subcommittee",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "The House Committee on Energy and Commerce Oversight and Investigations Subcommittee is seeking a mid-level Professional Staff or Counsel to work on oversight issues related to the Committee’s broad jurisdiction for the Committee’s Democratic staff. Prior familiarity working for or with Congress and area(s) of expertise under the Committee’s jurisdiction—including environment, energy, health care, public health, or consumer protection—is required.\n\nThe successful candidate will be a detail-oriented and proactive self-starter with strong communication and writing skills. A minimum of five years of work experience is required. An advanced degree is preferred but not required, as experience within the areas of the Committee’s jurisdiction may be equally relevant.",
    "responsibilities": [
      "Staffing congressional hearings",
      "Assisting in the management of investigations of governmental and non-governmental entities",
      "Conducting research, document review, and analysis",
      "Aiding in the drafting of official letters, memoranda, and investigative reports",
      "Helping to coordinate with other subcommittees of the full Committee"
    ],
    "qualifications": [
      "Prior familiarity working for or with Congress",
      "Area(s) of expertise under the Committee’s jurisdiction—including environment, energy, health care, public health, or consumer protection",
      "Detail-oriented and proactive self-starter",
      "Strong communication and writing skills",
      "A minimum of five years of work experience is required",
      "An advanced degree is preferred but not required, as experience within the areas of the Committee’s jurisdiction may be equally relevant."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and short writing sample to ecdjobs@mail.house.gov with the subject line, “E&C OI Professional Staff/Counsel.”",
    "salary_info": "Salary is commensurate with experience in the $80K–$90K range.",
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "People of color, veterans, women, and LGBTQ+ candidates are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-583-21",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2022-01-10",
    "description": "Responsibilities include welcoming office visitors, answering telephone calls, coordinating flag and tour requests, sorting and processing constituent correspondence, and other administrative duties as assigned. The ideal candidate will be detail-oriented, able to multi-task and have a positive attitude. Connecticut ties are a plus, but not required. Minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "Welcoming office visitors",
      "Answering telephone calls",
      "Coordinating flag and tour requests",
      "Sorting and processing constituent correspondence",
      "Other administrative duties as assigned"
    ],
    "qualifications": [
      "Detail-oriented",
      "Able to multi-task",
      "Positive attitude",
      "Connecticut ties are a plus, but not required"
    ],
    "how_to_apply": "Interested parties should email a cover letter, resume, writing sample and two references in a single PDF to ct05jobs@mail.house.gov with the following subject line: Full name – Staff Assistant. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "ct05jobs@mail.house.gov",
    "equal_opportunity": "Minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-582-21",
    "position_title": "Staff Assistant/ Full Committee Legislative Coordinator",
    "office": "U.S. House Committee on Veterans’ Affairs (Republican Staff)",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "The front office Staff Assistant and Legislative Coordinator would report directly to the Full Committee Deputy Staff Director and should have excellent oral and communication skills, strong organizational skills, attention to detail, a positive attitude and ability to work cooperatively and courteously with others, and a sense of humor.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates please send resumes only to the following e-mail address: VAR.Resumes@mail.house.gov with “HVAC Republican Staff Assistant” in the subject line. No calls or walk-ins.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-578-21",
    "position_title": "Press Secretary",
    "office": "Conservative Colorado member",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "Conservative Colorado member seeks Press Secretary to work under Communications Director for fast-paced office with strong social media presence.",
    "responsibilities": [],
    "qualifications": [
      "Skills in graphic design and digital media strongly preferred."
    ],
    "how_to_apply": "Email co04.resumes@gmail.com with a resume.",
    "salary_info": null,
    "contact": "co04.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-577-21",
    "position_title": "Deputy Chief/Counsel",
    "office": "Conservative Colorado member",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "for judiciary committee portfolio with an emphasis on tech and antitrust issues. Law degree strongly preferred but not required. Comfort with a fast-paced, intense work environment a must.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Email co04.resumes@gmail.com with a resume.",
    "salary_info": null,
    "contact": "co04.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-574-21",
    "position_title": "Clerk/Special Assistant to the Staff Director",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nClerk/Special Assistant to the Staff Director to support the Chief Clerk and Staff\nDirector.\n\nThe candidate will be responsible for administrative tasks, including but not\nlimited to, processing oversight mail, scheduling staff director's meetings,\nmanaging the hearings calendar, managing hearing correspondence, co-leading\nthe transcript review process, preparing hearing invitations, tracking hearing\nsubmissions, and documenting member and/or staff attendance.\n\nThe qualified candidate will be extremely organized, have editing skills, be\nattentive to detail, be hardworking, innovative, and able to handle assigned tasks\nin a demanding, fast-paced office. Ideal candidates will have a bachelor's degree,\n1-2 years of administrative experience, and congressional experience is preferred,\nbut not required.",
    "responsibilities": [
      "processing oversight mail",
      "scheduling staff director’s meetings",
      "managing the hearings calendar",
      "managing hearing correspondence",
      "co-leading the transcript review process",
      "preparing hearing invitations",
      "tracking hearing submissions",
      "documenting member and/or staff attendance"
    ],
    "qualifications": [
      "extremely organized",
      "editing skills",
      "attentive to detail",
      "hardworking",
      "innovative",
      "able to handle assigned tasks in a demanding, fast-paced office",
      "bachelor’s degree",
      "1-2 years of administrative experience",
      "congressional experience is preferred, but not required"
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter and resume\nto E&L.Jobs@mail.house.gov with “Clerk/Special Assistant to the Staff\nDirector” in the subject line.",
    "salary_info": "Salary commensurate with education and\nexperience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are strongly encouraged\nto apply."
  },
  {
    "id": "MEM-561-21",
    "position_title": "Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Subcommittee on Economic and Consumer Policy, Democratic (Majority) Staff",
    "location": null,
    "posting_date": "2022-01-10",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. The Subcommittee on Economic and Consumer Policy conducts investigations, writes reports, and holds hearings on a wide range of issues affecting consumers (e.g., marketing e-cigarettes to children; the presence of lead and other toxic metals in baby food).\nThe ideal candidate will be a strong writer with prior investigative experience and a demonstrated interest in consumer protection. Responsibilities include developing ideas for investigations, drafting document requests, reviewing documents, interviewing witnesses, writing reports, and preparing for hearings.\nCandidates with diverse backgrounds and experiences are strongly encouraged to apply.",
    "responsibilities": [
      "developing ideas for investigations",
      "drafting document requests",
      "reviewing documents",
      "interviewing witnesses",
      "writing reports",
      "preparing for hearings"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Economic and Consumer Policy” in the subject line. Please use the following formats for file names: “LastName.FirstName.Resume” and “LastName.FirstName.CoverLetter.”",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-539-21",
    "position_title": "Staff Assistant",
    "office": "Nevada’s 4th District Democratic Member of Congress",
    "location": "North Las Vegas, Nevada District office",
    "posting_date": "2022-01-10",
    "description": "Nevada’s 4th District Democratic Member of Congress seeks a highly organized, passionate, team-oriented Staff Assistant for a position in our North Las Vegas, Nevada District office. Candidates must be comfortable working with the public, have excellent oral and written communication skills, problem solving abilities.",
    "responsibilities": [
      "Managing the front desk, greeting visitors, processing flag requests, answering phones, conducting tours, overseeing an active mail program;",
      "Sorting/batching correspondence, drafting correspondence and ensuring a swift turnaround time;",
      "Responding to constituent mail, keeping abreast of legislative developments, and meeting with constituent groups;",
      "Assisting District Representatives as needed, and",
      "Perform all other duties as assigned and required"
    ],
    "qualifications": [
      "Passionate about public service and committed to democratic values;",
      "Strong writing, communication skills and be detail-oriented;",
      "Have advanced experience with spreadsheets and forms,",
      "A poised, confident, self-starter, and team-player with a sense of humor; and",
      "The ability to work in a high-paced environment.",
      "The ability work weekends and holidays",
      "Have reliable transportation, auto insurance and a clean driving record",
      "Currently enrolled in an ungraduated degree program at a college or university or have a minimum of a bachelor’s degree in the related fields of human services or social work, and a minimum of one-year relevant experience in community or human services."
    ],
    "how_to_apply": "Qualified candidates must include a cover letter, resume, one writing sample and three professional references in a single PDF file. Email submissions to the Director of Administration, nv04resume@mail.house.gov. Subject line must read \"",
    "salary_info": null,
    "contact": "Director of Administration, nv04resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Spanish language skills and District ties are a plus."
  },
  {
    "id": "MEM-NV04-DSA",
    "position_title": "__last name, First name",
    "office": "MEM-NV04",
    "location": null,
    "posting_date": "2022-01-10",
    "description": null,
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2022-01-10",
    "description": "The Office of Representative Spanberger seeks a motivated, creative, self-starter to join the district constituent services staff as a District Coordinator in the Glen Allen, VA office.\n\nResponsibilities include responding to constituent inquiries, managing constituent casework with federal agencies, working with the legislative team to address constituent concerns, and district outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events. Additional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills and have significant experience interacting with the public.\n\nAdditionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]