[
  {
    "id": "MEM-280-21",
    "position_title": "Staff Assistant",
    "office": "Midwestern Democrat",
    "location": "Capitol Hill",
    "posting_date": "2021-07-26",
    "description": "Midwestern Democrat seeking an organized, detail-oriented individual to serve in the position of Staff Assistant in a fast-paced and highly collaborative Capitol Hill office. Responsibilities include staffing and managing the front office, managing mail intake, answering and managing the phone system, greeting visitors, handling tour and flag requests, assisting staff during and after office hours, providing administrative support to the Administrative Director, and providing additional office support as needed.\n\nWhile this is an entry-level position, candidates should have excellent oral and written communication skills, great attention to detail, strong time management skills, an ability to work under pressure to meet tight deadlines, and a sense of humor. Capitol Hill and/or customer service experience are strongly preferred.\n\nMidwest and Great Lakes ties are a plus.",
    "responsibilities": [
      "Staffing and managing the front office",
      "Managing mail intake",
      "Answering and managing the phone system",
      "Greeting visitors",
      "Handling tour and flag requests",
      "Assisting staff during and after office hours",
      "Providing administrative support to the Administrative Director",
      "Providing additional office support as needed"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Great attention to detail",
      "Strong time management skills",
      "Ability to work under pressure to meet tight deadlines",
      "Sense of humor",
      "Capitol Hill and/or customer service experience are strongly preferred",
      "Midwest and Great Lakes ties are a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and writing sample in one PDF document to: midwestern.resume@mail.house.gov.",
    "salary_info": null,
    "contact": "midwestern.resume@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and women, people of color, members of the LGBTQ+ community, and members of other traditionally underrepresented communities are STRONGLY encouraged to apply."
  },
  {
    "id": "MEM-278-21",
    "position_title": "Legislative Assistant",
    "office": "Rep. Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2021-07-26",
    "description": "The Legislative Assistant will support the Member’s work on the Energy & Commerce Health Subcommittee and cover a portfolio that includes health care, reproductive rights, family services|child welfare, and other issues.",
    "responsibilities": [
      "Drafting legislation, policy letters, memos, and talking points",
      "Preparing for and staffing committee hearings",
      "Making vote recommendations",
      "Meeting and maintaining relationships with constituents and advocacy groups",
      "Working closely with the communications team and district staff",
      "Advancing a number of the Member’s legislative priorities",
      "Other tasks as required"
    ],
    "qualifications": [
      "This is NOT an entry-level position.",
      "Candidates should have at least 2-3 years of Capitol Hill or relevant policy experience",
      "Be highly motivated, detail-oriented professionals with strong organizational and time-management skills, as well as positive attitudes, and pride in work.",
      "Candidates should have a strong understanding of the legislative process, coalition building, and have the ability to maintain strategic relationships with constituent organizations, and should be comfortable managing multiple priorities in a fast paced environment.",
      "Los Angeles Metro Area|Southern California ties and Spanish language skills are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, two references, and two writing samples with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary will be commensurate with skills and experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-274-21",
    "position_title": "Staff Assistant",
    "office": "Active Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2021-07-26",
    "description": "Ideal candidate will be a motivated self-starter with outstanding interpersonal, customer service, time-management, and organizational skills.\n\n",
    "responsibilities": [
      "answering and logging telephone calls",
      "front of office operations",
      "recruiting and managing interns",
      "managing constituent requests for flags and tours",
      "assisting the Communications Director",
      "assisting with constituent mail responses and other administrative duties"
    ],
    "qualifications": [
      "relevant experience and demonstrate the ability to think on their feet to solve problems",
      "show keen attention to detail",
      "demonstrate excellent oral and written skills",
      "maintain a positive demeanor",
      "hold a clean driving record",
      "demonstrate resilience in a busy environment",
      "Candidates with California ties are preferred but not required."
    ],
    "how_to_apply": "Please submit a resume and cover letter in a single PDF document to ca07jobs@gmail.com with “DC Staff Assistant” in the subject line. No walkins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-273-21",
    "position_title": "Director of Operations",
    "office": "Rep. Karen Bass",
    "location": "Washington, DC",
    "posting_date": "2021-07-26",
    "description": "This role manages all aspects of the Member's and Chief of Staff’s daily and long-term schedule in DC and in the District, office administration (including finances, travel, etc.). This individual will work closely with the Member, Chief of Staff, DC and District staff. Qualified candidates will have strong communications and multi-tasking skills and will work well on a team.\n\nThe ideal candidate will have prior administrative and scheduling experience on the Hill or comparable work environment. Candidate must be well-organized, detail-oriented, team-oriented, self-motivated, comfortable working in a fastpaced environment focused on serving constituents. Candidate must also have comfort interfacing with a principal.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please email your cover letter, resume, and references to CA37.HR@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-268-21",
    "position_title": "Counsel or Professional Staff",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": null,
    "posting_date": "2021-07-26",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation’s response to the coronavirus crisis is efficient, effective, and equitable.\nChairman James E. Clyburn seeks to fill a Counsel or Professional Staff position on the Majority staff. The ideal candidate will be an attorney or policy professional with several years of investigative or litigation experience.",
    "responsibilities": [
      "Leading investigations",
      "Conducting depositions and transcribed interviews",
      "Preparing for hearings",
      "Drafting reports"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Counsel / Professional Staff” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-267-21",
    "position_title": "Staff Assistant and Clerk",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": "Capitol Hill",
    "posting_date": "2021-07-26",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation's response to the coronavirus crisis is efficient, effective, and equitable. Chairman James E. Clyburn seeks to fill a Staff Assistant and Clerk position on the Majority staff. The ideal candidate will be an enthusiastic and organized self-starter with previous experience working or interning on Capitol Hill. Responsibilities include editing letters, monitoring phone lines, maintaining correspondence files and other records, hosting meetings, and supporting staff on all aspects of hearings, briefings, and other events. Occasional assistance with research and writing may also be required.",
    "responsibilities": [
      "Editing letters",
      "Monitoring phone lines",
      "Maintaining correspondence files and other records",
      "Hosting meetings",
      "Supporting staff on all aspects of hearings, briefings, and other events",
      "Occasional assistance with research and writing may also be required."
    ],
    "qualifications": [
      "Superior organization skills and attention to detail",
      "Work well under pressure",
      "Be self-motivated",
      "Possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Staff Assistant and Clerk” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-265-21",
    "position_title": "Constituent Services Representative",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "Willingboro or Toms River offices",
    "posting_date": "2021-07-26",
    "description": "The Constituent Services Representative is a field representative and caseworker on behalf of the Congressman that acts as a liaison to various federal, state and local agencies, assesses problems and finds solutions in a professional manner and screens and refers cases, as appropriate.\n\nIdeal candidates will have experience managing casework, be exceptionally wellorganized and attentive to detail, be able to adhere to established casework processes, have strong oral and written communication skills, excel at time management and be able to maintain good working relationships with the Congressman, staff and constituents. An even temperament, ability to deal effectively with a wide range of personalities, and creative problem solving skills are essential.",
    "responsibilities": [
      "Interact with constituents via phone, email and in person",
      "Establish, follow through and complete constituent casework",
      "Keep accurate and complete case notes and alerts at all times",
      "Interact with assigned federal agencies",
      "Interact with local, county and state offices to make and accept referrals",
      "Establish efficient processes to handle common issues and problems",
      "Cross-train and accept changing areas of focus as needed",
      "Staff public events as needed"
    ],
    "qualifications": [
      "Casework or other high volume, high touch work",
      "Time spent in a customer service role",
      "Work with federal, state or local government",
      "Experience with casework IQ program is a plus",
      "Candidates with ties to New Jersey are strongly encouraged to apply"
    ],
    "how_to_apply": "Email cover letter, resume and 2-3 references to NJ03resumes@mail.house.gov with the subject line “Constituent Services Representative: [NAME]”. Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-261-21",
    "position_title": "Data Analyst",
    "office": "Joint Economic Committee",
    "location": null,
    "posting_date": "2021-07-26",
    "description": "The Republican staff of U.S. Congress's Joint Economic Committee seek a data\nanalyst with strong quantitative skills for the Social Capital Project. Proficiency\nin Excel as well as STATA, R, or other statistical software package is required\nfor this role. Successful candidates will have a background in economics, public\npolicy, or similar field. Ability to think creatively, work independently, and take\ninitiative is necessary.\n\nThe Project provides a unique chance to develop an ambitious agenda aimed at\nenabling more Americans to thrive in the 21st century. Interest in JEC Social\nCapital Project-related research topics, including expanding opportunity by\nstrengthening families, communities, and attachment to work, is a plus. Salary is\ncommensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "Strong quantitative skills",
      "Proficiency in Excel as well as STATA, R, or other statistical software package",
      "Background in economics, public policy, or similar field",
      "Ability to think creatively, work independently, and take initiative"
    ],
    "how_to_apply": "Interested candidates should send a resume and writing sample\nto RJobs@jec.senate.gov",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "RJobs@jec.senate.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, genetic information, national\norigin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-260-21",
    "position_title": "Senior Policy Advisor/Senior Economist",
    "office": "Republican staff of U.S Congress's Joint Economic Committee",
    "location": null,
    "posting_date": "2021-07-26",
    "description": "The Republican staff of U.S Congress's Joint Economic Committee seek a senior\npolicy advisor/senior economist for the Social Capital Project. The Project, a\n\"think tank within a committee,\" seeks candidates with experience in social\nscience and public policy research and interest in evidence-based approaches to\nexpanding opportunity by strengthening families, communities, and attachment to\nwork.\n\nFor these roles, successful candidates will have proven policy research and\nwriting experience (for a public audience) and be able to weigh empirical\nevidence and think creatively about policy. Ability to work independently and\ntake initiative are also essential.\n\nThe Project provides a unique chance to develop an ambitious policy agenda\naimed at enabling more Americans to thrive in the 21st century. We encourage\napplications from those with a masters, PhD, or equivalent level of policy\nknowledge/experience. Salary commensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "Proven policy research and writing experience (for a public audience)",
      "Ability to weigh empirical evidence and think creatively about policy",
      "Ability to work independently and take initiative",
      "Masters, PhD, or equivalent level of policy knowledge/experience"
    ],
    "how_to_apply": "Interested candidates should send a resume and writing sample (not to exceed\nthirty pages) to RJobs@jec.senate.gov",
    "salary_info": "Salary commensurate with experience.",
    "contact": "RJobs@jec.senate.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, genetic information, national\norigin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-254-21",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-07-26",
    "description": "The Committee's investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-253-21",
    "position_title": "Investigator",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-07-26",
    "description": "The Committee on Ethics seeks an experienced investigative professional for an investigator position.\n\nThe Committee’s investigator is responsible for assisting the Committee in all aspects of its investigative work, including researching and reviewing public data sources, forensic research, document review, data collection and analysis, preparing for and participating in witness interviews, and drafting and editing Committee documents.\n\nThis is a nonpartisan position which requires the ability to assist with impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding organizational, research, and analytical skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Assisting the Committee in all aspects of its investigative work",
      "Researching and reviewing public data sources",
      "Forensic research",
      "Document review",
      "Data collection and analysis",
      "Preparing for and participating in witness interviews",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Outstanding organizational, research, and analytical skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, or financial accounting.",
      "Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigator” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-252-21",
    "position_title": "Press Assistant/Digital Director",
    "office": "Senior House Republican",
    "location": "Washington, DC",
    "posting_date": "2021-07-26",
    "description": "Candidates must excel in a fast-paced existing press operation. Prior experience in a political office or campaign experience preferred, but not required.\nFamiliarity or existing contacts with conservative media outlets a major plus.\nPosition based in Washington, DC office. Must work well under pressure.",
    "responsibilities": [
      "Compile daily clips",
      "Assist with press releases, talking points, op-eds, and other materials",
      "Grow and manage a national press list",
      "Create compelling social media content",
      "Assist with maintaining office’s website and social media accounts",
      "Create and edit videos and graphics",
      "Monitor the Congressman’s presence and interactions on social media. Keeping Communications Director and Chief of Staff up-to-date on emerging trends and important conversations happening online",
      "Take photos/video at events"
    ],
    "qualifications": [
      "Video editing skills",
      "Excellent research skills",
      "Ability to write well"
    ],
    "how_to_apply": "Please submit your resume to Midwestern.Job@mail.house.gov with “Press Assistant/Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "Midwestern.Job@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-250-21",
    "position_title": "Communications Director or Press Secretary",
    "office": "Congressman John Sarbanes",
    "location": "Washington, D.C.",
    "posting_date": "2021-07-26",
    "description": "The Office of Congressman John Sarbanes seeks an experienced Communications Director or Press Secretary to serve in its Washington, D.C. office.\n\nSuccessful candidates will have impeccable writing skills, a close eye to detail, fluency with a wide range of social media platforms and digital tools – including Adobe Creative Suite and website CMS services – the ability to manage several, simultaneous projects in a fast-paced environment and experience working closely with national and local press, along with television and radio booking producers. This is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [
      "Impeccable writing skills",
      "Close eye to detail",
      "Fluency with a wide range of social media platforms and digital tools – including Adobe Creative Suite and website CMS services",
      "Ability to manage several, simultaneous projects in a fast-paced environment",
      "Experience working closely with national and local press, along with television and radio booking producers"
    ],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and writing portfolio to employment@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-247-21",
    "position_title": "In-District Press & Digital Media Assistant",
    "office": "Congresswoman Lisa Blunt Rochester",
    "location": "Wilmington, Delaware",
    "posting_date": "2021-07-26",
    "description": "This position is based in Wilmington, Delaware. Responsibilities include managing the Congresswoman's website and social media accounts, working collaboratively to generate creative and engaging content for digital platforms, drafting talking points and advisories, and staffing the Congresswoman and taking photos/videos at events.\n\nAdditionally, the press & digital media assistant will help draft and copy-edit speeches and talking points for the Congresswoman for events in Delaware, and the person in this role will report directly to the DC-based Communications Director. Prior press/digital experience; Hill or campaign experience and familiarity with social media and graphic/video design are strongly preferred. Delaware ties a major plus. Strong written and oral communications skills, a flexible schedule, access to a car, and a clean driving record are musts.",
    "responsibilities": [
      "Managing the Congresswoman's website and social media accounts",
      "Working collaboratively to generate creative and engaging content for digital platforms",
      "Drafting talking points and advisories",
      "Staffing the Congresswoman and taking photos/videos at events",
      "Drafting and copy-editing speeches and talking points for the Congresswoman for events in Delaware"
    ],
    "qualifications": [
      "Prior press/digital experience preferred",
      "Hill or campaign experience preferred",
      "Familiarity with social media and graphic/video design preferred",
      "Delaware ties a major plus",
      "Strong written and oral communications skills",
      "A flexible schedule",
      "Access to a car",
      "A clean driving record"
    ],
    "how_to_apply": "Interested candidates must submit a resume, one cover letter, two writing samples, and two examples of social media or digital media work samples to lbr.jobposting@gmail.com",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-240-21",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT/COUNSEL",
    "office": "Rep. Karen Bass (CA37)",
    "location": null,
    "posting_date": "2021-07-26",
    "description": "Rep. Karen Bass (CA37) seeks a hardworking lawyer with legal, policy, and Hill experience to serve as a Senior Legislative Assistant/Counsel, with the primary portfolio focusing on the Member’s Judiciary Committee work.\n\nResponsibilities include preparing and staffing the Member in committee hearings and markups; drafting talking points and speeches; and researching, drafting, and introducing legislation. All candidates should be a team player and possess excellent writing and communication skills, ability to work independently, and a thorough understanding of the legislative process.\n\nStrong candidates will have good relationships on the Hill with Democrats and Republicans, the ability to work effectively in a fast-paced environment, and a track record of turning ideas into legislation and preferably legislation into law.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Preparing and staffing the Member in committee hearings and markups",
      "Drafting talking points and speeches",
      "Researching, drafting, and introducing legislation"
    ],
    "qualifications": [
      "Team player",
      "Excellent writing and communication skills",
      "Ability to work independently",
      "Thorough understanding of the legislative process",
      "Good relationships on the Hill with Democrats and Republicans",
      "Ability to work effectively in a fast-paced environment",
      "Track record of turning ideas into legislation and preferably legislation into law"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and a short (1-2 page) writing sample to CA37.HR@mail.house.gov with “Senior Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, disability, military status, age, marital status, or parental status.\nWomen, people of color, LGBTQ+ individuals, and members of other underrepresented communities are strongly encouraged to apply.\nNo phone calls or drop-ins, please."
  },
  {
    "id": "MEM-235-21",
    "position_title": "Scheduler",
    "office": "Republican House Member",
    "location": "Washington, DC and in the District",
    "posting_date": "2021-07-26",
    "description": "The scheduler will manage all aspects of the Member's daily and long-term schedule in DC and in the District. This individual will work closely with the Member, DC and District staff.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Managing operational and logistical support for the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill or comparable work environment",
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Applicants should send their resume, and references to PA09Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "PA09Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-231-21",
    "position_title": "Counsel for House Judiciary Subcommittee on the Constitution, Civil Rights, and Civil Liberties",
    "office": "House Judiciary Committee’s Subcommittee on the Constitution, Civil Rights, and Civil Liberties",
    "location": null,
    "posting_date": "2021-07-26",
    "description": "The House Judiciary Committee’s Subcommittee on the Constitution, Civil Rights, and Civil Liberties seeks a dedicated and hard-working lawyer with a minimum of 5 years of professional legal experience to serve as a subcommittee counsel.\n\nThe counsel will be responsible for handling assignments in a range of issue areas, including reproductive rights, women’s issues, religious freedom, voting rights, civil rights litigation, torts and civil procedure, claims against the United States, separation of powers, federalism, individual constitutional rights, and any other areas as assigned.\n\nThe successful candidate must demonstrate exceptional writing and legal research skills, a strong work ethic, a professional temperament, and the ability to work on novel and complex matters under time and other pressures. Such a candidate must also be able to work collaboratively with a broad range of personalities. In addition, sound political judgment, prior legislative or policy experience, a substantive background in civil rights or constitutional law, and a demonstrated commitment to public service are strongly preferred. A sense of humor is a plus.",
    "responsibilities": [
      "serving as a resource for Democratic Members of the Committee on matters of law and policy within the Subcommittee’s jurisdiction",
      "drafting legislation",
      "preparing hearings",
      "drafting statements, memos, and briefing materials",
      "providing guidance to Democratic House offices on matters of constitutional and civil rights law"
    ],
    "qualifications": [
      "5 years of professional legal experience",
      "Exceptional writing and legal research skills",
      "Strong work ethic",
      "Professional temperament",
      "Ability to work on novel and complex matters under time and other pressures",
      "Ability to work collaboratively with a broad range of personalities",
      "Sound political judgment (preferred)",
      "Prior legislative or policy experience (preferred)",
      "Substantive background in civil rights or constitutional law (preferred)",
      "Demonstrated commitment to public service (preferred)",
      "A sense of humor (a plus)"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Constitution Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population. The Committee strongly encourages women and members of historically disadvantaged minority groups to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-228-21",
    "position_title": "Procurement Counsel or Professional Staff Member",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": "District of Columbia",
    "posting_date": "2021-07-26",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. Chairwoman Carolyn Maloney (D-NY) seeks to fill a Procurement Counsel or Professional Staff Member position on the Democratic staff. The ideal candidate will have several years of experience overseeing government procurement awards and performance.",
    "responsibilities": [
      "Research",
      "Investigations",
      "Briefings",
      "Managing congressional hearings"
    ],
    "qualifications": [
      "Candidates must have superior attention to detail",
      "Work well under pressure",
      "Be self-motivated",
      "Possess excellent written and oral communication skills",
      "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Procurement” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-227-21",
    "position_title": "Legislative Assistant/Senior Legislative Assistant",
    "office": "Ways and Means Republican",
    "location": "Hill",
    "posting_date": "2021-07-26",
    "description": "Senior Ways and Means Republican is seeking a legislative assistant/senior\nlegislative assistant to handle a diverse legislative portfolio. Qualified candidates\nwill have a minimum of 3 years legislative experience on the Hill and substantial\nknowledge of the legislative process and floor procedure. Strong writing, research\nand communication skills a must. All resumes handled in strict confidence.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 3 years legislative experience on the Hill",
      "Substantial knowledge of the legislative process and floor procedure",
      "Strong writing, research and communication skills"
    ],
    "how_to_apply": "Please forward a resume, cover letter and writing sample to resumes.FL16@mail.house.gov.",
    "salary_info": null,
    "contact": "resumes.FL16@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-226-21",
    "position_title": "STAFF ASSISTANT",
    "office": "Office of Representative Thomas Massie",
    "location": "Crescent Springs, Kentucky",
    "posting_date": "2021-07-26",
    "description": "The Office of Representative Thomas Massie is seeking a staff assistant to serve in the Crescent Springs, Kentucky office. Ideal candidate will be motivated self-starter with outstanding interpersonal, customer service, time-management, and organizational skills.\n\nSuccessful candidate will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, show strong attention to detail, and an ability to multitask effectively in a fast-paced environment.\n\nPrimary responsibilities will include maintaining the front office, answering phones, processing and logging constituent mail, greeting visitors, monitoring office deliveries, responding to inquiries, assisting with constituent casework, and other duties as assigned.",
    "responsibilities": [
      "Maintaining the front office",
      "Answering phones",
      "Processing and logging constituent mail",
      "Greeting visitors",
      "Monitoring office deliveries",
      "Responding to inquiries",
      "Assisting with constituent casework",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starter",
      "Outstanding interpersonal skills",
      "Customer service skills",
      "Time-management skills",
      "Organizational skills",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Strong attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume and cover letter to mary.troutman@mail.house.gov with “District Staff Assistant” in the subject line. Applications will be reviewed on a rolling basis until the position is filled.",
    "salary_info": null,
    "contact": "mary.troutman@mail.house.gov",
    "equal_opportunity": "Representative Massie’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  },
  {
    "id": "MEM-218-21",
    "position_title": "Professional Staff Member for Women Veterans Policy",
    "office": "House Committee on Veterans’ Affairs (Majority)",
    "location": "Washington, DC",
    "posting_date": "2021-07-26",
    "description": "The Democratic staff of the House Committee on Veterans’ Affairs seeks a Professional Staff Member (PSM) to join its Health Subcommittee staff.\nThe PSM will manage a portfolio focused on issues impacting women veterans to include matters related to military service, impacts to women veterans’ health, well-being, and access to care, benefits, and economic resources, as well as systemic and structural barriers which may inhibit access. The PSM will report directly to the staff director of the Subcommittee. Some travel will be required.",
    "responsibilities": [
      "Working with Committee leadership to develop an overall policy and legislative strategy",
      "Conducting oversight and investigations within the portfolio",
      "Tracking legislative and policy developments within the portfolio",
      "Drafting written product, to include memoranda, correspondence, reports, and public statements",
      "Planning and executing hearings and other official events",
      "Conducting site visits",
      "Developing and drafting legislation",
      "Engaging and working with stakeholders to include the Administration, Veterans Service Organization (VSOs), and others",
      "Supporting the full Committee and Subcommittee Chairs in advancing the Committee’s priorities"
    ],
    "qualifications": [
      "Highly qualified candidates will have significant experience with issues impacting women veterans, as well experience in government (at any level) or advocacy.",
      "Congressional experience is not required but is a plus.",
      "Qualified candidates will be extremely organized, have excellent oral and written communications skills, have a demonstrated ability to work on a team, and have a track record of successfully delivering excellent work in short timeframes."
    ],
    "how_to_apply": "All candidates are required to complete an online application via https://veterans.house.gov/opportunities to be considered.\nCandidates should upload a resume, cover letter, writing sample, and diversity & inclusion statement.\nThe diversity & inclusion statement should be 250 words or less and: 1) Explain how your past personal and/or professional experiences have contributed to your growth in understanding diversity, equity, and inclusion, and/or 2) Explain how you plan to engage in diversity, equity and inclusion matters in this role. Applications will not be considered complete if there is no diversity & inclusion statement.",
    "salary_info": "Starting salary is $90k, commensurate with experience.",
    "contact": null,
    "equal_opportunity": "In an effort to build a diverse and more inclusive work environment, the committee strongly encourages veterans, minority, women, people with disabilities, and LGBTQ+ candidates to apply."
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-07-26",
    "description": "The Office of Representative Spanberger seeks a motivated, creative, self-starter to join the district constituent services staff as a District Coordinator in the Glen Allen, VA office.\n\nResponsibilities include responding to constituent inquiries, managing constituent casework with federal agencies, working with the legislative team to address constituent concerns, and district outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events. Additional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills and have significant experience interacting with the public.\n\nAdditionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]