[
  {
    "id": "MEM-106-21",
    "position_title": "DIGITAL DIRECTOR / PRESS SECRETARY",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": "Capitol Hill",
    "posting_date": "2021-04-05",
    "description": "Congressman Mark Pocan (WI-02), member of both the House Appropriations and Education & Labor Committees, is seeking a highly motivated, detail-orientated, and energetic individual with experience in digital media strategy and video editing for a Digital Director/Press Secretary position.\n\nDaily tasks include managing and creating content for member’s social media platforms and website; graphic design; video filming and editing; daily press clips; managing in-district media relations; drafting releases, newsletters and advisories; and organizing press events. The ideal candidate will be creative, have a strong proficiency in crafting digital content, experience coordinating with media, and be a detail-oriented team player able to handle multiple tasks at once.\n\nExcellent writing and strong organizational skills are essential, along with the ability to be a self-starter while working in a fast-paced environment. Capitol Hill experience is a plus, but not required. A sense of humor is greatly appreciated, and the position reports to the Communications Director.",
    "responsibilities": [
      "Managing and creating content for member's social media platforms and website",
      "Graphic design",
      "Video filming and editing",
      "Daily press clips",
      "Managing in-district media relations",
      "Drafting releases, newsletters and advisories",
      "Organizing press events"
    ],
    "qualifications": [
      "Creative",
      "Strong proficiency in crafting digital content",
      "Experience coordinating with media",
      "Detail-oriented team player able to handle multiple tasks at once",
      "Excellent writing skills",
      "Strong organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Capitol Hill experience a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples, and an example of previous digital media or graphic design projects to WI02JobOpening@gmail.com with “Digital Director/Press Secretary” in the subject line. Job opening closes COB on April 8th. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-105-21",
    "position_title": "Health Legislative Assistant",
    "office": "Congresswoman Lisa Blunt Rochester (DE-At Large)",
    "location": "Washington, D.C.",
    "posting_date": "2021-04-05",
    "description": "Legislative portfolio will be focused on health care and will handle all of the Congresswoman’s work related to her assignment on the Energy & Commerce Health Subcommittee.\n\nThis position requires the ability to advance the Congresswoman’s legislative priorities in the health care portfolio and be creative in spotting new legislative opportunities. Candidates must be self-starters, able to meet short deadlines, and juggle many priorities in a fast-paced environment. Ties to Delaware are a plus.\n\nThis is not an entry level position",
    "responsibilities": [],
    "qualifications": [
      "Good knowledge of the legislative process",
      "Healthcare policy background",
      "Coalition building skills",
      "Ability to maintain strategic relationships with constituent organizations",
      "Self-starter",
      "Able to meet short deadlines",
      "Able to juggle many priorities in a fast-paced environment",
      "Ties to Delaware are a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and two writing samples to lbr.jobposting@gmail.com with “Health Legislative Assistant” in the subject line by COB April 12th. No phone calls, drop-ins, or emails please.",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "Equal Opportunity Employer"
  },
  {
    "id": "MEM-104-21",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT/COUNSEL",
    "office": "Rep. Karen Bass (CA37)",
    "location": "Hill",
    "posting_date": "2021-04-05",
    "description": "Rep. Karen Bass (CA37) seeks a hardworking lawyer with legal, policy, and Hill experience to serve as a Senior Legislative Assistant/Counsel, with the primary portfolio focusing on the Member’s Judiciary Committee work.\n\nResponsibilities include preparing and staffing the Member in committee hearings and markups; drafting talking points and speeches; and researching, drafting, and introducing legislation. All candidates should be a team player and possess excellent writing and communication skills, ability to work independently, and a thorough understanding of the legislative process.\n\nStrong candidates will have good relationships on the Hill with Democrats and Republicans, the ability to work effectively in a fast-paced environment, and a track record of turning ideas into legislation and preferably legislation into law.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Preparing and staffing the Member in committee hearings and markups",
      "Drafting talking points and speeches",
      "Researching, drafting, and introducing legislation"
    ],
    "qualifications": [
      "Team player",
      "Excellent writing and communication skills",
      "Ability to work independently",
      "Thorough understanding of the legislative process",
      "Good relationships on the Hill with Democrats and Republicans",
      "Ability to work effectively in a fast-paced environment",
      "Track record of turning ideas into legislation and preferably legislation into law",
      "Legal, policy, and Hill experience"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and two short (1-2 page) writing samples to CA37.HR@mail.house.gov with “Senior Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, disability, military status, age, marital status, or parental status.\nWomen, people of color, LGBTQ+ individuals, and members of other underrepresented communities are strongly encouraged to apply. No phone calls or drop-ins, please."
  },
  {
    "id": "MEM-103-21",
    "position_title": "Scheduler",
    "office": "Congressman Steve Cohen (TN-09)",
    "location": "DC",
    "posting_date": "2021-04-05",
    "description": "This individual is responsible for organizing, tracking, evaluating, and responding to all DC and legislative scheduling requests, making travel arrangements, and managing all aspects of the member’s daily and long-term DC schedule.\n\nIn addition to these duties, the Scheduler will be involved in various administrative tasks including tracking leave requests, House training compliance, member and staff reimbursements, parking coordination, and other duties as assigned. The ideal candidate will, in a fast-paced environment, have exceptional attention to detail and problem-solving skills, the ability to remain flexible to last-minute changes and demands, and a strong work ethic.",
    "responsibilities": [
      "Organizing, tracking, evaluating, and responding to all DC and legislative scheduling requests",
      "Making travel arrangements",
      "Managing all aspects of the member’s daily and long-term DC schedule",
      "Tracking leave requests",
      "House training compliance",
      "Member and staff reimbursements",
      "Parking coordination",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Exceptional attention to detail",
      "Problem-solving skills",
      "Ability to remain flexible to last-minute changes and demands",
      "Strong work ethic"
    ],
    "how_to_apply": "Interested applicants should email a resume, writing sample, and cover letter to Cohen.jobs@mail.house.gov with the subject line, “Scheduler: Last name.”",
    "salary_info": null,
    "contact": "Cohen.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Women, people of color, and LGBTQ+ candidates are strongly encouraged to apply.\n\nApplicants with disabilities who require reasonable accommodation to participate effectively in the application or hiring processes are encouraged to request an accommodation at any time during those processes. Requests for accommodation should be directed to Cohen.jobs@mail.house.gov."
  },
  {
    "id": "MEM-102-21",
    "position_title": "Digital Manager",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "The Digital Manager will be responsible for developing, implementing, and executing a digital strategy to effectively communicate with the public and grow the Committee’s online presence. Daily responsibilities will include developing creative content, managing the Committee’s website, and coordinating digital media strategy with Member offices and stakeholder groups.\nThe ideal candidate will be resourceful and proactive, have strong graphic design and video editing skills, and a working knowledge of the legislative process and Hill press operations. Candidates should have at least three years of experience working in digital communications. Congressional or campaign experience preferred but not required.",
    "responsibilities": [
      "Developing creative content",
      "Managing the Committee’s website",
      "Coordinating digital media strategy with Member offices and stakeholder groups"
    ],
    "qualifications": [
      "Resourceful and proactive",
      "Strong graphic design and video editing skills",
      "Working knowledge of the legislative process and Hill press operations",
      "At least three years of experience working in digital communications",
      "Congressional or campaign experience preferred but not required"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 2 work samples, and 3 professional references to E&L.Jobs@mail.house.gov with \"Digital Manager\" in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-101-21",
    "position_title": "Field Representative/Caseworker",
    "office": "Southern California Democrat",
    "location": "San Diego County District Office",
    "posting_date": "2021-04-05",
    "description": "Southern California Democrat is seeking a bilingual, high energy, highlyorganized, and detail- oriented Field Representative/Caseworker for San Diego County District Office.",
    "responsibilities": [
      "Serve as an official representative for the Member throughout communities in the District.",
      "Act as liaison to federal, district, and local government agencies and elected officials.",
      "Establish and maintain effective relationships with community members and organizations.",
      "Monitor local issues of importance and keep the District Director updated.",
      "Provide logistical support and staff the Member at district meetings and events.",
      "Assess local and casework-related issues for problems requiring possible legislative action; make recommendations to the District Director and Chief of Staff.",
      "Respond to casework correspondence and inquiries from constituents.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached."
    ],
    "qualifications": [
      "A candidate with an understanding of federal issues.",
      "Veterans, women, and minorities encouraged to apply.",
      "Ability to work non-traditional hours, including nights and weekends.",
      "Excellent written and interpersonal communication skills.",
      "Ability to work with staff at all levels, work well under pressure and be detailoriented.",
      "Possess an understanding of the federal legislative process.",
      "Ability to quickly learn about key issues and events in the district for which the Member is involved.",
      "A qualified applicant must possess a valid California driver’s license with the ability to travel as needed.",
      "Applicants bilingual in Spanish and/or Tagalog preferred."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to cajobs@mail.house.gov.",
    "salary_info": null,
    "contact": "cajobs@mail.house.gov",
    "equal_opportunity": "Veterans, women, and minorities encouraged to apply."
  },
  {
    "id": "MEM-100-21",
    "position_title": "Grants Coordinator",
    "office": "The Offices of Congressman Antonio Delgado (NY-19) and Congressman Paul D. Tonko (NY-20)",
    "location": "New York offices",
    "posting_date": "2021-04-05",
    "description": "The Offices of Congressman Antonio Delgado (NY-19) and Congressman Paul\nD. Tonko (NY-20) seek an enthusiastic, motivated, and highly organized Grants\nCoordinator to be based out of their New York offices.\n\nThe incumbent will have the unique opportunity to support multiple\nCongressional offices and as such will report to two or more managers.\nTherefore, the incumbent will be expected to understand multiple office policies\nand procedures as well as establish and maintain effective relationships with\nassociated office staff in multiple offices.",
    "responsibilities": [
      "Managing all functions of the offices’ grants programs.",
      "Providing direct support to constituents, including but not limited, to local\ngovernments, small businesses and non-profit organizations seeking federal\nfinancial assistance, researching potential federal, state and private grant\nopportunities.",
      "Drafting correspondence related to constituent grant applications and working\nwith staff to conduct outreach and communications on federal funding and\nresources."
    ],
    "qualifications": [
      "Applicant must have a passion for public service, great organizational skills,\nstrong writing skills, the ability to learn quickly, and a solid team mentality.",
      "Extra consideration will be given to those with NY-19 and/or NY-20 ties and a safe vehicle with a good driving record."
    ],
    "how_to_apply": "Interested individuals should email a cover letter, resume, and a writing sample of no less than one (1) page and no more than five (5) pages to NY20jobs@mail.house.gov with “Grants Coordinator Employment Opportunity” in the subject line.\n\nNo phone calls or drop-ins, please. Applications will be considered on a rolling basis, but all materials must be received by April 16, 2021.",
    "salary_info": "Compensation commensurate with experience. Employees of the U.S. House of Representatives are eligible to participate in the various employee benefits plans (e.g. Thrift Savings Plan, Federal Employees Health Benefits, Federal Employees Life Insurance, etc.) to which other federal employees are entitled.",
    "contact": "NY20jobs@mail.house.gov",
    "equal_opportunity": "The Offices of Congressman Antonio Delgado and Congressman Paul D. Tonko are equal opportunity employers; they do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation or gender identity or expression."
  },
  {
    "id": "MEM-099-21",
    "position_title": "Professional Staff Member",
    "office": "Chairman Ro Khanna, Committee on Oversight and Reform, Subcommittee on the Environment",
    "location": "Washington, DC",
    "posting_date": "2021-04-05",
    "description": "Chairman Ro Khanna seeks an exceptional, self-motivated candidate to staff Mr.\nKhanna on the Committee on Oversight and Reform, Subcommittee on the\nEnvironment.\n\nThe jurisdiction of the subcommittee includes: global climate change;\nenvironmental protection, public lands, endangered species, air and water quality;\noceans; public health; conservation; international agreements; energy policy,\nresearch and development; and oversight and legislative jurisdiction over\nregulatory affairs and federal paperwork reduction.\n\nThe Oversight and Reform Committee is the principal oversight committee in the\nHouse of Representatives.\n\nThe Chairman is particularly interested in candidates with a commitment to and\nan interest in engaging:\n*Clean technology jobs of the future, regenerative agriculture, toxic substances,\nand other sustainable energy and environment issues;\n*Environmental justice and the disproportionate effects of pollution on\nvulnerable communities;\n*Experience working with environmental federal agencies;\n*Congressional procedure, investigations, and legislation; and\n*Progressive policy solutions to combat the climate crisis.\n\nThe right candidate will serve as a critical part of a close-knit team. This person\nwill keep Chairman Khanna and the Staff Director fully informed of and staff all\nEnvironment Subcommittee events and activities and be an integral member of\nthe subcommittee staff.\n\nApplicants will be working from home in the shortterm. Once the team returns to work in the office, the candidate should be willing\nto be in the office full time and be able to attend work duties on some evenings\nand weekends.",
    "responsibilities": [
      "designing and preparing congressional hearings",
      "working with multiple stakeholders to design legislative solutions to address complex national policy concerns",
      "conducting legal and factual research",
      "writing memoranda, statements, questions and speeches",
      "ensuring subcommittee priorities are reflected in appropriations and authorization bills",
      "and leading oversight initiatives"
    ],
    "qualifications": [
      "Applicants should have (i) an interest in public service and (ii) expertise in the areas described above (iii) the ability to work closely with a team and remain entrepreneurial.",
      "They also must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills."
    ],
    "how_to_apply": "Please submit cover letter, resume and writing sample\nto reprokhannaca17@gmail.com with the subject line as “Environment\nSubcommittee Professional Staff Member.”",
    "salary_info": "Salary is commensurate with experience. Women, minorities, veterans and\nLGBTQ+ candidates are strongly encouraged to apply.",
    "contact": "reprokhannaca17@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status."
  },
  {
    "id": "MEM-096-21",
    "position_title": "Press Secretary/Communications Director",
    "office": "Rep. Sharice Davids (KS-03)",
    "location": "Washington, D.C.",
    "posting_date": "2021-04-05",
    "description": "Responsibilities include creating and implementing a proactive communications strategy; handling daily media inquiries; writing press releases, opinion pieces, speeches, and talking points; building relationships with local and national media contacts; as well as working closely with legislative staff to effectively message policy issues.\nQualified candidates must have excellent communication and organizational skills, experience speaking on-the-record, and the ability to be a self-starter while working in a fast-paced environment. Kansas ties are a plus.\nThis is not an entry-level position. The office is committed to building a diverse and inclusive team and is an equal opportunity employer.",
    "responsibilities": [
      "Creating and implementing a proactive communications strategy",
      "Handling daily media inquiries",
      "Writing press releases, opinion pieces, speeches, and talking points",
      "Building relationships with local and national media contacts",
      "Working closely with legislative staff to effectively message policy issues"
    ],
    "qualifications": [
      "Excellent communication and organizational skills",
      "Experience speaking on-the-record",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Kansas ties are a plus"
    ],
    "how_to_apply": "Interested candidates should send a resume, cover letter, and writing sample to ks03.jobs@mail.house.gov with the subject line “Press Secretary/Communications Director” by COB April 6, 2021.\nPlease no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ks03.jobs@mail.house.gov",
    "equal_opportunity": "The office is committed to building a diverse and inclusive team and is an equal opportunity employer."
  },
  {
    "id": "MEM-094-21",
    "position_title": "Director of Labor Oversight",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nDirector of Labor Oversight to manage oversight and investigations on the\nLabor team.",
    "responsibilities": [
      "Organizing oversight hearings",
      "Writing investigative reports",
      "Executing a complementary legislative and oversight strategy with positive results"
    ],
    "qualifications": [
      "Must have a J.D. and relevant policy experience with at least 3-5 years of experience conducting investigations.",
      "Experience in labor policy is not a requirement, however preferred.",
      "Must have exceptional writing skills, strong attention to detail, ability to juggle multiple projects, and have direct management experience."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, a writing sample (5-10 pages), a\nwriting sample describing an investigation the applicant would like to pursue, and\n3 professional references. The second writing sample must include a hyperlink to\na current news item from any source (newspapers, blogs, or other websites) and\ntwo paragraphs detailing why the Committee should investigate the issue\npresented and the steps the applicant would take to begin an investigation.",
    "salary_info": "$95K - $115K, commensurate with education and experience",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are strongly encouraged\nto apply."
  },
  {
    "id": "MEM-093-21",
    "position_title": "Press Assistant",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a proactive, hard-working individual to serve as Press Assistant. Candidates must have exceptional writing skills, strong attention to detail, and the ability to work effectively in a team environment. Responsibilities include but are not limited to: drafting press releases and remarks, coordinating press activities with Committee offices, managing the Committee website, compiling and distributing press clips, tracking press and social media analytics, and supporting a wide range of other communications work.\nThe ideal candidate will have 1-2 years of relevant communications experience.",
    "responsibilities": [
      "drafting press releases and remarks",
      "coordinating press activities with Committee offices",
      "managing the Committee website",
      "compiling and distributing press clips",
      "tracking press and social media analytics",
      "supporting a wide range of other communications work"
    ],
    "qualifications": [
      "exceptional writing skills",
      "strong attention to detail",
      "ability to work effectively in a team environment",
      "1-2 years of relevant communications experience"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, brief work samples, and 3 professional references to E&L.Jobs@mail.house.gov with \"Press Assistant\" in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-090-21",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Linda T. Sanchez",
    "location": "Washington, D.C.",
    "posting_date": "2021-04-05",
    "description": "Congresswoman Linda T. Sanchez, a Senior Member of the Committee on Ways and Means, seeks a Legislative Assistant to handle the Congresswoman’s work on the Social Security Subcommittee, as well as a diverse portfolio including Defense, Foreign Affairs, Housing, and other legislative issues. The Legislative Assistant will be responsible for developing legislative initiatives, meeting with constituents and interested groups on behalf of the Congresswoman, and staffing the Congresswoman for committee hearings and markups.",
    "responsibilities": [
      "Developing legislative initiatives",
      "Meeting with constituents and interested groups on behalf of the Congresswoman",
      "Staffing the Congresswoman for committee hearings and markups"
    ],
    "qualifications": [
      "At least 3 years of Hill experience",
      "Strong understanding of the issues listed",
      "Ability to work well with a team in a small, fast-paced environment",
      "Ability to maintain a sense of humor"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and writing sample to CAdemofficejob@gmail.com.",
    "salary_info": null,
    "contact": "CAdemofficejob@gmail.com",
    "equal_opportunity": "The Congresswoman strongly values diversity and encourages candidates of all backgrounds to apply."
  },
  {
    "id": "MEM-087-21",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2021-04-05",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible legislative office staff.\n\nThe candidate must have strong interpersonal skills, be comfortable with managing multiple tasks and able to work well under pressure.\n\nThe staff assistant is responsible for front office duties, including answering and screening telephone calls, mail distribution, room reservations, and responding to constituent requests for flags, tours, and other information. The staff assistant also serves as intern coordinator by recruiting training, scheduling and assigning duties.\n\nThe ideal candidate will have a bachelor's degree, significant experience interacting with the public, excellent writing and communication skills and a working knowledge of the District of Columbia. Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired.",
    "responsibilities": [
      "Front office duties, including answering and screening telephone calls",
      "Mail distribution",
      "Room reservations",
      "Responding to constituent requests for flags, tours, and other information",
      "Serves as intern coordinator by recruiting training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge of the District of Columbia",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-086-21",
    "position_title": "Legislative Director",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-04-05",
    "description": "The Office of Congressman Kweisi Mfume seeks a Legislative Director for its\nWashington, DC office. The ideal candidate is highly-organized, passionate,\nfriendly, and has noteworthy experience.\n\nThe position requires an incredible attention to detail. Due to COVID-19 work is often from home.",
    "responsibilities": [
      "Assisting in the development of policy positions and legislative initiatives",
      "Managing and supervising the office's legislative staff"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a resume and cover letter to MD07employment@mail.house.gov. Applications will be considered on a rolling basis, but no application will be considered later than April 16, 2021. No phone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-085-21",
    "position_title": "Communications Director",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-04-05",
    "description": "The Office of Congressman Kweisi Mfume seeks a Communications Director for its Washington, DC office. The ideal candidate is highly-organized, passionate, friendly, and has noteworthy experience.\n\nResponsibilities include managing and coordinating the messaging and communications activities, including media contacts, for the Member and the office. Traditional and digital communications are managed by the Communications Director including press statements, press releases, mass emails, social media posts, and website updates.\n\nThe position requires an incredible attention to detail. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Due to COVID19, work is often from home.",
    "responsibilities": [
      "Managing and coordinating the messaging and communications activities, including media contacts, for the Member and the office.",
      "Managing traditional and digital communications including press statements, press releases, mass emails, social media posts, and website updates."
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send a resume and cover letter to MD07employment@mail.house.gov. Applications will be considered on a rolling basis, but no application will be considered later than April 16, 2021. No phone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-084-21",
    "position_title": "Legislative Assistant",
    "office": "Congressman Kweisi Mfume",
    "location": "Washington, DC",
    "posting_date": "2021-04-05",
    "description": "The Office of Congressman Kweisi Mfume seeks a Legislative Assistant for its\nWashington, DC office. The ideal candidate is highly-organized, passionate,\nfriendly, and has noteworthy experience.",
    "responsibilities": [
      "Developing and planning legislative initiatives",
      "Monitoring legislative developments within Committees and on the House floor",
      "Tracking legislation, executive action, administrative action, and other governmental developments",
      "Drafting constituent correspondence for the Member",
      "Preparing for committee meetings and hearings",
      "Answering constituent letters",
      "Helping constituents with federal matters"
    ],
    "qualifications": [
      "Incredible attention to detail"
    ],
    "how_to_apply": "Applicants should send a resume and cover letter\nto MD07employment@mail.house.gov. Applications will be considered on a\rolling basis, but no application will be considered later than April 16, 2021. No\nphone calls, faxes, or emails.",
    "salary_info": null,
    "contact": "MD07employment@mail.house.gov",
    "equal_opportunity": "The office is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-078-21",
    "position_title": "Scheduler",
    "office": "Western Republican Member",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "Western Republican Member has opportunity for a motivated, well organized, and talented scheduler.\n\nQualified candidates will have experience managing a fast-paced schedule for a Member of Congress, processing all incoming schedule requests and arranging travel. The scheduler will work closely with Member, Chief of Staff, and District Director in advancing priorities of the office. This position requires attention to detail, problem solving skills, good judgment and the ability to work as part of a team.",
    "responsibilities": [],
    "qualifications": [
      "Prior relevant experience required",
      "Position requires reasonable flexibility and availability beyond normal office hours."
    ],
    "how_to_apply": "Please email cover letter and resume to uscongressjobs@gmail.com",
    "salary_info": "salary commensurate with experience",
    "contact": "uscongressjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-077-21",
    "position_title": "Legislative Director",
    "office": "Congressman Mondaire Jones (D-NY)",
    "location": "Washington, D.C.",
    "posting_date": "2021-04-05",
    "description": "The Legislative Director will be responsible for advancing the Congressman’s legislative priorities and supporting his work on the Judiciary and Education and Labor Committees. Rep. Jones serves as Freshman Representative to Leadership, co-chair of the Equality Caucus, Deputy Whip of the Congressional Progressive Caucus, and Vice Chair of the Subcommittee on Courts, Intellectual Property, and the Internet.\n\nThis is not an entry-level position; only candidates with previous House-side Hill experience and extensive legislative acumen will be considered and contacted. JD and previous experience serving as a Legislative Director or senior policy staff are strongly preferred.",
    "responsibilities": [],
    "qualifications": [
      "Substantial experience working on a variety of issues, including education, health, employment, labor, transportation, appropriations, housing, and other issues that impact majority-minority communities.",
      "Strong academic credentials",
      "Committee experience",
      "Proven leadership skills",
      "Strong oral and written communication skills",
      "The ability to work well under pressure",
      "Extensive knowledge of the legislative process",
      "Be available to work long hours"
    ],
    "how_to_apply": "You can find the application via the following link: https://airtable.com/shriBI8YHiyDXXfR0\n\nDue to the volume of applications we receive, we will only contact you if we decide to move forward with your application. Please no calls, direct emails, or walk-ins.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": "Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with ties to New York (and NY-17 in particular)."
  },
  {
    "id": "MEM-076-21",
    "position_title": "Economist",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, D.C.",
    "posting_date": "2021-04-05",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an\nEconomist to provide expert advice on labor economics, and support policy\nmaking initiatives in health, education and human services.\nThe Economist must be able to successfully communicate data and findings in an\naccessible manner to a non-technical audience and demonstrate a commitment to\nsocial justice and expanding economic opportunity. Responsibilities include\nassisting labor, health and education policy staff to draft legislation; prepare\nmaterials for hearings, markups and floor activity; and draft memos.\nThe Economist is also expected to conduct research, track and report on labor\nmarket and macroeconomic developments; coordinate appropriations and budget\nrelated matters; evaluate regulatory proposals; track other committees' activities\nthat intersect with the Ed and Labor Committee; provide cost/budget\njustifications for policy priorities; and, coordinate with oversight and\ncommunications teams in support of the Committee's agenda.",
    "responsibilities": [
      "Assist labor, health and education policy staff to draft legislation",
      "Prepare materials for hearings, markups and floor activity",
      "Draft memos",
      "Conduct research, track and report on labor market and macroeconomic developments",
      "Coordinate appropriations and budget related matters",
      "Evaluate regulatory proposals",
      "Track other committees’ activities that intersect with the Ed and Labor Committee",
      "Provide cost/budget justifications for policy priorities",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "At a minimum a Bachelor’s degree in Economics",
      "Quantitative aptitude",
      "Analytical mindset",
      "Good problem-solving skills",
      "At least 5 years of experience as a professional economist",
      "Strong writing, communication, and organizational skills",
      "Ability to successfully manage multiple projects under deadlines",
      "Collaborative disposition"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Economist\" in the subject line.",
    "salary_info": "The salary range is $70K to $95K, commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-075-21",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Professional Staff member to provide expert advice, advance legislation and provide oversight on workplace safety and health, and to support policy making where workplace safety issues cross cut with the Committee’s initiatives in health, education and human services.\n\nThe Candidate will draft legislation, organize and prepare materials for hearings, markups and floor activity; draft memos; research, track and report on workplace safety and health developments; engage with other committees and the full array of stakeholders; evaluate regulatory and legislative proposals from relevant agencies, including OSHA, MSHA, NIOSH, and the Department of Labor’s Office of Workers’ Compensation Programs; and coordinate with oversight and communications teams in support of the Committee’s agenda.",
    "responsibilities": [
      "Draft legislation",
      "Organize and prepare materials for hearings, markups and floor activity",
      "Draft memos",
      "Research, track and report on workplace safety and health developments",
      "Engage with other committees and the full array of stakeholders",
      "Evaluate regulatory and legislative proposals from relevant agencies, including OSHA, MSHA, NIOSH, and the Department of Labor’s Office of Workers’ Compensation Programs",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "A degree in a relevant discipline or at least 3 years of experience in Congress, a regulatory agency, union or other organization working on health and safety issues.",
      "Ability to anticipate emerging issues, support build support for initiatives, and successfully communicate safety and health information in an accessible manner to a nontechnical audience.",
      "An analytical mindset and good problem-solving skills.",
      "Exceptional writing, communication, and organizational skills.",
      "Ability to successfully manage multiple projects under tight deadlines.",
      "Display a collaborative disposition",
      "A commitment to social justice and expanding economic opportunity."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Workplace Safety\" in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-074-21",
    "position_title": "Legislative Counsel",
    "office": "House Ways and Means Committee",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "Progressive California Democrat and member of the House Ways and Means Committee seeks a Legislative Counsel to handle an active immigration and judiciary portfolio. This position also leads the member’s work on the Ways and Means Worker & Family Support Subcommittee in addition to handling child welfare, poverty, labor, civil rights, and social security issues.\n\nResponsibilities include: preparing and staffing the Member in committee hearings and markups, developing and advancing legislation and other policy priorities of the Member, researching and advising the Member on policy issues and vote recommendations, drafting talking points and speeches, and representing the Member in meetings and events.\n\nThe successful candidate will be an independent worker and a self-starter, possess the capacity to produce high-quality work in a fast-paced environment and have strong communication and writing skills. Preferred candidates will have a background in immigration policy. Candidate must be able to synthesize complex technical information under tight deadlines and be able to work well with a variety of competing interest groups. Must possess a positive attitude, a good sense of humor and thrive in a team environment.\n\nThis is not an entry level position. J.D. preferred but not required.",
    "responsibilities": [
      "Preparing and staffing the Member in committee hearings and markups",
      "Developing and advancing legislation and other policy priorities of the Member",
      "Researching and advising the Member on policy issues and vote recommendations",
      "Drafting talking points and speeches",
      "Representing the Member in meetings and events"
    ],
    "qualifications": [
      "Independent worker and a self-starter",
      "Capacity to produce high-quality work in a fast-paced environment",
      "Strong communication and writing skills",
      "Background in immigration policy (preferred)",
      "Ability to synthesize complex technical information under tight deadlines",
      "Ability to work well with a variety of competing interest groups",
      "Positive attitude and a good sense of humor",
      "Ability to thrive in a team environment",
      "J.D. preferred but not required"
    ],
    "how_to_apply": "Please e-mail your resume, cover letter, and a short writing sample to ca27jobs@gmail.com.",
    "salary_info": null,
    "contact": "ca27jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-073-21",
    "position_title": "General Counsel",
    "office": "The House Committee on Small Business",
    "location": null,
    "posting_date": "2021-04-05",
    "description": "The House Committee on Small Business seeks a General Counsel to advise the Chairwoman, Members, and staff on the rules and procedures of the Committee and assist senior staff in overseeing the legislative activities of the Committee.\n\nCandidates should possess excellent writing and organizational skills, be detail-oriented, and demonstrate an ability to work well under pressure and short deadlines.\n\nAn ideal candidate will have prior Hill experience and/or and a strong understanding of the House Rules. This is not an entry level position. The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply.",
    "responsibilities": [
      "Preparing for hearings, markups, and floor activity",
      "Tracking legislation",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Excellent writing and organizational skills",
      "Detail-oriented",
      "Ability to work well under pressure and short deadlines",
      "Prior Hill experience and/or a strong understanding of the House Rules (ideal)"
    ],
    "how_to_apply": "Interested applicants should submit a resume, cover letter and writing sample to: hsbcdems@gmail.com with the subject line General Counsel.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The Committee is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply."
  }
]