[
  {
    "id": "MEM-296-20",
    "position_title": "Policy Analyst",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": null,
    "posting_date": "2020-11-23",
    "description": "The broad jurisdiction of the subcommittee includes consumer protection generally; motor vehicle safety; consumer product safety; regulation of commercial practices, including sports-related matters; consumer privacy and data security; and travel, tourism, and time. The subcommittee oversees the National Highway Traffic Safety Administration, the Consumer Product Safety Commission, and the Federal Trade Commission, among others.\n\nThe position requires the handling of substantive legislative and administrative tasks, including staffing hearings and markups, conducting oversight, and drafting legislation.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 1-2 years of experience in the House of Representatives",
      "Strong writing, analytical, and legislative skills",
      "Sound political judgment",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Willingness to work long hours and weekends",
      "Experience working with relevant public interest groups, relevant agencies, Congress, and industry"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line “Consumer Protection PA Candidate [your last name].”",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age."
  },
  {
    "id": "MEM-294-20",
    "position_title": "Staff Assistant",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2020-11-23",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Staff\nAssistant to provide administrative and legislative support. Applicants should\nhave at least 2 years of administrative experience, preferably in a congressional\nsetting.\n\nPrimary duties include welcoming and interacting with visitors; answering phone\ncalls with a pleasant and professional demeanor; processing mail; drafting\nmemos, letters, and other Committee documents; assist in preparing for\nCommittee hearings, markups, and briefings; and ad hoc projects as assigned.\n\nCandidates should have excellent communications and interpersonal skills,\nshould be team oriented while able to work independently, highly-organized,\nprofessional and resourceful.",
    "responsibilities": [
      "welcoming and interacting with visitors",
      "answering phone calls with a pleasant and professional demeanor",
      "processing mail",
      "drafting memos, letters, and other Committee documents",
      "assist in preparing for Committee hearings, markups, and briefings",
      "ad hoc projects as assigned"
    ],
    "qualifications": [
      "at least 2 years of administrative experience, preferably in a congressional setting",
      "excellent communications and interpersonal skills",
      "team oriented while able to work independently",
      "highly-organized",
      "professional and resourceful"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample,\nand 3 professional references to E&L.Jobs@mail.house.gov with \"Staff\nAssistant\" in the subject line.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are encouraged to\napply."
  },
  {
    "id": "MEM-293-20",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2020-11-23",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a\nProfessional Staff member responsible for elementary and secondary education\n(K-12) policy legislation.\n\nCandidates should have familiarity with federal education policy, including the\nElementary and Secondary Education Act, General Education Provisions Act,\nCarl D. Perkins Career and Technical Education Act, and the Individuals with\nDisabilities Education Act. Knowledge of other statutes and policies within the\nCommittee’s jurisdiction and how they impact elementary and secondary\neducation policy is preferred.\n\nApplicants should have at least two years of policy or legal experience; prior Hill\nexperience is preferred. Tasks will include supporting the development of\nlegislation, providing technical assistance to the Committee and Member offices,\nresearching pertinent issues, preparing written materials and legislative analyses,\nand supporting the execution of committee proceedings and events related to K12 education.",
    "responsibilities": [
      "supporting the development of legislation",
      "providing technical assistance to the Committee and Member offices",
      "researching pertinent issues",
      "preparing written materials and legislative analyses",
      "supporting the execution of committee proceedings and events related to K12 education"
    ],
    "qualifications": [
      "familiarity with federal education policy, including the Elementary and Secondary Education Act, General Education Provisions Act, Carl D. Perkins Career and Technical Education Act, and the Individuals with Disabilities Education Act",
      "at least two years of policy or legal experience; prior Hill experience is preferred"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, and two short writing\nsamples to E&L.Jobs@mail.house.gov with \"K-12 Education Professional Staff\"\nin the subject line.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are encouraged to\napply."
  },
  {
    "id": "MEM-292-20",
    "position_title": "Professional Staff member",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2020-11-23",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Professional Staff member responsible for labor policy legislation, with a dual focus on workforce development programs, and workplace safety and health/mine safety and health.\n\nThe successful applicant will work with lead labor policy staff in both areas to organize and prepare materials for legislative hearings, markups and floor activity; track floor and other committees’ activities; research, review and draft legislation; solicit input from stakeholders; draft letters, dear colleagues and memos; track regulatory developments; support Member requests for assistance; and coordinate with oversight and communications teams in support of the Committee’s agenda.",
    "responsibilities": [
      "Organize and prepare materials for legislative hearings, markups and floor activity",
      "Track floor and other committees’ activities",
      "Research, review and draft legislation",
      "Solicit input from stakeholders",
      "Draft letters, dear colleagues and memos",
      "Track regulatory developments",
      "Support Member requests for assistance",
      "Coordinate with oversight and communications teams in support of the Committee’s agenda"
    ],
    "qualifications": [
      "At least 3 years of experience in Congress, federal agency or advocacy organization working on labor policy issues with in-depth knowledge of federal workforce development programs and/or workplace health and safety.",
      "An advanced degree in either area can substitute for experience.",
      "Exceptional writing, communication, and organizational skills.",
      "Ability to successfully manage multiple projects under deadlines",
      "Collaborative disposition",
      "Commitment to social justice and expanding economic opportunity."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, cover letter, 3-5 page writing sample, and 3 professional references to E&L.Jobs@mail.house.gov with \"Labor Professional Staff\" in the subject line.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-290-20",
    "position_title": "Communications Director",
    "office": "Congressman Mike Johnson",
    "location": null,
    "posting_date": "2020-11-23",
    "description": "The Office of Congressman Mike Johnson (LA-04), Vice Chairman-elect of the Republican Conference, is seeking a highly-motivated and experienced communications director to develop and manage the overall messaging strategy for the member and the office. A successful applicant will have exceptional writing and editing skills, a keen eye for detail, social media experience, booking experience and on-the-record press experience.\n\nAdditionally, this applicant will be familiar with the current political issues and be able to demonstrate situational awareness. This position will hold dual responsibilities for the Congressman's personal and vice chair communications department. This person is responsible for managing the entire press operation, including two direct reports.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 5 years of experience.",
      "Microsoft Office, Adobe Suite and video editing experience is necessary.",
      "Advanced degree preferred."
    ],
    "how_to_apply": "Interested applicants should submit their resume and writing samples to: LA04jobs@mail.house.gov",
    "salary_info": null,
    "contact": "LA04jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-280-20",
    "position_title": "Staff Assistant/Driver",
    "office": "Texas Democrat",
    "location": "Washington D.C.",
    "posting_date": "2020-11-23",
    "description": "Texas Democrat seeks a Staff Assistant/Driver to assist the Washington D.C. Office. The office maintains a state of telework, however this position will need to report to the D.C. office when the House Floor is in session.\n\nPrimary duties will include driving the Member to and from events during regular office hours, after hours, and occasional weekends, ensuring the member’s schedule is executed according to plan, handling tour and flag requests, helping manage the internship program, managing the incoming calls and voicemails to both offices phone systems, coordinating member correspondence, and assisting the Washington D.C. office with legislative work. Qualified candidates must have an impeccable driving record and a vehicle.\n\nAt such time as the COVID-19 pandemic allows, this individual will fulfill the role of the Staff Assistant in the Washington D.C. office. Those responsibilities will include staffing and managing the front office, answering the phone, greeting visitors, and providing additional office support as needed.",
    "responsibilities": [
      "Driving the Member to and from events during regular office hours, after hours, and occasional weekends",
      "Ensuring the member’s schedule is executed according to plan",
      "Handling tour and flag requests",
      "Helping manage the internship program",
      "Managing the incoming calls and voicemails to both offices phone systems",
      "Coordinating member correspondence",
      "Assisting the Washington D.C. office with legislative work",
      "Staffing and managing the front office (when COVID-19 pandemic allows)",
      "Answering the phone (when COVID-19 pandemic allows)",
      "Greeting visitors (when COVID-19 pandemic allows)",
      "Providing additional office support as needed (when COVID-19 pandemic allows)"
    ],
    "qualifications": [
      "Impeccable driving record",
      "Vehicle"
    ],
    "how_to_apply": "Interested candidates should submit a cover letter and resume to TX29SG.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "TX29SG.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation."
  },
  {
    "id": "MEM-278-20",
    "position_title": "Counsel/Professional Staff Member",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": null,
    "posting_date": "2020-11-23",
    "description": "The Energy & Commerce Committee, Democratic Staff, seeks a Counsel/Professional Staff Member for the Consumer Protection Subcommittee staff to handle portfolio that includes Federal Trade Commission oversight, unfair and deceptive practices, consumer privacy and data security, and technology, among other issues. This is not an entry level position.\n\nResponsibilities include staffing hearings and markups, conducting oversight, drafting legislation, and advising staff and members on legislative and nonlegislative matters.",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation",
      "Advising staff and members on legislative and nonlegislative matters"
    ],
    "qualifications": [
      "Must have a minimum of 4 years of experience in the U.S. House of Representatives",
      "Be knowledgeable of current legislative and nonlegislative issues before the subcommittee",
      "Have a thorough understanding of the legislative process and the organization and procedures of the House of Representatives",
      "Strong writing, analytical, and legislative skills",
      "Sound political judgment",
      "A proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "A willingness to work long hours and weekends",
      "Experience working with relevant public interest groups, agencies, Congress, and industry stakeholders"
    ],
    "how_to_apply": "Please submit a cover letter, resume, short writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line Consumer Protection Counsel/PSM Candidate.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age."
  },
  {
    "id": "MEM-269-20",
    "position_title": "Caseworker/ Field Representative",
    "office": "Congresswoman Linda Sanchez",
    "location": "Norwalk, CA",
    "posting_date": "2020-11-23",
    "description": "This position primarily entails constituent casework and community outreach. Other responsibilities include meeting with local stakeholders, representing the Congresswoman at community and government events, special projects, as well as general project and event work.\n\nCaseworker: Casework responsibilities involve assisting constituents of the 38th Congressional District resolve problems with federal agencies or find the appropriate state or local contact for non-federal issues. The candidate should be persistent and detail-orientated, and put a priority on facilitating resolutions and expediting priority requests. Knowledge of federal and California state government agencies and experience in customer service will be highly regarded.\n\nField Representative: Field Representatives are primarily charged with (but not limited to) maintaining, strengthening, and establishing new relationships with local community stakeholders, non-profit organizations, and local elected officials in the 38th Congressional District.\n\nThis position represents the Member of Congress in assigned areas and keeps the Member of Congress informed on all happenings in those areas. In addition to community outreach efforts, the Field Representative will be responsible for managing projects and large-scale public events.",
    "responsibilities": [
      "Assisting constituents of the 38th Congressional District resolve problems with federal agencies",
      "Finding the appropriate state or local contact for non-federal issues",
      "Maintaining, strengthening, and establishing new relationships with local community stakeholders, non-profit organizations, and local elected officials in the 38th Congressional District",
      "Representing the Member of Congress in assigned areas",
      "Keeping the Member of Congress informed on all happenings in those areas",
      "Managing projects and large-scale public events"
    ],
    "qualifications": [
      "Bachelor's Degree from an accredited four-year college or university.",
      "Thorough understanding or experience with government agencies (county, state, and federal), community and grassroots organizing.",
      "Strong written, communication, analytical, and organizational skills; an ability to relate well with individuals of diverse backgrounds; impeccable customer service manners; and superior public speaking skills.",
      "Skilled in Microsoft Word, Excel, Outlook, Publisher and Power Point.",
      "Able to work efficiently and effectively as a member of a team, be able to meet strict deadlines, balance multiple projects simultaneously, and work under pressure.",
      "Positive attitude, commitment to excellence, upbeat demeanor, flexibility, and sense of humor.",
      "Enjoy working with the public and constituents.",
      "Flexibility to work weekends, some holidays, and after-hours."
    ],
    "how_to_apply": "Interested applicants should submit a resume, cover letter, writing sample, and references by email to: CA38Jobs@mail.house.gov. Please indicate the title of the position in the subject line.",
    "salary_info": "Salary will depend on the experience of the applicant. Employees will receive health care insurance, 401(k)-style retirement benefits, and other federal employee benefits.",
    "contact": "CA38Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-261-20",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2020-11-23",
    "description": "Responsibilities will run the range of assisting the legislative, constituent services and administrative functions of the office, to include: monitoring and processing constituent mail and other communications, managing constituent tours, and coordinating DC and district office issues. As needed and depending on capability, the position also encompasses legislative correspondent and casework assistance. Direct report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring and processing constituent mail and other communications",
      "Managing constituent tours",
      "Coordinating DC and district office issues",
      "Legislative correspondent assistance (as needed)",
      "Casework assistance (as needed)"
    ],
    "qualifications": [
      "Prior Capitol Hill experience (strong preference)",
      "Hawai'i background (strong preference)",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours, especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-206-20",
    "position_title": "Research and Data Analyst",
    "office": "House Office of Diversity and Inclusion",
    "location": "Washington, D.C.",
    "posting_date": "2020-11-23",
    "description": "In this capacity the Analyst will be responsible for leading data and research collection and analysis for the Office of Diversity and Inclusion. This individual will lead the development of the required diversity report, maintain key metrics and key performance indicators for the Office, and serve as a resource for external and internal diversity best practices.\n\nThis individual will also serve as the project manager for any consultants and/or contractors with whom the Office may engage to support the completion of the diversity report and to develop relevant diversity and inclusion-based training, in collaboration with the Congressional Staff Academy.",
    "responsibilities": [
      "This staffer will assist in the translation of research findings into materials that staff can effectively utilize in their engagements with Members and Member offices.",
      "Provide research support on diversity and inclusion studies, techniques and tools.",
      "Serve as project manager for the diversity report and, where necessary, direct and coordinate activities of external consultants.",
      "Research and study best practices for retention and growth in House employing offices.",
      "Lead data tracking and reporting with a focus on performance and results.",
      "Prepare regular updates and briefing documents on research that is relevant to House employing offices.",
      "Assist with the development and delivery of training sessions and, as needed, conduct presentations at professional conferences and meetings."
    ],
    "qualifications": [
      "Master’s degree in social or behavioral sciences or related field; or equivalent level of experience providing technical assistance, data collections and/or research.",
      "Must have knowledge and experience in diversity, equity, and inclusion research efforts, ideally with a strong background in curriculum development.",
      "Current working knowledge of coalition functioning, evaluation and research.",
      "Quantitative and qualitative evaluation and research skills.",
      "Expertise using relevant software.",
      "Customer-service orientation and ability to work harmoniously with a diverse team.",
      "Ability to work under deadline pressure and extra hours if needed on assignment.",
      "Demonstrated ability to self-motivate, initiate project activities, and work on multiple assignments simultaneously.",
      "Extensive computer skills, including data input."
    ],
    "how_to_apply": "Interested candidates should apply by following the instructions here:\nhttps://house.csod.com/ux/ats/careersite/1/home/requisition/86?c=house\nCandidates will be asked to upload a cover letter, resume, and two writing samples.",
    "salary_info": "Salary commensurate with experience.",
    "contact": null,
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please."
  }
]