[
  {
    "id": "MEM-183-24",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2024-04-29",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office.\n\nThe Committee’s financial disclosure counsel is responsible for reviewing and certifying a large volume of Financial Disclosure Reports, providing legal advice on financial disclosure related matters, providing education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law. The salary range for this position is $136,780 and $145,604 per annum.",
    "responsibilities": [
      "reviewing and certifying a large volume of Financial Disclosure Reports",
      "providing legal advice on financial disclosure related matters",
      "providing education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "outstanding analytical and written and oral communication skills",
      "sound judgment necessary to evaluate sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "$136,780 and $145,604 per annum",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-182-24",
    "position_title": "Legislative Assistant",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": "Washington, DC",
    "posting_date": "2024-04-29",
    "description": "The Office of Congresswoman Pramila Jayapal (WA-07) is seeking a Legislative\nAssistant to handle a broad portfolio centered around health, seniors, Social\nSecurity, reproductive justice, women’s rights, and environmental issues. The\nideal candidate will possess strong strategic thinking, planning and execution\nskills. Additionally, candidates should have strong oral and written\ncommunication skills and the ability to work well in a fast-paced work\nenvironment.",
    "responsibilities": [
      "Advancing current and new legislative initiatives including idea generation,\nbuilding support, legislative drafting and producing accompanying materials,\nsuch as speeches, policy memos, and factsheets;",
      "Preparing and staffing the Congresswoman for relevant committee hearing and\nmarkups, including drafting hearing remarks and questions, preparing\namendments and talking points;",
      "Representing the Congresswoman’s priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal stakeholders\nincluding advocacy organizations; academics; fellow Congressional and\nCommittee offices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "3 - 5 years of relevant experience including policy development and analysis;\nissue advocacy; and strategic planning;",
      "Passionate about public service and committed to progressive values;",
      "Excellent writing and time management skills;",
      "Ability to digest new content with a political and ideological lens that is\nappropriate for the office;",
      "Previous Hill experience strongly preferred;",
      "Poised, level-headed, flexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Candidates should submit their resume, cover letter, two writing samples, and\nreferences in PDF format to jobs.pramila@mail.house.gov with “Legislative\nAssistant: [Applicant’s First and Last Name]” in the subject line. No calls or\ndrop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer.\nWomen, people of color, LGBTQ+ individuals, new Americans, people with\ndisabilities, and members of other underrepresented communities are strongly\nencouraged to apply. State and/or district ties are a plus. Prior Hill experience is\nstrongly preferred."
  },
  {
    "id": "MEM-181-24",
    "position_title": "District Director",
    "office": "Congressman Steven Horsford",
    "location": "North Las Vegas",
    "posting_date": "2024-04-29",
    "description": "As District Director, you will play a key role in representing the Congressman in the district and ensuring effective communication and coordination between the district and Washington, DC offices.",
    "responsibilities": [
      "Represent the Member or assign appropriate staff to do so in district as needed.",
      "Manage district office staff, providing leadership, guidance, and support.",
      "Plan, assign, and evaluate the work of employees in district offices.",
      "Speak to local groups when the Member is unavailable, effectively communicating the Congressman's positions and priorities.",
      "Maintain close communications with the Washington, DC, office, and committee staff, ensuring alignment and coordination on key initiatives and priorities.",
      "Travel throughout the district at regular intervals to keep abreast of local concerns and issues.",
      "Meet with elected officials and representatives of local groups on behalf of the Member, fostering positive relationships and addressing constituent needs.",
      "Schedule meetings with federal and district government agencies as necessary, advocating for the interests of the district.",
      "Respond to constituent telephone calls and mail in a timely and professional manner, addressing inquiries and concerns effectively.",
      "Perform other duties as assigned by the Congressman."
    ],
    "qualifications": [
      "Bachelor’s degree or equivalent experience.",
      "Preferably with a strong interest in public service and familiarity with District 4.",
      "Experience in government affairs or related fields is advantageous.",
      "Essential skills include leadership, effective communication, relationship building, and strong organization.",
      "The role requires flexibility, adaptability, and a willingness to travel."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples (no longer than two pages) and three professional references to NV04Resume@mail.house.gov with \"District Director,” [Last Name, First Name]\" in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, minorities, individuals with disabilities, and veteran are encouraged to apply."
  },
  {
    "id": "MEM-180-24",
    "position_title": "District Representative",
    "office": "Congressman Steven Horsford’s District Office",
    "location": "North Las Vegas",
    "posting_date": "2024-04-29",
    "description": "Under the supervision of the District Director, the District Representative acts as the representative for the Member. District Representative responsibilities include strengthening relationships with key stakeholders, as well as attending engagements on behalf of the Member. Caseworker responsibilities include helping constituents resolve problems with federal agencies through written and verbal communication.",
    "responsibilities": [
      "Outreach Responsibilities:",
      "Ensure outreach efforts align with the Member’s strategic vision and goals.",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities.",
      "Build and maintain relationships with constituents and key community leaders.",
      "Organize and participate in community events, town halls, and outreach campaigns to engage constituents.",
      "Casework Responsibilities:",
      "Act as the representative for the Member within his or her area of responsibility, including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies.",
      "Handle casework assignments and assess casework for problems requiring legislative action, making recommendations to the District Director and Chief of Staff.",
      "Monitor scheduled district meetings for the Member with constituents.",
      "Communications and Professionalism:",
      "Maintain a good working relationship with the Member, staff, and constituents.",
      "Accept performance-based criticism and directions.",
      "Work well under pressure and handle stress.",
      "Work a flexible schedule including long hours, nights, and weekends.",
      "Perform other duties as assigned."
    ],
    "qualifications": [
      "Political knowledge and comfortable navigating complicated situations",
      "Strong written, verbal, analytical, and organization skills; impeccable customer service manners; public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible schedule, including occasional nights, weekends and some holidays.",
      "Bachelor’s degree or related job experience is required.",
      "A demonstrated interest in public service and familiarity with District 4 community is preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples (no longer than two pages) and three professional references to NV04Resume@mail.house.gov with \"District Representative,” [Last Name, First Name]\" in the subject line. All submissions must be in a single PDF file.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, minorities, individuals with disabilities, and veteran are encouraged to apply."
  },
  {
    "id": "MEM-178-24",
    "position_title": "Labor Policy Counsel",
    "office": "House Committee on Education and the Workforce (Democratic Staff)",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "The House Committee on Education and the Workforce (Democratic Staff) seeks a Labor Policy Counsel responsible for the portfolio covering labor law. Candidates should have familiarity with the National Labor Relations Act, the Labor-Management Reporting and Disclosure Act, labor enforcement provisions in trade agreements, and employment arbitration.\n\nCandidates should also have knowledge of the National Labor Relations Board (NLRB), the Department of Labor’s Office of Labor-Management Standards (OLMS) and the International Labor Affairs Bureau (ILAB). Applicants should have a law degree and experience working with an organization, Congress, or government agency related to labor law.\n\nDuties will include supporting the development of legislation, providing technical assistance to the Committee and Member offices, researching pertinent issues, preparing written materials and legislative analyses, and supporting the execution of committee proceedings and events related to labor law. This is not an entry level position; three to five years of experience are strongly preferred.",
    "responsibilities": [
      "supporting the development of legislation",
      "providing technical assistance to the Committee and Member offices",
      "researching pertinent issues",
      "preparing written materials and legislative analyses",
      "supporting the execution of committee proceedings and events related to labor law"
    ],
    "qualifications": [
      "familiarity with the National Labor Relations Act",
      "familiarity with the Labor-Management Reporting and Disclosure Act",
      "familiarity with labor enforcement provisions in trade agreements",
      "familiarity with employment arbitration",
      "knowledge of the National Labor Relations Board (NLRB)",
      "knowledge of the Department of Labor’s Office of Labor-Management Standards (OLMS)",
      "knowledge of the International Labor Affairs Bureau (ILAB)",
      "a law degree",
      "experience working with an organization, Congress, or government agency related to labor law",
      "three to five years of experience are strongly preferred"
    ],
    "how_to_apply": "To apply, applicants must submit a resume and two short writing samples to E&L.Jobs@mail.house.gov with \"Labor Policy Counsel” in the subject line.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-177-24",
    "position_title": "Civil Rights Counsel",
    "office": "House Committee on Education and the Workforce (Democratic Staff)",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "The House Committee on Education and the Workforce (Democratic Staff) seeks\na Civil Rights Counsel responsible for the portfolio covering civil rights issues\nin employment.\n\nCandidates should have familiarity with employment federal civil rights laws,\nsuch as Title VII of the Civil Rights Act of 1964, the Age Discrimination in\nEmployment Act, the Equal Pay Act of 1963 and Title 42, Chapter 21 of the U.S.\nCode. Knowledge of the EEOC, OFCCP and federal statutes and policies and\nhow they impact civil rights in employment and health care is preferred.\n\nApplicants should have a law degree and experience working with an\norganization, Congress, or government agency addressing civil rights.\n\nDuties will include supporting the development of legislation, providing technical\nassistance to the Committee and Member offices, researching pertinent issues,\npreparing written materials and legislative analyses, and supporting the execution\nof committee proceedings and events related to civil rights. This is not an entry\nlevel position; three to five years of experience are strongly preferred.",
    "responsibilities": [
      "supporting the development of legislation",
      "providing technical assistance to the Committee and Member offices",
      "researching pertinent issues",
      "preparing written materials and legislative analyses",
      "supporting the execution of committee proceedings and events related to civil rights"
    ],
    "qualifications": [
      "familiarity with employment federal civil rights laws, such as Title VII of the Civil Rights Act of 1964, the Age Discrimination in Employment Act, the Equal Pay Act of 1963 and Title 42, Chapter 21 of the U.S. Code.",
      "law degree",
      "experience working with an organization, Congress, or government agency addressing civil rights",
      "three to five years of experience are strongly preferred"
    ],
    "how_to_apply": "To apply, applicants must submit a resume and two short writing samples demonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with \"Civil Rights Counsel\" in the subject line.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-174-24",
    "position_title": "Communications Director",
    "office": "Congresswoman Val Hoyle (D-OR-04)",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "Congresswoman Val Hoyle (D-OR-04) seeks a self-starting, highly experienced, and creative Communications Director to join her Washington, D.C. office and lead a fast-paced communications team.\nThe ideal candidate will have familiarity with national press, the House franking process, and will work closely with the Deputy Chief of Staff/District Director, Legislative Director, and report to the Chief of Staff to set the Congresswomen’s messaging priorities. This position will be the direct supervisor of the Press Secretary and any Press Interns. This is not an entry-level position.",
    "responsibilities": [
      "Develops and implements strategic communications plans for the office, including working closely with the legislative team to develop media strategies to roll out legislation, send letters, and make other major announcements",
      "Successfully and consistently pitches the Congresswoman to both local and national TV, radio, and print media",
      "Helps plan and staffs DC- and district-based events such as press conferences, tele-townhalls, and roundtables, etc.",
      "Prepares for, brief, and staffs the Congresswoman for media interviews, press conferences, roundtables, and other engagements;",
      "Drafts talking points, speeches, press releases, op-eds and other materials, as necessary, and in the Congresswoman’s voice;",
      "Speaks on background with reporters and act as a media liaison for the Congresswoman;",
      "Helps manage social media presence, this includes drafting social media copy, clipping interviews, and creating graphics to circulate across platforms;",
      "Maintains and updates office website to ensure that it features timely content;",
      "Serves as the formal spokesperson and media liaison for the Member;",
      "Develops and implements media, communications, and public relations strategy for the Member;",
      "Oversees digital media, website and other communications consultant;",
      "Remains abreast of current legislative and non-legislative issues about which the Member may be questioned;",
      "Evaluates current events and media reports in the district and the nation for their impact on the Member;",
      "Provides ideas and advice on the effect in the media of the Member's actions and legislative activities;",
      "Creates official digital ads and other graphics;",
      "Writes speeches for the Member;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Member, staff, media, and constituents;",
      "Works well under pressure and handles stress;",
      "Supervises Press Secretary and any assigned Press Interns;",
      "Accepts performance-based criticism and direction;",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Deep understanding of print, broadcast, and online media;",
      "Understanding of House franking process and regulations;",
      "Experience with digital communications, including paid ads and analytics reports;",
      "Background in graphic design, including graphics, videos, CANVA or Adobe Suite preferred;",
      "Experience developing communication strategy for a Member of Congress, an elected official, a federal agency, or a private or non-profit organization;",
      "Expertise in advising others on a communication strategy and ability to work well on a team;",
      "Able to make split-second decisions and develop communications under tight deadlines;",
      "Strategic thinker, politically savvy and comfortable navigating difficult situations with press and staff; and",
      "Time management skills, ability to work under pressure, and comfortable balancing multiple responsibilities at once."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter.\nThe Office is accepting resumes until COB Friday, May 3, 2024. We will review them on a rolling basis. Please have them send a resume and cover letter to resumes.hoyle@mail.house.gov with the subject line: Communications Director Opening. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "resumes.hoyle@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, marital status, parental status, military status, or any other factor or basis prohibited by applicable federal law."
  },
  {
    "id": "MEM-173-24",
    "position_title": "Research Assistant for the Subcommittee on Technology Modernization",
    "office": "House Committee on Veterans' Affairs",
    "location": "Washington, DC",
    "posting_date": "2024-04-29",
    "description": "The Majority staff of the House Committee on Veterans' Affairs is seeking a\nResearch Assistant for the Subcommittee on Technology Modernization.\nThis position will support the Subcommittee Staff Director and Professional Staff\nMember in conducting oversight of the Department of Veterans Affairs’ (VA)\nenterprise technology programs and projects, including Electronic Health Record\nModernization, as well its information technology operations. The role involves\nadministrative assistance, research, some policy work, and other duties as\nassigned. Prior congressional experience (permanent or intern) is required. Prior\nfederal agency experience is beneficial. Subject matter expertise is not required.\nVeterans are strongly encouraged to apply. This is a full-time, on-site position in\nWashington, DC. Some domestic travel is required.",
    "responsibilities": [
      "Provide administrative assistance including answering the phone and responding to phone and email inquiries, reviewing incoming correspondence and documents, maintaining Subcommittee records, scheduling meetings, supporting hearings, and other administrative duties as assigned.",
      "Assisting with oversight including organizing and participating in meetings, drafting memos, reading documents, summarizing documents and meetings orally and in writing, limited domestic travel, and other oversight duties as assigned.",
      "Conducting research to support oversight and legislative activities by searching for and compiling documents and information.",
      "Assisting with legislation in a limited capacity including reading and tracking pending and enacted legislation.",
      "Representing the Committee in a limited capacity including meeting with other congressional staff, veteran service organizations, technical organizations, and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Staff Director, Committee Staff Director, or Committee Deputy Staff Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "Congressional experience (permanent or intern)",
      "Veterans are strongly encouraged to apply",
      "Graduate-level writing skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Problem solving skills",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Qualified candidates should send their cover letter and resume\nto VAR.Resumes@mail.house.gov with “Technology Modernization Research\nAssistant” in the subject line. Writing samples and references may be requested.\nNo calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House\nof Representatives is an equal opportunity employer. All applicants will be\nconsidered without regard to race, color, national origin, religion, sex (including\nmarital or parental status), disability, or age. Transportation and all related travel\nexpenses associated with the interview and hiring process must be paid by the\napplicant."
  },
  {
    "id": "MEM-172-24",
    "position_title": "Constituent Services Caseworker",
    "office": "Office of Congressman Jamie Raskin (MD-08)",
    "location": "Rockville, Maryland District Office",
    "posting_date": "2024-04-29",
    "description": "The Office of Congressman Jamie Raskin (MD-08) seeks a Constituent Services\nCaseworker to work in the Rockville, Maryland District Office. This is an entry level position.\nTies to Maryland’s 8th District are preferred. Second language fluency is a plus.\nThis position provides an opportunity to be part of a hard-working, cohesive team\nthat is committed to providing superior constituent service. The ideal candidate is\norganized, self-motivated, detail-oriented, has excellent verbal and written\ncommunication skills and time management skills, and has a passion for making\na difference in people’s lives.\nCandidates from diverse backgrounds and underrepresented communities are\nstrongly encouraged to apply. The U.S. House of Representatives is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, national origin, age, disability, military status, gender identity and\nexpression, marital status, parental status, or sexual orientation, or any other\ncharacteristic protected by applicable law, in any of its activities or operations.",
    "responsibilities": [
      "handling constituent casework",
      "interacting with constituents and government agencies",
      "planning and executing outreach events",
      "representing the Office at community events",
      "assisting with administrative duties"
    ],
    "qualifications": [
      "organized",
      "self-motivated",
      "detail-oriented",
      "excellent verbal and written communication skills",
      "time management skills",
      "passion for making a difference in people's lives",
      "Ties to Maryland’s 8th District are preferred.",
      "Second language fluency is a plus."
    ],
    "how_to_apply": "To apply, please send an email to District Chief Kathleen Connor at the following\nemail address: Raskin.DistrictJobs@mail.house.gov with “Constituent Services\nCaseworker” in the subject line and the following application materials attached\nas one combined PDF:\n•Cover letter (not to exceed one page) – please customize your letter to this\nposition.\n•Résumé (not to exceed one page)\n•Two writing samples (not to exceed two pages each)\n•Three references (not to exceed one page) – for each reference, please include\nname, current title/office, phone number, email, and a one-sentence description of\nyour relationship to the reference.\nThe deadline to apply is 5:00 p.m. on May 3rd, 2024.",
    "salary_info": null,
    "contact": "Raskin.DistrictJobs@mail.house.gov",
    "equal_opportunity": "The U.S. House of Representatives is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, national origin, age, disability, military status, gender identity and\nexpression, marital status, parental status, or sexual orientation, or any other\ncharacteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-171-24",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Robin Kelly (IL-02)",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "The Communications Director will be responsible for developing and executing a robust communications strategy to maximize the Member’s visibility in the district; drafting press releases, statements, speeches, newsletters, and talking points; maintaining relationships and booking interviews with national and local press outlets; pitching stories and responding to reporter inquiries; managing a press team; assisting with social media; and other duties as assigned.",
    "responsibilities": [
      "Developing and executing a robust communications strategy to maximize the Member’s visibility in the district",
      "Drafting press releases, statements, speeches, newsletters, and talking points",
      "Maintaining relationships and booking interviews with national and local press outlets",
      "Pitching stories and responding to reporter inquiries",
      "Managing a press team",
      "Assisting with social media",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Previous communications experience",
      "Exceptional writing skills",
      "Proficiency in photo and video editing and graphic design tools",
      "Organized",
      "Detail-oriented",
      "Highly motivated to serve on an active team",
      "Illinois or Midwest ties are a plus"
    ],
    "how_to_apply": "To apply, send via email including a resume, cover letter, and a 2-3 page writing sample to IL02Staff.Resume@mail.house.gov with the following subject line: “Full Name – Communications Director.” This is not an introductory level position. Applications will be considered on a rolling basis until the position is filled.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "IL02Staff.Resume@mail.house.gov",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-169-24",
    "position_title": "Communications Director",
    "office": "Congressman Frank Pallone",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "This position will develop communications plans, maintain relationships with reporters, create in-district press events, and prepare written materials, including speeches, talking points, newsletters, and op-eds. The ability to collaborate with committee colleagues to advance local communications priorities is key. Highlyqualified candidates will demonstrate on-the-record experience, creativity with social media platforms, and experience with Franked outreach, including direct mail, teletown halls, texting, and phone surveys. Ties to New Jersey are a plus.",
    "responsibilities": [
      "Develop communications plans",
      "Maintain relationships with reporters",
      "Create in-district press events",
      "Prepare written materials, including speeches, talking points, newsletters, and op-eds",
      "Collaborate with committee colleagues to advance local communications priorities"
    ],
    "qualifications": [
      "On-the-record experience",
      "Creativity with social media platforms",
      "Experience with Franked outreach, including direct mail, teletown halls, texting, and phone surveys",
      "Ties to New Jersey are a plus"
    ],
    "how_to_apply": "Please send your resume and a cover letter that references Bruce Springsteen to NJ06Resume@mail.house.gov.",
    "salary_info": null,
    "contact": "NJ06Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-166-24",
    "position_title": "Scheduler/Operations Manager",
    "office": "Rep. Joe Courtney (D-CT-2)",
    "location": "Washington",
    "posting_date": "2024-04-29",
    "description": "Rep. Joe Courtney (D-CT-2) is seeking a Scheduler/Operations Manager in a team-oriented office. Applicants must have exceptional organizational skills, attention to detail, and an ability to manage competing demands and deadlines.\n\nThis is not an entry-level position. Previous scheduling experience required and 1-3 years of prior work experience desired. The ideal candidate for this position is detail-oriented and proactive, possesses strong communication skills, a selfstarter, has good managerial instincts, and can thrive in a collaborative environment. Valid driver's license and access to a vehicle preferred; Connecticut/New England ties, prior Capitol Hill experience, and good sense of humor are all plusses. Salary and title commensurate with experience.",
    "responsibilities": [
      "Managing all aspects of the member's daily and long-term schedule in Washington, including intaking, evaluating, and scheduling meeting requests, updating and ensuring accuracy of member's calendar, and coordinating travel arrangements and day-to-day logistics.",
      "Working with legislative and press staff to ensure member is prepared for engagements.",
      "Managing member personal correspondence and records.",
      "Interfacing with government agencies, Congressional offices, and outside organizations on behalf of the Member",
      "Working with staff to coordinate staff-level meetings and manage office meeting space.",
      "Coordinating office internship program"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Attention to detail",
      "Ability to manage competing demands and deadlines",
      "Previous scheduling experience required",
      "1-3 years of prior work experience desired",
      "Detail-oriented and proactive",
      "Strong communication skills",
      "Self-starter",
      "Good managerial instincts",
      "Ability to thrive in a collaborative environment",
      "Valid driver's license and access to a vehicle preferred",
      "Connecticut/New England ties, prior Capitol Hill experience, and good sense of humor are all plusses"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and writing sample to CT02JOB@mail.house.gov with the subject line “Scheduler Application”",
    "salary_info": "Salary and title commensurate with experience.",
    "contact": "CT02JOB@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer. Candidates with diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-165-24",
    "position_title": "Digital Director",
    "office": "Rep. Jimmy Gomez (CA-34)",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "The office of Rep. Jimmy Gomez (CA-34), a member of the Ways and Means Committee, seeks a driven individual with experience in digital and social media, video editing, content creation and impeccable copyediting skills to join a fast-paced team as the Digital Director.\n\nCandidates must possess strong writing, editing and time management abilities, and must be able to draft daily social media posts and create a long-term digital content plan. The Digital Director will manage multiple social media accounts for the member, and will be key in working with the member and under the Communications Director to create timely, relevant, well-produced content.\n\nThis is not an entry-level position. Prospective candidates should e-mail a cover letter, resume and two writing/digital samples in PDF format",
    "responsibilities": [
      "Manage multiple social media accounts for the member",
      "Work with the member and under the Communications Director to create timely, relevant, well-produced content"
    ],
    "qualifications": [
      "Experience in digital and social media",
      "Experience in video editing",
      "Experience in content creation",
      "Impeccable copyediting skills",
      "Strong writing, editing and time management abilities",
      "Ability to draft daily social media posts and create a long-term digital content plan"
    ],
    "how_to_apply": "Prospective candidates should e-mail a cover letter, resume and two writing/digital samples in PDF format to Gomez.Jobs@mail.house.gov with the subject line “LASTNAME_Digital.” No calls or drop-ins please.",
    "salary_info": "$55,000-65,000 annually, commensurate with experience",
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status or parental status."
  },
  {
    "id": "MEM-162-24",
    "position_title": "Digital Manager/Press Secretary",
    "office": "Congressman Jamie Raskin (MD-08)",
    "location": "Washington, DC",
    "posting_date": "2024-04-29",
    "description": "The Digital Manager/Press Secretary will support digital and traditional communications in a fast-paced and high-visibility congressional office. The individual will be responsible for drafting press releases, quotes and statements, creating digital content (including written copy, graphics and video), helping manage the Congressman's official social media accounts, fielding press requests and inquiries, and executing other duties as assigned.\n\nThe Digital Manager/Press Secretary will work closely with the Communications Director, who will be the direct supervisor, as well as the Chief of Staff, the District Chief, the Legislative Director, and other legislative and district staff in creating, coordinating and executing digital and written content strategy promoting the Congressman's legislative and district priorities.\n\nThe Digital Manager/Press Secretary must be an excellent writer with exceptional communications skills. The successful candidate is a motivated self-starter and team player who demonstrates intellectual engagement, creative thinking, hard work, scrupulous attention to detail, effective time management and a professional and discreet approach. Relevant skills include: video editing (Adobe Premiere Pro and Adobe Creative Suite experience preferred), graphic design and social media management (i.e. experience and familiarity with major platforms).",
    "responsibilities": [
      "Drafting press releases, quotes and statements",
      "Creating digital content (including written copy, graphics and video)",
      "Helping manage the Congressman's official social media accounts",
      "Fielding press requests and inquiries",
      "Executing other duties as assigned",
      "Creating, coordinating and executing digital and written content strategy promoting the Congressman's legislative and district priorities."
    ],
    "qualifications": [
      "Excellent writer with exceptional communications skills",
      "Motivated self-starter and team player",
      "Demonstrates intellectual engagement, creative thinking, hard work, scrupulous attention to detail, effective time management and a professional and discreet approach",
      "Video editing (Adobe Premiere Pro and Adobe Creative Suite experience preferred)",
      "Graphic design and social media management (i.e. experience and familiarity with major platforms)",
      "1-3 years prior experience in political communications is required.",
      "Ties to Maryland's Eighth District, Spanish fluency and facility with other languages are a plus."
    ],
    "how_to_apply": "To apply, please email MD08.Resumes@mail.house.gov by April 23, 2024 with “Digital Manager/Press Secretary: Last Name” in the subject line and the following application materials attached as one combined PDF:\n\nResume\nCover letter\nTwo writing samples\nOne piece of original digital media content (graphic design or video—if video, please link to a Google Drive file)\nThree references–for each reference, please include name, current title, phone number, email address and your relationship to the reference",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-159-24",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2024-04-29",
    "description": "The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "$136,780 and $145,604",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-158-24",
    "position_title": "Press Secretary/Communications Director",
    "office": "Congressman Tom Suozzi",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "Congressman Tom Suozzi seeks a Press Secretary or Communications Director to serve in his Washington, D.C. office. Successful candidates will have very strong writing skills, a close eye to detail, fluency with social media platforms and digital tools, and experience working with national and local press.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Creating and managing social media content, including graphics and videos",
      "Drafting talking points and op-eds",
      "Creating franked communications, including e-newsletters, mailers and telephone townhalls"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and relevant portfolio to NY03.jobs@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "NY03.jobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-157-24",
    "position_title": "Legal Research Analyst (full-time)",
    "office": "Joint Committee on Taxation, United States Congress",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "The Joint Committee on Taxation seeks a highly motivated professional to join its nonpartisan staff as a Legal Research Analyst to assist in the organization and management of its print and electronic library collections and to support legal and legislative research. The Legal Research Analyst will work closely with (under the direct supervision of) the Joint Committee's Legal Research and Reference:\nLibrarian and with committee attorneys, economists, accountants, and administrative staff on projects involving a wide range of tax subject areas, including individual, business, international, tax-exempt organization, benefits, and pension taxation.",
    "responsibilities": [
      "Conduct, organize, and curate legal, legislative, and historical research on tax, economic, and financial policy matters.",
      "Manage a comprehensive collection of compiled legislative histories on taxation.",
      "Inventory and catalog Joint Committee library resources, including treaties, periodicals, and congressional documents.",
      "Monitor, summarize, and report on current legislation, congressional hearings, court cases, and seminars from a wide variety of sources.",
      "Negotiate with vendors to secure subscriptions to print and electronic resources, while maintaining the overall library budget, in collaboration with the Administrative Director.",
      "Post, describe, and maintain both current and historical publications on the Joint Committee's website, in collaboration with the Computer Team.",
      "Archive work product – both print and digital – in accordance with established guidelines and policies."
    ],
    "qualifications": [
      "Willingness to collaborate with professional and administrative staff, both within the Joint Committee and with other information institutions, such as the Libraries of the House and the Senate, the Office of the Historian and the Clerk of the House's Office of Art and Archives, Congressional Research Service, Library of Congress, and the Law Library of Congress.",
      "Attention to detail and strong organizational skills.",
      "Sense of curiosity and resourcefulness when conducting research across multiple subscriptions and platforms.",
      "Ability to manage and reprioritize simultaneous projects and deadlines.",
      "Ability to anticipate and proactively compile resources and conduct research.",
      "An interest in both research and administrative responsibilities.",
      "A bachelor’s degree in political science, information studies, legal studies, economics or related fields and an interest and understanding of the American legislative process – including prior congressional\nexperience – sufficient to understand complex policy issues. Strong writing, communication, and research skills, including knowledge of specialized legal and legislative databases, and research experience are required. A Master of Library and Information Science (MLIS) degree is preferred, however not required."
    ],
    "how_to_apply": "Please submit a cover letter and resume to Katie Mikulka by email at JCTCareers@jct.gov. Please include “Legal Research Analyst” in the subject line.",
    "salary_info": "Salary is commensurate with skills and experience.",
    "contact": "Katie Mikulka, JCTCareers@jct.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-156-24",
    "position_title": "Counsel",
    "office": "Committee on House Administration Republican Office",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "This position performs a key role in the development and execution of the Committee on House Administration Republican Office’s strategy, especially with respect to elections issues, as well as ensuring that the committee’s legislative and oversight activities are operated in conformance with applicable statutes, House Rules, and Committee Rules.\n\nThe incumbent is also responsible for handling additional responsibilities and special projects as assigned. Major duties include: in coordination with the General Counsel, assists in the development and execution of the Committee’s oversight & legislative agenda; serves on elections coalitions development in the election integrity and voter confidence arenas, with a particular focus on grassroots organizations and other elections stakeholders; prepares for committee markups, hearings, and business meetings in cooperation with the Committee Clerk and relevant committee attorneys and staff; conducts thorough and accurate legislative research and drafts reports and memoranda; and more.",
    "responsibilities": [
      "In coordination with the General Counsel, assists in the development and execution of the Committee’s oversight & legislative agenda",
      "Serves on elections coalitions development in the election integrity and voter confidence arenas, with a particular focus on grassroots organizations and other elections stakeholders",
      "Prepares for committee markups, hearings, and business meetings in cooperation with the Committee Clerk and relevant committee attorneys and staff",
      "Conducts thorough and accurate legislative research and drafts reports and memoranda"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume and writing sample to thomas.lane@mail.house.gov",
    "salary_info": null,
    "contact": "thomas.lane@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-155-24",
    "position_title": "DIGITAL DIRECTOR OR PRESS SECRETARY",
    "office": "Rep. Tokuda (HI-02)",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "Rep. Tokuda (HI-02) seeks an energetic person to join her communications team in her Washington, D.C. office. This individual will work closely with the Communications Director who works in Honolulu. Candidates must have experience in digital media and video editing and will be responsible for managing multiple digital media accounts. This position will also assist with press releases and inquiries, speeches, and mass communications.\nCandidate must also be able to work occasionally on weekends and evenings.",
    "responsibilities": [],
    "qualifications": [
      "Strong writing and editing skills with attention to detail",
      "Creative graphic production",
      "Ability to multi-task and work quickly under pressure",
      "Patience, flexibility, and a sense of humor"
    ],
    "how_to_apply": "Interested parties should email a cover letter, resume, writing sample, sample social media posts, and two references to Hawaii02jobs@gmail.com",
    "salary_info": null,
    "contact": "Hawaii02jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-154-24",
    "position_title": "Press Secretary/Communications Director",
    "office": "Congressman John Sarbanes",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "Congressman John Sarbanes seeks a Press Secretary or Communications Director to serve in his Washington, D.C. office. Successful candidates will have very strong writing skills, a close eye to detail, fluency with social media platforms and digital tools, and experience working with national and local press.",
    "responsibilities": [
      "Writing press releases, statements and media advisories",
      "Creating and managing social media content, including graphics and videos",
      "Drafting talking points and op-eds",
      "Creating franked communications, including e-newsletters, mailers and telephone townhalls"
    ],
    "qualifications": [
      "Very strong writing skills",
      "Close eye to detail",
      "Fluency with social media platforms and digital tools",
      "Experience working with national and local press"
    ],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and writing portfolio to employment@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-152-24",
    "position_title": "Legislative Assistant",
    "office": "Rep. Joe Courtney (D-CT-02)",
    "location": "Washington, DC",
    "posting_date": "2024-04-29",
    "description": "Rep. Joe Courtney (D-CT-02) seeks qualified candidates for a Legislative\nAssistant position to join his Washington, DC office team.",
    "responsibilities": [
      "Develop, plan, and execute legislative initiatives within assigned issue areas",
      "Monitor developments in legislation on the floor and within certain House\nCommittees",
      "Staff the member at Committee events as appropriate within assigned policy\nportfolio",
      "Meet with constituents on behalf of the member",
      "Prepare briefing notes and talking points for the Member",
      "Collaborate with District staff to advocate for federal projects and initiatives at\nthe local level"
    ],
    "qualifications": [
      "Qualified candidates will have approximately 3 years of legislative experience\nworking on Capitol Hill, thorough knowledge of the legislative process, excellent\noral and written communication skills, strong project management and\nprioritization skills, the ability to quickly synthesize information and make sound\ndecisions, and the ability to exercise independent judgement in the formulation\nand recommendation of policy positions for the Member."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, and writing\nsample to CT02JOB@mail.house.gov",
    "salary_info": null,
    "contact": "CT02JOB@mail.house.gov",
    "equal_opportunity": "This office is an equal\nopportunity employer. Candidates with diverse backgrounds are encouraged to\napply."
  },
  {
    "id": "MEM-151-24",
    "position_title": "Legislative Assistant",
    "office": "House Democrat",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "Senior House Democrat seeks a Legislative Assistant for the Member’s personal\noffice to staff a portfolio of domestic legislative issues. Portfolio is flexible\ndepending upon the candidate’s background and interests.\n\nA successful candidate will be a self-starter that works well in a fast-paced\nenvironment, possess excellent oral and written communication skills, and have a\nproven ability to work effectively with a collaborative legislative team.",
    "responsibilities": [
      "drafting and introducing legislation, and drafting oversight letters",
      "monitoring pending legislation and current events",
      "staffing the Member at events and meetings",
      "preparing briefing materials and talking points for the Member",
      "reviewing requests to cosign letters and cosponsor legislation, and making\nrecommendations to the Member",
      "representing the Member in meetings and briefings",
      "collaborating with constituent organizations",
      "other tasks and assignments as needed"
    ],
    "qualifications": [
      "The ideal candidate will have at least 1-2 years legislative\nexperience in a congressional office or similar experience off the Hill."
    ],
    "how_to_apply": "Applicants should send a resume, cover\nletter, and two writing samples to housedemlajob@gmail.com",
    "salary_info": "Salary commensurate with experience.",
    "contact": "housedemlajob@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all\nbackgrounds to apply."
  },
  {
    "id": "MEM-150-24",
    "position_title": "Staff Director, Subcommittee on Health",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2024-04-29",
    "description": "Core Responsibilities:\n\n*Serve as the principal advisor to the full Committee Chairman, subcommittee Chairman, and Republican Members for issues under the jurisdiction of the Subcommittee.\n\n*Provide in-depth policy analysis and political strategy for issues that fall under the jurisdiction of the Subcommittee.\n\n*Lead and supervise the implementation of the Subcommittee’s legislative initiatives including the formulation, drafting, introduction, passage, negotiation, and enactment of all legislation under the jurisdiction of the Subcommittee.\n\n*Supervise the Subcommittee staff in the organization of, and preparation for, hearings, to include determination of the agenda, briefing of witnesses and Members, and drafting remarks and questions for the Chairman.\n\n*Conduct informational and oversight meetings with Administration officials, VA and other agencies, Veteran Service Organizations, non-profit organizations, industry experts, and veterans on all issues under the jurisdiction of the Subcommittee.\n\n*Plan and supervise implementation of the Subcommittee’s oversight agenda of issues within its jurisdiction, including sending requests for information, writing oversight letters, conducting oversight visits, reviewing document productions, cultivating sources of information, determining the veracity of information received, and other oversight measures, as needed.\n\n*Build relationships with internal and external partners, including Veteran Service Organizations, member offices, industry, and contacts within the Department of Veterans Affairs and other government agencies to promote and enact the legislative and oversight agenda of the Subcommittee, and that of the full Committee Chairman.\n\n*Represent and discuss the full Committee or Subcommittee Chairman’s views at various conferences and speaking events.\n\n*Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; as needed.",
    "responsibilities": [
      "Serve as the principal advisor to the full Committee Chairman, subcommittee Chairman, and Republican Members for issues under the jurisdiction of the Subcommittee.",
      "Provide in-depth policy analysis and political strategy for issues that fall under the jurisdiction of the Subcommittee.",
      "Lead and supervise the implementation of the Subcommittee’s legislative initiatives including the formulation, drafting, introduction, passage, negotiation, and enactment of all legislation under the jurisdiction of the Subcommittee.",
      "Supervise the Subcommittee staff in the organization of, and preparation for, hearings, to include determination of the agenda, briefing of witnesses and Members, and drafting remarks and questions for the Chairman.",
      "Conduct informational and oversight meetings with Administration officials, VA and other agencies, Veteran Service Organizations, non-profit organizations, industry experts, and veterans on all issues under the jurisdiction of the Subcommittee.",
      "Plan and supervise implementation of the Subcommittee’s oversight agenda of issues within its jurisdiction, including sending requests for information, writing oversight letters, conducting oversight visits, reviewing document productions, cultivating sources of information, determining the veracity of information received, and other oversight measures, as needed.",
      "Build relationships with internal and external partners, including Veteran Service Organizations, member offices, industry, and contacts within the Department of Veterans Affairs and other government agencies to promote and enact the legislative and oversight agenda of the Subcommittee, and that of the full Committee Chairman.",
      "Represent and discuss the full Committee or Subcommittee Chairman’s views at various conferences and speaking events.",
      "Responsible for all other duties assigned by the full Committee Chairman, Staff Director, or Deputy Staff Director; as needed."
    ],
    "qualifications": [
      "Bachelor of Arts or Science",
      "At least five to seven years of relevant policy or legislative experience. Experience on Capitol Hill desired but other experience will be considered."
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references to VAR.Resumes@mail.house.gov with “HEALTH Staff Director” in the subject line. In your cover letter please indicate what you believe are the three most pressing challenges facing the Veterans Health Administration. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-135-24",
    "position_title": "PRESS SECRETARY",
    "office": "The Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-04-29",
    "description": "The Office of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. office. Candidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\n\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staff the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the office's larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-04-29",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  }
]