[
  {
    "id": "MEM-088-18",
    "position_title": "Legislative Director",
    "office": "Iowa Republican (Rep. Rod Blum, IA-01)",
    "location": "U.S. House of Representatives, Washington, D.C.",
    "posting_date": "2018-03-12",
    "description": "Iowa Republican (Rep. Rod Blum, IA-01) seeks experienced legislative director to develop and advance long-term legislative agenda. Legislative Director will work closely with the Member, Chief of Staff, Communications Director, District Director, and staff to advance Member’s priorities and implement strategic legislative and outreach strategies. Successful candidate must work well in a collaborative, team-oriented environment and have the ability to oversee an active legislative team in implementing and advancing an expansive legislative agenda.\nLegislative Director must be highly organized, detail oriented, and able to manage multiple tasks and projects. Excellent interpersonal skills and written and verbal communication, as well as strong editing and proofreading abilities are required.\nIdeal candidate will be politically astute and have a positive attitude. Successful candidate must have the ability to thrive in a demanding, fast-paced, deadline-driven environment, and must be able to respond to challenging situations quickly and strategically.\nThis is not an entry-level position; only candidates with previous Hill experience and a solid knowledge of legislative and political processes will be considered. Prior experience serving as a Legislative Director - is strongly preferred.",
    "responsibilities": [],
    "qualifications": [
      "Previous Hill experience",
      "Solid knowledge of legislative and political processes",
      "Prior experience serving as a Legislative Director (strongly preferred)"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to: John.Ferland@mail.house.gov . No calls or drop ins please.",
    "salary_info": "Commensurate with experience",
    "contact": "John.Ferland@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-082-18",
    "position_title": "Legislative Correspondent",
    "office": "Conservative Western Republican",
    "location": "DC",
    "posting_date": "2018-03-12",
    "description": "Conservative Western Republican is seeking a Legislative Correspondent in his DC office to manage all aspects of constituent correspondence.",
    "responsibilities": [
      "processing incoming correspondence through iConstituent",
      "drafting timely responses",
      "assisting with updating website",
      "creating graphics/images",
      "assisting with projects and events"
    ],
    "qualifications": [
      "knowledge of the legislative process",
      "excellent writing and organizational skills",
      "strong attention to detail",
      "familiarity with iConstituent",
      "Western ties are preferred but not required."
    ],
    "how_to_apply": "Email resume, cover letter and two writing samples to WesternRepublicanJob@yahoo.com.",
    "salary_info": null,
    "contact": "WesternRepublicanJob@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-078-18",
    "position_title": "Social Media Manager & Press Assistant",
    "office": "The press office of Rep. Louise Slaughter (NY-25) and the House Rules Committee",
    "location": null,
    "posting_date": "2018-03-12",
    "description": "Responsibilities include managing the congresswoman’s digital media channels, including website and social media accounts, developing engaging online content, writing e-newsletters, and taking photos and video. The social media manager & press assistant will also compile press clips, copy-edit press releases and talking points, and other projects as necessary. Must be comfortable working collaboratively to execute a broad communications strategy. Prior press and/or digital experience and familiarity with both graphic design and video editing is preferred. Ideal candidates must also have strong written and verbal communications skills and be able to work demanding hours in a fast-paced environment.",
    "responsibilities": [
      "Managing the congresswoman’s digital media channels, including website and social media accounts",
      "Developing engaging online content",
      "Writing e-newsletters",
      "Taking photos and video",
      "Compile press clips",
      "Copy-edit press releases and talking points",
      "Other projects as necessary",
      "Working collaboratively to execute a broad communications strategy"
    ],
    "qualifications": [
      "Prior press and/or digital experience",
      "Familiarity with both graphic design and video editing",
      "Strong written and verbal communications skills",
      "Able to work demanding hours in a fast-paced environment"
    ],
    "how_to_apply": "Interested candidates must submit a resume, cover letter, two writing samples, and two examples of social media or digital media work to digitalpressposting@mail.house.gov. Candidates will be considered on a rolling basis until the position is filled.",
    "salary_info": null,
    "contact": "digitalpressposting@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-076-18",
    "position_title": "Legislative Director",
    "office": "Rep. Jerry McNerney, CA-09",
    "location": "Washington, DC",
    "posting_date": "2018-03-12",
    "description": "California Democrat (Rep. Jerry McNerney, CA-09) seeks experienced legislative director to develop and advance long-term legislative agenda.\nLegislative Director will work closely with the Member, Chief of Staff, Communications Director, District Director, and staff to advance Member’s priorities and implement strategic legislative and outreach strategies.\nSuccessful candidate must work well in a collaborative, team-oriented environment and have the ability to oversee an active legislative team in implementing and advancing an expansive legislative agenda.\nLegislative Director must be highly organized, detail oriented, and able to manage multiple tasks and projects. Excellent interpersonal skills and written and verbal communication, as well as strong editing and proofreading abilities are required.\nIdeal candidate will be politically astute and have a good sense of humor and positive attitude.\nSuccessful candidate must have the ability to thrive in a demanding, fastpaced, deadline-driven environment, and must be able to respond to challenging situations quickly and strategically.\nThis is not an entry-level position; only candidates with previous Hill experience and a solid knowledge of legislative and political processes will be considered. Prior experience serving as a Legislative Director or working on Energy and Commerce Committee-related policy issues – including energy, environment, and water – is strongly preferred.\nCalifornia ties, Spanish literacy, and previous supervisory experience are a plus. Minorities and candidates with CA-09 ties are encouraged to apply.",
    "responsibilities": [
      "Develop and advance long-term legislative agenda.",
      "Work closely with the Member, Chief of Staff, Communications Director, District Director, and staff to advance Member’s priorities and implement strategic legislative and outreach strategies.",
      "Oversee an active legislative team in implementing and advancing an expansive legislative agenda.",
      "Manage multiple tasks and projects."
    ],
    "qualifications": [
      "Must work well in a collaborative, team-oriented environment.",
      "Must be highly organized, detail oriented.",
      "Excellent interpersonal skills and written and verbal communication, as well as strong editing and proofreading abilities are required.",
      "Politically astute and have a good sense of humor and positive attitude.",
      "Ability to thrive in a demanding, fast-paced, deadline-driven environment, and must be able to respond to challenging situations quickly and strategically.",
      "Previous Hill experience and a solid knowledge of legislative and political processes.",
      "Prior experience serving as a Legislative Director or working on Energy and Commerce Committee-related policy issues – including energy, environment, and water – is strongly preferred.",
      "California ties, Spanish literacy, and previous supervisory experience are a plus.",
      "Minorities and candidates with CA-09 ties are encouraged to apply."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to: McNerneyResumes@mail.house.gov.\nNo calls or drop ins, please.",
    "salary_info": null,
    "contact": "McNerneyResumes@mail.house.gov",
    "equal_opportunity": "Minorities and candidates with CA-09 ties are encouraged to apply."
  },
  {
    "id": "MEM-070-18",
    "position_title": "Press Secretary",
    "office": "U.S. Rep. Lloyd Doggett",
    "location": "Washington",
    "posting_date": "2018-03-12",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas) seeks a press secretary for his Washington office. Spanish skills and Hill experience a plus.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Send resume, brief writing sample, and three references to DoggettJobs@mail.house.gov. No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-064-18",
    "position_title": "Legislative Assistant",
    "office": "Senior Rocky Mountain Democrat",
    "location": null,
    "posting_date": "2018-03-12",
    "description": "Senior Rocky Mountain Democrat is seeking a legislative assistant to manage a very active health care portfolio, including the Member's leadership of two high-profile caucuses. Candidates should have at least three years of experience developing and implementing legislative strategies in a Congressional office. Strong research, writing, and negotiation skills are essential. An advanced degree in a health field is preferred. The ideal candidate will be creative and proactive, possess a strong work ethic, and be able to have fun while maintaining a busy schedule.",
    "responsibilities": [],
    "qualifications": [
      "At least three years of experience developing and implementing legislative strategies in a Congressional office.",
      "Strong research, writing, and negotiation skills are essential.",
      "An advanced degree in a health field is preferred."
    ],
    "how_to_apply": "Interested applicants should send a cover letter and resume to rockymountainhealthla@gmail.com.",
    "salary_info": null,
    "contact": "rockymountainhealthla@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-055-18",
    "position_title": "Speechwriter",
    "office": "Northeastern progressive Democrat, Senior Member of Democratic Leadership, and Member of the Appropriations Committee",
    "location": null,
    "posting_date": "2018-03-12",
    "description": "Northeastern progressive Democrat, Senior Member of Democratic Leadership, and Member of the Appropriations Committee seeks an experienced speechwriter to join busy, high-functioning office. The individual will work closely with the legislative staff and take the lead on crafting speeches and op-ed columns.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess excellent and proven writing and organizational skills and the ability to grasp complex policy concepts, think strategically, and multitask effectively under tight deadlines.",
      "Applicants must also have command of the legislative process, sound political judgment, and a sense of humor."
    ],
    "how_to_apply": "Please send cover letter, resume, and 2-3 writing samples to: ctspeechwriter@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ctspeechwriter@gmail.com",
    "equal_opportunity": null
  }
]