[
  {
    "id": "MEM-128-18",
    "position_title": "Legislative Director",
    "office": "Senior Democratic House member and Committee Ranking Member",
    "location": "Capitol Hill",
    "posting_date": "2018-04-23",
    "description": "Primary responsibilities include developing policy and legislative initiatives and advising Member on all legislative issues. Position will manage long-term and short-term legislative planning; monitor legislative activity on the House floor; supervise all legislative staff in the personal office; ensure effective coordination between the personal office and committee office; and assist with hearing preparation as needed. The successful candidate will be a results-oriented problem solver with experience supervising staff and a proven track record of developing and advancing legislation. Excellent oral and written communication skills, time-management skills, and the ability to quickly analyze and summarize complex legislative details are essential. Graduate degree and extensive experience on Capitol Hill are required.",
    "responsibilities": [
      "Developing policy and legislative initiatives",
      "Advising Member on all legislative issues",
      "Managing long-term and short-term legislative planning",
      "Monitoring legislative activity on the House floor",
      "Supervising all legislative staff in the personal office",
      "Ensuring effective coordination between the personal office and committee office",
      "Assisting with hearing preparation as needed"
    ],
    "qualifications": [
      "Results-oriented problem solver",
      "Experience supervising staff",
      "Proven track record of developing and advancing legislation",
      "Excellent oral and written communication skills",
      "Time-management skills",
      "Ability to quickly analyze and summarize complex legislative details",
      "Graduate degree",
      "Extensive experience on Capitol Hill"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter and resume with the words “Legislative Director” in the subject line to job_09@live.com. Please paste the cover letter and resume directly in the body of the email.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-127-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Rep. Debbie Dingell, MI-12",
    "location": "Washington, D.C.",
    "posting_date": "2018-04-23",
    "description": "The office of Rep. Debbie Dingell, MI-12, is seeking a scheduler/executive assistant to maintain the Member’s official Washington, D.C. schedule, to manage all travel and to work directly with the District based scheduler under the Direction of the Chief of Staff to ensure a seamless schedule between the District and Washington, D.C. offices.",
    "responsibilities": [],
    "qualifications": [
      "Extensive (3-5 years) experience working as a scheduler and or executive assistant in either a public official’s office or similar private sector position.",
      "Positive attitude.",
      "Ability to be flexible and adapt quickly to changing circumstances.",
      "Strong level of competency in multi-tasking and attention to detail.",
      "Associate degree in applied business with an executive secretary major is preferred with least two years of office experience.",
      "Extensive experience booking and managing travel reservations."
    ],
    "how_to_apply": "Interested applicants should email their resume, one short writing sample and a list of references to MI12Scheduler.Request@mail.house.gov. Please no walk-ins or phonecalls.",
    "salary_info": "Salary is commensurate with level of experience with a wide range of benefits.",
    "contact": "MI12Scheduler.Request@mail.house.gov",
    "equal_opportunity": "This office does not discriminate in hiring on the basis of race, color, religion (creed), gender, gender expression, age, national origin (ancestry), disability, marital status, sexual orientation, or military status, or in any of its activities or operations."
  },
  {
    "id": "MEM-126-18",
    "position_title": "Director of Security and Foreign Affairs",
    "office": "U.S.-China Economic and Security Review Commission",
    "location": null,
    "posting_date": "2018-04-23",
    "description": "The individual is responsible for leading and managing the Security and Foreign Affairs Team in monitoring, investigating, assessing and reporting on a wide range of China related issues including military/defense/national security, cybersecurity, export controls, foreign affairs, science and technology, and energy security.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Further responsibilities as well as qualification requirements and information on how to apply can be found here. All application materials are due May 11, 2018 at 5:00 pm.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-124-18",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2018-04-23",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include: answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.\nNO PHONE CALLS PLEASE",
    "salary_info": "$30,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-121-18",
    "position_title": "Communications Director",
    "office": "House Republican office",
    "location": null,
    "posting_date": "2018-04-23",
    "description": "High-profile House Republican office is seeking an experienced Communications Director. Candidate must be prepared to operate in a fastpaced environment and be able to develop and execute an aggressive communications strategy. National TV pitching and booking experience a plus. Candidate should also possess excellent writing skills and an understanding of the legislative process. Additional responsibilities include drafting press releases, speeches, talking points, op-eds, and newsletters, developing and executing an online media strategy, and maintaining and building local and national press relations.",
    "responsibilities": [
      "Drafting press releases, speeches, talking points, op-eds, and newsletters",
      "Developing and executing an online media strategy",
      "Maintaining and building local and national press relations"
    ],
    "qualifications": [
      "Experience operating in a fast-paced environment",
      "Ability to develop and execute an aggressive communications strategy",
      "National TV pitching and booking experience a plus",
      "Excellent writing skills",
      "Understanding of the legislative process"
    ],
    "how_to_apply": "Please submit resume and 2 writing samples to AZ02resumes@gmail.com.",
    "salary_info": null,
    "contact": "AZ02resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-115-18",
    "position_title": "Communications Director",
    "office": "Southern Nevada Democrat",
    "location": null,
    "posting_date": "2018-04-23",
    "description": "Southern Nevada Democrat is seeking a talented writer to be Communications Director. Responsibilities include, but are not limited to, developing and implementing communications strategies across both traditional and digital media; writing speeches; responding to press inquiries; drafting press releases; writing and placing op-eds; overseeing and expanding the Member’s social media presence; and planning press conferences and in-district events. Experience with Nevada media a plus. Spanish speakers encouraged to apply.",
    "responsibilities": [
      "Developing and implementing communications strategies across both traditional and digital media",
      "Writing speeches",
      "Responding to press inquiries",
      "Drafting press releases",
      "Writing and placing op-eds",
      "Overseeing and expanding the Member’s social media presence",
      "Planning press conferences and in-district events"
    ],
    "qualifications": [
      "Experience with Nevada media a plus",
      "Spanish speakers encouraged to apply"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples, and two sample social media posts to NV01Jobs@gmail.com. The subject line should contain “Communications Director.” No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "NV01Jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-114-18",
    "position_title": "Communications Director/Press Secretary",
    "office": "Congresswoman Michelle Lujan Grisham",
    "location": null,
    "posting_date": "2018-04-23",
    "description": "Congresswoman Michelle Lujan Grisham is seeking a Communications Director/Press Secretary to lead an aggressive communications operation. The ideal candidate must be a talented writer; have previous communications experience; and be able to work quickly under pressure in a fast paced work environment. This role demands creativity, high attention to detail, and hard work.",
    "responsibilities": [
      "working with the Congresswoman and the legislative team on developing and implementing a communications strategy",
      "managing social media platforms",
      "maintaining the office website",
      "briefing the Congresswoman before interviews",
      "writing talking points for the Congresswoman’s speaking engagements, events, and floor speeches",
      "drafting op-eds",
      "pitching stories"
    ],
    "qualifications": [
      "talented writer",
      "previous communications experience",
      "able to work quickly under pressure in a fast paced work environment",
      "creativity",
      "high attention to detail",
      "hard work",
      "Hill experience a plus"
    ],
    "how_to_apply": "Interested candidates should submit both a cover letter and resume in one attachment to NM01.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "NM01.Resumes@mail.house.gov",
    "equal_opportunity": "Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-112-18",
    "position_title": "Scheduler/Executive Assistant",
    "office": "Democratic Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2018-04-23",
    "description": "Duties include managing the daily schedule for a Democratic Member of Congress; reviewing invitations and meeting requests with the Chief of Staff and other staff members; organizing all the logistical aspects of the Member's schedule and travel arrangements; and making sure the Member attends all of his appointments on time.\n\nOther responsibilities include overseeing the front office reception area, flag requests, a very active intern program and other administrative tasks.\n\nThis position requires exceptional organization, strong interpersonal skills, attention to detail and the ability to multitask and prioritize.\n\nCandidates must be a team player with a sense of humor.\n\nPrevious scheduling experience, Spanish proficiency, and California ties are all pluses.\n\nAn expanded portfolio to include financial administration is possible for qualified candidates.",
    "responsibilities": [
      "Managing the daily schedule",
      "Reviewing invitations and meeting requests with the Chief of Staff and other staff members",
      "Organizing all the logistical aspects of the Member's schedule and travel arrangements",
      "Making sure the Member attends all of his appointments on time",
      "Overseeing the front office reception area",
      "Handling flag requests",
      "Managing a very active intern program",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Exceptional organization",
      "Strong interpersonal skills",
      "Attention to detail",
      "Ability to multitask and prioritize",
      "Team player with a sense of humor",
      "Previous scheduling experience (plus)",
      "Spanish proficiency (plus)",
      "California ties (plus)"
    ],
    "how_to_apply": "Please send resume and cover letter to CAJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-111-18",
    "position_title": "District Representative",
    "office": "Congressman Mark DeSaulnier (CA-11)",
    "location": "Richmond",
    "posting_date": "2018-04-23",
    "description": "Job responsibilities include monitoring district and local issues; acting as a liaison to federal, district, and local agencies in West Contra Costa County; answering casework correspondence; and ensuring constituents receive a timely response. The position will also assist with the federal grant process.",
    "responsibilities": [
      "Monitoring district and local issues",
      "Acting as a liaison to federal, district, and local agencies in West Contra Costa County",
      "Answering casework correspondence",
      "Ensuring constituents receive a timely response",
      "Assist with the federal grant process"
    ],
    "qualifications": [
      "Hard working",
      "Excellent oral and written communications skills",
      "Knowledge of West County",
      "Ability to multi-task",
      "Meet deadlines",
      "Produce a quality work product",
      "Flexible schedule and ability to travel throughout the district required, but position is based in Richmond"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to California11Resumes@gmail.com, please include West County District Representative in the subject line.",
    "salary_info": "Salary commensurate with experience",
    "contact": "California11Resumes@gmail.com",
    "equal_opportunity": "Equal opportunity employer"
  },
  {
    "id": "MEM-103-18",
    "position_title": "Press Secretary",
    "office": "Northeast Democrat",
    "location": "Washington",
    "posting_date": "2018-04-23",
    "description": "Northeast Democrat seeks Press Secretary to run Washington press operations, including working closely with Member's legislative staff, leadership and committee press staff, and national TV news producers. Position also includes management of the Member's website, social media pages, newsletters, e-news updates, and other constituent outreach. Will work closely with District Communications Director on some joint projects.",
    "responsibilities": [],
    "qualifications": [
      "Excellent legislative research and writing skills required."
    ],
    "how_to_apply": "Send cover letter and resume to democratic.hilljob@gmail.com.",
    "salary_info": "SALARY LEVEL/RANGE: Commensurate with experience",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Minority and women candidates encouraged to apply."
  }
]