[
  {
    "id": "MEM-164-16",
    "position_title": "Legislative Assistant",
    "office": "House Veterans’ Affairs Committee",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-06",
    "description": "New England Democrat and member of the House Veterans’ Affairs Committee seeks legislative assistant for Washington office. Applicants should possess excellent writing skills, energy, enthusiasm, attention to detail, the ability to work in a fast-paced team environment, and a good sense of humor. Legislative portfolio includes, but is not limited to, work on Veterans’ Affairs Committee issues, healthcare, and defense. Previous experience in veterans or health care policy is required. Responsibilities include developing proactive legislative initiatives, tracking legislation, drafting correspondence and statements, and representing the Member in meetings. New England ties preferred and veterans strongly encouraged to apply.",
    "responsibilities": [
      "Developing proactive legislative initiatives",
      "Tracking legislation",
      "Drafting correspondence and statements",
      "Representing the Member in meetings"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Energy and enthusiasm",
      "Attention to detail",
      "Ability to work in a fast-paced team environment",
      "Good sense of humor",
      "Previous experience in veterans or health care policy"
    ],
    "how_to_apply": "Applicants should send cover letter, resume, and two writing samples to hill.jobs@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-163-16",
    "position_title": "Press Secretary",
    "office": "Democratic House committee",
    "location": null,
    "posting_date": "2016-06-06",
    "description": "Democratic House committee seeks experienced, self-motivated and creative\nindividual to serve as Press Secretary. Candidate must possess excellent\nwriting and speaking skills and have the ability to operate quickly and\nefficiently in a fast-paced environment under tight deadlines. S/he must be\nable to work collaboratively with a large and diverse staff.",
    "responsibilities": [
      "coordinating media relations efforts with print, digital, and broadcast outlets",
      "drafting press releases and other materials",
      "supporting an active and energetic press shop"
    ],
    "qualifications": [
      "Experience in web management and social media required.",
      "Ideal candidates will have an excellent knowledge of minority press.",
      "Previous communications experience on the Hill is required."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to fscdemresumes@mail.house.gov with “Press Secretary” in the subject line. Applications received after June 10, 2016 will not be considered. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "fscdemresumes@mail.house.gov",
    "equal_opportunity": "Minorities and women are encouraged to apply."
  },
  {
    "id": "MEM-162-16",
    "position_title": "Veteran Affairs Caseworker/Field Representative",
    "office": "Congresswoman Dina Titus of Nevada",
    "location": "Las Vegas District Office",
    "posting_date": "2016-06-06",
    "description": "Successful candidates will have previous experience in social work, familiarity with federal agencies, excellent written and oral communication skills, be team-oriented, and comfortable working both independently and as part of a team. Strong knowledge or connection with Nevada's First Congressional District is a plus. Availability for evening and weekend assignments is required.",
    "responsibilities": [],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Comfortable working both independently and as part of a team",
      "Strong knowledge or connection with Nevada's First Congressional District is a plus",
      "Availability for evening and weekend assignments is required"
    ],
    "how_to_apply": "Interested candidates should send their resume and cover letter to Mike.Naft@mail.house.gov. Please write “Caseworker” in the subject line of your email message.",
    "salary_info": null,
    "contact": "Mike.Naft@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-161-16",
    "position_title": "Executive Assistant/Scheduler",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2016-06-06",
    "description": "California Democrat is seeking a highly organized, hard-working executive assistant/scheduler to develop and maintain Member's official schedule both short and long term, and to organize domestic and international travel logistics. This position also works closely with the chief of staff on administrative duties.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communications skills and attention to detail",
      "Exhibit good judgement",
      "Efficiently problem solve",
      "Possess a positive attitude",
      "Work well in a team environment",
      "Have a good sense of humor",
      "Previous scheduling experience preferred"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume and writing sample",
    "salary_info": "Salary commensurate with experience.",
    "contact": "cademocrat.scheduler@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer."
  },
  {
    "id": "MEM-159-16",
    "position_title": "Scheduler",
    "office": "Southern Republican Congressman",
    "location": "Washington, DC",
    "posting_date": "2016-06-06",
    "description": "Ideal candidate will be high energy, organized, proven multi-tasker, detailoriented, possess strong verbal and written communication skills and be a fast\nlearner and problem solver. Individual must excel at balancing competing\ndemands in a fast-paced environment maintaining close attention to detail and\nmaintain a positive attitude.",
    "responsibilities": [
      "Managing Members schedule including organizing and tracking invitations, meetings, committee schedule, speaking engagements, member travel scheduling requests and managing day to day schedule and logistics.",
      "Assisting the chief of staff with administrative functions."
    ],
    "qualifications": [],
    "how_to_apply": "Please email resumes to:",
    "salary_info": null,
    "contact": "Erin.Hass@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-157-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Senior Democratic Member",
    "location": "Washington",
    "posting_date": "2016-06-06",
    "description": "Senior Democratic Member seeks an energetic, detail-oriented individual with excellent oral and written communication skills for the position of Staff Assistant/Legislative Correspondent in his busy Washington office. Daily tasks include greeting visitors, processing flag and tour requests, training and supervising interns, and providing support to the congressman and legislative staff. Legislative Correspondent responsibilities include management of an active constituent correspondence program, which includes monitoring the flow of incoming and outgoing mail and responding to mail and email in both form and individual letters in a timely manner.",
    "responsibilities": [
      "Greeting visitors",
      "Processing flag and tour requests",
      "Training and supervising interns",
      "Providing support to the congressman and legislative staff",
      "Management of an active constituent correspondence program",
      "Monitoring the flow of incoming and outgoing mail",
      "Responding to mail and email in both form and individual letters in a timely manner"
    ],
    "qualifications": [
      "Excellent writing, editing and multi-tasking skills",
      "Possess patience and a good sense of humor",
      "Strong communication skills",
      "Sharp attention to detail",
      "Ability to work well with others",
      "Good time management skills",
      "Experience with the Intranet Quorum database and Microsoft Office desired",
      "Knowledge of or ties to Georgia are a plus but not required"
    ],
    "how_to_apply": "Please send resume and cover letter to COStoCHJ@gmail.com. Please absolutely no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "COStoCHJ@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-154-16",
    "position_title": "Military Legislative Assistant (MLA)",
    "office": "Southern Democratic Member",
    "location": null,
    "posting_date": "2016-06-06",
    "description": "This is not a senior position. It is important that the MLA have experience with military or a strong military background, familiarity with the NDAA, overall budgeting, and the ability to track major acquisition and RDT&E programs. Additionally, prior legislative experience with the Defense Authorization and Appropriations Process is preferred. An ability to multitask and work under tight deadlines is necessary. Georgia ties are helpful. Candidates that can engage in creative policy-making are encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Experience with military or a strong military background",
      "Familiarity with the NDAA, overall budgeting",
      "Ability to track major acquisition and RDT&E programs",
      "Prior legislative experience with the Defense Authorization and Appropriations Process (preferred)",
      "Ability to multitask and work under tight deadlines",
      "Georgia ties (helpful)",
      "Ability to engage in creative policy-making"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to costochj@gmail.com.",
    "salary_info": null,
    "contact": "costochj@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-153-16",
    "position_title": "Scheduler/Office Manager",
    "office": "Southern Democratic Office",
    "location": "Washington",
    "posting_date": "2016-06-06",
    "description": "The staffer will maintain the Member’s official schedule, travel plans, and related records. Brief the Member on scheduling activities in Washington and present proposed meetings to Chief of Staff and Member for input. Coordinates the scheduling of press, interview, radio, and television with the Communications Director. This is not an entry-level position. Metropolitan Atlanta-ties a plus.",
    "responsibilities": [
      "Maintain the Member’s official schedule, travel plans, and related records.",
      "Brief the Member on scheduling activities in Washington.",
      "Present proposed meetings to Chief of Staff and Member for input.",
      "Coordinates the scheduling of press, interview, radio, and television with the Communications Director."
    ],
    "qualifications": [],
    "how_to_apply": "Please send inquiries to COStoCHJ@gmail.com.",
    "salary_info": null,
    "contact": "COStoCHJ@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-152-16",
    "position_title": "Communications Director",
    "office": "House Committee on Science, Space and Technology (Majority)",
    "location": null,
    "posting_date": "2016-06-06",
    "description": "The House Committee on Science, Space and Technology (Majority) is seeking experienced candidates for the position of Communications Director. The successful candidate will be a strong writer who can communicate public policy on a District, state and national level and can operate in a fast-moving, high pressure environment. Candidate will be responsible for managing committee press team and coordinating with professional staff, as well as working with press secretaries in Committee Members' personal offices. Qualified candidates must be able to draft op-eds and press releases, and proactively work with the local and national media.",
    "responsibilities": [
      "Managing committee press team",
      "Coordinating with professional staff",
      "Working with press secretaries in Committee Members' personal offices",
      "Drafting op-eds and press releases",
      "Proactively work with the local and national media"
    ],
    "qualifications": [
      "At least three years of professional experience"
    ],
    "how_to_apply": "Please submit a resume and writing sample to house.science.committee@mail.house.gov. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "house.science.committee@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-151-16",
    "position_title": "Legislative Correspondent",
    "office": "Florida Progressive Democrat",
    "location": "Capitol Hill",
    "posting_date": "2016-06-06",
    "description": "Florida Progressive Democrat seeks Legislative Correspondent with excellent writing, research, and communications skills as well as the ability to work in a fast-paced team environment. The ideal candidate will have a sense of humor, be a detail-oriented self-starter who is willing to take on additional tasks as assigned.",
    "responsibilities": [],
    "qualifications": [
      "At least 1 year of related Capitol Hill experience",
      "A car and driver’s license",
      "Familiarity with IQ constituent management system",
      "Florida ties and Spanish speaker are a plus"
    ],
    "how_to_apply": "Please send resume, cover letter including salary requirement, references, and two independently written examples of legislative correspondence to FL09job@gmail.com. No emails, calls or drop by please.",
    "salary_info": null,
    "contact": "FL09job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-150-16",
    "position_title": "Director of Administration",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2016-06-06",
    "description": "The Committee on Ethics seeks an experienced office administrator to serve as the Director of Administration for the Committee. The Director of Administration will oversee the Committee’s administrative functions and will manage a nonpartisan administrative staff who are responsible for ensuring the efficient operation of the Committee’s work. This is a nonpartisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 5 years of experience with government administrative process",
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment",
      "Experience in one or more of the following areas is also desirable: accounting, office administration, and familiarity with Congress.",
      "Previous management experience preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a list of references to ethicsjobs@mail.house.gov. Please include the phrase “Director of Administration” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-149-16",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2016-06-06",
    "description": "The Committee on Ethics seeks an experienced attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must\nPage 4 of 6\npossess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and financial accounting.",
    "responsibilities": [
      "conducting investigations",
      "adjudicatory proceedings",
      "disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "outstanding analytical skills",
      "written/oral communications skills",
      "sound judgment necessary to evaluate sensitive matters",
      "Experience in one or more of the following areas: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-145-16",
    "position_title": "Press Assistant/Staff Assistant",
    "office": "Rep. Luke Messer",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-06",
    "description": "The ideal candidate will have experience or education in digital media, new media or journalism. Strong writing skills are a must, and an ability to boil down complex issues into easily understandable social media content is ideal. The press assistant/staff assistant must be a self-starter with the ability to learn and grow in a fastpaced environment.",
    "responsibilities": [
      "Press clips",
      "Daily social media posts",
      "Assisting the communications director with press releases and press inquiries",
      "Answering phones",
      "Giving tours",
      "Interacting with constituents"
    ],
    "qualifications": [
      "Experience or education in digital media, new media or journalism",
      "Strong writing skills",
      "Ability to boil down complex issues into easily understandable social media content",
      "Ability and interest in learning to create graphics and editing video"
    ],
    "how_to_apply": "Resumes and cover letters can be sent to press.messer@mail.house.gov.",
    "salary_info": null,
    "contact": "press.messer@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-144-16",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Pacific Northwest Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-06",
    "description": "Primary responsibilities include managing the office mail program and ensuring that constituent correspondence is responded to in a timely manner. The Legislative Correspondent/Press Assistant will also assist the Communications Director with press-related materials, research, daily news clips, and media tracking.",
    "responsibilities": [
      "Managing the office mail program",
      "Ensuring constituent correspondence is responded to in a timely manner",
      "Assisting the Communications Director with press-related materials, research, daily news clips, and media tracking"
    ],
    "qualifications": [
      "Strong, proven writing skills a must",
      "Previous Capitol Hill experience strongly preferred",
      "Familiarity with Intranet Quorum software strongly preferred",
      "Ties to the Pacific Northwest strongly preferred"
    ],
    "how_to_apply": "Please send resume, cover letter, and two independently written examples of legislative correspondence on topic of applicant’s choice to heck.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "heck.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-143-16",
    "position_title": "Communications Director",
    "office": "Congresswoman Anna G. Eshoo (CA-18)",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-06",
    "description": "Congresswoman Anna G. Eshoo (CA-18) seeks a Communications Director to handle all media matters. Duties include long-term planning, working with local and national reporters, producers, and bookers, as well as conducting proactive media outreach, managing online communications, and drafting press releases, op-eds, and speeches. The position requires a close partnership with legislative and district staff, attention to detail, and the ability to work well under pressure.\n\nThe Communications Director also oversees an active social media, online operation, and email communications program. The position requires excellent organizational skills, understanding of message development, sound judgement, a positive attitude and the ability to work well in a team environment. Hill experience preferred. This is not an entry level position.",
    "responsibilities": [
      "Long-term planning",
      "Working with local and national reporters, producers, and bookers",
      "Conducting proactive media outreach",
      "Managing online communications",
      "Drafting press releases, op-eds, and speeches",
      "Overseeing an active social media, online operation, and email communications program"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Understanding of message development",
      "Sound judgement",
      "A positive attitude",
      "Ability to work well in a team environment",
      "Hill experience preferred",
      "Not an entry level position"
    ],
    "how_to_apply": "Email cover letter, resume, references, and two writing samples to ca18resumes@gmail.com. NO CALLS OR DROP BYS PLEASE.",
    "salary_info": null,
    "contact": "ca18resumes@gmail.com",
    "equal_opportunity": null
  }
]