[
  {
    "id": "MEM-314-21",
    "position_title": "Press Assistant",
    "office": "Office of Congresswoman Julia Brownley (CA-26)",
    "location": "Washington, DC",
    "posting_date": "2021-08-09",
    "description": "The Office of Congresswoman Julia Brownley (CA-26) seeks Press Assistant to support a very active, Washington, DC office. This individual reports to the Communications Director and will be responsible for creating content for social media platforms, recording and editing video, and updating the website. In addition, the staff member will produce daily clips, draft press releases, assist with responding to press inquiries, compile and update press lists.\n\nCandidates will be creative and strong writers who understand social media trends. This individual will have experience with photography, graphic creation, and video editing. Previous digital communications experience on Capitol Hill, a campaign, or at a communications firm is strongly preferred. The ideal candidate is energetic, detail-oriented, able to multitask, and willing to work long hours in a fast-paced and demanding setting. Spanish fluency and Southern California ties are a plus.",
    "responsibilities": [
      "Creating content for social media platforms",
      "Recording and editing video",
      "Updating the website",
      "Produce daily clips",
      "Draft press releases",
      "Assist with responding to press inquiries",
      "Compile and update press lists"
    ],
    "qualifications": [
      "Creative and strong writers who understand social media trends",
      "Experience with photography, graphic creation, and video editing",
      "Previous digital communications experience on Capitol Hill, a campaign, or at a communications firm is strongly preferred",
      "Energetic, detail-oriented, able to multitask, and willing to work long hours in a fast-paced and demanding setting",
      "Spanish fluency and Southern California ties are a plus"
    ],
    "how_to_apply": "Interested applicants should email a cover letter, resume, a writing sample, and two examples of graphics or other digital communications work to CA26Resumes@gmail.com with “Press Assistant: Last Name, First Name” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-312-21",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space, and Technology",
    "location": "Capitol Hill",
    "posting_date": "2021-08-09",
    "description": "Duties include oversight of manufacturing and innovation programs within the Committee’s jurisdiction, outreach to stakeholder groups, researching and drafting legislation, staffing hearings, and preparing memoranda, statements, and speeches for Majority Members.\n\nThe ideal candidate will have significant Capitol Hill or relevant government or industry experience. An advanced degree or technical background is a plus, but not required.\n\nThis not an entry-level position.",
    "responsibilities": [
      "Oversight of manufacturing and innovation programs within the Committee’s jurisdiction",
      "Outreach to stakeholder groups",
      "Researching and drafting legislation",
      "Staffing hearings",
      "Preparing memoranda, statements, and speeches for Majority Members"
    ],
    "qualifications": [
      "Experience in at least one or both of the following subject matter areas: 1) manufacturing innovation and policy, 2) technology, manufacturing, and innovation activities carried out by the Department of Commerce.",
      "Strong writing, organizational, and communication skills",
      "Capacity to articulate technical and policy issues clearly and concisely",
      "Ability to meet tight deadlines",
      "Significant Capitol Hill or relevant government or industry experience (preferred)",
      "Advanced degree or technical background (a plus, but not required)"
    ],
    "how_to_apply": "Please send a cover letter and resume to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-306-21",
    "position_title": "Caseworker",
    "office": "Congresswoman Kay Granger",
    "location": "Texas Congressional District 12",
    "posting_date": "2021-08-09",
    "description": "Congresswoman Kay Granger is seeking a caseworker to join her staff. This position acts as a liaison between federal agencies and the Congresswoman and constituents.\n\nIdeal candidate will have a bachelor's degree or equivalent. Education can be substituted with at least 3 years of related experience or training in legislation or equivalent experience.",
    "responsibilities": [
      "Handles casework assignments from a variety of federal agencies including, but not limited to:\nSocial Security",
      "IRS",
      "Veterans Affairs",
      "Assess casework for issues",
      "Screens casework and when necessary assigns to appropriate offices",
      "Logs in all incoming and outgoing mail and telephone calls related to casework",
      "Meets attendance requirements established by the office",
      "Accepts performance-based criticism and direction",
      "Works well under pressure and handles stress well",
      "Assist in planning and organizing casework roundtables between North Texas caseworkers and federal agencies",
      "Review and learn federal regulations that affect constituents in the area",
      "Review and learn state regulations that may overlap with federal casework",
      "Attend local, state, and nationwide casework briefings",
      "Maintain professional relationships with agency contacts and other area caseworkers",
      "Maintain up to date files on all cases",
      "Periodically update congresswoman with relevant casework trends or cases",
      "Flexible schedule including long hours, nights, and weekends",
      "Perform other duties as assigned"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Knowledge of local, state, and federal agencies and departments",
      "Familiarity with Texas Congressional District 12 is a plus",
      "Ability to work cooperatively and courteously with others",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Thoroughness and careful attention to detail",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities",
      "Excellent interpersonal skills",
      "Exceptional time management",
      "Knowledge of office policies, practices, procedures, and computer applications"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to josie.flores@mail.house.gov and charlie.cripliver@mail.house.gov.",
    "salary_info": null,
    "contact": "josie.flores@mail.house.gov and charlie.cripliver@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-304-21",
    "position_title": "Civil Rights Counsel",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-08-09",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Civil Rights Counsel responsible for the portfolio covering civil rights issues in education and employment.\n\nCandidates should have familiarity with educational and employment federal civil rights laws, such as Title VI and Title VII of the Civil Rights Act of 1964 and Title IX of the Education Amendments of 1972. Knowledge of the EEOC, OFCCP and federal statutes and policies and how they impact civil rights in education and employment is preferred.\n\nApplicants should have a law degree and experience working with an organization, Congress, or government agency addressing civil rights. Duties will include supporting the development of legislation, providing technical assistance to the Committee and Member offices, researching pertinent issues, preparing written materials and legislative analyses, and supporting the execution of committee proceedings and events related to civil rights. Salary range is between $75,000 and $100,000, commensurate with experience.",
    "responsibilities": [
      "supporting the development of legislation",
      "providing technical assistance to the Committee and Member offices",
      "researching pertinent issues",
      "preparing written materials and legislative analyses",
      "supporting the execution of committee proceedings and events related to civil rights"
    ],
    "qualifications": [
      "familiarity with educational and employment federal civil rights laws, such as Title VI and Title VII of the Civil Rights Act of 1964 and Title IX of the Education Amendments of 1972.",
      "Knowledge of the EEOC, OFCCP and federal statutes and policies and how they impact civil rights in education and employment is preferred.",
      "a law degree and experience working with an organization, Congress, or government agency addressing civil rights"
    ],
    "how_to_apply": "To apply, applicants must submit a resume and two short writing samples demonstrating a proficiency in policy analysis to E&L.Jobs@mail.house.gov with \"Civil Rights Counsel Position\" in the subject line. Please apply no later than August 20, 2021.",
    "salary_info": "$75,000 and $100,000, commensurate with experience",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-301-21",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Veterans’ Affairs, Subcommittee on Oversight and Investigations",
    "location": null,
    "posting_date": "2021-08-09",
    "description": "The Democratic Staff of the House Committee on Veterans’ Affairs, Subcommittee on Oversight and Investigations seeks a Professional Staff Member to join a small team. The PSM will report to the Subcommittee Staff Director.\n\nThe position’s responsibilities include conducting oversight and investigations, tracking legislative and policy developments, conducting site visits, developing and drafting legislation, and engaging with stakeholders and whistleblowers.\n\nQualified candidates will have strong research, writing, and communications skills with a demonstrated ability to work on a team, execute events, and work on competing projects and priorities. This is not an entry-level position. Hill experience is strongly preferred.\n\nExceptional candidates will have strong knowledge and experience in the legislative process including planning and executing Committee hearings, writing memoranda and correspondence, and briefing Members of Congress. Knowledge and experience in Department of Veterans Affairs policies and operations, congressional oversight of federal programs, investigations of fraud, waste, and abuse, and working with whistleblowers are a plus. Salary range is 65-85k, commensurate with experience.",
    "responsibilities": [
      "conducting oversight and investigations",
      "tracking legislative and policy developments",
      "conducting site visits",
      "developing and drafting legislation",
      "engaging with stakeholders and whistleblowers"
    ],
    "qualifications": [
      "strong research, writing, and communications skills with a demonstrated ability to work on a team, execute events, and work on competing projects and priorities",
      "Hill experience is strongly preferred",
      "strong knowledge and experience in the legislative process including planning and executing Committee hearings, writing memoranda and correspondence, and briefing Members of Congress",
      "Knowledge and experience in Department of Veterans Affairs policies and operations, congressional oversight of federal programs, investigations of fraud, waste, and abuse, and working with whistleblowers are a plus"
    ],
    "how_to_apply": "All candidates are required to complete an online application (https://veterans.house.gov/opportunities) to be considered. Candidates should upload a resume, cover letter, writing sample, and diversity & inclusion statement.\n\nThe diversity & inclusion statement should be 250 words or less and: 1) Explain how your past personal and/or professional experiences have contributed to your growth in understanding diversity, equity, and inclusion, and/or 2) Explain how you plan to engage in diversity, equity and inclusion matters in this role.\n\nApplications will not be considered complete if there is no diversity & inclusion statement.",
    "salary_info": "Salary range is 65-85k, commensurate with experience.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-300-21",
    "position_title": "PRESS AND DIGITAL MANAGER/LEGISLATIVE CORRESPONDENT",
    "office": "Senior Northeastern House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2021-08-09",
    "description": "This role will support all aspects of a demanding communications operation, with\nresponsibilities including but not limited to drafting press materials such as\nreleases, background memos, talking points and op-eds; creating content for paid\nand organic social media on various platforms; and maintaining the website. The\npress and digital manager/legislative correspondent will also execute the office's\nmail program, with assistance from Legislative Fellows, interns, and the Staff\nAssistant.",
    "responsibilities": [
      "Drafting press materials such as releases, background memos, talking points and op-eds",
      "Creating content for paid and organic social media on various platforms",
      "Maintaining the website",
      "Execute the office's mail program, with assistance from Legislative Fellows, interns, and the Staff Assistant"
    ],
    "qualifications": [
      "Demonstrated interest and experience in communications and Democratic politics",
      "Proficiency with a variety of graphic design and video production tools",
      "Capability of meeting tight deadlines",
      "Strong written and oral communications skills",
      "The ability to think creatively and strategically"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two professional writing samples and two digital content samples to democratic.hilljob@gmail.com.",
    "salary_info": "$50,000",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Office is an Equal Opportunity Employer committed to building and maintaining an inclusive and diverse work environment. Women, candidates of color, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-290-21",
    "position_title": "Scheduler",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2021-08-09",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced and well-organized Scheduler for the Representative’s Washington, D.C. office.\n\nThis is not an entry-level position; 2-4 years of work experience are desired.\n\nApplicants with prior work experience as a Scheduler, as well as experience in fast-paced operational roles, are highly preferred.\n\nThe Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus.",
    "responsibilities": [
      "Developing, coordinating, and managing all aspects of the Representative’s daily and long-term schedule in D.C. and in the district, as well as tracking, evaluating, and responding to all invitations and scheduling requests;",
      "Coordinating all travel for the Representative and her staff, filing travel receipts, and other logistical support tasks as required;",
      "Working closely with and supporting the Chief of Staff, Deputy Chief of Staff, Legislative Director, District Director, and Communications Director to ensure smooth daily schedules and operations."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values;",
      "A hard worker with excellent attention to detail;",
      "Adept at juggling complex schedules, competing priorities;",
      "Able to anticipate problems, seek solutions, and effectively communicate them to the Representative and her staff;",
      "Able to work long hours, including some nights and weekends;",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Scheduler” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-290-21",
    "position_title": "Scheduler",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2021-08-09",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced and well-organized Scheduler for the Representative’s Washington, D.C. office.\n\nThis is not an entry-level position; 2-4 years of work experience are desired. Applicants with prior work experience as a Scheduler, as well as experience in fast-paced operational roles, are highly preferred.",
    "responsibilities": [
      "Developing, coordinating, and managing all aspects of the Representative’s daily and long-term schedule in D.C. and in the district, as well as tracking, evaluating, and responding to all invitations and scheduling requests;",
      "Coordinating all travel for the Representative and her staff, filing travel receipts, and other logistical support tasks as required;",
      "Working closely with and supporting the Chief of Staff, Deputy Chief of Staff, Legislative Director, District Director, and Communications Director to ensure smooth daily schedules and operations."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values;",
      "A hard worker with excellent attention to detail;",
      "Adept at juggling complex schedules, competing priorities;",
      "Able to anticipate problems, seek solutions, and effectively communicate them to the Representative and her staff;",
      "Able to work long hours, including some nights and weekends;",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Scheduler” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-287-21",
    "position_title": "Legislative Assistant",
    "office": "Office of Congresswoman Pramila Jayapal (WA-07)",
    "location": null,
    "posting_date": "2021-08-09",
    "description": "The Office of Congresswoman Pramila Jayapal (WA-07) is seeking a Legislative\nAssistant to handle a broad portfolio centered around labor, jobs, trade and\neconomic issues.\n\nThis position will be the lead staff person for Congresswoman Jayapal’s\nmembership on the Select Committee on Economic Disparity and Fairness in\nGrowth as well as the primary staff person for Congresswoman Jayapal’s labor\nportfolio for the Education and Labor Committee.\n\nThis position requires the ability to advance Congresswoman Jayapal's legislative\npriorities and other progressive policies in their issue portfolio. The ideal\ncandidate will possess strong strategic thinking, planning and execution skills.\nAdditionally, candidates should have strong oral and written communication\nskills and the ability to work well under pressure.",
    "responsibilities": [
      "Driving current and new legislative initiatives including idea generation,\nlegislative drafting and producing accompanying materials, such as speeches,\npolicy memos, and factsheets;",
      "Preparing and staffing the Congresswoman for relevant committee hearing and\nmarkups; drafting hearing remarks and questions;",
      "Representing the Congresswoman’s priorities with external stakeholders;",
      "Building and maintaining relationships with external and internal stakeholders\nincluding advocacy organizations; academics; fellow Congressional and\nCommittee offices; and",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "3 - 5 years of relevant experience including policy development and analysis; issue advocacy; and strategic planning;",
      "Passionate about public service and committed to progressive values;",
      "Excellent writing and time management skills;",
      "Ability to digest new content with a political and ideological lens that is appropriate for the office;",
      "Poised, level-headed, flexible, collaborative, team oriented; and",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Candidates should submit their resume, cover letter, two writing samples, and references in PDF format to jobs.pramila@mail.house.gov with “Legislative Assistant: [Applicant’s First and Last Name]” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer.\nWomen, people of color, LGBTQ+ individuals, new Americans, people with\ndisabilities, and members of other underrepresented communities are strongly\nencouraged to apply. State and/or district ties are a plus. Prior Hill experience is\nstrongly preferred."
  },
  {
    "id": "MEM-280-21",
    "position_title": "Staff Assistant",
    "office": "Midwestern Democrat",
    "location": "Capitol Hill",
    "posting_date": "2021-08-09",
    "description": "Midwestern Democrat seeking an organized, detail-oriented individual to serve in the position of Staff Assistant in a fast-paced and highly collaborative Capitol Hill office. Responsibilities include staffing and managing the front office, managing mail intake, answering and managing the phone system, greeting visitors, handling tour and flag requests, assisting staff during and after office hours, providing administrative support to the Administrative Director, and providing additional office support as needed.\n\nWhile this is an entry-level position, candidates should have excellent oral and written communication skills, great attention to detail, strong time management skills, an ability to work under pressure to meet tight deadlines, and a sense of humor. Capitol Hill and/or customer service experience are strongly preferred.\n\nMidwest and Great Lakes ties are a plus.",
    "responsibilities": [
      "Staffing and managing the front office",
      "Managing mail intake",
      "Answering and managing the phone system",
      "Greeting visitors",
      "Handling tour and flag requests",
      "Assisting staff during and after office hours",
      "Providing administrative support to the Administrative Director",
      "Providing additional office support as needed"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Great attention to detail",
      "Strong time management skills",
      "An ability to work under pressure to meet tight deadlines",
      "A sense of humor",
      "Capitol Hill and/or customer service experience are strongly preferred",
      "Midwest and Great Lakes ties are a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and writing sample in one PDF document to: midwestern.resume@mail.house.gov.",
    "salary_info": null,
    "contact": "midwestern.resume@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and women, people of color, members of the LGBTQ+ community, and members of other traditionally underrepresented communities are STRONGLY encouraged to apply."
  },
  {
    "id": "MEM-278-21",
    "position_title": "Legislative Assistant",
    "office": "Rep. Nanette Diaz Barragan (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2021-08-09",
    "description": "The Legislative Assistant will support the Member's work on the Energy & Commerce Health Subcommittee and cover a portfolio that includes health care, reproductive rights, family services|child welfare, and other issues.\n\nResponsibilities will include drafting legislation, policy letters, memos, and talking points, preparing for and staffing committee hearings, making vote recommendations, meeting and maintaining relationships with constituents and advocacy groups, working closely with the communications team and district staff, advancing a number of the Member's legislative priorities, and other tasks as required. The position requires strong written and oral communication skills, the ability to manage multiple priorities at one time, and the ability to work collaboratively in a team environment.\n\nThis is NOT an entry-level position.",
    "responsibilities": [
      "Drafting legislation, policy letters, memos, and talking points",
      "Preparing for and staffing committee hearings",
      "Making vote recommendations",
      "Meeting and maintaining relationships with constituents and advocacy groups",
      "Working closely with the communications team and district staff",
      "Advancing a number of the Member's legislative priorities",
      "Other tasks as required"
    ],
    "qualifications": [
      "Candidates should have at least 2-3 years of Capitol Hill or relevant policy experience",
      "Be highly motivated, detail-oriented professionals with strong organizational and time-management skills, as well as positive attitudes, and pride in work",
      "Candidates should have a strong understanding of the legislative process, coalition building, and have the ability to maintain strategic relationships with constituent organizations, and should be comfortable managing multiple priorities in a fast paced environment",
      "Los Angeles Metro Area|Southern California ties and Spanish language skills are a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, two references, and two writing samples with “Legislative Assistant” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary will be commensurate with skills and experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-274-21",
    "position_title": "Staff Assistant",
    "office": "Active Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2021-08-09",
    "description": "Ideal candidate will be a motivated self-starter with outstanding interpersonal, customer service, time-management, and organizational skills.\n\nPrimary responsibilities include: answering and logging telephone calls; front of office operations; recruiting and managing interns; managing constituent requests for flags and tours; assisting the Communications Director; assisting with constituent mail responses and other administrative duties.\n\nIdeal candidates will have relevant experience and demonstrate the ability to think on their feet to solve problems; show keen attention to detail; demonstrate excellent oral and written skills; maintain a positive demeanor; hold a clean driving record; and demonstrate resilience in a busy environment.",
    "responsibilities": [
      "answering and logging telephone calls",
      "front of office operations",
      "recruiting and managing interns",
      "managing constituent requests for flags and tours",
      "assisting the Communications Director",
      "assisting with constituent mail responses and other administrative duties"
    ],
    "qualifications": [
      "relevant experience",
      "demonstrate the ability to think on their feet to solve problems",
      "show keen attention to detail",
      "demonstrate excellent oral and written skills",
      "maintain a positive demeanor",
      "hold a clean driving record",
      "demonstrate resilience in a busy environment",
      "Candidates with California ties are preferred but not required."
    ],
    "how_to_apply": "Please submit a resume and cover letter in a single PDF document to ca07jobs@gmail.com with “DC Staff Assistant” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-273-21",
    "position_title": "Director of Operations",
    "office": "Rep. Karen Bass",
    "location": "Washington, DC",
    "posting_date": "2021-08-09",
    "description": "This role manages all aspects of the Member's and Chief of Staff's daily and long-term schedule in DC and in the District, office administration (including finances, travel, etc.). This individual will work closely with the Member, Chief of Staff, DC and District staff. Qualified candidates will have strong communications and multi-tasking skills and will work well on a team.\n\nThe ideal candidate will have prior administrative and scheduling experience on the Hill or comparable work environment. Candidate must be well-organized, detail-oriented, team-oriented, self-motivated, comfortable working in a fastpaced environment focused on serving constituents. Candidate must also have comfort interfacing with a principal.",
    "responsibilities": [
      "Manages all aspects of the Member's and Chief of Staff's daily and long-term schedule in DC and in the District",
      "Office administration (including finances, travel, etc.)",
      "Work closely with the Member, Chief of Staff, DC and District staff"
    ],
    "qualifications": [
      "Strong communications and multi-tasking skills",
      "Work well on a team",
      "Prior administrative and scheduling experience on the Hill or comparable work environment",
      "Well-organized",
      "Detail-oriented",
      "Team-oriented",
      "Self-motivated",
      "Comfortable working in a fast-paced environment focused on serving constituents",
      "Comfort interfacing with a principal"
    ],
    "how_to_apply": "To apply, please email your cover letter, resume, and references to CA37.HR@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-268-21",
    "position_title": "Counsel or Professional Staff",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": null,
    "posting_date": "2021-08-09",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation’s response to the coronavirus crisis is efficient, effective, and equitable.\nChairman James E. Clyburn seeks to fill a Counsel or Professional Staff position on the Majority staff. The ideal candidate will be an attorney or policy professional with several years of investigative or litigation experience.",
    "responsibilities": [
      "Leading investigations",
      "Conducting depositions and transcribed interviews",
      "Preparing for hearings",
      "Drafting reports"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Be self-motivated",
      "Possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Counsel / Professional Staff” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-267-21",
    "position_title": "Staff Assistant and Clerk",
    "office": "Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives",
    "location": "Capitol Hill",
    "posting_date": "2021-08-09",
    "description": "The Select Subcommittee on the Coronavirus Crisis in the U.S. House of Representatives conducts investigations to ensure the nation's response to the coronavirus crisis is efficient, effective, and equitable. Chairman James E. Clyburn seeks to fill a Staff Assistant and Clerk position on the Majority staff.\n\nThe ideal candidate will be an enthusiastic and organized self-starter with previous experience working or interning on Capitol Hill. Responsibilities include editing letters, monitoring phone lines, maintaining correspondence files and other records, hosting meetings, and supporting staff on all aspects of hearings, briefings, and other events. Occasional assistance with research and writing may also be required.",
    "responsibilities": [
      "editing letters",
      "monitoring phone lines",
      "maintaining correspondence files and other records",
      "hosting meetings",
      "supporting staff on all aspects of hearings, briefings, and other events",
      "Occasional assistance with research and writing may also be required."
    ],
    "qualifications": [
      "superior organization skills and attention to detail",
      "work well under pressure",
      "be self-motivated",
      "possess excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to SSCCJobs@mail.house.gov, with “Staff Assistant and Clerk” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-265-21",
    "position_title": "Constituent Services Representative",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "Willingboro or Toms River offices",
    "posting_date": "2021-08-09",
    "description": "The Constituent Services Representative is a field representative and caseworker on behalf of the Congressman that acts as a liaison to various federal, state and local agencies, assesses problems and finds solutions in a professional manner and screens and refers cases, as appropriate.\n\nIdeal candidates will have experience managing casework, be exceptionally wellorganized and attentive to detail, be able to adhere to established casework processes, have strong oral and written communication skills, excel at time management and be able to maintain good working relationships with the Congressman, staff and constituents. An even temperament, ability to deal effectively with a wide range of personalities, and creative problem solving skills are essential.",
    "responsibilities": [
      "Interact with constituents via phone, email and in person",
      "Establish, follow through and complete constituent casework",
      "Keep accurate and complete case notes and alerts at all times",
      "Interact with assigned federal agencies",
      "Interact with local, county and state offices to make and accept referrals",
      "Establish efficient processes to handle common issues and problems",
      "Cross-train and accept changing areas of focus as needed",
      "Staff public events as needed"
    ],
    "qualifications": [
      "Casework or other high volume, high touch work",
      "Time spent in a customer service role",
      "Work with federal, state or local government",
      "Experience with casework IQ program is a plus",
      "Candidates with ties to New Jersey are strongly encouraged to apply"
    ],
    "how_to_apply": "Email cover letter, resume and 2-3 references to NJ03resumes@mail.house.gov with the subject line “Constituent Services Representative: [NAME]”. Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-261-21",
    "position_title": "Data Analyst",
    "office": "Joint Economic Committee",
    "location": null,
    "posting_date": "2021-08-09",
    "description": "The Republican staff of U.S. Congress’s Joint Economic Committee seek a data\nanalyyst with strong quantitative skills for the Social Capital Project. Proficiency\nin Excel as well as STATA, R, or other statistical software package is required\nfor this role. Successful candidates will have a background in economics, public\npolicy, or similar field. Ability to think creatively, work independently, and take\ninitiative is necessary.\n\nThe Project provides a unique chance to develop an ambitious agenda aimed at\nenabling more Americans to thrive in the 21st century. Interest in JEC Social\nCapital Project-related research topics, including expanding opportunity by\nstrengthening families, communities, and attachment to work, is a plus. Salary is\ncommensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "Proficiency in Excel as well as STATA, R, or other statistical software package is required",
      "Background in economics, public policy, or similar field",
      "Ability to think creatively, work independently, and take initiative is necessary."
    ],
    "how_to_apply": "Interested candidates should send a resume and writing sample",
    "salary_info": "Salary is\ncommensurate with experience.",
    "contact": "RJobs@jec.senate.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, genetic information, national\norigin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-260-21",
    "position_title": "Senior Policy Advisor/Senior Economist",
    "office": "Republican staff of U.S Congress’s Joint Economic Committee",
    "location": null,
    "posting_date": "2021-08-09",
    "description": "The Republican staff of U.S Congress’s Joint Economic Committee seek a senior policy advisor/senior economist for the Social Capital Project. The Project, a “think tank within a committee,” seeks candidates with experience in social science and public policy research and interest in evidence-based approaches to expanding opportunity by strengthening families, communities, and attachment to work.\n\nFor these roles, successful candidates will have proven policy research and writing experience (for a public audience) and be able to weigh empirical evidence and think creatively about policy. Ability to work independently and take initiative are also essential.\n\nThe Project provides a unique chance to develop an ambitious policy agenda aimed at enabling more Americans to thrive in the 21st century. We encourage applications from those with a masters, PhD, or equivalent level of policy knowledge/experience. Salary commensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "Proven policy research and writing experience (for a public audience)",
      "Ability to weigh empirical evidence and think creatively about policy",
      "Ability to work independently and take initiative",
      "Masters, PhD, or equivalent level of policy knowledge/experience"
    ],
    "how_to_apply": "Interested candidates should send a resume and writing sample (not to exceed thirty pages) to RJobs@jec.senate.gov",
    "salary_info": "Salary commensurate with experience.",
    "contact": "RJobs@jec.senate.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-254-21",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-08-09",
    "description": "The Committee's investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is desirable: government ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase \"Investigative Counsel\" in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-253-21",
    "position_title": "Investigator",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-08-09",
    "description": "The Committee on Ethics seeks an experienced investigative professional for an investigator position.\n\nThe Committee’s investigator is responsible for assisting the Committee in all aspects of its investigative work, including researching and reviewing public data sources, forensic research, document review, data collection and analysis, preparing for and participating in witness interviews, and drafting and editing Committee documents.\n\nThis is a nonpartisan position which requires the ability to assist with impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding organizational, research, and analytical skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Assisting the Committee in all aspects of its investigative work",
      "Researching and reviewing public data sources",
      "Forensic research",
      "Document review",
      "Data collection and analysis",
      "Preparing for and participating in witness interviews",
      "Drafting and editing Committee documents"
    ],
    "qualifications": [
      "Outstanding organizational, research, and analytical skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, or financial accounting.",
      "Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigator” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-250-21",
    "position_title": "Communications Director or Press Secretary",
    "office": "Congressman John Sarbanes",
    "location": "Washington, D.C.",
    "posting_date": "2021-08-09",
    "description": "The Office of Congressman John Sarbanes seeks an experienced Communications Director or Press Secretary to serve in its Washington, D.C. office.\n\nThis is not an entry-level position.",
    "responsibilities": [],
    "qualifications": [
      "Impeccable writing skills",
      "A close eye to detail",
      "Fluency with a wide range of social media platforms and digital tools – including Adobe Creative Suite and website CMS services",
      "The ability to manage several, simultaneous projects in a fast-paced environment",
      "Experience working closely with national and local press, along with television and radio booking producers"
    ],
    "how_to_apply": "Qualified individuals should submit a resume, cover letter and writing portfolio to employment@mail.house.gov. No calls or walk-ins please.",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-247-21",
    "position_title": "In-district Press & Digital Media Assistant",
    "office": "Congresswoman Lisa Blunt Rochester",
    "location": "Wilmington, Delaware",
    "posting_date": "2021-08-09",
    "description": "This position is based in Wilmington, Delaware. Responsibilities include managing the Congresswoman’s website and social media accounts, working collaboratively to generate creative and engaging content for digital platforms, drafting talking points and advisories, and staffing the Congresswoman and taking photos/videos at events.\n\nAdditionally, the press & digital media assistant will help draft and copy-edit speeches and talking points for the Congresswoman for events in Delaware, and the person in this role will report directly to the DC-based Communications Director. Prior press/digital experience; Hill or campaign experience and familiarity with social media and graphic/video design are strongly preferred. Delaware ties a major plus. Strong written and oral communications skills, a flexible schedule, access to a car, and a clean driving record are musts.",
    "responsibilities": [
      "Managing the Congresswoman’s website and social media accounts",
      "Working collaboratively to generate creative and engaging content for digital platforms",
      "Drafting talking points and advisories",
      "Staffing the Congresswoman and taking photos/videos at events",
      "Drafting and copy-editing speeches and talking points for the Congresswoman for events in Delaware"
    ],
    "qualifications": [
      "Prior press/digital experience",
      "Hill or campaign experience",
      "Familiarity with social media and graphic/video design",
      "Delaware ties a major plus",
      "Strong written and oral communications skills",
      "Flexible schedule",
      "Access to a car",
      "Clean driving record"
    ],
    "how_to_apply": "Interested candidates must submit a resume, one cover letter, two writing samples, and two examples of social media or digital media work samples to lbr.jobposting@gmail.com",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-240-21",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT/COUNSEL",
    "office": "Rep. Karen Bass (CA37)",
    "location": "Hill",
    "posting_date": "2021-08-09",
    "description": "Rep. Karen Bass (CA37) seeks a hardworking lawyer with legal, policy, and Hill experience to serve as a Senior Legislative Assistant/Counsel, with the primary portfolio focusing on the Member’s Judiciary Committee work.\n\nResponsibilities include preparing and staffing the Member in committee hearings and markups; drafting talking points and speeches; and researching, drafting, and introducing legislation. All candidates should be a team player and possess excellent writing and communication skills, ability to work independently, and a thorough understanding of the legislative process.\n\nStrong candidates will have good relationships on the Hill with Democrats and Republicans, the ability to work effectively in a fast-paced environment, and a track record of turning ideas into legislation and preferably legislation into law.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Preparing and staffing the Member in committee hearings and markups",
      "Drafting talking points and speeches",
      "Researching, drafting, and introducing legislation"
    ],
    "qualifications": [
      "Team player",
      "Excellent writing and communication skills",
      "Ability to work independently",
      "Thorough understanding of the legislative process",
      "Good relationships on the Hill with Democrats and Republicans",
      "Ability to work effectively in a fast-paced environment",
      "Track record of turning ideas into legislation and preferably legislation into law",
      "Legal, policy, and Hill experience"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and a short (1-2 page) writing sample to CA37.HR@mail.house.gov with “Senior Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "CA37.HR@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, sexual orientation, disability, military status, age, marital status, or parental status.\nWomen, people of color, LGBTQ+ individuals, and members of other underrepresented communities are strongly encouraged to apply.\nNo phone calls or drop-ins, please."
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-08-09",
    "description": "The Office of Representative Spanberger seeks a motivated, creative, self-starter to join the district constituent services staff as a District Coordinator in the Glen Allen, VA office.\n\nResponsibilities include responding to constituent inquiries, managing constituent casework with federal agencies, working with the legislative team to address constituent concerns, and district outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events. Additional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills and have significant experience interacting with the public.\n\nAdditionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]