[
  {
    "id": "MEM-538-23",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Porter",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-23",
    "description": "Congresswoman Porter seeks a legislative assistant to handle civil rights, defense, federal courts, immigration, international affairs, trade, veterans’ affairs, and related issues assigned by the office and to support her work as a member of the Oversight & Accountability Subcommittee on National Security, the Border, and Foreign Affairs.\n\nThe ideal candidate will have two to four years of Hill and comparable advocacy experience, familiarity with congressional process and procedure, and a demonstrated ability to design and execute legislative projects. The candidate will have the creativity, drive, and confidence to propose original and compelling legislative work, including drafting legislation, hearing questions, and oversight letters that resonate with our ideologically diverse constituents. This is not an entry level position.",
    "responsibilities": [
      "Manage the Congresswoman’s work on civil rights, defense, federal courts, immigration, international affairs, trade, veterans’ affairs, and related policy issues as assigned by the office.",
      "Monitor House floor and committee activity to recommend votes and legislative action.",
      "Identify and pursue legislative opportunities for the Congresswoman, including sponsoring or cosponsoring bills and drafting and cosigning letters.",
      "Draft and edit constituent correspondence, oversight letters, op-eds, talking points, legislation, and other written material related to the issue area portfolio.",
      "Provide regular verbal and written reports to the Deputy Chief of Staff & Legislative Director and Chief of Staff on legislative work and priorities.",
      "Communicate with the Chief of Staff and District Director to help them amplify legislative work locally.",
      "Support the District Office in writing speeches and memos for events the Congresswoman attends that fall under the issue area portfolio.",
      "Other duties as assigned the Deputy Chief of Staff & Legislative Director and Chief of Staff."
    ],
    "qualifications": [
      "two to four years of Hill and comparable advocacy experience",
      "familiarity with congressional process and procedure",
      "demonstrated ability to design and execute legislative projects",
      "creativity, drive, and confidence to propose original and compelling legislative work, including drafting legislation, hearing questions, and oversight letters that resonate with our ideologically diverse constituents"
    ],
    "how_to_apply": "To apply, send a resume and a short writing sample to CA47.Resumes@mail.house.gov with “Legislative Assistant” in the subject line. Applications will be accepted until the position is filled.",
    "salary_info": "$70,000",
    "contact": "CA47.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, ethnicity, color, religion, sex, national origin, age, family status, military status, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-532-23",
    "position_title": "Press Secretary",
    "office": "Congressman Henry Cuellar (TX-28)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-23",
    "description": "The office of Congressman Henry Cuellar seeks a detail-oriented, highly motivated Press Secretary in his Washington, D.C. office.",
    "responsibilities": [
      "Drafting op-eds, floor speeches, press releases, statements, talking points, and advisories",
      "Booking interviews with national, cable, and local press outlets across multiple markets",
      "Assisting with pitching stories, responding to reporter inquiries, and staffing the Member as needed",
      "Compiling news clips and transcribing interviews",
      "Collaborating with legislative staff"
    ],
    "qualifications": [
      "Political communications experience and exceptional writing and organizational skills",
      "Experience working in fast-paced environments, supporting and helping implement an aggressive communications plan, working collaboratively to prioritize and publicize a Members' strategic goals, and balancing competing priorities",
      "Texas ties are preferred",
      "Spanish proficiency is highly desired but not required"
    ],
    "how_to_apply": "Interested candidates should submit a resume, 3 references, and 3 writing samples (ex: press release, op-ed, statement, floor speech, etc).",
    "salary_info": null,
    "contact": "texas28resumes@gmail.com",
    "equal_opportunity": "Diverse candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-530-23",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2023-10-23",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible legislative office staff.\n\nThe candidate must have strong interpersonal skills, be comfortable with managing multiple tasks and able to work well under pressure.",
    "responsibilities": [
      "Front office duties, including answering and screening telephone calls",
      "Mail distribution",
      "Room reservations",
      "Responding to constituent requests for flags, tours, and other information",
      "Serves as intern coordinator by recruiting training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Working knowledge of the District of Columbia",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-529-23",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Senior Democrat",
    "location": "District of Columbia",
    "posting_date": "2023-10-23",
    "description": "Senior Democrat is seeking a highly energetic, motivated, and organized individual with strong writing, social media/media, and interpersonal skills who can manage multiple tasks and work well under pressure.",
    "responsibilities": [
      "Responding to constituent mail, including any research necessary to write an adequate response to the mail",
      "Monitoring House floor procedures",
      "Meeting with constituents and interested individuals/organizations",
      "Preparing congressional record entries",
      "Drafting social media and outreach content",
      "Producing high-quality graphics and videos",
      "Livestreaming outreach events",
      "Assisting the communications director with updating the website and social media pages"
    ],
    "qualifications": [
      "The ideal candidate will be a results-oriented problem solver and a motivated self-starter who can think outside the box.",
      "Candidate must have a bachelor's degree, excellent writing and communication skills.",
      "Candidate must be a resident of, or be willing to become, a resident of the District of Columbia."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to DC00.NortonResume@mail.house.gov",
    "salary_info": null,
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-527-23",
    "position_title": "Director of Scheduling and Operations",
    "office": "Congresswoman Julia Brownley (CA-26)",
    "location": "Washington, DC",
    "posting_date": "2023-10-23",
    "description": "Congresswoman Julia Brownley (CA-26) seeks an experienced Director of Scheduling and Operations to work in the Washington, DC office. Candidates must have exceptional organizational and communication skills, be detail-oriented, have a passion for serving our constituents, and have the ability to execute multiple competing and ever-changing priorities in a fast-paced environment.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedule",
      "Organizing and evaluating all meeting requests and invitations with senior staff",
      "Compiling and managing the Member’s daily materials",
      "Helping the District Director with the Member’s district schedule as and if needed",
      "Overseeing office operations",
      "Preparing and submitting office expenses",
      "Arranging travel for the Member, the Chief of Staff, and other staff members",
      "Working with the Chief of Staff on certain budget items",
      "Ensuring that constituents are greeted in a professional and welcoming manner",
      "Supervising front office staff",
      "Coordinating with IT contractors",
      "Other tasks related to the day to day operations of the office"
    ],
    "qualifications": [
      "This is not an entry-level position; ideal candidates will have scheduling experience and knowledge of the Hill.",
      "Southern California ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "To apply, please send cover letter, resume, and references to: CA26Resumes@gmail.com.",
    "salary_info": "Salary range is competitive to the position and commensurate with experience.",
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital, or parental status."
  },
  {
    "id": "MEM-526-23",
    "position_title": "Constituent Services and Field Representative",
    "office": "Congresswoman Lucy McBath (GA-07)",
    "location": "Metro Atlanta region, Duluth District Office",
    "posting_date": "2023-10-23",
    "description": "Congresswoman Lucy McBath (GA-07) seeks a staff member based in the Metro Atlanta region for a position in her Duluth District Office. Primary responsibilities include assisting constituents in resolving issues with various federal agencies and representing the Congresswoman at meetings and events throughout the district.\n\nAdditionally, the staff member will play an active role in creating constituent services events and coordinating site visits as well as supporting the management of incoming and outgoing District Office communications. Candidates with experience in the nonprofit, healthcare, or public sectors are strongly encouraged to apply, and fluency in one or more of the following languages is a plus: Chinese (Mandarin or Cantonese), Korean, Spanish, or Vietnamese.",
    "responsibilities": [],
    "qualifications": [
      "Be a team player who can work independently while managing multiple tasks and projects",
      "Possess strong written, verbal, and interpersonal communication skills",
      "Practice strong interpersonal skills with constituents, agencies, and stakeholders",
      "Be willing to staff events and attend meetings outside of business hours as necessary",
      "Reliably execute tasks and projects with great organization and attention to detail"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to GA07Resumes@gmail.com with the subject line “Constituent Services and Field Representative” no later than November 6th, 2023.",
    "salary_info": null,
    "contact": "GA07Resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.\nCandidates from diverse backgrounds are encouraged to apply, as well as candidates with ties to Georgia."
  },
  {
    "id": "MEM-512-23",
    "position_title": "Digital/Press Staffer",
    "office": "Office of Congresswoman Lois Frankel (FL-22)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-23",
    "description": "The Office of Congresswoman Lois Frankel (FL-22) seeks a Digital/Press Staffer to support the Congresswoman’s communications efforts.\nTitle, specific responsibilities, and exact pay for this position are flexible and commensurate with experience. The Digital/Press Staffer will report directly to the Communications Director and oversee digital communications and outreach. This is a full-time in-person position based in Washington, D.C. The ideal candidate is a team player who can juggle multiple projects, deliver professional work under tight deadlines, develop and implement new ideas, and stay organized.",
    "responsibilities": [
      "Managing the Congresswoman’s Facebook, Twitter, and Instagram pages and producing videos, photos, and other creative content.",
      "Developing and carrying out a digital media strategy.",
      "Creating graphics that effectively communicate an idea or policy clearly.",
      "Drafting Facebook ads, unsolicited texts/newsletters, and working with the Communications Director to formulate a comprehensive Franked communications plan.",
      "Analyzing digital media performance.",
      "Assisting the Communications Director with photography at DC events, hearings, mark-ups, etc.",
      "Managing and distributing daily clips and media mentions.",
      "Developing and updating media lists.",
      "Drafting written materials like press releases, media advisories, and ICYMI’s.",
      "Assisting with the day-to-day operation of the communications shop."
    ],
    "qualifications": [
      "Previous Hill experience is preferred and Florida ties are a plus. Proficiency in Adobe Creative Suite, Canva or an industry-recognized design program is required. Experience with Franked media strongly preferred. Some photography experience is a plus."
    ],
    "how_to_apply": "Please visit tinyurl.com/fl22-comms-opening to apply. Applications will be reviewed on a rolling basis.",
    "salary_info": "Salary range is $55,000 - $65,000 depending on experience, and includes health insurance, student loan repayment, and other competitive benefits.",
    "contact": null,
    "equal_opportunity": "Women, people of color, LGBTQ+ people, and members of other minority or marginalized groups are strongly encouraged to apply. We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status."
  },
  {
    "id": "MEM-510-23",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Honolulu district office",
    "posting_date": "2023-10-23",
    "description": "Duties include but are not limited to greeting visitors and answering constituent calls and requests for general information, tours and other inquiries. This position also is responsible for a wide variety of administrative duties and acts as a liaison to the federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues.\n\nDirect report to the Deputy Chief of Staff in the Honolulu office, although the position also interacts directly with the Congressman and his Washington, D.C. office.",
    "responsibilities": [
      "Greeting visitors",
      "Answering constituent calls and requests for general information, tours and other inquiries",
      "Wide variety of administrative duties",
      "Acts as a liaison to the federal, district and local government agencies on behalf of the Congressman on requests by constituents for assistance with individual issues"
    ],
    "qualifications": [
      "Prior experience, especially in comparable duties",
      "Hawai'i background/community involvement",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long and unpredictable hours"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-508-23",
    "position_title": "Press Secretary/Digital Director (PS/DD)",
    "office": "Congresswoman Shontel Brown (OH-11)",
    "location": "Washington, DC",
    "posting_date": "2023-10-23",
    "description": "Working with the Communications Director, located in the District, the PS/DD will develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence. Other primary responsibilities include but are not limited to developing, editing, and producing graphics, videography, and other creative tools to enhance messaging; fielding press requests from local and national media; producing the Member’s newsletters; drafting releases and advisories, speeches , and talking points.\n\nThe successful candidate will have a creative and strategic approach to visual and graphic design, excellent oral and written communications skills, an ability to handle multiple assignments on tight deadlines, a desire to hone the Member’s voice, a strong collaborative approach to cross functional teaming, and a good sense of humor. They will also have a working knowledge of the legislative process, procedures, and organization of the House, with a proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately. Ohio ties are a plus, but not required, but proven effective digital and videography experience is required.\n\nThis is not an entry level position. The ideal candidate will have at least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level.",
    "responsibilities": [
      "Develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence.",
      "Developing, editing, and producing graphics, videography, and other creative tools to enhance messaging.",
      "Fielding press requests from local and national media.",
      "Producing the Member’s newsletters.",
      "Drafting releases and advisories, speeches , and talking points."
    ],
    "qualifications": [
      "Creative and strategic approach to visual and graphic design.",
      "Excellent oral and written communications skills.",
      "Ability to handle multiple assignments on tight deadlines.",
      "Desire to hone the Member’s voice.",
      "Strong collaborative approach to cross functional teaming.",
      "Good sense of humor.",
      "Working knowledge of the legislative process, procedures, and organization of the House.",
      "Proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately.",
      "Proven effective digital and videography experience is required.",
      "At least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level."
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume, two writing and one creative samples to Ohio11Resumes@mail.house.gov with the subject line “Press Secretary – Last Name, First Initial.” No drop-ins, direct emails to staff or phone calls, please. The position is open until filled, but applications will be screened as they are received.",
    "salary_info": "The salary is flexible and dependent upon proven experience and expertise.",
    "contact": "Ohio11Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-506-23",
    "position_title": "Legislative Assistant",
    "office": "Representative Josh Gottheimer (NJ-05)",
    "location": null,
    "posting_date": "2023-10-23",
    "description": "Representative Josh Gottheimer (NJ-05) seeks a Legislative Assistant to manage work including:",
    "responsibilities": [
      "A focused issue portfolio including the House Permanent Select Committee on Intelligence, Israel, and general foreign policy and defense issues",
      "Drafting and editing legislation, amendments, resolutions, letters and memos",
      "Building relationships with relevant stakeholders",
      "Working with the communications team to highlight the Congressman’s work"
    ],
    "qualifications": [],
    "how_to_apply": "Applicants should send, as a single PDF file, a cover letter, resume and three references with “Legislative Assistant” in the subject line to nj5jobs@mail.house.gov. The PDF file should be titled “Legislative Assistant – LastName, FirstName” (e.g. “Legislative Assistant – Doe, Jane.pdf”).",
    "salary_info": null,
    "contact": "nj5jobs@mail.house.gov",
    "equal_opportunity": "Female, minority, and LGBTQ+ candidates are strongly encouraged to apply.\nThe office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-505-23",
    "position_title": "West Hawai'i Island Field Representative",
    "office": "U.S. Representative Jill Tokuda",
    "location": "West Hawai'i Island",
    "posting_date": "2023-10-23",
    "description": "Congresswoman Jill Tokuda (HI-02) seeks a part-time Field Representative for West Hawai'i Island. This position will work closely with and report to the District Chief in Hawai'i, and in coordination with the East Hawai'i Island Field Representative.\n\nThis position requires consistent and effective collaboration with all components of the member's office. Work hours for this position are approximately 20-25 hours per month.",
    "responsibilities": [
      "Coordinating the Member's visits to West Hawai'i, including scheduling meetings and events, and transporting the Member on-island;",
      "Preparing briefing sheets and talking points as needed;",
      "Connecting with Washington, D.C. staff on relevant notes and contacts;",
      "Staffing the Member as appropriate, taking notes and photos, and ensuring that follow up is conducted;",
      "Informs the Member and relevant staff of community events and happenings in West Hawai'i; and",
      "Prepares and delivers West Hawai'i messages and communications, and represents the Member at events as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates must submit an application to kendra.oishi@mail.house.gov by October 27, 2023. Candidates should submit a cover letter, resume, and references.",
    "salary_info": null,
    "contact": "kendra.oishi@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-500-23",
    "position_title": "Grants Coordinator and Field Representative",
    "office": "Rep. Salinas",
    "location": "Tigard, Oregon",
    "posting_date": "2023-10-23",
    "description": "The Grants Coordinator responsibilities include tracking federal grant opportunities and liaising with key stakeholders (local and state government, local businesses and community-based organizations, federal agency grant administrators) and internal staff, maintaining and regularly updating the grants tracker, tracking new grant opportunities, works closely with the Legislative\n\nDirector to develop a successful Congressional Project Funding (CPF) process, and providing additional office support as needed.\n\nThe Field Representative responsibilities include acting as a grassroots representative for the Member within their area of responsibility, informs the District Director and office on all happenings in their assigned issue area, building and maintaining positive relationships with constituents, key community leaders and other stakeholders, attends events to staff or advance the member including on evenings and weekends, as determined by the District Director.\n\nQualified applicants should have prior professional experience, reliable transportation, and be prepared to work in a fast-paced office that frequently requires non-traditional work hours, extensive district travel, and remote work.",
    "responsibilities": [
      "Tracking federal grant opportunities and liaising with key stakeholders (local and state government, local businesses and community-based organizations, federal agency grant administrators) and internal staff.",
      "Maintaining and regularly updating the grants tracker.",
      "Tracking new grant opportunities.",
      "Working closely with the Legislative Director to develop a successful Congressional Project Funding (CPF) process.",
      "Providing additional office support as needed.",
      "Acting as a grassroots representative for the Member within their area of responsibility.",
      "Informs the District Director and office on all happenings in their assigned issue area.",
      "Building and maintaining positive relationships with constituents, key community leaders and other stakeholders.",
      "Attending events to staff or advance the member including on evenings and weekends, as determined by the District Director."
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Interpersonal skills",
      "Great attention to detail",
      "Strong time management skills",
      "A desire to work collaboratively",
      "Prior professional experience",
      "Reliable transportation",
      "Prepared to work in a fast-paced office that frequently requires non-traditional work hours, extensive district travel, and remote work."
    ],
    "how_to_apply": "Interested applicants should e-mail 1) a resume, 2) a cover letter, to OR06resumes@mail.house.gov with the subject “Grants Coordinator/Field Rep: Last Name”",
    "salary_info": "Salary is approximately $65,000-$70,000 (or commensurate with experience) with federal benefits.",
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation."
  },
  {
    "id": "MEM-499-23",
    "position_title": "Digital Outreach Manager",
    "office": "Office of Congresswoman Andrea Salinas (OR-06)",
    "location": null,
    "posting_date": "2023-10-23",
    "description": "The Office of Congresswoman Andrea Salinas (OR-06) seeks a Digital\nOutreach Manager to join a past-faced communications team and lead an\naggressive digital outreach program for a freshman member in a brand-new\ncongressional district. The ideal candidate is a self-starter who has strong writing\nskills, a relentless creative streak, a good sense of humor, and a deep familiarity\nwith social media. Applicants with Oregon ties will be given preference. Spanishfluency is a major plus.\nThis is not an entry-level position.",
    "responsibilities": [
      "Creating digital content (copy, graphics, videos, toolkits, etc.)",
      "Managing the Congresswoman’s social media pages",
      "Overseeing a large Franked communications program",
      "Updating the Congresswoman’s website",
      "Other press and creative projects as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, 2-3 references, one\nwriting sample, and one digital sample to OR06resumes@mail.house.gov with\nthe following subject line: “Full Name – Digital Outreach Manager.”",
    "salary_info": "$58,000 - $65,000 or commensurate with experience",
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office is an\nequal-opportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-496-23",
    "position_title": "Communications Assistant",
    "office": "The Office of Congressman Rob Wittman (VA01)",
    "location": null,
    "posting_date": "2023-10-23",
    "description": "This position is responsible for developing a proactive constituent communications strategy and plan. Primary responsibilities include: writing weekly email newsletters for targeted constituent coalitions, overseeing website management and updates, branding through graphic design, managing social media, overseeing the telephone town hall program, and maintaining the Member’s photo and video database. They will work with the communications director to find new ways grow the congressman’s following and maintain synergy across communications materials.\n\nA strong candidate will be a creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing. Excellent written and oral skills are required. An ability to multitask and work under tight deadlines is necessary.\n\nCandidates must have previous congressional or political communications experience; ties to Virginia’s First District are helpful but not required.",
    "responsibilities": [
      "writing weekly email newsletters for targeted constituent coalitions",
      "overseeing website management and updates",
      "branding through graphic design",
      "managing social media",
      "overseeing the telephone town hall program",
      "maintaining the Member’s photo and video database"
    ],
    "qualifications": [
      "creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing",
      "Excellent written and oral skills are required",
      "An ability to multitask and work under tight deadlines is necessary",
      "previous congressional or political communications experience",
      "ties to Virginia’s First District are helpful but not required"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Julianne.Heberlein@mail.house.gov with “Communications Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Julianne.Heberlein@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-495-23",
    "position_title": "Communications Director",
    "office": "Congresswoman Dina Titus (D-NV-1)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-23",
    "description": "Congresswoman Dina Titus (D-NV-1) is seeking an experienced Communications Director to lead media efforts in a fast- paced Washington, D.C. office. We are looking for a self-starting professional with a strong background in political communications, media relations, and social media management.\n\nThe ideal candidate will have a deep understanding of both national and local media and be capable of developing and implementing strategic communication and digital plans. This is not an entry-level position, and a successful candidate must have 2-5 years of communications experience in a relevant setting.",
    "responsibilities": [
      "Strategic Communications: Develop and execute strategic communication plans in collaboration with senior staff and the legislative team, ensuring alignment with the Congresswoman's priorities and legislative initiatives.",
      "Media Relations: Cultivate and maintain strong relationships with local and national print, radio, and broadcast media professionals.",
      "Media Outreach: Successfully pitch the Congresswoman to both local and national TV, radio, and print media, positioning her effectively on key issues.",
      "Event Planning: Plan and manage press conferences, tele-townhalls, roundtables, and other events in both Washington, D.C., and the district.",
      "Media Engagement: Prepare, brief, and accompany the Congresswoman for media interviews, press conferences, roundtables, and other public engagements.",
      "Content Creation: Draft talking points, speeches, press releases, op-eds, and other materials in the Congresswoman's voice.",
      "Social Media Management: Manage the Congresswoman's social media presence, including drafting engaging content, clipping interviews, and creating graphics for various platforms.",
      "Website Maintenance: Ensure that the office website features timely and relevant content.",
      "Current Affairs: Stay informed about current news and legislative issues that may impact the Congresswoman's work."
    ],
    "qualifications": [
      "Exceptional Communication Skills: Strong writing, editing, and proofreading skills.",
      "Media Proficiency: Deep understanding of print, broadcast, and online media.",
      "Experience: 2-5 years of experience in developing communication strategy for elected officials, government agencies, non-profit organizations, or similar entities.",
      "Team Player: Expertise in advising others on communication strategy and the ability to work effectively with a team and Member of Congress.",
      "Deadline-Oriented: Capable of producing communications materials under tight deadlines.",
      "Strategic Thinker: Politically savvy and skilled at navigating challenging situations with the press and staff.",
      "Adaptability: Ability to work flexible hours, including long hours, nights, and weekends, as needed.",
      "Constructive Feedback: Willingness to accept performance-based criticism and direction.",
      "Relationship Building: Ability to maintain positive working relationships with the Congresswoman, staff, and media professionals."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and two writing samples to NV01jobs@gmail.com with \"Application: Rep. Titus Communications Director\" in the subject line.\n\nApplications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "NV01jobs@gmail.com",
    "equal_opportunity": "Our office is committed to promoting diversity and inclusivity. We are an equal opportunity employer and do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-494-23",
    "position_title": "Communications Staffer",
    "office": "Office of Congresswoman Jennifer McClellan (VA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-23",
    "description": "The Office of Congresswoman Jennifer McClellan (VA-04) seeks a proactive, creative, and digital-savvy individual to join her D.C.-based communications team. This position reports directly to the Communications Director and will play an integral role in the office’s press and digital operation. Title, responsibilities, and pay for this position are flexible and commensurate with experience.",
    "responsibilities": [
      "Managing social media pages",
      "Writing compelling social copy",
      "Developing creative graphics, videos, and other digital collateral",
      "Maintaining the Member’s website",
      "Compiling daily press clips",
      "Assisting in the execution of virtual and in-person press events",
      "Supporting the Communications Director in drafting and sending other press materials, including press releases, media advisories, op-eds, and other content"
    ],
    "qualifications": [
      "Be creative in how they develop and grow the Member’s digital platforms",
      "Be proficient in Adobe Creative Suite",
      "Understand social media metrics, graphic design, and video production",
      "Be detail-oriented",
      "Possess strong written and verbal communication skills",
      "Prior communications experience required.",
      "Capitol Hill or other political communications experience preferred.",
      "Virginia ties are a plus."
    ],
    "how_to_apply": "To apply please send a resume, cover letter, and writing sample to VA04.Jobs@mail.house.gov.",
    "salary_info": "$60,000-$75,000",
    "contact": "VA04.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, religious affiliation, national origin, age, or military, marital, or parental status. The office prioritizes building a diverse team: women and candidates from BIPOC, LGBTQ+, and other underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-490-23",
    "position_title": "Scheduler",
    "office": "Congressman Jamie Raskin (MD-08)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-23",
    "description": "The Office of Congressman Jamie Raskin (MD-08) seeks a Scheduler to work in the Washington, D.C. office in a full-time capacity.\nCandidates must have exceptional organizational and communications skills, scrupulous attention to detail, effective time management, and thrive in a fastpaced team environment.\nThe successful candidate will have knowledge of the congressional work setting, ability to balance competing demands and work well under pressure, and possess sound judgement and a professional and discreet demeanor. The position requires a willingness to work non-traditional hours when required. Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred. Ties to Maryland's 8th District, humor, and a facility with other languages are a plus.",
    "responsibilities": [
      "Developing, coordinating and managing all aspects of the Members's schedule and logistics in D.C. and in the district",
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Leading scheduling meetings",
      "Communicating key information and scheduling changes to the Congressman, staff, and stakeholders in a timely and efficient manner",
      "Coordinating with legislative and press staff on events and briefing materials, and coordinating with the district office, committee staff, other Members offices, and with the campaign team on political scheduling requests",
      "Assisting the Chief of Staff with office operations",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Exceptional organizational and communications skills",
      "Scrupulous attention to detail",
      "Effective time management",
      "Ability to thrive in a fast-paced team environment",
      "Knowledge of the congressional work setting",
      "Ability to balance competing demands and work well under pressure",
      "Sound judgement and a professional and discreet demeanor",
      "Willingness to work non-traditional hours when required",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred",
      "Ties to Maryland's 8th District, humor, and a facility with other languages are a plus"
    ],
    "how_to_apply": "To apply, please send an email to MD08.Resumes@mail.house.gov with “Scheduler: Last Name” in the subject line and the following application materials attached as one combined PDF:\n•Cover letter (not to exceed two pages) – please customize your letter to this position\n•Resume\n•Two writing samples\n•Three references – for each reference, please include name, current title/office, phone",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-489-23",
    "position_title": "Staff Assistant",
    "office": "Midwest Democrat",
    "location": "Washington D.C.",
    "posting_date": "2023-10-23",
    "description": "Primary responsibilities include managing the front office, answering and logging telephone calls, managing constituent requests for flags and tours, assisting with constituent correspondence, recruiting and managing interns, supporting legislative and communications staff, and other administrative duties.\n\nIdeal candidates will be motivated self-starters with excellent oral, written, and interpersonal communication skills, strong organizational skills, demonstrate an ability to think quickly when troubleshooting, and maintain a positive demeanor in a busy environment. Candidate must be able to drive member, though does not need to provide their own vehicle. Capitol Hill or other relevant experience is preferred. Illinois ties are a plus.",
    "responsibilities": [
      "Managing the front office",
      "Answering and logging telephone calls",
      "Managing constituent requests for flags and tours",
      "Assisting with constituent correspondence",
      "Recruiting and managing interns",
      "Supporting legislative and communications staff",
      "Other administrative duties"
    ],
    "qualifications": [
      "Motivated self-starters",
      "Excellent oral, written, and interpersonal communication skills",
      "Strong organizational skills",
      "Ability to think quickly when troubleshooting",
      "Maintain a positive demeanor in a busy environment",
      "Ability to drive member",
      "Capitol Hill or other relevant experience is preferred",
      "Illinois ties are a plus"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and writing sample to IL10.Jobs@mail.house.gov and list “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "IL10.Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-483-23",
    "position_title": "Legislative Assistant",
    "office": "Representative Nanette Diaz Barragán (CA-44)",
    "location": "Washington, DC",
    "posting_date": "2023-10-23",
    "description": "Congresswoman Nanette Barragán (CA-44) seeks a Legislative Assistant position in her Washington, DC office. The Legislative Assistant will manage the Member’s work on the Energy & Commerce Health Subcommittee and cover an active portfolio that includes health care, aging & families, child welfare, social security, veteran’s affairs, LGBTQ issues, and appropriations for these issues.\n\nThe position requires strong written and oral communication skills, the ability to manage multiple priorities, and the ability to work collaboratively in a team environment.\n\nIn addition, candidates should understand the legislative process, sound political judgment, coalition building, familiarity working on issues that impact communities of color, and have the ability to maintain strategic relationships with issue advocates, constituent organizations, and stakeholders.\n\nThis is NOT an entry-level position. Candidates should have at least Capitol Hill or relevant policy experience, be highly motivated, detail-oriented, and possess strong organizational and time-management skills.\n\nDiverse candidates are encouraged to apply. California ties are a plus.",
    "responsibilities": [
      "Preparing and staffing the Member for subcommittee hearings and markups",
      "Drafting legislation, letters, memos, and talking points",
      "Researching and advising the Member on policy issues",
      "Making vote recommendations",
      "Maintaining positive relationships with constituents, advocacy groups, and key stakeholders",
      "Supporting the work of the communications team, district staff, and Congressional Hispanic Caucus staff",
      "Advancing the Member’s legislative priorities",
      "Other tasks as required"
    ],
    "qualifications": [
      "Strong written and oral communication skills",
      "Ability to manage multiple priorities",
      "Ability to work collaboratively in a team environment",
      "Understand the legislative process",
      "Sound political judgment",
      "Coalition building",
      "Familiarity working on issues that impact communities of color",
      "Ability to maintain strategic relationships with issue advocates, constituent organizations, and stakeholders",
      "Capitol Hill or relevant policy experience",
      "Highly motivated",
      "Detail-oriented",
      "Strong organizational and time-management skills"
    ],
    "how_to_apply": "To apply, candidates should send a resume, cover letter, two writing samples, and three references to CA44Resumes@mail.house.gov. Please include your name and “Legislative Assistant” in the subject line.",
    "salary_info": "$60,000 - $80,000 (commensurate with experience)",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-481-23",
    "position_title": "District Director",
    "office": "Representative Jason Crow (CO-6)",
    "location": "Aurora, CO",
    "posting_date": "2023-10-23",
    "description": "We are looking for an experienced leader who can serve as the Congressman’s primary advisor in the district office, manage a talented team, and maintain strong relationships with community leaders and stakeholders.\n\nThis is not an entry level position.",
    "responsibilities": [],
    "qualifications": [
      "Strong oral and written communications skills",
      "Thoroughness and careful attention to detail",
      "The temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner"
    ],
    "how_to_apply": "Candidates should submit a resume and cover letter with the subject line “District Director” to: co06.resumes@mail.house.gov. No phone calls, faxes, or drop-ins, please.",
    "salary_info": null,
    "contact": "co06.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-468-23",
    "position_title": "Investigative Counsel",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2023-10-23",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks one attorney with 5-10 years of experience to serve as Investigative Counsel.\n\nThe Investigative Counsel reports to the Staff Director and Chief Counsel and will be responsible for conducting sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives and advising the Staff Director and Chief Counsel on legal and policy matters.\n\nThe OCE is seeking attorneys interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Counsel would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Review information received by OCE, discern possible violations, and identify facts requiring further investigation",
      "Plan, organize and conduct investigations regarding allegations and advise the Staff Director and Chief Counsel regarding appropriate evaluation of cases",
      "Advise the Staff Director and Chief Counsel on legal issues in matters under investigation and on broader legal and policy issues involved in the operations of OCE",
      "Draft lengthy and detailed memoranda, reports, and referrals for Board consideration and potential public release",
      "Developing investigative strategies and implementing investigative plans",
      "Reviewing evidence and data in order to analyze, develop, and provide detailed written and oral reports of findings",
      "Identifying information to substantiate or disprove allegations and assess the likely sources of that information",
      "Collecting and reviewing documents, electronic media, and physical evidence",
      "Interviewing witnesses and subjects",
      "Performing other duties as assigned"
    ],
    "qualifications": [
      "Demonstrated ability to conduct and direct complex legal research and present the results in a clear, precise and persuasive manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Strong legal judgment and demonstrated professional integrity",
      "Experience auditing large sets of data or evidence and providing detailed analysis",
      "Investigative experience with high-profile and sensitive matters",
      "Experience with investigations involving public officials",
      "Experience with campaign finance or ethics law",
      "Experience conducting interviews or depositions",
      "Experience writing public reports or legal documents",
      "Advanced proficiency in development and use of electronic databases, and other computer skills including knowledge of current information technology tools related to investigations",
      "work independently or as part of an investigative team",
      "manage multiple tasks and projects",
      "work well under pressure and tight time deadlines",
      "exercise discretion and independent judgment",
      "Ability to pass Security Background Investigation to obtain Top Secret clearance",
      "Graduation from an ABA accredited law school and active bar membership"
    ],
    "how_to_apply": "Please send cover letter, short writing sample, and resume (electronic submissions preferred) to:",
    "salary_info": null,
    "contact": "Omar S. Ashmawy\nStaff Director and Chief Counsel\nOffice of Congressional Ethics\nUnited States House of Representatives\nP.O. Box 895\nWashington, DC 20515-0895\nOCEJOB@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2023-10-23",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-448-23",
    "position_title": "Professional Staff Member",
    "office": "House Armed Services Committee Democrats",
    "location": null,
    "posting_date": "2023-10-23",
    "description": "The House Armed Services Committee Democrats are seeking a Professional Staff Member for the Military Personnel Subcommittee.\n\nResponsibilities include, but are not limited to, advising Members of Congress on military justice and other military personnel policy matters, evaluating budget requests and legislative proposals, preparing for committee hearings and briefings, and developing and drafting proposal for inclusion in the annual National Defense Authorization Act.\n\nThe Military Personnel Subcommittee jurisdiction includes: policy and programs and accounts related to military personnel and their families, Reserve Component integration and employment, military health care, military education, dependent schools, POW/MIA issues, Morale, Welfare and Recreation, commissaries, cemeteries under the jurisdiction of the Department of Defense, the Uniform Code of Military Justice, military retirement issues, and the civilian and contract workforce.\n\nThis is not an entry level position. Candidates with a law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred. The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees. A successful candidate will be required to obtain and maintain a security clearance.",
    "responsibilities": [
      "Advising Members of Congress on military justice and other military personnel policy matters",
      "Evaluating budget requests and legislative proposals",
      "Preparing for committee hearings and briefings",
      "Developing and drafting proposal for inclusion in the annual National Defense Authorization Act"
    ],
    "qualifications": [
      "Law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred",
      "Successful candidate will be required to obtain and maintain a security clearance"
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, to hasc.dememployment@mail.house.gov with the subject line: “Full Name – PSM – Military Personnel.” We will accept applications until the position is filled.",
    "salary_info": null,
    "contact": "hasc.dememployment@mail.house.gov",
    "equal_opportunity": "The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees."
  },
  {
    "id": "MEM-354-23",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "Washington, DC",
    "posting_date": "2023-10-23",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public. The Policy Director’s responsibilities will include:",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-305-23",
    "position_title": "DPCC COMMUNICATIONS DIRECTOR",
    "office": "House Democratic Policy and Communications Committee",
    "location": "Capitol Hill",
    "posting_date": "2023-10-23",
    "description": "The House Democratic Policy and Communications Committee seeks an experienced Communications Director.\n\nThe Communications Director will work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats; create messaging guidance, event suggestions, sample releases, and other communications tools; help Democratic offices pitch stories, hold strong local press events, and position Members in the media; and assist in bolstering paid communications programs in Democratic offices.\n\nThe Communications Director is also expected to assist with the planning and execution of regular DPCC message meetings and policy dinners; support DPCC outreach initiatives; and assist with daily tasks and long-term planning. Spanish language fluency and experience with constituency media is strongly preferred.",
    "responsibilities": [
      "Design and execute strategies that advance the message priorities and values of House Democrats",
      "Create messaging guidance, event suggestions, sample releases, and other communications tools",
      "Help Democratic offices pitch stories, hold strong local press events, and position Members in the media",
      "Assist in bolstering paid communications programs in Democratic offices",
      "Assist with the planning and execution of regular DPCC message meetings and policy dinners",
      "Support DPCC outreach initiatives",
      "Assist with daily tasks and long-term planning"
    ],
    "qualifications": [
      "A strong background in communications on Capitol Hill is required.",
      "Spanish language fluency and experience with constituency media is strongly preferred."
    ],
    "how_to_apply": "To apply, please email jobs.DPCC@mail.house.gov with the following application materials attached as one combined PDF: 1. Cover letter; 2. Resume; 3. Two writing samples, with one coming from work on Capitol Hill; and 4. Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without contacting you first).",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-300-23",
    "position_title": "Legislative Director",
    "office": "Congressman Steven Horsford (NV-O4)",
    "location": "Capitol Hill",
    "posting_date": "2023-10-23",
    "description": "Congressman Steven Horsford (NV-O4) seeks a highly motivated, hard-working, skilled and experienced Legislative Director to help shape and manage a robust legislative portfolio.\nCongressman Horsford is a member of the Armed Services and Financial Services Committees, Chair of the Congressional Black Caucus, and an active frontline member. Previous legislative experience on Capitol Hill is required, and Nevada ties are a plus.\nIdeal candidates will have experience managing and mentoring staff, thinking strategically and will possess a sophisticated understanding of the legislative process, along with excellent writing, organizational and time management skills.\nThe ideal candidate will primarily be responsible for managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues.\nCandidates should be creative, proactive and self-motivated, and have an ability to operate effectively under pressure and work closely in a team atmosphere in this fast-moving, dynamic office.",
    "responsibilities": [
      "Managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues."
    ],
    "qualifications": [
      "Previous legislative experience on Capitol Hill is required.",
      "Nevada ties are a plus.",
      "Experience managing and mentoring staff",
      "Sophisticated understanding of the legislative process",
      "Excellent writing, organizational and time management skills.",
      "Creative, proactive and self-motivated",
      "Ability to operate effectively under pressure and work closely in a team atmosphere"
    ],
    "how_to_apply": "Interested candidates must include a cover letter, resume, two page max writing sample and three professional references in a single PDF file.\nEmail submissions to the Director of Administration, Selena Harvey at nv04resumes@mail.house.gov. Subject line must read \"Legislative Director Application\".",
    "salary_info": "Salary is competitive and commensurate with experience, along with generous benefits and professional development opportunities.",
    "contact": "Selena Harvey at nv04resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color and LGBTQAI+ candidates are strongly encouraged to apply, as are candidates with Nevada ties."
  },
  {
    "id": "MEM-NV04-23",
    "position_title": "Legislative Director",
    "office": "MEM-NV04",
    "location": null,
    "posting_date": "2023-10-23",
    "description": "last name",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "No calls please. Individuals selected for an interview will be contacted.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  }
]