[
  {
    "id": "MEM-137-20",
    "position_title": "Junior Professional Staff Member",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": "House of Representatives",
    "posting_date": "2020-04-13",
    "description": "The Energy & Commerce Committee, Democratic Staff, seeks Junior\nProfessional Staff Member for the Consumer Protection Subcommittee staff.\nThe broad jurisdiction of the subcommittee includes consumer protection\ngenerally; motor vehicle safety; consumer product safety; regulation of\ncommercial practices, including sports-related matters; consumer privacy and\ndata security; and travel, tourism, and time. The subcommittee oversees the\nNational Highway Traffic Safety Administration, the Consumer Product\nSafety Commission, and the Federal Trade Commission, among others.\n\nThe position requires the handling of substantive legislative and\nadministrative tasks, including staffing hearings and markups, conducting\noversight, and drafting legislation.\n",
    "responsibilities": [
      "Staffing hearings and markups",
      "Conducting oversight",
      "Drafting legislation"
    ],
    "qualifications": [
      "Minimum of 2-4 years of experience in the House of Representatives",
      "Strong writing, analytical, and legislative skills",
      "Sound political judgment",
      "Proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "Willingness to work long hours and weekends",
      "Experience working with relevant public interest groups, relevant agencies, Congress, and industry"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two\nprofessional references to ecdjobs@mail.house.gov using the subject line\nConsumer Protection Junior PSM Candidate.",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin,\nreligion, sex (including marital or parental status), gender identity, disability,\nor age. Women, minority, and veteran candidates are highly encouraged to\napply."
  },
  {
    "id": "MEM-136-20",
    "position_title": "Scheduler/Executive Assistant",
    "office": "New York Democrat",
    "location": "Washington, DC",
    "posting_date": "2020-04-13",
    "description": "Duties include, but not limited to the following: preparing the Member’s daily and monthly schedules, briefing the Member on all scheduling activities and requests of the Washington, DC and district offices, managing all of the Member’s travel and lodging reservations, and maintaining the Member’s files and correspondence.\n\nThe ideal candidate must work well under pressure and be willing to work a flexible schedule that includes non-traditional work hours. Qualified applicants should have at least three to five years of related work experience including prior scheduling and professional office experience.\n\nThe Scheduler/Executive Assistant will report to the Chief of Staff. Prior Capitol Hill experience and ties to Brooklyn is a plus. This position is based in Washington, DC.\n\nThis is a permanent, full-time position.",
    "responsibilities": [
      "preparing the Member’s daily and monthly schedules",
      "briefing the Member on all scheduling activities and requests of the Washington, DC and district offices",
      "managing all of the Member’s travel and lodging reservations",
      "maintaining the Member’s files and correspondence"
    ],
    "qualifications": [
      "must work well under pressure",
      "be willing to work a flexible schedule that includes non-traditional work hours",
      "at least three to five years of related work experience including prior scheduling and professional office experience",
      "Prior Capitol Hill experience and ties to Brooklyn is a plus"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter and resume to ResumeNY@mail.house.gov. Please place SCHEDULER/EXECUTIVE ASSISTANT in the subject line. NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-135-20",
    "position_title": "District Director",
    "office": "Southern California Democrat",
    "location": "Southern California",
    "posting_date": "2020-04-13",
    "description": "Southern California Democrat seeks District Director to oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans, as well as direct all activities and staff of the district offices.\n\nThis position is responsible for recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures; represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.\n\nResponsibilities include strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management. This individual also serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district; and, acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region.",
    "responsibilities": [
      "Oversee all operations of the district offices, including the development and implementation of policy objectives, strategies and operating plans, as well as direct all activities and staff of the district offices.",
      "Recruiting, hiring, training, and managing district staff and ensures that district staff complies with office policies, practices, and procedures",
      "Represents the Member and/or assigns appropriate staff to do so at events or functions through the district as needed.",
      "Strategizing, developing, and implementing district communications and outreach plan for constituents, including casework management.",
      "Serves as the primary liaison between the Congresswoman and constituents and special interest groups in the district",
      "Acts as an advisor for the Congresswoman on local concerns, district issues and politics, and other developments throughout the region."
    ],
    "qualifications": [
      "Minimum of 3-5 years of management experience",
      "Strong ability to provide necessary organization, leadership and motivation to manage a Congressional office",
      "Excellent oral and written communication skills",
      "Thorough knowledge of the legislative process",
      "Energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours (including evenings and weekends) in a fast-paced and demanding setting.",
      "Spanish fluency and Southern California ties are a plus."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and appropriate writing samples to CA26Resumes@gmail.com with just “District Director” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-132-20",
    "position_title": "Press Secretary/Digital Director",
    "office": "California Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2020-04-13",
    "description": "The person chosen for the position will work closely with the Communications Director to develop and execute the Congresswoman’s long-term communication plan.\n\nThey will assist with media relations, oversee all video production and photography, and be responsible for leading or contributing to regular newsletters, mail pieces and reports.\n\nThe Press Secretary/Digital Director will be responsible for a wide range of critical functions, including developing original social media content; designing graphics and web content and maintaining the office’s website.\n\nAdditionally, they will assist the Communications Director with drafting press releases, advisories, talking points, op-eds and other materials. Media list maintenance is an important part of this job.\n\nThis is not an entry-level position. Previous experience in press or relevant social media experience is required.\n\nSuccessful applicants will need to demonstrate their writing ability by completing an in person writing and editing test.",
    "responsibilities": [
      "Developing original social media content",
      "Designing graphics and web content",
      "Maintaining the office’s website",
      "Assisting the Communications Director with drafting press releases, advisories, talking points, op-eds and other materials",
      "Media list maintenance"
    ],
    "qualifications": [
      "Strong writing, editing, proofreading skills",
      "Proficient in photography, video recording and editing",
      "Detail-oriented",
      "News savvy",
      "Able to work in a fast-paced, demanding work setting",
      "A sense of humor and ability to be a team player",
      "Spanish language skills are a big plus",
      "Evening and weekend work will be expected"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter including salary requirements, and two writing samples to ResumeInbox5@mail.house.gov",
    "salary_info": null,
    "contact": "ResumeInbox5@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-131-20",
    "position_title": "Legislative Correspondent",
    "office": "Congressman Greg Pence",
    "location": "DC office",
    "posting_date": "2020-04-13",
    "description": "The Office of Congressman Greg Pence is seeking a Legislative Correspondent with an exceptional work ethic and strong writing skills to manage all aspects of constituent correspondence in the DC office.\n\nIdeal candidates will have knowledge of the legislative process, excellent writing and organizations skills, and attention to detail. Duties include but are not limited to processing constituent inquires, drafting correspondence, preparing weekly mail reports, and monitoring floor activity. Preliminary knowledge of IQ is preferred. This is not an entry level position. Indiana ties preferred.",
    "responsibilities": [
      "processing constituent inquires",
      "drafting correspondence",
      "preparing weekly mail reports",
      "monitoring floor activity"
    ],
    "qualifications": [
      "knowledge of the legislative process",
      "excellent writing and organizations skills",
      "attention to detail",
      "Preliminary knowledge of IQ is preferred",
      "Indiana ties preferred"
    ],
    "how_to_apply": "Qualified applicants should submit a resume and writing sample to gopresumesubmission@gmail.com",
    "salary_info": null,
    "contact": "gopresumesubmission@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-129-20",
    "position_title": "Legislative Assistant",
    "office": "Congressman Jim Baird",
    "location": "Washington, D.C.",
    "posting_date": "2020-04-13",
    "description": "Office of Congressman Jim Baird seeks an experienced Legislative Assistant. The ideal candidate will have 3-5 years of experience, with 2-3 years of Hill experience. This role requires strong writing, research and organizational skills.\n\nThis is not an entry level position. Qualified candidates should include their resume and professional references.",
    "responsibilities": [
      "develop and plan legislative initiatives",
      "monitor legislative developments within Committees and on the House floor",
      "write Floor speeches for the Member",
      "draft constituent correspondence",
      "meet with constituents and special interest groups on behalf of the Member"
    ],
    "qualifications": [
      "3-5 years of experience",
      "2-3 years of Hill experience",
      "strong writing skills",
      "strong research skills",
      "strong organizational skills"
    ],
    "how_to_apply": "Please send applications to ResumeIN@mail.house.gov with the subject “LA – Rep. Baird”",
    "salary_info": null,
    "contact": "ResumeIN@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-122-20",
    "position_title": "Press Assistant",
    "office": "Southern California Democrat",
    "location": "Washington, DC",
    "posting_date": "2020-04-13",
    "description": "This individual reports to the Communications Director and will be responsible for creating content for social media platforms, recording and editing video, and updating website.\n\nIn addition, the staff member will produce daily clips, draft press releases, assist with responding to press inquiries, compile and update press lists.\n\nThe ideal candidate is energetic, detail-oriented, able to multi-task, and willing to work long hours in a fast-paced and demanding setting. Spanish fluency and Southern California ties are a plus.",
    "responsibilities": [
      "Creating content for social media platforms",
      "Recording and editing video",
      "Updating website",
      "Produce daily clips",
      "Draft press releases",
      "Assist with responding to press inquiries",
      "Compile and update press lists"
    ],
    "qualifications": [
      "Creative and strong writers who understand social media trends",
      "Experience with photography, graphic creation, and video editing",
      "Previous digital communications experience on Capitol Hill, a campaign, or at a communications firm is strongly preferred"
    ],
    "how_to_apply": "Interested applicants should email a cover letter, resume, a writing sample, and two examples of graphics or other digital communications work to CA26Resumes@gmail.com with “Press Assistant” in the subject line.\nNo phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "CA26Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-112-20",
    "position_title": "Legislative Counsel",
    "office": "Office of Rep. Justin Amash (I-MI)",
    "location": "Washington, DC",
    "posting_date": "2020-04-13",
    "description": "The Office of Rep. Justin Amash (I-MI) is seeking a bright, creative, and selfmotivated legislative counsel to join our Washington, DC-based policy team.\n\nThe legislative counsel will draft legislation, analyze bills, and meet with constituents concerning policy matters, among other duties. The person will be expected to handle a diverse portfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the tradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America. An individual who prefers staid and steady work or who avoids challenges (and the occasional failure) may be more comfortable elsewhere.\n",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters",
      "Handle a diverse portfolio of policy issues"
    ],
    "qualifications": [
      "JD or equivalent",
      "Two years of relevant policy experience is preferred, although Hill experience is not required"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to applydc@amash.com. Please include \"legislative counsel applicant\" in the subject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-512-19",
    "position_title": "Legislative Assistant",
    "office": "Southern Republican",
    "location": "Hill",
    "posting_date": "2020-04-13",
    "description": "Southern Republican seeks an experienced and enthusiastic Legislative Assistant to cover their work on Homeland Security Committee issues, among others.\n\nThis is not an entry level position.",
    "responsibilities": [
      "Drafting legislation",
      "Writing hearing statements and legislative memos",
      "Preparing briefing materials"
    ],
    "qualifications": [
      "3-5 years of experience, ideally 2-3 on the Hill",
      "Solid grasp of House procedures",
      "Deep understanding of relevant policy",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment"
    ],
    "how_to_apply": "Qualified candidates should include in their application a resume and professional references. Please send applications to congressionaljobs2805@gmail.com with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "congressionaljobs2805@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-428-19",
    "position_title": "Senior Staff",
    "office": "California",
    "location": null,
    "posting_date": "2020-04-13",
    "description": "Qualified candidates should have a minimum of 2 years' experience\nmanaging a team, possess excellent oral and written communications skills,\nhighly organized, meet deadlines, and manage multiple projects.\nA flexible schedule and ability to travel throughout the district is required.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample\nto cademhouseoffice@gmail.com please include Senior Staff in the subject\nline.",
    "salary_info": "Commensurate with experience",
    "contact": "cademhouseoffice@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  }
]