[
  {
    "id": "MEM-207-14",
    "position_title": "Staff Assistant",
    "office": "Office of Congressman Xavier Becerra",
    "location": "Los Angeles, CA",
    "posting_date": "2014-06-23",
    "description": "As the primary administrative staff member in the District Office, Staff Assistant duties include (but are not limited to): answer phones; handle mail and faxes; greet and direct visitors; maintain order & efficiency of front and back offices; order supplies; organize office files; coordinate with the Capitol Office to arrange tour and flag requests; coordinate vendor service needs; research the status of some legislation; draft some correspondence; assist the District Director and all District Office staff with additional tasks, as needed.\n\nIn the absence of the District Scheduler, the staff assistant will serve as backup and help facilitate any scheduling requests.\n\nCasework duties include (but are not limited to): Assist constituents with their individual cases pertaining to federal agencies. Help constituents to obtain timely consideration and cut through red tape. As the “front-line” caseworker, help constituents with nonfederal questions to find appropriate resources.",
    "responsibilities": [
      "Answer phones",
      "Handle mail and faxes",
      "Greet and direct visitors",
      "Maintain order & efficiency of front and back offices",
      "Order supplies",
      "Organize office files",
      "Coordinate with the Capitol Office to arrange tour and flag requests",
      "Coordinate vendor service needs",
      "Research the status of some legislation",
      "Draft some correspondence",
      "Assist the District Director and all District Office staff with additional tasks, as needed",
      "Serve as backup to District Scheduler and help facilitate scheduling requests",
      "Assist constituents with their individual cases pertaining to federal agencies",
      "Help constituents to obtain timely consideration and cut through red tape",
      "Help constituents with nonfederal questions to find appropriate resources"
    ],
    "qualifications": [
      "Prefer some experience working directly with the community.",
      "Solid interpersonal, writing and organizational skills are essential.",
      "The successful applicant will be a team player, have a positive attitude and the ability to work and set priorities in a fast-paced environment.",
      "Spanish language skills considered a plus."
    ],
    "how_to_apply": "Please fax or email cover letter and resume to:\nOffice of Congressman Xavier Becerra\n350 S. Bixel Street, Suite 100\nLos Angeles, CA 90017\nFax: (213) 481-1427\nEmail: Resume.California@mail.house.gov",
    "salary_info": null,
    "contact": {
      "fax": "(213) 481-1427",
      "email": "Resume.California@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-196-14",
    "position_title": "Senior Legislative Assistant",
    "office": "Texas Democrat",
    "location": "Hill",
    "posting_date": "2014-06-23",
    "description": "Texas Democrat seeks a hard-working and experienced legislative staffer to handle the healthcare and energy portfolio, along with other legislative areas. A bachelor’s degree with at least 4 years of legislative experience on the Hill is required. Potential candidates should have excellent writing and verbal skills coupled with some knowledge of social media. The ideal candidate will have experience working under pressure, working as part of a team, a sense of humor and the ability to work flexible hours. Experience with iConstituent is a plus, but not required.",
    "responsibilities": [
      "Handle the healthcare and energy portfolio",
      "Handle other legislative areas"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "At least 4 years of legislative experience on the Hill",
      "Excellent writing and verbal skills",
      "Knowledge of social media",
      "Experience working under pressure",
      "Experience working as part of a team",
      "Sense of humor",
      "Ability to work flexible hours",
      "Experience with iConstituent is a plus, but not required"
    ],
    "how_to_apply": "Please send cover letter, resume and a writing sample to TXResumeInbox@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "TXResumeInbox@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-194-14",
    "position_title": "Staff Assistant",
    "office": "Southern conservative Republican",
    "location": "Washington",
    "posting_date": "2014-06-23",
    "description": "Southern conservative Republican seeks a Staff Assistant to handle a wide range of office responsibilities and constituent services in the Washington office. Because the Member places a special emphasis on constituent services, candidates must be able to maintain a courteous and respectful demeanor at all times and possess a true desire to help constituents. Competitive candidates will be confident and well-spoken, have excellent oral and written communication skills, possess an acute attention to detail, demonstrate an assertive and organized approach to problem solving, and exhibit an ability to multi-task in a fast paced work environment. Though duties are largely administrative in nature, the Staff Assistant should have a personal interest in current events and Congressional activities, and should be fully engaged in all aspects of the day-to-day operations of the office. Additionally, the daily work hours for this position are 8:30 a.m. to 5:30 p.m. Completion of a four-year college education is required. Prior work experience is preferred. Southern ties are a significant plus.",
    "responsibilities": [
      "answering the main telephone line for the office",
      "processing flag requests",
      "arranging tours of the Capitol",
      "preparing the office for daily activities",
      "drafting personal notes and letters of commendation to constituents",
      "Other responsibilities may be assigned."
    ],
    "qualifications": [
      "be confident and well-spoken",
      "have excellent oral and written communication skills",
      "possess an acute attention to detail",
      "demonstrate an assertive and organized approach to problem solving",
      "exhibit an ability to multi-task in a fast paced work environment",
      "Completion of a four-year college education is required.",
      "Prior work experience is preferred.",
      "Southern ties are a significant plus."
    ],
    "how_to_apply": "Interested individuals should send a resume, cover letter, and two writing samples to congressjob@gmail.com.",
    "salary_info": null,
    "contact": "congressjob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-190-14",
    "position_title": "Communications Director",
    "office": "Senior Democrat",
    "location": "D.C.",
    "posting_date": "2014-06-23",
    "description": "Senior Democrat seeks a communications director experienced in all aspects of public relations and social media, who is also organized, energetic and creative to be based in D.C. congressional office to handle all communications strategy and media operations for an unusually busy office. This is a very fast-paced office where the communications director writes press releases; help the member with social media; pitches stories; responds to reporters’ inquiries; oversees website content; develops and maintains relationships with local and national media; organizes media events; and produces newsletters and e-newsletters. Occasional help on press releases is sometimes available from legislative staff. Excellent research, writing and social media skills are essential.\nCandidate must be able to handle multiple tasks and issues effectively while meeting deadlines. A successful candidate will develop and implement a communications plan, think outside the box and possess the political savvy needed to anticipate big news stories and to proactively promote the Member’s message. At least three years of prior media and/or Hill experience and demonstrated experience with both mainstream and new media outlets is preferred. This is NOT an entry level communications position. Candidate must be a DC resident or be willing to become a resident of the District of Columbia. Salary based on skill and experience level.",
    "responsibilities": [
      "Writes press releases",
      "Help the member with social media",
      "Pitches stories",
      "Responds to reporters’ inquiries",
      "Oversees website content",
      "Develops and maintains relationships with local and national media",
      "Organizes media events",
      "Produces newsletters and e-newsletters"
    ],
    "qualifications": [
      "Excellent research, writing and social media skills are essential.",
      "Candidate must be able to handle multiple tasks and issues effectively while meeting deadlines.",
      "A successful candidate will develop and implement a communications plan, think outside the box and possess the political savvy needed to anticipate big news stories and to proactively promote the Member’s message.",
      "At least three years of prior media and/or Hill experience and demonstrated experience with both mainstream and new media outlets is preferred.",
      "This is NOT an entry level communications position.",
      "Candidate must be a DC resident or be willing to become a resident of the District of Columbia."
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, references and two writing samples to(202) 225-1129 (fax) or DC00.NortonResume@mail.house.gov . NO PHONE CALLS, PLEASE! If you have questions, please email them to dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-189-14",
    "position_title": "Scheduler",
    "office": "Republican seeking Scheduler for Capitol Hill office",
    "location": "Capitol Hill",
    "posting_date": "2014-06-23",
    "description": "Candidate must have experience on the Hill or in private sector, be highly organized; possesses strong people skills with exceptional attention to detail and be comfortable working in a demanding and fast paced environment. Responsibilities include but not limited to: process all scheduling requests, invitations and events for Member’s calendar; respond to all invitations by written email correspondence or by personal telephone call; maintain office contact lists; make travel arrangements; handle Member correspondence; ensure the Member is provided with briefing materials for each event by coordinating with event participants and the appropriate legislative and/or district staff; and assist with other duties as assigned.",
    "responsibilities": [
      "Process all scheduling requests, invitations and events for Member’s calendar",
      "Respond to all invitations by written email correspondence or by personal telephone call",
      "Maintain office contact lists",
      "Make travel arrangements",
      "Handle Member correspondence",
      "Ensure the Member is provided with briefing materials for each event by coordinating with event participants and the appropriate legislative and/or district staff",
      "Assist with other duties as assigned"
    ],
    "qualifications": [
      "Experience on the Hill or in private sector",
      "Highly organized",
      "Strong people skills with exceptional attention to detail",
      "Comfortable working in a demanding and fast paced environment"
    ],
    "how_to_apply": "Email resume and cover letter to with “Scheduler” in the subject line to PA.Resumes@mail.house.gov.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "PA.Resumes@mail.house.gov",
    "equal_opportunity": null
  }
]