[
  {
    "id": "MEM-043-19",
    "position_title": "Staff Assistant",
    "office": "Veterans Committee Majority",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. House of Representatives Committee on Veterans’ Affairs seeks a Staff Assistant to handle administrative tasks, event coordination, workflow tracking, constituent communication, research, and other tasks as needed. A qualified candidate has a Bachelors’ degree, Hill or political experience, and knowledge of military and veterans issues. He or she should be extremely organized, hardworking, creative and willing to handle any task necessary get the job done. Perfect job for organized, self-starter looking to work in a fast-paced environment and gain Hill experience.",
    "responsibilities": [
      "handle administrative tasks",
      "event coordination",
      "workflow tracking",
      "constituent communication",
      "research",
      "other tasks as needed"
    ],
    "qualifications": [
      "Bachelors’ degree",
      "Hill or political experience",
      "knowledge of military and veterans issues",
      "extremely organized",
      "hardworking",
      "creative",
      "willing to handle any task necessary get the job done"
    ],
    "how_to_apply": "Please submit cover letter and resume to hvactransition@gmail.com with Staff Assistant in the subject line.",
    "salary_info": null,
    "contact": "hvactransition@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages women, minorities, and LGBTQ candidates to apply. Veterans are also strongly encouraged to apply."
  },
  {
    "id": "MEM-042-19",
    "position_title": "Staff Assistant",
    "office": "Congressman Ed Case (HI-01)",
    "location": "DC",
    "posting_date": "2019-01-21",
    "description": "The Office of Congressman Ed Case (HI-01) seeks a hardworking and detailed-oriented Staff Assistant in DC. Responsibilities include answering the phone, greeting visitors, leading tours, processing flag requests, and handling other administrative tasks as assigned. Applicants will also perform some legislative-related work, such as writing letters and evaluating bills for cosponsorship. Hawai'i ties and previous Hill experience strongly preferred.",
    "responsibilities": [
      "Answering the phone",
      "Greeting visitors",
      "Leading tours",
      "Processing flag requests",
      "Handling other administrative tasks as assigned"
    ],
    "qualifications": [
      "Hawai'i ties strongly preferred",
      "Previous Hill experience strongly preferred"
    ],
    "how_to_apply": "Please send a resume, cover letter, and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-039-19",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Sylvia R. Garcia",
    "location": "Hill",
    "posting_date": "2019-01-21",
    "description": "The Office of Congresswoman Sylvia R. Garcia seeks an experienced Communications Director to lead her media team. Ideal candidates will possess a strong network of press and Hill contacts, and will have experience creating dynamic communications strategies. Responsibilities include planning and managing all aspects of the Congresswoman’s digital media; writing press releases, op-eds, and talking points; pitching stories; developing messaging; and conveying complex issues to a broad audience.",
    "responsibilities": [
      "Planning and managing all aspects of the Congresswoman’s digital media",
      "Writing press releases, op-eds, and talking points",
      "Pitching stories",
      "Developing messaging",
      "Conveying complex issues to a broad audience"
    ],
    "qualifications": [
      "A qualified candidate will have a minimum of 4 years of experience in communications",
      "Hill or other political experience is strongly preferred",
      "Spanish language proficiency is required"
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter and resume to TX29SG.Resumes@mail.house.gov with “TX-29 Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "TX29SG.Resumes@mail.house.gov",
    "equal_opportunity": "Female, minority, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please."
  },
  {
    "id": "MEM-038-19",
    "position_title": "Legislative Aide",
    "office": "Texas Democrat",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "A Texas Democrat seeks a hardworking Legislative Aide to oversee the mail program and handle a small policy portfolio. Responsibilities include managing a high-volume mail program, researching legislative issues, and drafting timely responses. Ideal candidates will have excellent research and writing skills, and the ability to work under pressure and meet deadlines. Women and minorities are encouraged to apply. Texas ties, knowledge of Fireside 21, and Spanish fluency are a plus, but not required.",
    "responsibilities": [
      "Managing a high-volume mail program",
      "Researching legislative issues",
      "Drafting timely responses"
    ],
    "qualifications": [
      "Excellent research and writing skills",
      "Ability to work under pressure and meet deadlines",
      "Texas ties, knowledge of Fireside 21, and Spanish fluency are a plus, but not required."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to TX16Resumes@gmail.com and write “Legislative Aide” in the subject line. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "TX16Resumes@gmail.com",
    "equal_opportunity": "Women and minorities are encouraged to apply."
  },
  {
    "id": "MEM-037-19",
    "position_title": "Communications Director",
    "office": "Midwestern Democratic Representative",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-21",
    "description": "This position will manage all communications and social media functions of the office, including developing communications plans, maintaining relationships with both national and district media, responding to daily media inquiries, and preparing written materials, including speeches, talking points, newsletters, op-eds, and direct mail. Knowledge of Congressional process and public policy is highly desirable. This is not an entry-level position.",
    "responsibilities": [
      "Developing communications plans",
      "Maintaining relationships with both national and district media",
      "Responding to daily media inquiries",
      "Preparing written materials, including speeches, talking points, newsletters, op-eds, and direct mail"
    ],
    "qualifications": [
      "At least three years of experience on the Hill or in an aggressive, proactive media environment",
      "Extensive on-the-record experience",
      "Creativity with the full range of social media platforms",
      "Ability to handle multiple projects simultaneously",
      "Excellent oral and written communications skills",
      "Knowledge of Congressional process and public policy is highly desirable"
    ],
    "how_to_apply": "Please submit resume and two writing samples to press.resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "press.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-036-19",
    "position_title": "Senior Legislative Assistant or Legislative Director",
    "office": "Democrat",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "Democrat seeks Senior Legislative Assistant or Legislative Director depending on qualifications to handle financial services, tax, economic issues, and other domestic policy issues. Candidate must have substantial Congressional experience and understand the legislative process. A successful applicant will possess strong writing and verbal communication skills, work well with others, and be comfortable in a fast-paced environment.",
    "responsibilities": [],
    "qualifications": [
      "Substantial Congressional experience",
      "Understand the legislative process",
      "Strong writing and verbal communication skills",
      "Ability to work well with others",
      "Comfortable in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please e-mail a resume and cover letter to financeservicesla@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "financeservicesla@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-035-19",
    "position_title": "Communications Director",
    "office": "PA House Republican member",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "PA House Republican member seeks a ro-active, experienced communications director to implement strategic media plan in a fast-paced and results-driven environment. Successful candidates will be comfortable multi-tasking and managing deadlines. Must have proven track-record, and ability to manage website, social media platforms, and experience managing a robust constituent outreach program. Outstanding writing skills and strong managerial skills are required. This is not an entry level position.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit resume and cover letter to pa01communication@gmail.com",
    "salary_info": null,
    "contact": "pa01communication@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-029-19",
    "position_title": "Legislative Director",
    "office": "Northeast Democrat",
    "location": "Hill",
    "posting_date": "2019-01-21",
    "description": "Northeast Democrat seeks enthusiastic Legislative Director to coordinate and oversee the Member’s legislative agenda, along with advising the Member on legislative activities and leading legislative staff. This is not an entry-level position. An ideal candidate will have at least 3 years of legislative experience on the Hill. Successful applicants must have a demonstrated ability to manage and mentor staff, think strategically, and have experience in formulating strategic plans for advancing legislation.",
    "responsibilities": [
      "Coordinate and oversee the Member’s legislative agenda",
      "Advise the Member on legislative activities",
      "Lead legislative staff"
    ],
    "qualifications": [
      "At least 3 years of legislative experience on the Hill",
      "Demonstrated ability to manage and mentor staff",
      "Ability to think strategically",
      "Experience in formulating strategic plans for advancing legislation",
      "Expert knowledge of House legislative processes and procedures",
      "Excellent organization and communication skills",
      "Ability to work under pressure and meet deadlines",
      "New Jersey ties are a plus but not required"
    ],
    "how_to_apply": "Interested parties should e-mail a cover letter and resume to NJ10resumes@gmail.com with the following subject line: First name Last Name - Legislative Director.",
    "salary_info": null,
    "contact": "NJ10resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-027-19",
    "position_title": "SENIOR LEGISLATIVE ASSISTANT",
    "office": "House Committee on Transportation & Infrastructure",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "Senior Member on the House Committee on Transportation & Infrastructure is seeking qualified candidates to staff the Member’s committee assignment in addition to managing a diverse legislative issue portfolio. Candidates should be accomplished at drafting, advancing, and analyzing legislation, monitoring legislative developments, conducting research, and drafting vote recommendations. Ideal candidates will have strong organizational and time management skills, excellent written and verbal communication skills, and a positive attitude.\n\nParamount is a solid knowledge of the legislative process as well as an ability to work under pressure and meet deadlines in an unpredictable work environment, all while keeping a sense of humor. This is not an entry-level legislative position. 2-3 years of Hill experience strongly preferred. MidSouth ties are a plus but not required. Women and minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "Drafting legislation",
      "Advancing legislation",
      "Analyzing legislation",
      "Monitoring legislative developments",
      "Conducting research",
      "Drafting vote recommendations"
    ],
    "qualifications": [
      "Strong organizational and time management skills",
      "Excellent written and verbal communication skills",
      "Positive attitude",
      "Solid knowledge of the legislative process",
      "Ability to work under pressure and meet deadlines",
      "2-3 years of Hill experience strongly preferred",
      "MidSouth ties are a plus but not required"
    ],
    "how_to_apply": "Interested individuals should e-mail a resume and 2 recent writing samples (no longer than 2 pages each) to tn09jobs18@mail.house.gov with the following subject line: [First name] [Last Name] – Senior Legislative Assistant. Please be aware this office has a dog. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "tn09jobs18@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-025-19",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-01-21",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee's investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:",
      "Government ethics",
      "Criminal law",
      "Employment law, including the laws governing sexual harassment in the workplace",
      "Civil litigation",
      "Administrative investigations and adjudications",
      "Depositions",
      "Financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-19",
    "position_title": "Communications Director",
    "office": "Democratic House member from California",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "Democratic House member from California seeks pro-active, experienced communications director to develop and implement strategic media plan in a fast-paced and results -driven environment.",
    "responsibilities": [],
    "qualifications": [
      "Must have proven track-record",
      "Ability to manage website and social media tools",
      "Outstanding writing skills",
      "Strong pitching skills",
      "This is not an entry level position."
    ],
    "how_to_apply": "Qualified candidates should submit resume and cover letter to commstaffer@gmail.com.",
    "salary_info": null,
    "contact": "commstaffer@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-022-19",
    "position_title": "Digital Specialist",
    "office": "New England Democrat",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "New England Democrat seeks a motivated and savvy Digital Specialist to\nsupport and contribute to the efforts of the communications team. The\nrequirements of this position include the production of high-quality web\ngraphics and videos, as well as filming, taking photos, and livestreaming\nevents. Candidates must possess strong technical skills, advanced creativity\nand artistic ability, a high level of attention to detail, and strong writing skills.\nApplicants should have experience with Adobe Photoshop, Premiere, and\nIllustrator. Experience executing paid social media campaigns a plus.",
    "responsibilities": [
      "developing creative graphics",
      "editing and creating custom videos",
      "photography",
      "assisting with traditional press, all under tight deadlines"
    ],
    "qualifications": [
      "strong technical skills",
      "advanced creativity and artistic ability",
      "a high level of attention to detail",
      "strong writing skills",
      "experience with Adobe Photoshop, Premiere, and Illustrator",
      "experience executing paid social media campaigns a plus"
    ],
    "how_to_apply": "Applicants should send cover letter, resume, and two writing samples to\nHill.jobs@mail.house.gov. No phone calls or drop-ins.",
    "salary_info": null,
    "contact": "Hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-020-19",
    "position_title": "Staff Assistant",
    "office": "U.S. Congress Joint Economic Committee",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nStaff Assistant to handle administrative tasks, event coordination, workflow\ntracking, research and other tasks as needed. He or she will work directly with\nthe Staff Director.\n\nPerfect job for organized, self-starter looking to work in a fastpaced environment and gain Hill experience.",
    "responsibilities": [
      "Handle administrative tasks",
      "Event coordination",
      "Workflow tracking",
      "Research",
      "Other tasks as needed"
    ],
    "qualifications": [
      "A qualified candidate has a bachelors’ degree and Hill experience or knowledge of American politics.",
      "He or she should be extremely organized, hardworking, creative and willing to handle any task necessary get the job done.",
      "A degree in economics, political science or a related field is helpful but not required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to\nsenate_employment@saa.senate.gov indicating the job title and referral\nnumber 224743 in the subject line. All application materials must be\nsubmitted by 5:00 pm EST on February 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-019-19",
    "position_title": "Senior Policy Analyst",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nSenior Policy Analyst to research and write reports, policy memos and other\nmaterials; prepare briefing documents for Congressional hearings; monitor\neconomic indicators; conduct quantitative analyses; and oversee the work of\nmid-level policy staff.",
    "responsibilities": [
      "Research and write reports, policy memos and other materials",
      "Prepare briefing documents for Congressional hearings",
      "Monitor economic indicators",
      "Conduct quantitative analyses",
      "Oversee the work of mid-level policy staff"
    ],
    "qualifications": [
      "A qualified candidate has a master’s degree in economics, or an MPP degree.",
      "Excellent quantitative and analytical skills",
      "Be able to convey complex information to a non-expert audience",
      "Write clearly and to give careful feedback on others’ writing.",
      "Proficiency with Haver and working with government databases including Current Population Survey (CPS) and Current Employment Statistics (CES).",
      "Applicants should have two+ years in experience in government, think tank or academic research.",
      "Experience with the following issues are a plus: trade, climate change, health care, family workplace policies, immigration, consumer protection, automation, outsourcing, inequality, taxation, federal debt or other topics that relate to current issues in economics.",
      "Hill experience is preferred but not required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three writing\nsamples to senate_employment@saa.senate.gov indicating the job title and\nreferral number 224744 in the subject line. All application materials must be\nsubmitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, genetic information, national\norigin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-018-19",
    "position_title": "Press Assistant",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nPress Assistant to work as part of a three-person communications team.",
    "responsibilities": [
      "monitoring media coverage",
      "compiling press clips",
      "maintaining press lists",
      "drafting press releases",
      "organizing press events",
      "assisting with social media"
    ],
    "qualifications": [
      "bachelor's degree in economics, journalism, English, political science or a related field",
      "a proven ability to write well",
      "experience with social media",
      "excellent attention to detail and accuracy",
      "strong research skills",
      "Hill experience preferred but not required",
      "Basic graphics or video experience a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224746 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-017-19",
    "position_title": "Communications Director",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic Staff of the U.S. Congress Joint Economic Committee seeks a Communications Director to design and implement an aggressive and creative communications strategy in a challenging media environment.",
    "responsibilities": [
      "developing strong relationships with reporters",
      "pitching stories",
      "developing messaging",
      "writing press releases, speeches, opeds and other documents",
      "planning and reviewing documents by policy staff",
      "preparing the Vice Chair for interviews",
      "building relationships with the communication staffs of other committees and offices",
      "managing a Digital Media Associate and a Press Assistant"
    ],
    "qualifications": [
      "a minimum of five years of experience in communications",
      "an ability to think creatively about strategy and to find opportunities where others don’t see them",
      "demonstrated ability to convey complex information to a wide audience",
      "excellent writing and editing skills",
      "professional experience or coursework in economic or related issues",
      "social media experience",
      "the ability to manage a team",
      "Hill or other political experience is strongly preferred by not required",
      "Knowledge of economic issues is a plus"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and 3-5 writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224751 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-016-19",
    "position_title": "Digital Media Manager",
    "office": "U.S. Congress Joint Economic Committee",
    "location": "Washington, D.C.",
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a Digital Media Manager to work as part of a three-person communications team. Responsibilities include helping to create an innovative social media strategy; writing, posting and monitoring social media content; reaching out to social media staff at other organizations; and substantially increasing the number and quality of followers.",
    "responsibilities": [
      "Helping to create an innovative social media strategy",
      "Writing, posting and monitoring social media content",
      "Reaching out to social media staff at other organizations",
      "Substantially increasing the number and quality of followers"
    ],
    "qualifications": [
      "Bachelor’s degree",
      "A minimum of two years working as a social media professional",
      "Proven ability to write social media content",
      "Excellent attention to detail and accuracy",
      "Strong research skills",
      "Hill experience preferred but not required.",
      "Basic graphics or video experience a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and a substantial selection of tweets and Facebook posts (in a Word or PDF document) to senate_employment@saa.senate.gov indicating the job title and referral number 224750 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-015-19",
    "position_title": "Research Assistant",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nResearch Assistant to help policy staff research, write and fact-check reports,\npolicy briefs, hearing memos, charts and other documents.",
    "responsibilities": [],
    "qualifications": [
      "A qualified candidate has a bachelor’s or master’s degree in economics, political science or a related degree.",
      "He or she should have excellent analytical skills;",
      "An ability to process and simplify complex issues;",
      "Meticulous attention to detail",
      "An ability to handle multiple projects simultaneously.",
      "Hill experience is preferred but not required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and two writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224745 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11th.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-014-19",
    "position_title": "Editor",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic Staff of the U.S. Congress Joint Economic Committee seeks\nan Editor to write, edit and frame Committee materials. Editor will play key\nrole in shaping Committee reports, releases, speeches, op-eds and other\ndocuments.",
    "responsibilities": [],
    "qualifications": [
      "A qualified candidate has a minimum of five years of experience in\njournalism or communications",
      "excellent writing and editing skills",
      "an ability to work on multiple projects simultaneously",
      "demonstrated ability to convey complex information to a wide audience",
      "mastery of grammar, punctuation and style",
      "professional experience or strong interest in economic issues",
      "The ideal candidate will have worked in news environment as a\nreporter/editor, or as an editor at a think tank."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and 3-5 writing\nsamples to senate_employment@saa.senate.gov indicating the job title and\nreferral number 224748 in the subject line. All application materials must be\nsubmitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the\nbasis of race, sex, color, age, religion, disability, genetic information, national\norigin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-013-19",
    "position_title": "Economist",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks\nan Economist to research and write reports, policy memos and other\nmaterials; participate in long-term planning of hearings and reports; prepare\nbriefing documents for Congressional hearings; monitor economic indicators;\nconduct quantitative analyses; and oversee the work of mid-level policy staff.",
    "responsibilities": [
      "Research and write reports, policy memos and other materials",
      "Participate in long-term planning of hearings and reports",
      "Prepare briefing documents for Congressional hearings",
      "Monitor economic indicators",
      "Conduct quantitative analyses",
      "Oversee the work of mid-level policy staff"
    ],
    "qualifications": [
      "Ph.D. or master’s degree in economics, or an MPP degree and excellent quantitative and analytical skills.",
      "Ability to write clearly and to give careful feedback on others’ writing",
      "Ability to convey complex information to a non-expert audience",
      "Proficiency in STATA, EViews, Matlab, or R, as well as solid experience with Haver and government databases including the Current Population Survey (CPS) and Current Employment Statistics (CES).",
      "Two+ years of experience in government, think tank or academic research.",
      "Experience with the following issues are a plus: trade, climate change, health care, family workplace policies, immigration, consumer protection, automation, outsourcing, inequality, taxation, federal debt or other topics that relate to current issues in economics.",
      "Hill experience is preferred but not required."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224749 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-012-19",
    "position_title": "Policy Analyst",
    "office": "U.S. Congress Joint Economic Committee",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Democratic staff of the U.S. Congress Joint Economic Committee seeks a\nPolicy Analyst to help researching and writing reports; drafting policy\nmemos and other documents; preparing for hearings; and fact checking. He or\nshe will report to the senior policy staff and will work closely with the\ncommunications team.",
    "responsibilities": [
      "researching and writing reports",
      "drafting policy memos and other documents",
      "preparing for hearings",
      "fact checking"
    ],
    "qualifications": [
      "A qualified candidate has at least a bachelors’ degree in economics, political science or a related degree; a master’s degree, especially an MPP, is preferred.",
      "He or she should have excellent quantitative and analytical skills",
      "the ability to write clearly",
      "an ability to convey complex information to a non-expert audience.",
      "Hill experience preferred but not required.",
      "Experience with Haver and working with government databases including Current Population Survey (CPS) and Current Employment Statistics (CES) are a plus.",
      "Two to five years of work experience is expected."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three writing samples to senate_employment@saa.senate.gov indicating the job title and referral number 224747 in the subject line. All application materials must be submitted by 5:00 pm EST on January 11.",
    "salary_info": null,
    "contact": "senate_employment@saa.senate.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, genetic information, national origin, uniformed service, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-011-19",
    "position_title": "District Director",
    "office": "Congresswoman Diana DeGette",
    "location": "Denver office",
    "posting_date": "2019-01-21",
    "description": "The District Director manages all aspects of district office operations including community outreach, casework, and staff oversight and represents the Congresswoman at events and meetings throughout the community.",
    "responsibilities": [
      "Manages district office staff; including planning, assigning and directing work. addressing complaints; and resolving problems.",
      "Manages district office budget and finances.",
      "Manages the Congresswoman’s schedule in coordination with the district scheduler.",
      "Manages staff outreach to the local community with the assistance of the outreach coordinator.",
      "Oversees the management of constituent casework with the Deputy District Director coordinator.",
      "Ensures clear communication with the DC office and regular reporting of district office activities to the Congresswoman.",
      "Coordinates closely with DC staff to develop and implement the overall strategic plan for the Congresswoman’s staff.",
      "Initiates and maintains key relationships with elected and non-elected leaders in the congressional district.",
      "Develops a keen understanding of the local political climate and the needs and concerns of all the constituencies within the congressional district.",
      "Actively promotes the Congresswoman’s legislative goals and accomplishments in the local community.",
      "Maintains direct outreach connections with specific constituencies as assigned based on experience and the needs of the office.",
      "Represents the Congresswoman and/or assigns appropriate staff to do so in meetings and at events with elected officials and local groups in the district.",
      "Works a flexible schedule including long hours, nights and weekends.",
      "Assists constituents as needed.",
      "Performs other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should send a resume and cover letter to degettedistrictdirectorsearch@gmail.com.",
    "salary_info": null,
    "contact": "degettedistrictdirectorsearch@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-009-19",
    "position_title": "Clerk",
    "office": "House Committee on Science, Space, and Technology",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "Democratic Chair-elect of the House Committee on Science, Space, and Technology seeks to fill a Clerk opening on the Full Committee staff. Duties include assisting with the preparation and conduct of markups, assisting with hearing preparation, maintaining and archiving Committee records, assisting with the printing of Committee documents, and executing other administrative duties as needed.",
    "responsibilities": [
      "Assisting with the preparation and conduct of markups",
      "Assisting with hearing preparation",
      "Maintaining and archiving Committee records",
      "Assisting with the printing of Committee documents",
      "Executing other administrative duties as needed"
    ],
    "qualifications": [
      "Strong organizational and communication skills",
      "The ability to work under tight deadlines",
      "Be able to multi-task effectively",
      "Hill experience is required",
      "Previous clerking experience is strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-19",
    "position_title": "Press Secretary",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "Rep. Elijah E. Cummings is seeking a detail-oriented communications\nprofessional to join the staff of the Committee on Oversight and Government\nReform as Press Secretary. The ideal candidate should be a strong writer, a\nproactive team player, have experience with rapid responses, and be able to\nmulti-task in a fast-paced environment. This position reports directly to the\nCommunications Director.",
    "responsibilities": [
      "Develop day-to-day press materials, including press releases, talking points,\nstatements, and media advisories.",
      "Field and respond to media inquiries.",
      "Seek to correct inaccurate reporting.",
      "Strategize with the Communications Director on interview requests.",
      "Staff the congressman at interviews and press events.",
      "Physically manage the press at Committee hearings.",
      "Work closely with member relations Committee staff to achieve goals for\nCommittee Members.",
      "Liaison with committee member and other congressional offices.",
      "Organize press conferences.",
      "Assist with overall communications strategy.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "A Bachelor’s degree in Journalism, English, Public Relations, or a closely\nrelated field preferred.",
      "A minimum of four years of media relations and/or social media\ncoordination experience.",
      "Experience with rapid responses.",
      "A strong ability to perform multiple tasks accurately and efficiently in a fastpaced environment.",
      "Previous campaign experience a plus.",
      "Previous Hill experience a plus."
    ],
    "how_to_apply": "Submit a cover letter and resume to oversightpress@mail.house.gov with\n“Press Secretary Application” in the subject line. Applications will be\naccepted until January 18. Please no drop-by applications, phone calls, or\nseparate emails.",
    "salary_info": null,
    "contact": "oversightpress@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-006-19",
    "position_title": "Senior Health LA",
    "office": "U.S. Rep. Lloyd Doggett (D)",
    "location": "Washington office",
    "posting_date": "2019-01-21",
    "description": "Not an entry level job. Law degree a plus.",
    "responsibilities": [],
    "qualifications": [
      "Law degree a plus"
    ],
    "how_to_apply": "Email cover letter, resume, and three references to: DoggettJobs@mail.house.gov. (No calls or drop-ins please) Reply with subject line, Senior Health LA.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-005-19",
    "position_title": "Scheduler",
    "office": "Senior California Democrat",
    "location": "Washington, DC",
    "posting_date": "2019-01-21",
    "description": "Senior California Democrat seeks a motivated, energetic, and detail-oriented Scheduler for the Washington, DC office. Responsibilities include coordinating and maintaining the Member’s schedule, drafting personal correspondence, and occasionally driving the member.",
    "responsibilities": [
      "coordinating and maintaining the Member’s schedule",
      "drafting personal correspondence",
      "occasionally driving the member"
    ],
    "qualifications": [
      "personable",
      "dependable",
      "able to juggle multiple tasks with competing priorities",
      "California ties preferred",
      "Sense of humor required"
    ],
    "how_to_apply": "To apply, please submit resume, cover letter, and a short writing sample to CADemOfficeJob@gmail.com",
    "salary_info": null,
    "contact": "CADemOfficeJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-513-18",
    "position_title": "Scheduler",
    "office": "Office of Congresswoman-Elect Veronica Escobar (TX-16)",
    "location": "Capitol Hill",
    "posting_date": "2019-01-21",
    "description": "The Office of Congresswoman-Elect Veronica Escobar (TX-16) seeks a\nScheduler to begin in the new year. This individual will be responsible for\nmaintaining the Member-Elect's official schedule, travel plans, personal\nschedule, along with coordinating press interviews, radio and television time\nwith the Press Secretary; legislative briefings and hearings with the\nLegislative team and other tasks as assigned. This position will also be in\ncharge of coordinating with the district director all district visits. This is NOT\nAN ENTRY LEVEL position.",
    "responsibilities": [
      "Maintaining the Member-Elect's official schedule, travel plans, personal schedule",
      "Coordinating press interviews, radio and television time with the Press Secretary",
      "Coordinating legislative briefings and hearings with the Legislative team",
      "Other tasks as assigned",
      "Coordinating with the district director all district visits"
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Previous scheduling and administrative experience (one year in a similar position) is required.",
      "Texas, southwest ties and Spanish language proficiency a plus."
    ],
    "how_to_apply": "Please email resume, writing sample and\ncover letter to tx16resumes@gmail.com with the subject line SCHEDULER\nAPPLICATION.",
    "salary_info": null,
    "contact": "tx16resumes@gmail.com",
    "equal_opportunity": "Women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-512-18",
    "position_title": "Staff Assistant",
    "office": "Office of Congresswoman-Elect Veronica Escobar (TX-16)",
    "location": "Washington, DC",
    "posting_date": "2019-01-21",
    "description": "The Office of Congresswoman-Elect Veronica Escobar (TX-16) seeks a Staff Assistant to start in the new year and join an active office in Washington, DC. Responsibilities will include managing front desk operations, answering phones, sorting mail, coordinating tours, supervising interns, greeting visitors, processing flag requests and other duties as assigned.\n\nThis is an entry-level position and prior Hill internship preferred. Successful candidates will be able to adapt to a startup environment and work under tight deadlines. Texas, southwest ties and Spanish language proficiency a plus, women and minority candidates are encouraged to apply.",
    "responsibilities": [
      "Managing front desk operations",
      "Answering phones",
      "Sorting mail",
      "Coordinating tours",
      "Supervising interns",
      "Greeting visitors",
      "Processing flag requests",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Entry-level position",
      "Prior Hill internship preferred",
      "Successful candidates will be able to adapt to a startup environment and work under tight deadlines.",
      "Texas, southwest ties and Spanish language proficiency a plus"
    ],
    "how_to_apply": "Please email resume, writing sample and cover letter to tx16resumes@gmail.com with the subject line STAFF ASSISTANT APPLICATION.",
    "salary_info": null,
    "contact": "tx16resumes@gmail.com",
    "equal_opportunity": "women and minority candidates are encouraged to apply."
  },
  {
    "id": "MEM-511-18",
    "position_title": "Legislative Director",
    "office": "Progressive New York City Member",
    "location": "Capitol Hill",
    "posting_date": "2019-01-21",
    "description": "Progressive New York City Member seeks Legislative Director to oversee and support the Member’s legislative priorities. Responsibilities include providing the Member with vote recommendations, setting legislative priorities and managing staff to achieve them, planning dynamic events to raise awareness of the Member’s actions, writing talking points, liaising with community leaders, and spearheading legislative initiatives within their own portfolio. Ideal candidates will have a strong understanding of housing and immigration policy, an advanced degree, and 3-5 years of legislative experience on Capitol Hill. Strong written and verbal skills are essential as is the ability to work collaboratively in a fast-paced, dynamic environment. This is not an entry-level position and New York City ties are a plus.",
    "responsibilities": [
      "Providing the Member with vote recommendations",
      "Setting legislative priorities and managing staff to achieve them",
      "Planning dynamic events to raise awareness of the Member’s actions",
      "Writing talking points",
      "Liaising with community leaders",
      "Spearheading legislative initiatives within their own portfolio"
    ],
    "qualifications": [
      "Strong understanding of housing and immigration policy",
      "Advanced degree",
      "3-5 years of legislative experience on Capitol Hill",
      "Strong written and verbal skills",
      "Ability to work collaboratively in a fast-paced, dynamic environment",
      "New York City ties are a plus"
    ],
    "how_to_apply": "Interested parties should email a cover letter and resume to Kendall.Mitchell@mail.house.gov with “Legislative Director” in the subject line.",
    "salary_info": null,
    "contact": "Kendall.Mitchell@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-510-18",
    "position_title": "Digital Specialist and Press Aide",
    "office": "Rep. Ro Khanna",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "Rep. Ro Khanna, a very active leader of the Progressive Caucus, seeks a\nDigital Specialist and Press Aide to create original content in videos, social\nmedia and other messaging vehicles to expand the reach of the Member’s\nvision and priorities. This individual will work collaboratively with the\nCommunications Director in managing the Member’s social media channels\n(Facebook, Twitter and Instagram) and using the platforms to frequently share\ncontent and elevate the Member’s online presence.\n\nThe Digital Specialist and Press Aide will work the Communications Director\nto design and implement a robust communications/digital/social media plan.\nThis individual will be proficient in video/audio production, graphic design\nand editing. Audio and video clips of various topics and events attended by\nthe Member will be used to develop creative content for use within videos and\nonline communications distributed by the office.",
    "responsibilities": [],
    "qualifications": [
      "Successful candidates will possess at least two years of relevant video\nexperience in a legislative office, political organization or progressive\nadvocacy group",
      "proficiency in video filming, editing and graphic design\nsoftware",
      "knowledge of live-streaming platforms, digital trends and\ndevelopments in media",
      "strong organizational, time-management,\nproblem-solving and story-telling skills",
      "After hours and weekend\nresponsiveness will be required."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter,\ntwo writing samples, three graphic design samples and links to three samples\nof video work.",
    "salary_info": null,
    "contact": "RepRoKhannaCA17@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-504-18",
    "position_title": "Events Coordinator/Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District of Columbia",
    "posting_date": "2019-01-21",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible constituent services staff.\n\nThe Events Coordinator is also a caseworker who helps constituents with federal issues but spends a good part of the time managing and directing very diverse city-wide and neighborhood events that relate to the Congresswoman’s congressional and constituent responsibilities, including staying on top of everyday events in the Member’s district that keep the community connected to the Member’s work. The Events Coordinator takes the lead in our frequent Norton-In-Your Neighborhood meetings with constituents and in developing major events, among them, the Small Business Fair and Job Fair.\n\nCandidate must be able to handle multiple tasks. The office prizes staff able to think outside the box and work independently while also being available to assist in co-worker projects where necessary or requested. Prior community or event planning experience is desirable. The ideal candidate will have a bachelor’s degree, excellent writing and communication skills, experience interacting with the public and leadership qualities. Candidate must be a resident of the District of Columbia or willing to move immediately to DC if hired.",
    "responsibilities": [
      "Managing and directing very diverse city-wide and neighborhood events that relate to the Congresswoman’s congressional and constituent responsibilities",
      "Staying on top of everyday events in the Member’s district that keep the community connected to the Member’s work",
      "Taking the lead in Norton-In-Your Neighborhood meetings with constituents",
      "Developing major events, among them, the Small Business Fair and Job Fair"
    ],
    "qualifications": [
      "Ability to handle multiple tasks",
      "Able to think outside the box and work independently",
      "Available to assist in co-worker projects where necessary or requested",
      "Prior community or event planning experience is desirable",
      "Bachelor’s degree",
      "Excellent writing and communication skills",
      "Experience interacting with the public",
      "Leadership qualities",
      "Resident of the District of Columbia or willing to move immediately to DC if hired"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter and references to dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-456-18",
    "position_title": "Deputy Clerk",
    "office": "Committee on Education and the Workforce, Democratic Staff",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Committee on Education and the Workforce, Democratic Staff is currently seeking a Deputy Clerk to assist the Chief Clerk in the 116th Congress. Duties include, but are not limited to archiving and records keeping, notices and circulations, official filings, editing letters and reports, hearing, markup and conference logistics and proceeding, bill drops and floor logistics, redlines, updates to the website, managing intern and fellowship program, maintaining the documents room, updating and maintaining the Committee Calendar and all other duties as assigned. Candidates should possess exceptional organizational skills, be comfortable with public speaking, and have excellent writing and research skills. The Deputy clerk will be required to assume all clerking duties in the absence of the Chief Clerk. Previous congressional experience is highly encouraged.",
    "responsibilities": [
      "Archiving and records keeping",
      "Notices and circulations",
      "Official filings",
      "Editing letters and reports",
      "Hearing, markup and conference logistics and proceeding",
      "Bill drops and floor logistics",
      "Redlines",
      "Updates to the website",
      "Managing intern and fellowship program",
      "Maintaining the documents room",
      "Updating and maintaining the Committee Calendar",
      "All other duties as assigned"
    ],
    "qualifications": [
      "Exceptional organizational skills",
      "Comfortable with public speaking",
      "Excellent writing and research skills",
      "Previous congressional experience is highly encouraged"
    ],
    "how_to_apply": "Interested applicants should email their cover letter, resume and writing sample to jobs_ewdems@mail.house.gov. To ensure proper identification, please put “DEPUTY CLERK APPLICATION” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "jobs_ewdems@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-411-18",
    "position_title": "Counsel",
    "office": "Committee on Oversight and Government Reform",
    "location": null,
    "posting_date": "2019-01-21",
    "description": "The Committee on Oversight and Government Reform is the principal investigative body for the U.S. House of Representatives. Ranking Member Elijah Cummings seeks to fill a Counsel position on the Democratic staff. The ideal candidate will be an attorney with several years of investigative or litigation experience. Responsibilities include depositions, transcribed interviews, briefings, and congressional hearings. Candidates with diverse backgrounds and experiences are strongly encouraged to apply. Candidates must have superior attention to detail, work well under pressure, be selfmotivated, and possess excellent written and oral communication skills.",
    "responsibilities": [
      "Depositions",
      "Transcribed interviews",
      "Briefings",
      "Congressional hearings"
    ],
    "qualifications": [
      "Attorney with several years of investigative or litigation experience",
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Counsel” in the subject line. No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  }
]