[
  {
    "id": "MEM-315-19",
    "position_title": "Press Secretary",
    "office": "Congresswoman Sylvia R. Garcia (TX-29)",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "Congresswoman Sylvia R. Garcia (TX-29) seeks candidates for the position of Press Secretary. Candidates must be fluent in Spanish. Ideal candidates should have minimum of two years of successful work on communications for an elected leader or comparable experience, excellent writing abilities, and experience handling press inquiries. Applicants should be able to communicate effectively about a variety of policy issues. Applicants should also have a proven history of writing creative and original copy.\nCandidates should be organized, creative, motivated and must have the ability to write content that accurately conveys the priorities of the congresswoman and the 29th district. Candidates must be able to work effectively in a fastpaced environment, including quickly researching and writing copy.\nCandidates should have enough knowledge of video production/editing and creating graphic content that they can assist or fill-in when needed.\nThis is NOT an entry level position. The position reports to the Chief of Staff.",
    "responsibilities": [
      "drafting talking points for speaking engagements",
      "writing press releases",
      "developing relationships with members of the media",
      "tracking press and social media analytics",
      "research",
      "A limited policy portfolio will eventually be incorporated into the position."
    ],
    "qualifications": [
      "Candidates must be fluent in Spanish.",
      "Ideal candidates should have minimum of two years of successful work on communications for an elected leader or comparable experience, excellent writing abilities, and experience handling press inquiries.",
      "Applicants should be able to communicate effectively about a variety of policy issues.",
      "Applicants should also have a proven history of writing creative and original copy.",
      "Candidates should be organized, creative, motivated and must have the ability to write content that accurately conveys the priorities of the congresswoman and the 29th district.",
      "Candidates must be able to work effectively in a fastpaced environment, including quickly researching and writing copy.",
      "Candidates should have enough knowledge of video production/editing and creating graphic content that they can assist or fill-in when needed.",
      "Ability to independently produce content in English and Spanish is required."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter, two one-page writing samples (one in English and one in Spanish) to:\nTX29SG.Resumes@mail.house.gov .\nNo phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "TX29SG.Resumes@mail.house.gov",
    "equal_opportunity": "THIS OFFICE IS AN EQUAL OPPORTUNITY EMPLOYER: Women and minorities are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-306-19",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include: answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$30,000 per year starting salary",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-303-19",
    "position_title": "Communications Director",
    "office": "Senior Democratic Texas Member",
    "location": "Washington, D.C.",
    "posting_date": "2019-07-15",
    "description": "This person will plan and execute a proactive media and digital constituent outreach strategy. This is a senior staff role requiring a minimum of 3 years of previous Hill or political communications experience. This is not an entrylevel position.\nThe position will require a tremendous amount of writing, and the aptitude to oversee all press and communications responsibilities. Candidates should be proactive, detail-oriented and have demonstrated experience in national, local, and digital media.\nThe Communications Director is expected to have a close working relationship with the House Science, Space, and Technology Committee's media team. Dallas ties are preferred, but not necessary. Occasional district travel may be necessary.",
    "responsibilities": [
      "Develop strong relationships with local/national media; know local TV media markets, radio stations, and newspapers to elevate Member's profile on key issues",
      "Work closely with district team to plan messaging and plan local press events in the district",
      "Develop and execute communications strategies for the office using best practices",
      "Write talking points, press releases, op-eds, speeches, and more",
      "Book and prepare Member for interviews",
      "Produce a weekly communications report for the Congresswoman and provide regular communications updates to staff",
      "Create and oversee digital communications outreach including e-newsletter, website, and social media platforms"
    ],
    "qualifications": [
      "Political savvy",
      "Exceptional self-starter",
      "Creative/forward thinker",
      "Strong writer, editor, and proofreader",
      "Able to meet tight deadlines",
      "Detail oriented",
      "Team player",
      "Flexible schedule"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, and three writing samples, immediately, in one email to Kenneth.Nealy@mail.house.gov with “Communications Director” in the subject line. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "Kenneth.Nealy@mail.house.gov",
    "equal_opportunity": "Equal Opportunity Employer. Women, people of color, LGBTQ+ individuals and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-302-19",
    "position_title": "Staff Assistant",
    "office": "Rocky Mountain Democrat",
    "location": "Capitol Hill",
    "posting_date": "2019-07-15",
    "description": "Rocky Mountain Democrat is seeking an organized, detail-oriented individual to serve in the position of Staff Assistant in a fast-paced and highly collaborative Capitol Hill office. Responsibilities include staffing and managing the front office, answering the phone, greeting visitors, handling tour and flag requests, overseeing the internship program, occasionally driving the Member to and from events during regular office hours and afterhours, and providing additional office support as needed.",
    "responsibilities": [
      "Staffing and managing the front office",
      "Answering the phone",
      "Greeting visitors",
      "Handling tour and flag requests",
      "Overseeing the internship program",
      "Occasionally driving the Member to and from events during regular office hours and afterhours",
      "Providing additional office support as needed"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Great attention to detail",
      "Strong time management skills",
      "An ability to work under pressure to meet tight deadlines",
      "A sense of humor",
      "Capitol Hill experience and/or Western ties are preferred, but not required."
    ],
    "how_to_apply": "Please send a resume and cover letter to:\nRockyMountainDem@mail.house.gov with “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "RockyMountainDem@mail.house.gov",
    "equal_opportunity": "Equal Employment Opportunity Employer."
  },
  {
    "id": "MEM-299-19",
    "position_title": "Fall Internship",
    "office": "Congresswoman Jahana Hayes",
    "location": "Washington, DC and Waterbury, CT",
    "posting_date": "2019-07-15",
    "description": "Congresswoman Jahana Hayes (D-CT) is pleased to announce paid fall internship opportunities in her Washington, DC and Waterbury, CT offices.\n\nInternships are designed to offer students and recent graduates direct participation in public service through supporting our offices' constituent engagement and services, administrative responsibilities, and research.\n\nInterns' responsibilities will vary depending on the office in which they work.\n\nThey will be asked to answer phones, assist with correspondence, coordinate and conduct tours, research legislation, assist with constituent casework, develop the Congresswoman's community outreach, and attend hearings and briefings on various issues.",
    "responsibilities": [
      "Answer phones",
      "Assist with correspondence",
      "Coordinate and conduct tours",
      "Research legislation",
      "Assist with constituent casework",
      "Develop the Congresswoman's community outreach",
      "Attend hearings and briefings on various issues"
    ],
    "qualifications": [
      "Friendly",
      "Organized",
      "Flexible",
      "Ability to multitask in a fast-paced environment"
    ],
    "how_to_apply": "Please apply through the website at https://hayes.house.gov/services/internships. The deadline to apply is August 1, 2019. Please go no walk-ins or calls, please.",
    "salary_info": "Payment is limited to those interns who are not sponsored by outside organizations.",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-294-19",
    "position_title": "Legislative Assistant",
    "office": "Senior Congressional Hispanic Caucus Member and Co-Chair of the Labor and Working Families Caucus",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "The Legislative Assistant will be responsible for developing legislative initiatives, meeting with constituents and interested groups on behalf of the Member, and staffing the Member.",
    "responsibilities": [
      "Developing legislative initiatives",
      "Meeting with constituents and interested groups on behalf of the Member",
      "Staffing the Member"
    ],
    "qualifications": [
      "At least 2-4 years of experience",
      "A strong understanding of the issues listed",
      "Ability to work well with a team in a small, fast-paced environment, while maintaining a sense of humor",
      "Not an entry level position"
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and writing sample to CAdemofficejob@gmail.com. No calls or drop-ins, please.",
    "salary_info": null,
    "contact": "CAdemofficejob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-292-19",
    "position_title": "Staff Assistant",
    "office": "Congressman Ted Lieu",
    "location": "Los Angeles District Office",
    "posting_date": "2019-07-15",
    "description": "Congressman Ted Lieu has an immediate opening for a Staff Assistant in his Los Angeles District Office. Primary responsibilities include answering phones, maintaining the front office, assisting with various administrative and legislative duties and aiding constituents with federal casework. The Staff Assistant will greet constituents, ensures that constituent requests for assistance are directed to the appropriate staff member in a timely manner and will assist district staff to ensure the proper execution of events and programs in the district.",
    "responsibilities": [
      "Answering phones",
      "Maintaining the front office",
      "Assisting with various administrative and legislative duties",
      "Aiding constituents with federal casework",
      "Greet constituents",
      "Ensures that constituent requests for assistance are directed to the appropriate staff member in a timely manner",
      "Assist district staff to ensure the proper execution of events and programs in the district"
    ],
    "qualifications": [
      "Positive attitude",
      "Ability to work and set priorities in a fast paced and challenging environment",
      "Strong writing and verbal communications skills",
      "Valid California Driver License and automobile are required",
      "Bilingual skills are a plus"
    ],
    "how_to_apply": "If interested, please send a resume, cover letter, references, and two short writing samples no later than July 18, 2019 to:\nNICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33)\n1645 Corinth Avenue, Suite 101\nLos Angeles, CA 90025\nLieu.Staff@mail.house.gov",
    "salary_info": null,
    "contact": "NICOLAS RODRIQUEZ\nDistrict Director\nCongressman Ted Lieu (CA-33)\n1645 Corinth Avenue, Suite 101\nLos Angeles, CA 90025\nLieu.Staff@mail.house.gov",
    "equal_opportunity": "Our office is an Equal Opportunity Employer."
  },
  {
    "id": "MEM-290-19",
    "position_title": "Professional Staff Member",
    "office": "Committee on Natural Resources’ Subcommittee on Oversight and Investigations",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "The Committee on Natural Resources’ Subcommittee on Oversight and Investigations is seeking to fill a Professional Staff Member position on the Republican staff. The ideal candidate will have a strong interest in investigations and natural resources issues.",
    "responsibilities": [
      "Staffing Subcommittee and some Full Committee congressional hearings",
      "Drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations",
      "Transcribed interviews",
      "Reviewing document productions",
      "Research",
      "Interacting with various congressional committee and personal offices",
      "Managing the Subcommittee’s administrative needs"
    ],
    "qualifications": [
      "Must possess a strong work ethic",
      "Attention to detail",
      "Desire to learn how to conduct congressional oversight and investigations",
      "Be self-motivated",
      "Work well under pressure",
      "Possess strong research, written, and oral communication skills",
      "Prior Hill experience preferred, but not required"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to NaturalResources.Jobs@mail.house.gov, with “O&I PSM” in the subject line.",
    "salary_info": null,
    "contact": "NaturalResources.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-289-19",
    "position_title": "Counsel",
    "office": "Committee on Natural Resources’ Subcommittee on Oversight and Investigations",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "The Committee on Natural Resources’ Subcommittee on Oversight and Investigations is seeking to fill a Counsel position on the Republican staff.\n\nThe ideal candidate will have at least three years of experience with a background or strong interest in investigations. Experience in natural resources issues is a plus.",
    "responsibilities": [
      "Staffing Subcommittee and some Full Committee congressional hearings",
      "Drafting Subcommittee and some Full Committee correspondence to and from the Executive Branch as well as with outside organizations",
      "Depositions/ transcribed interviews",
      "Reviewing document productions",
      "Research",
      "Managing external sources of information",
      "Interacting with various congressional committee and personal offices"
    ],
    "qualifications": [
      "Candidates must possess a strong work ethic, superior attention to detail, be self-motivated, work well under pressure, and possess excellent written and oral communication skills.",
      "JD required.",
      "Prior Hill experience preferred, but not required."
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to NaturalResources.Jobs@mail.house.gov, with “O&I Counsel” in the subject line.",
    "salary_info": null,
    "contact": "NaturalResources.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-279-19",
    "position_title": "Communications Director",
    "office": "Senior Republican Member on Appropriations",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "Looking for Communications Director. Ideal candidates should have 3-5 years of Hill experience, strong writing skills, are detailed oriented, and familiar working with the media.",
    "responsibilities": [],
    "qualifications": [
      "3-5 years of Hill experience",
      "Strong writing skills",
      "Detailed oriented",
      "Familiar working with the media"
    ],
    "how_to_apply": "Interested applicants should send their cover letter, resume and writing samples to TX.JobListing@mail.house.gov",
    "salary_info": "Salary commensurate with experience.",
    "contact": "TX.JobListing@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-264-19",
    "position_title": "Digital Specialist",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2019-07-15",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an\nexperienced, creative and highly motivated Digital Specialist for her\nWashington, D.C. office. Reporting to the Communications Director, the\nDigital Specialist is responsible for creating original and creative content\n(including, but not limited to, videos and graphics) and managing the\nCongresswoman’s social media channels to further communicate and elevate\nher agenda and accomplishments.",
    "responsibilities": [
      "Drafting daily digital content for highly active social media channels;",
      "Serving as the lead graphic designer and video producer/editor for the office;",
      "Tracking social media performance and providing analysis of trends and opportunities for future growth;",
      "Updating and managing the Congresswoman’s official website; and",
      "Coordinating the creation and distribution of an e-newsletter."
    ],
    "qualifications": [
      "Social media, graphic design, and video production experience in a legislative office, campaign, political organization or progressive advocacy group;",
      "Fluency with social media platforms and a nuanced understanding of the current social media landscape and trends;",
      "Excellent organization and time management skills necessary to work in a fast-paced environment that requires rapid response;",
      "Strong writing skills and attention to detail;",
      "A passion for storytelling and social justice."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter,\ntwo writing samples, two graphic design samples, three references, and links\nto either a reel or samples of video work.\n\nPlease send applications to jobs.pramila@mail.house.gov with “Digital\nSpecialist” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with\ndisabilities, and members of other underrepresented communities are strongly\nencouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-263-19",
    "position_title": "Constituent Services Representative",
    "office": "Congresswoman Diana DeGette (CO-01)",
    "location": "Denver district office",
    "posting_date": "2019-07-15",
    "description": "The Denver district office of Congresswoman Diana DeGette (CO-01) is seeking a Constituent Services Representative with superior communication (verbal and writing), customer service, relationship building and problem-solving skills. The ideal candidate will have experience in public service, grants work and/or arts and education. Moreover, the ideal candidate is organized, detail-oriented and resilient in the face of a fast-paced legislative office. The ideal candidate is proactive and comfortable working with diverse staff, community members and constituents.\n\nThe Constituent Services Representative acts as a representative for the Congresswoman in assigned communities and provides casework assistance to constituents in assigned issue areas.",
    "responsibilities": [
      "Assists constituents by providing information and is capable of researching federal issues, answering questions on federal issues, directing constituents to appropriate state or local governments or community resources.",
      "Writes memorandums for meetings the Congresswoman has scheduled within assigned areas.",
      "Answers casework correspondence, meets with constituents and serves as a liaison with federal, state and local agencies in terms of assigned issue areas.",
      "Controls and processes constituent correspondence and cases in the casework areas as assigned; exercises judgment to determine the best course of action for individual cases.",
      "Follows district office casework policy and employs appropriate congressional casework tools, programs and resources, logs in all incoming and outgoing mail and incoming telephone calls relating to casework.",
      "Screens and refers cases, where appropriate, to other congressional district offices; continually screens active cases to ensure that their cases are handled in a responsive manner; maintains up-to-date files on all cases and categories of information of importance to the office.",
      "Logs-in constituent comments and researches questions on federal policy, law or procedure in the casework / issue areas as assigned; works with legislative staff in the Washington, D.C. office on researching issues regarding pending legislation in conjunction with district office outreach/events.",
      "Acts as a liaison to assigned constituency groups to form effective relationships for the district office; facilitates meetings with federal agencies, constituents, and groups having a common interest.",
      "Represents the Congresswoman at meetings/events of assigned constituency groups.",
      "Drives and staffs the Congresswoman for various events, meetings and district office outreach activities/functions, as needed;",
      "Meets attendance requirements established by the office; works full-time which periodically, may include additional hours, nights, and weekends without overtime pay; works well under pressure and manages stress appropriately;",
      "Maintains a good working relationship with the Congresswoman, staff and constituents;",
      "Performs other duties as assigned by the District Director."
    ],
    "qualifications": [
      "Ability to perform Essential Job Functions referenced herein;",
      "Good organizational skills, professional manner and appearance;",
      "Good communications skills (written and verbal); ability to communicate effectively with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Knowledge of Microsoft Office suite; proficiency in word processing and mail-merge;",
      "Ability to work cooperatively and courteously with others;",
      "Ability to drive a car – valid driver’s license.",
      "U.S. Citizen; office experience preferred; driver’s license;",
      "High school or GED required; college degree preferred."
    ],
    "how_to_apply": "Please send cover letter and resume to degette.employment@mail.house.gov",
    "salary_info": null,
    "contact": "degette.employment@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-258-19",
    "position_title": "Communications Director",
    "office": "Congressman",
    "location": null,
    "posting_date": "2019-07-15",
    "description": "We are looking to expand the Member's visibility and outreach, resulting in a need for highly diligent, confident candidates with substantial experience for the role of Communications Director. Spanish speaking skills are also important.\n\nThe position comes with great responsibility, as our Communications Director is part of the senior staff for the Congressman and responsible for helping in development and promotion of the Member's agenda. All aspects of communications are covered, including but not limited to, televised press conferences, statements to the press, speeches, radio addresses and social media. Experience with graphic design is a plus. The selected individual will also work closely with the entire office team to formulate consistent messaging in district mail pieces, and our 499-program.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Anyone interested may send their applications to Congressionaljobopening@gmail.com",
    "salary_info": "Salary is commensurate with experience. Benefits include paid vacation and sick leave, parking or metro benefits, health insurance and retirement -- Plus an awesome work environment!",
    "contact": "Congressionaljobopening@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-256-19",
    "position_title": "Press Assistant",
    "office": "Republican (Minority) staff of the House Committee on Veteran's Affairs",
    "location": "Washington",
    "posting_date": "2019-07-15",
    "description": "The Republican (Minority) staff of the House Committee on Veteran's Affairs is seeking a full-time press assistant in its Washington office.",
    "responsibilities": [
      "drafting talking points, press releases, speeches, and op-eds",
      "managing the website",
      "updating social media",
      "compiling and monitoring press clips"
    ],
    "qualifications": [
      "strong written and verbal communication skills",
      "the ability to work in a fast-paced environment",
      "professionalism",
      "a good sense of humor",
      "Prior Capitol Hill experience and/ or military service are a plus"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references, and three writing samples to var.resumes@mail.house.gov with “Press Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "var.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-252-19",
    "position_title": "Legislative Assistant",
    "office": "Rep. Justin Amash (MI-03)",
    "location": "Washington, DC",
    "posting_date": "2019-07-15",
    "description": "The Office of Rep. Justin Amash (MI-03) is seeking a bright, creative, and\nself-motivated legislative assistant with a background in law to join our\nWashington, DC-based policy team. The legislative assistant will draft\nlegislation, analyze bills, and meet with constituents concerning policy\nmatters, among other duties. The person will be expected to handle a diverse\nportfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the\ntradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant\nmust demonstrate a strong commitment to individual liberty, economic\nfreedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take\non the most serious impediments to a freer, more prosperous America. An\nindividual who prefers staid and steady work or who avoids challenges (and\nthe occasional failure) may be more comfortable elsewhere.",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters"
    ],
    "qualifications": [
      "Applicants must have a JD or equivalent.",
      "Two years of relevant policy experience is preferred, although Hill experience is not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to\napplydc@amash.com. Please include \"legislative assistant applicant\" in the\nsubject line. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  }
]