[
  {
    "id": "MEM-582-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Orange County",
    "posting_date": "2022-12-05",
    "description": "The Field Representative serves an important role in the Member’s Congressional\nDistrict, acting as a liaison with federal, district, and local agencies for the\nMember and constituents. They are responsible for strengthening community\nrelations and assessing casework for problems requiring legislative action and/or\nCongressional oversight.\n\nUnder the supervision of the Chief of Staff and the District Director, the Field\nRepresentative briefs the Member in preparation for district meetings with\nconstituents and acts as the representative for the Member by attending events\nand meetings. This includes public speaking and certificate presentations.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in\nlegislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community\nleaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible scheduling, including nights and\nweekends",
      "Constituent service oriented; patient empathetic, and desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director, Office of Congresswoman\nSteel Stephanie.Hu@mail.house.gov",
    "salary_info": "Salary range is $49,000-$57,000. Salary commensurate with experience.",
    "contact": "Stephanie Hu, District Director",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex\n(including marital or parental status), sexual orientation, gender identity,\ndisability, age, or national origin."
  },
  {
    "id": "MEM-581-22",
    "position_title": "Scheduler",
    "office": "Congressman Joaquin Castro",
    "location": "Washington, DC",
    "posting_date": "2022-12-05",
    "description": "The Office of Congressman Joaquin Castro seeks a well-organized scheduler based in Washington, DC.",
    "responsibilities": [
      "Managing the Member’s DC and collaborating on district scheduling.",
      "Coordinating the Member's travel arrangements.",
      "Working closely with the Member and senior staff to ensure smooth daily operations."
    ],
    "qualifications": [],
    "how_to_apply": "The deadline to apply is Monday, December 12. To apply, please email Castro.Resumes@mail.house.gov with “Scheduler - Name” in the subject line and the following application materials attached as one combined PDF.\n\n•Cover letter\n•Resume\n•2 references, including name, title, organization, phone number, email, and a one-sentence description of your relationship to the reference.",
    "salary_info": null,
    "contact": "Castro.Resumes@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-575-22",
    "position_title": "Senior Legislative Assistant",
    "office": "Congressman Mark DeSaulnier (D-CA)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-05",
    "description": "Congressman Mark DeSaulnier (D-CA), member of the Education and Labor Committee and Transportation and Infrastructure Committee, seeks a Senior Legislative Assistant to handle a diverse legislative portfolio including committee work.\n\nDuties include identifying and advancing policy proposals, committee hearing and mark-up preparation and staffing, building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff, briefing the Congressman and drafting legislative memos, policy background, and constituent correspondence. Title is negotiable based on candidate’s experience.\n\nIdeal candidate will be a strategic, detail-oriented thinker with experience formulating and advancing legislation. Successful applicants will have excellent organizational, research, writing, and communication skills, and have working knowledge of House processes and procedures. Candidates should possess the ability to concisely communicate and have strong time management skills and a willingness to work in a team environment. Knowledge of California a plus. This is not an entry level position -- prior legislative experience on Capitol Hill is preferred.",
    "responsibilities": [
      "Identifying and advancing policy proposals",
      "Committee hearing and mark-up preparation and staffing",
      "Building relationships with district and federal stakeholders and advocacy organizations as well as agency and congressional staff",
      "Briefing the Congressman",
      "Drafting legislative memos, policy background, and constituent correspondence"
    ],
    "qualifications": [
      "Strategic, detail-oriented thinker with experience formulating and advancing legislation",
      "Excellent organizational, research, writing, and communication skills",
      "Working knowledge of House processes and procedures",
      "Ability to concisely communicate",
      "Strong time management skills",
      "Willingness to work in a team environment",
      "Knowledge of California a plus",
      "Prior legislative experience on Capitol Hill is preferred"
    ],
    "how_to_apply": "Qualified candidates should send resume and cover letter to DeSaulnierResumes@gmail.com.",
    "salary_info": null,
    "contact": "DeSaulnierResumes@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity, marital status, parental status, or sexual orientation. Candidates from diverse backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-573-22",
    "position_title": "Staff Assistant",
    "office": "Rep. Sharice Davids’ office",
    "location": "DC",
    "posting_date": "2022-12-05",
    "description": "The staff assistant is responsible for a number of administrative duties including maintaining the front office, assisting the office manager with coordinating office operations, and helping the communications and legislative staff with various tasks. This position also oversees Rep. Davids’ internship program in DC and drives and helps staff the Member at events (car required). The ideal candidate should be detail-oriented, well organized, able to adapt, a team player, and accustomed to a fast-paced work environment.",
    "responsibilities": [
      "Maintaining the front office",
      "Assisting the office manager with coordinating office operations",
      "Helping the communications and legislative staff with various tasks",
      "Overseeing Rep. Davids’ internship program in DC",
      "Driving and helps staff the Member at events (car required)"
    ],
    "qualifications": [
      "Bachelor’s Degree required.",
      "Hill experience and Kansas ties preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume and cover letter to ks03.jobs@mail.house.gov by COB December 6, 2022 with the subject line “Staff Assistant – LAST NAME, FIRST NAME”. No phone calls, please.",
    "salary_info": null,
    "contact": "ks03.jobs@mail.house.gov",
    "equal_opportunity": "Rep. Davids’ Office is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are highly encouraged to apply."
  },
  {
    "id": "MEM-572-22",
    "position_title": "Legislative Director",
    "office": "Congresswoman Susan Wild (D-PA)",
    "location": "Capitol Hill",
    "posting_date": "2022-12-05",
    "description": "Congresswoman Susan Wild (D-PA) seeks a Legislative Director to oversee her legislative team and a fast-paced policy agenda.\n\nThis is not an entry-level position and previous policy and Capitol Hill experience is required. The person in this role will very likely have a legislative portfolio as well as be responsible for managing the legislative team and potentially other staff.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff;",
      "Manages a legislative team of 3-4 staff;",
      "Works closely with the communications team and helps influence the successful messaging of legislative issues;",
      "Coordinates the preparation of legislative and policy memos and committee hearings;",
      "Handles a portfolio of legislative issues, which may be tailored to the candidate’s expertise;",
      "Occasionally assists with the creation and execution of events in the District and in DC;",
      "Regularly monitors activity on the House Floor and the Member’s committees;",
      "Builds relationships with district and national stakeholders and advocacy organizations; and",
      "Takes constituent and advocacy group meetings regularly."
    ],
    "qualifications": [
      "Is a leader with strong inter-personal skills who thrives in a collaborative teamfirst environment;",
      "Works quickly under pressure and manages time efficiently;",
      "Is creative and has an entrepreneurial spirit;",
      "Possesses strong written and verbal communications skills;",
      "5+ years of congressional, policy, or political experience (Capitol Hill experience required);",
      "Domestic policy experience – health care policy experience a plus;",
      "Existing relationships and experience working with federal agencies; and",
      "Knowledge of or ties to Pennsylvania a plus."
    ],
    "how_to_apply": "Email a cover letter and resume to repwildjobs@gmail.com with the subject line, “Legislative Director”.",
    "salary_info": null,
    "contact": "repwildjobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-566-22",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic member of the House Science, Space, and Technology Committee",
    "location": "DC",
    "posting_date": "2022-12-05",
    "description": "Senior Democratic member of the House Science, Space, and Technology Committee seeks a Legislative Assistant to handle the office’s SST committee portfolio.\n\nIdeal candidates will have previous congressional experience and a strong understanding of the legislative process. Excellent writing skills, attention to detail, and the ability to work efficiently in a fast-paced environment are required.\n\nThis is not an entry level-position. Additional legislative responsibilities will be assigned based on a candidate’s experience/interest and office needs.",
    "responsibilities": [
      "staffing and preparing the member for hearings, markups, and relevant briefings",
      "writing legislative memos, talking points and floor statements",
      "drafting legislation, agency letters, and supporting materials",
      "working with the committee staff and stakeholders to advance the member’s priorities",
      "representing the member in meetings and other engagements with constituents, stakeholders, and state/federal government agencies"
    ],
    "qualifications": [
      "previous congressional experience",
      "strong understanding of the legislative process",
      "Excellent writing skills",
      "attention to detail",
      "the ability to work efficiently in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume, cover letter, and a writing sample in a single PDF document to ca07jobs@gmail.com with “SST Legislative Assistant - DC” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-560-22",
    "position_title": "Legislative Director",
    "office": "Congressman Raja Krishnamoorthi (D-IL)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-05",
    "description": "Congressman Raja Krishnamoorthi (D-IL), a member of the House Permanent\nSelect Committee on Intelligence and the House Oversight Committee (Chairman\nof the Subcommittee on Economic and Consumer Policy and Member of the\nCoronavirus Subcommittee) seeks a hardworking Legislative Director to oversee\nhis policy team and legislative agenda. This is not an entry-level position and\nprevious policy and Capitol Hill experience is required. The person in this role\nwill also have a legislative portfolio of domestic policy issues, including\nworkforce development, tax, finance, small business, and labor.",
    "responsibilities": [
      "Develop a legislative strategy in close consultation with the Member and Chief\nof Staff",
      "Manages a legislative team of 4-5 staff",
      "Works closely with the communications team and helps influence the successful\nmessaging of legislative issues",
      "Coordinates the preparation of legislative and policy memos, hearings, and\nTown Halls",
      "Handles a portfolio of legislative issues, which may be tailored to the\ncandidate’s expertise",
      "Occasionally assists with the creation and execution of events in the District and\nin DC",
      "Regularly monitors activity on the House Floor and the Member’s committees",
      "Builds relationships with district and national stakeholders and advocacy\norganizations",
      "Takes constituent and advocacy group meetings as necessary"
    ],
    "qualifications": [
      "Works quickly under pressure and manages time efficiently",
      "Is creative and has an entrepreneurial spirit",
      "Possesses strong written and verbal communications skills",
      "5+ years of congressional, policy, or political experience (Capitol Hill\nexperience strongly preferred)",
      "Policy experience in domestic policy issues a plus",
      "Knowledge of or ties to Illinois a plus"
    ],
    "how_to_apply": "Email a cover letter and resume to il08careers@gmail.com with the\nsubline, “Legislative Director: [Your Full Name]”",
    "salary_info": null,
    "contact": "il08careers@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. Candidates from diverse backgrounds are strongly encouraged to\napply."
  },
  {
    "id": "MEM-555-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-05",
    "description": "The legislative assistant will primarily handle health care and Social Security for an active Member of the Ways and Means Committee and House Democratic Leadership, along with other legislative issues including veterans.\n\nResponsibilities are wide-ranging and include preparing for and staffing committee hearings, drafting legislation and amendments, writing talking points and memorandums, and interacting with key constituent groups and stakeholders.\n\nApplicants should have a demonstrated passion for health care policy and Congress.\n\nApplicants must be willing to work on a team, bring an entrepreneurial spirit to a fast-paced office, previously demonstrated pro-active initiative, and possess a desire to continually learn. Applicants must work well under pressure, have excellent written and oral communication skills and demonstrate leadership capabilities. The position requires strategic thinking and the ability to work independently as well as within a team.\n\nThis is not an entry-level position. A minimum of two to three years of experience is required. Applicants with Michigan or Midwest ties are a plus.",
    "responsibilities": [
      "Preparing for and staffing committee hearings",
      "Drafting legislation and amendments",
      "Writing talking points and memorandums",
      "Interacting with key constituent groups and stakeholders"
    ],
    "qualifications": [
      "Demonstrated passion for health care policy and Congress",
      "Willing to work on a team",
      "Bring an entrepreneurial spirit to a fast-paced office",
      "Previously demonstrated pro-active initiative",
      "Possess a desire to continually learn",
      "Work well under pressure",
      "Excellent written and oral communication skills",
      "Demonstrate leadership capabilities",
      "Strategic thinking and the ability to work independently as well as within a team",
      "A minimum of two to three years of experience is required",
      "Applicants with Michigan or Midwest ties are a plus"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to Michigan05jobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": "Compensation is commensurate with experience.",
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer, committed to developing an organization that is reflective of the district that we serve. The office does not discriminate on the basis of race, sex, color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-554-22",
    "position_title": "Communications Director",
    "office": "Representative Mike Levin (CA-49)",
    "location": "DC and California",
    "posting_date": "2022-12-05",
    "description": "This position is responsible for guiding Rep. Levin’s communications operation, formulating and delivering his message, and managing a second communications staffer.",
    "responsibilities": [
      "Managing local and national press relationships",
      "Considering newsworthy actions by the Member that should be pitched to local press and executing pitches to strategically chosen reporters",
      "Responding to all press inquiries and interview requests in a timely manner",
      "Scheduling print and television interviews for Rep. Levin",
      "Drafting and sending press releases on Rep. Levin’s actions, priorities, and the issues of the day",
      "Formulating weekly and long-term communications plans",
      "Overseeing social media post development",
      "Updating the Member’s website with press releases, issue pages, and more",
      "Managing a comprehensive franked mail program",
      "Leading the development process of talking points for the Member’s speeches, interviews, and events in both DC and California",
      "Authoring, pitching, and publishing op-eds",
      "Closely monitoring the news and flagging relevant press and clips for Rep. Levin"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Thoroughness and careful attention to detail",
      "Capacity to create strong content on short notice",
      "Creative communications instincts",
      "Strong, independent judgment and discretion",
      "Thorough knowledge of social media accounts and tools including basic graphic design",
      "Knowledge of legislative process and of House organization and procedures",
      "Knowledge of local, state, and federal agencies and departments"
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, writing sample, and a list of three references to ca49.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We deeply value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-550-22",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-05",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-548-22",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai’i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-05",
    "description": "Responsibilities run the range of assisting the legislative, constituent services and administrative functions of the office, to include: monitoring, processing and responding to constituent mail and other communications, managing constituent tours and other needs, and coordinating DC and district office issues. As needed and depending on capability, the position also encompasses legislative duties.\n\nDirect report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring, processing and responding to constituent mail and other communications",
      "Managing constituent tours and other needs",
      "Coordinating DC and district office issues",
      "Legislative duties (as needed and depending on capability)"
    ],
    "qualifications": [
      "Prior Capitol Hill experience (strong preference)",
      "Hawai’i background (strong preference)",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-547-22",
    "position_title": "Constituent Services Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Honolulu office",
    "posting_date": "2022-12-05",
    "description": "The ideal candidate has diverse experience working in the community to address a wide range of statewide and local issues with a strong track record of advocacy for the people of Hawai'i. The position is responsible for assisting the Congressman to address requests for assistance from individual constituents and organizations, primarily but not exclusively with a wide range of federal government programs and activities.\n\nDuties include but are not limited to dealing directly with constituents and federal state and local agencies and organizations. The position also includes interaction with the Congressman’s D.C. office on related legislative and administrative matters, as well as representing the Congressman at community events, such as neighborhood board meetings, and otherwise assisting with the range of activities in the Congressman’s office. Direct report to the Deputy Chief of Staff in the Honolulu office. Although the position may also interact directly with the Congressman and his Washington, D.C. office from time to time. The ideal candidate is an individual who is seeking to live and work in the community that this position is designed to serve.",
    "responsibilities": [
      "Dealing directly with constituents and federal state and local agencies and organizations.",
      "Interaction with the Congressman’s D.C. office on related legislative and administrative matters.",
      "Representing the Congressman at community events, such as neighborhood board meetings.",
      "Assisting with the range of activities in the Congressman’s office."
    ],
    "qualifications": [
      "Prior experience especially in comparable duties including customer service or social work",
      "Hawai'i background/community involvement",
      "Experience evaluating, synthesizing and articulating issues in a thoughtful and respectful manner in support of constituents’ needs and the Congressman’s initiatives",
      "Extensive knowledge of a broad range of community resources and services from which to draw on when addressing constituent requests",
      "An interest in government and in assisting others",
      "Initiative",
      "Interpersonal skills",
      "The ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long and sometimes unpredictable hours"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Constituent Services Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-546-22",
    "position_title": "Scheduler",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-05",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced and well-organized Scheduler for the Representative’s Washington, D.C. office.",
    "responsibilities": [
      "Developing, coordinating, and managing all aspects of the Representative’s daily and long-term schedule in D.C. and in the district, as well as tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating all travel for the Representative and her staff and other logistical support tasks as required",
      "Working closely with and supporting the Chief of Staff, Deputy Chief of Staff/District Director, Legislative Director and Communications Director to ensure smooth daily schedules and operations."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values",
      "A hard worker with excellent attention to detail",
      "Adept at juggling complex schedules, competing priorities",
      "Able to anticipate problems, seek solutions, and effectively communicate them to the Representative and her staff",
      "Able to work long hours, including some nights and weekends",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Scheduler” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-543-22",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas), Chair of the Ways & Means Health Subcommittee",
    "location": "Washington, D.C.",
    "posting_date": "2022-12-05",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), Chair of the Ways & Means Health\nSubcommittee seeks an experienced Legislative Assistant to assist with his\nhealth care work and other to be determined issues.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill or other policy or political experience strongly preferred, as well as a law or graduate degree.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor references to DoggettJobs@mail.house.gov. Use this title on your email: “Experienced LA Applicant” -- No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-541-22",
    "position_title": "Senior Legislative Assistant and Counsel",
    "office": "House Democrat",
    "location": null,
    "posting_date": "2022-12-05",
    "description": "Senior House Democrat seeks a Senior Legislative Assistant and Counsel for\nthe Member’s personal office to staff a portfolio of legislative issues and to serve\nas council for the office. The duties include providing legal or equivalent service\nin an agency or private sector employer, advice concerning the full range of\nlegislative issues and with compliance issues.\n\nThe ideal applicant will have a law degree, bar membership and a strong policy\nbackground. Previous Capitol Hill legislative experience strongly preferred. The\nposition requires clear, concise legal analysis as well as the political acumen to\nwork closely and collaboratively with constituent, labor and public interest\norganizations.",
    "responsibilities": [
      "Providing legal or equivalent service in an agency or private sector employer",
      "Advice concerning the full range of legislative issues",
      "Compliance issues"
    ],
    "qualifications": [
      "Law degree",
      "Bar membership",
      "Strong policy background",
      "Previous Capitol Hill legislative experience strongly preferred",
      "Clear, concise legal analysis",
      "Political acumen to work closely and collaboratively with constituent, labor and public interest organizations"
    ],
    "how_to_apply": "Applicants should send a resume and cover letter",
    "salary_info": null,
    "contact": "Legalcongress24@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-540-22",
    "position_title": "Legislative Assistant",
    "office": "Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2022-12-05",
    "description": "The office seeks an experienced staffer that can manage a portfolio of domestic issues.\nA successful candidate will have excellent writing and communication skills, a solid understanding of the legislative process, and a proven ability to work effectively with a congressional legislative team. Press and communications experience is also a plus, but not required.",
    "responsibilities": [
      "monitoring and drafting legislation",
      "representing the Member in meetings/briefings",
      "collaborating with constituent organizations",
      "preparing materials for committee hearings and markups",
      "other tasks and assignments as needed"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to congressjob2022@gmail.com",
    "salary_info": null,
    "contact": "congressjob2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-531-22",
    "position_title": "Communications Director",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2022-12-05",
    "description": "California Democrat seeks Communications Director to develop and implement\na strategic and aggressive communications plan involving local, national, and\nspecialty media.",
    "responsibilities": [
      "managing day-to-day press operations",
      "working closely with legislative and district staff in planning press conferences and in-district events",
      "drafting and editing speeches, press advisories, releases, op-eds, enewsletters and franked mailings",
      "managing the Member’s social media accounts and official website",
      "responding to press inquiries"
    ],
    "qualifications": [
      "strong political and messaging instincts",
      "proactive, detailed-oriented storytellers who work well under tight deadlines in a fast-paced environment",
      "deep interest and enthusiasm for closely following the local and national news cycles",
      "deep sense of duty to public service",
      "available to work long hours and weekends when necessary"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, three writing samples of\none page or less, samples of digital media and graphic design projects, and three\nreferences with “COMMUNICATIONS DIRECTOR” in the subject line\nto ca20.jobs@mail.house.gov",
    "salary_info": "The office offers student loan repayment, paid vacation, and sick leave, in\naddition to other benefits that include health care and retirement.",
    "contact": "ca20.jobs@mail.house.gov",
    "equal_opportunity": "This office is committed to, and benefits from, a diverse staff, and candidates of\nall backgrounds are encouraged to apply. The office is an equal opportunity\nemployer and does not discriminate on the basis of race, color, religion, sex,\nsexual orientation, gender identity and expression, national origin, disability,\nmilitary status, age, marital status, or parental status."
  },
  {
    "id": "MEM-530-22",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Deborah Ross",
    "location": "Raleigh, NC",
    "posting_date": "2022-12-05",
    "description": "The Raleigh District Office of Congresswoman Deborah Ross is hiring a fulltime Staff Assistant.\nThe position is available to qualified candidates with an undergraduate degree.\nThe position starts December 1, 2022 (negotiable). Employees are expected to\nwork from 9:00am to 5:30pm with evenings and weekends assigned as needed.\nAn ideal candidate will have strong written and oral communication skills, be\norganized with strong attention to detail, will exercise emotional and social\nintelligence at all times, and will take initiative. Employees regularly deal with\nsensitive information and must exercise discretion. A valid driver’s license and\navailable car are required for the position. Candidates are subject to a background\ncheck and online presence check.",
    "responsibilities": [
      "Constituent services (assisting with casework, communicating with constituents as a representative of the office)",
      "Office administration (answering phones, processing mail, greeting guests in the office)",
      "Staffing duties (driving and accompanying Congresswoman Ross to various events)",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Undergraduate degree",
      "Strong written and oral communication skills",
      "Organized with strong attention to detail",
      "Exercise emotional and social intelligence",
      "Ability to take initiative",
      "Discretion when dealing with sensitive information",
      "Valid driver’s license",
      "Available car"
    ],
    "how_to_apply": "Please submit your resume and a cover letter to Ross.Applications@mail.house.gov.",
    "salary_info": "Based on experience",
    "contact": "Ross.Applications@mail.house.gov",
    "equal_opportunity": "This opportunity is without regard to race, gender, religion, sexual orientation,\nnational origin, ethnicity, age, physical or mental disability, veteran status, or any\nother characteristic prohibited by state or local law."
  }
]