[
  {
    "id": "MEM-385-19",
    "position_title": "LEGISLATIVE AIDE",
    "office": "California Democrat",
    "location": "Capitol Hill",
    "posting_date": "2019-08-12",
    "description": "California Democrat seeks Legislative Aide to assist an active and dynamic legislative team. Candidates should have excellent research, writing, and communication skills. Duties include administrative assistance, research, special projects, and constituent correspondence. Prior experience on Capitol Hill is preferred. Office is an equal opportunity employer.",
    "responsibilities": [
      "Administrative assistance",
      "Research",
      "Special projects",
      "Constituent correspondence"
    ],
    "qualifications": [
      "Excellent research, writing, and communication skills",
      "Prior experience on Capitol Hill is preferred"
    ],
    "how_to_apply": "Qualified candidates should send resume, cover letter, and one writing sample to CADemocratResumes@gmail.com",
    "salary_info": null,
    "contact": "CADemocratResumes@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer."
  },
  {
    "id": "MEM-384-19",
    "position_title": "Executive Assistant",
    "office": "Republican Energy and Commerce Member",
    "location": "D.C. and the district",
    "posting_date": "2019-08-12",
    "description": "Active Republican Energy and Commerce Member seeks an Executive\nAssistant to manage the Member’s schedule and office logistics. Primary\nduties include processing all scheduling requests, maintaining the Member’s\nschedule, and ensuring the Member has briefing materials for all meetings in\nD.C. and the district.\nThis is not an entry-level position and prior Congressional experience is\npreferred.",
    "responsibilities": [
      "Processing all scheduling requests",
      "Maintaining the Member’s schedule",
      "Ensuring the Member has briefing materials for all meetings in D.C. and the district"
    ],
    "qualifications": [
      "Highly organized and skilled at handling multiple tasks at once",
      "Detail oriented",
      "Able to keep up in a fast paced environment",
      "Proactive, anticipating the needs and expectations of the Member",
      "Team oriented with good communication skills",
      "Resourceful and able to solve problems creatively and independently"
    ],
    "how_to_apply": "To apply please send a resume and cover letter to GOPhousescheduler@gmail.com",
    "salary_info": null,
    "contact": "GOPhousescheduler@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-382-19",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Tulsi Gabbard’s Hawaii District Office",
    "location": "Honolulu",
    "posting_date": "2019-08-12",
    "description": "Job responsibilities include fielding constituent calls, processing mail, internship program coordination, processing casework intake and constituent requests for information, maintaining a photographic database, drafting correspondence, maintaining office equipment, and other administrative duties as needed.\n\nIn addition, the staff assistant occasionally represents Congresswoman Gabbard at community meetings or events.\n\nWe are seeking applicants to join our fun, team-oriented, hard-working office.\n\nThe ideal candidate will possess a can-do attitude and will be process and solution oriented. He or she will also be an independent worker, a self-starter and will possess the capacity to produce high quality work on short deadlines. He or she will also have a demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment.",
    "responsibilities": [
      "Fielding constituent calls",
      "Processing mail",
      "Internship program coordination",
      "Processing casework intake and constituent requests for information",
      "Maintaining a photographic database",
      "Drafting correspondence",
      "Maintaining office equipment",
      "Other administrative duties as needed",
      "Occasionally represents Congresswoman Gabbard at community meetings or events"
    ],
    "qualifications": [
      "Can-do attitude",
      "Process and solution oriented",
      "Independent worker",
      "Self-starter",
      "Capacity to produce high quality work on short deadlines",
      "Demonstrated ability to communicate effectively with colleagues and superiors in a dynamic work environment"
    ],
    "how_to_apply": "Please do not call or drop in to the office; qualified applicants may email a cover letter, resume and two writing samples with “Staff Assistant” in the email title to: hi02jobs@gmail.com.",
    "salary_info": null,
    "contact": "hi02jobs@gmail.com",
    "equal_opportunity": "Veteran applications are welcome!"
  },
  {
    "id": "MEM-381-19",
    "position_title": "Professional Staff Member or Counsel",
    "office": "Energy & Commerce Committee, Democratic Staff",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "The Energy & Commerce Committee, Democratic Staff seeks dedicated, organized and enthusiastic candidates to join the Communications and Technology Subcommittee staff as Professional Staff Member or Counsel.\n\nThe jurisdiction of the subcommittee includes traditional and emerging communications technologies generally and as they relate to emergency and public safety communications, consumer protection, cybersecurity, privacy, and data security.\n\nThe subcommittee oversees the Federal Communications Commission, the National Telecommunications and Information Administration, the Office of Emergency Communications in the Department of Homeland Security, and all aspects of the above-referenced jurisdiction related to the Department of Homeland Security.\n\nThe position requires the handling of substantive legislative and administrative tasks, including staffing hearings and markups, conducting oversight, and drafting legislation. Qualified candidates must have strong writing, analytical, legislative, and organizational skills; a proven ability to perform under pressure while juggling multiple tasks with competing priorities; a willingness to work long hours and weekends; and sound political judgment. Candidates should have experience working with relevant public interest groups, the FCC, Congress, and industry. Law degree preferred but not required.",
    "responsibilities": [
      "staffing hearings and markups",
      "conducting oversight",
      "drafting legislation"
    ],
    "qualifications": [
      "strong writing, analytical, legislative, and organizational skills",
      "a proven ability to perform under pressure while juggling multiple tasks with competing priorities",
      "a willingness to work long hours and weekends",
      "sound political judgment",
      "experience working with relevant public interest groups, the FCC, Congress, and industry",
      "Law degree preferred but not required"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and at least two professional references to ecdjobs@mail.house.gov using the subject line C&T PSM/Counsel Candidate",
    "salary_info": null,
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), gender identity, disability, or age. Women, minority, and veteran candidates are highly encouraged to apply."
  },
  {
    "id": "MEM-380-19",
    "position_title": "Constituent Services Representative, Palmdale",
    "office": "Office of Congresswoman Katie Hill",
    "location": "Palmdale",
    "posting_date": "2019-08-12",
    "description": "The Office of Congresswoman Katie Hill is looking for a full-time Constituent Services Representative to act as an accessible, approachable, and effective bridge between the community and the office. The Constituent Services Representative will lead the office’s veterans casework and community outreach operation to deliver excellent constituent services. The right candidate is a self-starter, passionate about civil service, and is able to work both independently and as part of a team. Those with experience and a strong interest in working with veterans are encouraged to apply.\n\nThis is a full-time salaried position, reporting to the Deputy District Director. The Constituent Services Representative will be based out of the Palmdale district office during normal operating hours and is also expected to attend events outside the office during the week, some evenings, and on weekends.",
    "responsibilities": [
      "To assist constituents with cases involving federal agencies, predominantly the United States Department of Veterans Affairs",
      "to represent the Member and the office at community events and in meetings",
      "to assist the District team in planning and staffing events hosted by our office",
      "to answer correspondence and verbal communications with constituents including answering the telephone, greeting visitors to the office, and responding to constituent requests for general information",
      "to maintain a professional and courteous front office",
      "to take the lead on various community outreach and legislative projects, as assigned."
    ],
    "qualifications": [
      "Minimum of 3 years work experience, preferably in a related field, such as social work or customer service",
      "a strong track record of community service",
      "demonstrable knowledge of local issues and events in which the Member is involved or in key issue areas",
      "strong oral and written communication skills, including proven ability to convey empathy and exercise discretion and good judgement",
      "proficiency in word processing, operation of office equipment, and general tech savvy",
      "excellent organizational skills, thoroughness, and careful attention to detail",
      "skill in organizing and prioritizing work tasks and activities",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with others",
      "availability to work nights and weekends, as necessary."
    ],
    "how_to_apply": "To apply, please send resume and cover letter to:",
    "salary_info": null,
    "contact": "Andrea.Rosenthal@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-379-19",
    "position_title": "Constituent Services Assistant",
    "office": "Office of Congresswoman Katie Hill",
    "location": "Simi Valley",
    "posting_date": "2019-08-12",
    "description": "The Constituent Services Assistant serves as an accessible, approachable, and effective bridge between the community and the Office of Congresswoman Katie Hill. The Constituent Services Assistant conducts casework and community outreach to deliver excellent constituent services. This individual is a self-starter, passionate about civil service, and is able to work both independently and as part of a team.\n\nThis role is a part-time position, reporting to the Constituent Services Representative in Simi Valley. The Constituent Services Assistant is based out of the Simi Valley district office during normal operating hours and will have the opportunity to attend occasional events on behalf of the office during the week, some evenings, and on weekends.",
    "responsibilities": [
      "To assist constituents with cases involving federal agencies",
      "to assist the District team in planning and staffing events hosted by our office",
      "to answer correspondence and verbal communications with constituents including answering the telephone, greeting visitors to the office, and responding to constituent requests for general information",
      "to maintain a professional and courteous front office",
      "to take the lead on with various community outreach and legislative projects, as assigned.",
      "Communicates with federal agency liaisons and follows through with constituents to deliver updates and final outcomes of their cases",
      "continually screens active cases to ensure that they are handled in a responsive manner",
      "screens and refers cases, when appropriate, to other district offices",
      "actively listens to the concerns of constituents, empathizes, and ensures that requests for assistance are handled in a timely manner",
      "maintains a professional, courteous office environment, including greeting and screening visitors, answering and screening telephone calls, taking messages, assisting persons who have appointments, handling materials delivered to the office in a timely manner, maintaining the office voicemail, and logging constituent opinions, including full name, address, and all relevant information.",
      "works independently and as part of the team to execute various community outreach and legislative projects, as assigned",
      "prepares weekly reports for the Constituent Services Representative on district activities in his or her assigned issue areas."
    ],
    "qualifications": [
      "Prior work or educational experience in a related field, such as social work or customer service",
      "a strong track record of community service",
      "strong oral and written communication skills, including proven ability to convey empathy and exercise discretion and good judgement",
      "proficiency in word processing, operation of office equipment, and general tech savvy",
      "excellent organizational skills, thoroughness, and careful attention to detail",
      "skill in organizing and prioritizing work tasks and activities",
      "ability to work well under pressure",
      "ability to work cooperatively and courteously with others."
    ],
    "how_to_apply": "To apply, please send a resume and cover letter to:",
    "salary_info": null,
    "contact": "Melissa.Pender@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-378-19",
    "position_title": "District Representative",
    "office": "Congressman John Garamendi (CA-03)",
    "location": "Fairfield office",
    "posting_date": "2019-08-12",
    "description": "Job responsibilities include monitoring district and local issues; acting as a liaison to federal, district, and local agencies in Solano County; working with constituents who have an issue with a federal agency ensuring they receive a timely response; and ensuring that the office is appropriately staffed during office hours.",
    "responsibilities": [
      "Monitoring district and local issues",
      "Acting as a liaison to federal, district, and local agencies in Solano County",
      "Working with constituents who have an issue with a federal agency ensuring they receive a timely response",
      "Ensuring that the office is appropriately staffed during office hours"
    ],
    "qualifications": [
      "Hard working",
      "Excellent oral and written communications skills",
      "Knowledge of Solano County",
      "Ability to multi-task, meet deadlines, and produce a quality work product",
      "A flexible schedule and ability to travel throughout the district is required"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample to ca.03.resumes@gmail.com, please include District Representative in the subject line.",
    "salary_info": null,
    "contact": "ca.03.resumes@gmail.com",
    "equal_opportunity": "Equal opportunity employer."
  },
  {
    "id": "MEM-376-19",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Jahana Hayes (D-CT)",
    "location": "Washington, DC",
    "posting_date": "2019-08-12",
    "description": "Duties include: greeting visitors, answering the telephone constituent requests for general information, tours, and other inquiries, ordering all office supplies and maintaining office equipment, among other administrative and legislative duties as assigned.",
    "responsibilities": [
      "Greeting visitors",
      "Answering the telephone constituent requests for general information, tours, and other inquiries",
      "Ordering all office supplies and maintaining office equipment",
      "Other administrative and legislative duties as assigned"
    ],
    "qualifications": [
      "Work well under pressure and handle stress",
      "Be able to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Have the ability to work cooperatively and courteously with others",
      "Accept performance-based criticism and direction",
      "Be able to work a flexible schedule including long hours, nights, and weekends"
    ],
    "how_to_apply": "To apply for this position, please email Jahana.Hayes@mail.house.gov with a cover letter and resume, with email subject line “STAFF ASSISANT FIRST NAME LAST NAME.” No walk-ins or calls, please.",
    "salary_info": null,
    "contact": "Jahana.Hayes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-375-19",
    "position_title": "Assistant Clerk/Security Manager",
    "office": "House Committee",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "This person will work with the Chief Clerk & Deputy Clerk to coordinate logistical aspects of hearings, markups, and Committee meetings.\n\nOther responsibilities include managing the Legislative Calendar, hearing documents, Committee archives, and the transcript review process. This person would also serve as the Committee's Security Manager to manage classified and sensitive materials, briefings, hearings, meetings, etc. The Assistant Clerk / Security Manager would also manage security clearances for Members and staff, manage the Committee SCIF, and work effectively with the House Security Office.",
    "responsibilities": [
      "Work with the Chief Clerk & Deputy Clerk to coordinate logistical aspects of hearings, markups, and Committee meetings.",
      "Manage the Legislative Calendar.",
      "Manage hearing documents.",
      "Manage Committee archives.",
      "Manage the transcript review process.",
      "Serve as the Committee's Security Manager to manage classified and sensitive materials, briefings, hearings, meetings, etc.",
      "Manage security clearances for Members and staff.",
      "Manage the Committee SCIF.",
      "Work effectively with the House Security Office."
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Good written and verbal communication skills",
      "Ability to handle multiple projects simultaneously in a demanding work environment",
      "TS or TS/SCI clearance is required.",
      "Prior Hill experience is strongly preferred."
    ],
    "how_to_apply": "Interested candidates should e-mail a cover letter and resume to Oversightjobs@mail.house.gov with “Assistant Clerk/Security Manager” in the subject line.",
    "salary_info": null,
    "contact": "Oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-373-19",
    "position_title": "Executive Assistant, Office Manager, and Intern Coordinator",
    "office": "House Republican Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2019-08-12",
    "description": "House Republican Member of Congress seeks an experienced individual to serve as his Executive Assistant in his Washington, D.C. office. This individual will also serve as the Office Manager and Intern Coordinator.\n\nPosition duties include, but are not limited to: maintaining Member’s Washington, DC and district calendars, managing all incoming meeting requests and invitations, coordinating travel and logistics, processing office invoices for vendor payment, maintaining stock of office supplies, overseeing the day-to-day operations of the office, processing/scheduling all incoming tour requests, managing the office’s internship program, and other duties as required.",
    "responsibilities": [
      "Maintaining Member’s Washington, DC and district calendars",
      "Managing all incoming meeting requests and invitations",
      "Coordinating travel and logistics",
      "Processing office invoices for vendor payment",
      "Maintaining stock of office supplies",
      "Overseeing the day-to-day operations of the office",
      "Processing/scheduling all incoming tour requests",
      "Managing the office’s internship program",
      "Other duties as required"
    ],
    "qualifications": [
      "Applicants should be well-organized",
      "Possess a keen attention to detail",
      "Work well in a fast-paced environment",
      "Have strong interpersonal skills"
    ],
    "how_to_apply": "Please submit resume and cover letter to executiveassistantjob2019@gmail.com",
    "salary_info": null,
    "contact": "executiveassistantjob2019@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-370-19",
    "position_title": "Scheduler",
    "office": "Congressman Dan Meuser",
    "location": "Washington, DC",
    "posting_date": "2019-08-12",
    "description": "The Office of Congressman Dan Meuser seeks a Scheduler for his\nWashington office. The scheduler will manage all aspects of the Member's\ndaily and long-term schedule in DC and in the District. This individual will\nwork closely with the Member, DC and District staff.\nThis is not an entry-level position.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Managing operational and logistical support for the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill or comparable work environment",
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Applicants should send their resume, and references to PA09Jobs@mail.house.gov. No phone calls, emails, or walk-ins, please.",
    "salary_info": null,
    "contact": "PA09Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-367-19",
    "position_title": "Press Aide/Press Secretary",
    "office": "West Coast Democrat",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "West Coast Democrat seeks an innovative and self-directed Press Aide/Press Secretary.",
    "responsibilities": [
      "Coordinating and managing all district and national communications operations.",
      "Developing and executing a proactive press strategy.",
      "Drafting written materials including press releases, op-eds, and talking points.",
      "Planning and coordinating press conferences and other media events.",
      "Pitching and booking interviews with local and national media outlets.",
      "Oversee all social media platforms and website content.",
      "Build and maintain excellent relationships with members of the district and national and media and act as a spokesperson for the Member."
    ],
    "qualifications": [
      "Exceptional oral and written communication skills, as well as excellent interpersonal skills.",
      "Excellent writing skills with a strong attention to detail.",
      "The ability to multi-task in a fast-paced environment.",
      "Applicants should have superior organizational abilities.",
      "A successful candidate will be discreet, goal oriented, and driven.",
      "A sense of humor and the ability to work well as an individual and as a member of a team.",
      "Professional Spanish fluency is required."
    ],
    "how_to_apply": "If interested, please email a resume, cover letter, and references to CAJobs@mail.house.gov with “Press Aide/Press Secretary” in the subject line. Relevant press experience is required.",
    "salary_info": "Salary will be commensurate with experience. This is not an entry level position.",
    "contact": "CAJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-365-19",
    "position_title": "Director of Scheduling",
    "office": "Moderate Midwestern Member",
    "location": "Washington, D.C.",
    "posting_date": "2019-08-12",
    "description": "Moderate Midwestern Member seeks a hardworking, detail-oriented and highly-organized Director of Scheduling to be based out of the Washington, D.C., office. The scheduler will manage all aspects of the Member’s daily and long-term schedules in D.C. and the district.\n\nThe Director of Scheduling will work closely with the Chief of Staff, Legislative Director, Communications Director, and District Director on a weekly basis to ensure all scheduling needs are met. The scheduler will develop in-depth knowledge of the district’s geography and key stakeholders in order to strategically and creatively support district staff.\n\nThe ideal candidate will be an excellent communicator with exceptional organizational skills, an ability to work well in a demanding and fast-paced environment, and an ability to anticipate problems, take initiative, and offer solutions. Previous Congressional scheduling or executive-level experience required. This is not an entry-level position.",
    "responsibilities": [
      "Preparing and executing the Member’s daily, weekly, and long-term schedules in both D.C. and the District",
      "Coordinating all travel for the Member",
      "Managing incoming scheduling requests from D.C. and the District",
      "Managing weekly scheduling meetings",
      "Coordinating various other projects and administrative duties as assigned"
    ],
    "qualifications": [
      "Excellent communicator with exceptional organizational skills",
      "Ability to work well in a demanding and fast-paced environment",
      "Ability to anticipate problems, take initiative, and offer solutions",
      "Previous Congressional scheduling or executive-level experience required"
    ],
    "how_to_apply": "Please Email your resume and cover letter to MidWestDemjob2020@gmail.com with Subject Line “Midwestern Moderate – Scheduler”",
    "salary_info": "Salary commensurate with experience.",
    "contact": "MidWestDemjob2020@gmail.com",
    "equal_opportunity": "This Office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or expression, or sexual orientation. Women, people of color, veterans, and LGBTQIA individuals are strongly encouraged to apply."
  },
  {
    "id": "MEM-360-19",
    "position_title": "District Representative/Caseworker",
    "office": "Office of Congresswoman Cindy Axne (IA-03)",
    "location": "Des Moines",
    "posting_date": "2019-08-12",
    "description": "The District Representative/Caseworker acts as a representative for the Congresswoman within his or her area of responsibility. Essential job functions include, but are not limited to: establishing and maintaining relationships with local organizations, community leaders, and elected officials on behalf of the Office; monitoring district and local issues; acting as liaison to federal agencies; handling casework; managing special projects; and assisting with events and other activities. Some travel is required.",
    "responsibilities": [
      "Establishing and maintaining relationships with local organizations, community leaders, and elected officials on behalf of the Office",
      "Monitoring district and local issues",
      "Acting as liaison to federal agencies",
      "Handling casework",
      "Managing special projects",
      "Assisting with events and other activities"
    ],
    "qualifications": [
      "excellent verbal and written communications skills",
      "exceptional organizational skills",
      "the ability to work well in a fast-paced environment",
      "the ability to adapt and be flexible",
      "the ability to anticipate problems, take initiative, and offer solutions",
      "interest in addressing issues affecting Iowans",
      "Familiarity with the state and congressional district is preferred"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, and writing sample (2-3 pages) to Kaitryn.Patchett@mail.house.gov",
    "salary_info": null,
    "contact": "Kaitryn.Patchett@mail.house.gov",
    "equal_opportunity": "This Office is an equal opportunity employer."
  },
  {
    "id": "MEM-357-19",
    "position_title": "Staff Associate",
    "office": "Chairman of the Foreign Affairs Subcommittee on the Western Hemisphere, Civilian Security, and Trade",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "The Staff Associate will serve as a subcommittee staffer coordinating hearings and assisting with preparing legislative documents.",
    "responsibilities": [
      "Handle day to day administration",
      "Subcommittee event coordination",
      "Intern management",
      "Conduct policy research",
      "Draft press and social media statements",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Successful candidates will be enthusiastic, professional, hard-working, and detail-oriented, with strong writing and communication skills and able to work in a fast-paced environment.",
      "Candidates must hold a bachelor’s degree and demonstrate clear interest in U.S. policy toward Latin America and the Western Hemisphere more broadly.",
      "Previous Hill experience is preferred but not required.",
      "Previous relevant work experience is preferred.",
      "Spanish proficiency required."
    ],
    "how_to_apply": "Qualified candidates should send resume and cover letter to WHEMjobs@gmail.com with the subject line “Staff Associate.” No calls or drop-ins.",
    "salary_info": null,
    "contact": "WHEMjobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-344-19",
    "position_title": "Oversight Counsel",
    "office": "House Committee (Democratic Staff)",
    "location": "Washington, D.C.",
    "posting_date": "2019-08-12",
    "description": "House Committee (Democratic Staff) is looking for a proactive, experienced oversight counsel. Responsibilities include planning and conducting congressional oversight and advising in policy matters related to oversight of issues within the committee's jurisdiction. Candidates must possess relevant legal experience, excellent research and writing skills, and strong analytical and communication skills. Must also be a team player and able to work well under pressure and with quick deadlines. Experience with congressional oversight preferred; Hill experience is a plus.\n\nJ.D. is required; please no recent graduates. This is not an entry level position.",
    "responsibilities": [
      "Planning and conducting congressional oversight",
      "Advising in policy matters related to oversight of issues within the committee's jurisdiction"
    ],
    "qualifications": [
      "Relevant legal experience",
      "Excellent research and writing skills",
      "Strong analytical and communication skills",
      "Team player",
      "Able to work well under pressure and with quick deadlines",
      "J.D. is required",
      "Experience with congressional oversight preferred",
      "Hill experience is a plus"
    ],
    "how_to_apply": "Please send cover letter and resume to hsbcdems@gmail.com with the position name in the subject line.",
    "salary_info": null,
    "contact": "hsbcdems@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-337-19",
    "position_title": "Outreach Representative",
    "office": "Progressive U.S. Member of Congress",
    "location": "District Office, Brooklyn area",
    "posting_date": "2019-08-12",
    "description": "Progressive U.S. Member of Congress has an immediate opening for a highly motivated Outreach Representative to join their District Office. This is a full-time position.",
    "responsibilities": [
      "Attending community outreach events on behalf of the Member and District Office",
      "Working with local businesses, merchant associations, community organizations, and agencies to assist them in navigating the services provided by the federal government",
      "Organizing and participating in community projects and events",
      "Developing and executing outreach strategies with the Outreach Director",
      "Serving as liaison to Community Boards, Precincts Councils and Block Associations"
    ],
    "qualifications": [
      "Strong communication, writing and presentation skills",
      "Event planning experience",
      "Knowledge of the District and the greater Brooklyn area",
      "Valid driver’s license preferred",
      "Fluency in Haitian Creole or Russian is highly preferred",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Please send resume and cover letter to NYDemocrat@mail.house.gov",
    "salary_info": null,
    "contact": "NYDemocrat@mail.house.gov",
    "equal_opportunity": "We are an equal opportunity employer that is committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law."
  },
  {
    "id": "MEM-336-19",
    "position_title": "Constituent Services Representative",
    "office": "Progressive U.S. Member of Congress",
    "location": "District Office",
    "posting_date": "2019-08-12",
    "description": "Progressive U.S. Member of Congress has an immediate opening for a highlymotivated Constituent Services Representative to join their District Office.\nThis is a full-time position.",
    "responsibilities": [
      "Developing and executing constituent services plans with Constituent Services Director",
      "Responding to constituent casework",
      "Meeting with constituents",
      "Working with local and federal agencies to navigate relevant services provided",
      "Availability for Evening and Weekend assignments is required."
    ],
    "qualifications": [
      "Must have extraordinary interpersonal skills",
      "Be customer service oriented",
      "Be highly-motivated and organized",
      "Exhibit a professional demeanor and work ethic",
      "Excellent writing skills are required",
      "Strong analytical skills and experience with casework pertaining to issues such as immigration, veterans’ affairs, social security, housing, and more.",
      "Valid driver’s license preferred.",
      "Fluency in Haitian Creole or Russian is highly preferred."
    ],
    "how_to_apply": "Please send resume and cover letter to NYDemocrat@mail.house.gov",
    "salary_info": null,
    "contact": "NYDemocrat@mail.house.gov",
    "equal_opportunity": "We are an equal opportunity employer that is committed to equal treatment of all employees without regard to race, national origin, religion, gender, age, sexual orientation, veteran status, physical or mental disability or other basis protected by law."
  },
  {
    "id": "MEM-334-19",
    "position_title": "Scheduler",
    "office": "Congressman Don Beyer",
    "location": "Washington, DC",
    "posting_date": "2019-08-12",
    "description": "The Office of Congressman Don Beyer seeks a scheduler for his Washington, DC office. The scheduler will manage all aspects of the Member’s daily and long-term schedule in DC and the district. This individual will work closely with the Member, DC staff, and District staff.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the Member",
      "Managing operational and logistical support for all aspects of the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill",
      "Well organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced work environment"
    ],
    "how_to_apply": "Applicants should email a resume, cover letter, and references to Beyerstaff@gmail.com with “Scheduler” in the subject line. No phone calls, faxes, emails, or walk-ins, please.",
    "salary_info": "The salary for this position will be commensurate with experience.",
    "contact": "Beyerstaff@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-330-19",
    "position_title": "Communications Director",
    "office": "Congressman",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "We are looking to expand the Member's visibility and outreach, resulting in a need for highly diligent, confident candidates with substantial experience for the role of Communications Director. Spanish speaking skills preferred.\n\nThe position comes with great responsibility, as our Communications Director is part of the senior staff for the Congressman and responsible for helping in development and promotion of the Member's agenda.\n\nAll aspects of communications are covered, including but not limited to, televised press conferences, statements to the press, speeches, radio addresses and social media. Experience with graphic design is a plus. The selected individual will also work closely with the entire office team to formulate consistent messaging in district mail pieces, and our 499-program.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Anyone interested may send their applications to CongressionalOpenJob@gmail.com",
    "salary_info": "Salary is commensurate with experience. Benefits include paid vacation and sick leave, parking or metro benefits, health insurance and retirement -- Plus an awesome environment!",
    "contact": "CongressionalOpenJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-323-19",
    "position_title": "Communications Director",
    "office": "Southern California Democrat",
    "location": "Capitol Hill",
    "posting_date": "2019-08-12",
    "description": "Southern California Democrat seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, energetic, and hungry!\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\n\nMoreover, the Communications Director will oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; coordinating the Member’s social media accounts; and editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters.\n\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging. The Communications Director is responsible for maintaining the Congressman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congressman’s values and advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. To be considered for the position, candidates must have previous press-related experience either on or off Capitol Hill. They must be highly organized, proficient in multi-tasking, have strong political acumen and instincts, and possess superior writing, editing, and proofreading skills. Fluency in Spanish is a plus. Experience with video editing and graphic design are a plus.\n\nAdditionally, the Communications Director must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive demeanor and good sense of humor.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Develop and execute an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; coordinating the Member’s social media accounts; and editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters.",
      "Work with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
      "Maintain the Congressman’s voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congressman’s values and advocacy to a diverse constituent base."
    ],
    "qualifications": [
      "Must have previous press-related experience either on or off Capitol Hill.",
      "Must be highly organized and proficient in multi-tasking.",
      "Must have strong political acumen and instincts.",
      "Must possess superior writing, editing, and proofreading skills.",
      "Fluency in Spanish is a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive demeanor and good sense of humor."
    ],
    "how_to_apply": "Please e-mail a resume, a cover letter including salary requirements, and two writing samples to CARuizJobs@mail.house.gov with “Communications Director Position” in subject line.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CARuizJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and encourages all qualified candidates to apply."
  },
  {
    "id": "MEM-315-19",
    "position_title": "Press Secretary",
    "office": "Congresswoman Sylvia R. Garcia (TX-29)",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "Congresswoman Sylvia R. Garcia (TX-29) seeks candidates for the position\nof Press Secretary. Candidates must be fluent in Spanish. Ideal candidates\nshould have minimum of two years of successful work on communications\nfor an elected leader or comparable experience, excellent writing abilities, and\nexperience handling press inquiries.\n\nApplicants should be able to communicate effectively about a variety of\npolicy issues. Applicants should also have a proven history of writing creative\nand original copy.\n\nCandidates should be organized, creative, motivated and must have the ability\nto write content that accurately conveys the priorities of the congresswoman\nand the 29th district. Candidates must be able to work effectively in a fastpaced environment, including quickly researching and writing copy.\n\nCandidates should have enough knowledge of video production/editing and\ncreating graphic content that they can assist or fill-in when needed.\n\nThis is NOT an entry level position. The position reports to the Chief of Staff.",
    "responsibilities": [
      "drafting talking points for speaking engagements",
      "writing press releases",
      "developing relationships with members of the media",
      "tracking press and social media analytics",
      "research",
      "A limited policy portfolio will eventually be incorporated into the position."
    ],
    "qualifications": [
      "Candidates must be fluent in Spanish.",
      "Ideal candidates should have minimum of two years of successful work on communications for an elected leader or comparable experience, excellent writing abilities, and experience handling press inquiries.",
      "Applicants should be able to communicate effectively about a variety of policy issues.",
      "Applicants should also have a proven history of writing creative and original copy.",
      "Candidates should be organized, creative, motivated and must have the ability to write content that accurately conveys the priorities of the congresswoman and the 29th district.",
      "Candidates must be able to work effectively in a fastpaced environment, including quickly researching and writing copy.",
      "Candidates should have enough knowledge of video production/editing and creating graphic content that they can assist or fill-in when needed.",
      "Ability to independently produce content in English and Spanish is required."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter, two one-page writing samples (one in English and one in Spanish) to:",
    "salary_info": null,
    "contact": "TX29SG.Resumes@mail.house.gov",
    "equal_opportunity": "THIS OFFICE IS AN EQUAL OPPORTUNITY EMPLOYER: Women and\nminorities are strongly encouraged to apply. The office is an equal\nopportunity employer and does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national\norigin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-279-19",
    "position_title": "Communications Director",
    "office": "Senior Republican Member on Appropriations",
    "location": null,
    "posting_date": "2019-08-12",
    "description": "Senior Republican Member on Appropriations looking for Communications Director. Ideal candidates should have 3-5 years of Hill experience, strong writing skills, are detailed oriented, and familiar working with the media. Salary commensurate with experience.",
    "responsibilities": [],
    "qualifications": [
      "3-5 years of Hill experience",
      "strong writing skills",
      "detailed oriented",
      "familiar working with the media"
    ],
    "how_to_apply": "Interested applicants should send their cover letter, resume and writing samples to TX.JobListing@mail.house.gov",
    "salary_info": "Salary commensurate with experience.",
    "contact": "TX.JobListing@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-252-19",
    "position_title": "Legislative Assistant",
    "office": "Rep. Justin Amash (MI-03)",
    "location": "Washington, DC",
    "posting_date": "2019-08-12",
    "description": "The Office of Rep. Justin Amash (MI-03) is seeking a bright, creative, and\nself-motivated legislative assistant with a background in law to join our\nWashington, DC-based policy team. The legislative assistant will draft\nlegislation, analyze bills, and meet with constituents concerning policy\nmatters, among other duties. The person will be expected to handle a diverse\nportfolio of policy issues.\n\nThe successful applicant will be a libertarian or classical liberal in the\ntradition of F.A. Hayek, Henry Hazlitt, and Frederic Bastiat. The applicant\nmust demonstrate a strong commitment to individual liberty, economic\nfreedom, the Rule of Law, and the Constitution.\n\nThe person also must be an excellent writer and clear thinker willing to take\non the most serious impediments to a freer, more prosperous America. An\nindividual who prefers staid and steady work or who avoids challenges (and\nthe occasional failure) may be more comfortable elsewhere.\n",
    "responsibilities": [
      "Draft legislation",
      "Analyze bills",
      "Meet with constituents concerning policy matters"
    ],
    "qualifications": [
      "Applicants must have a JD or equivalent.",
      "Two years of relevant policy experience is preferred, although Hill experience is not required.",
      "Must demonstrate a strong commitment to individual liberty, economic freedom, the Rule of Law, and the Constitution.",
      "Must be an excellent writer and clear thinker willing to take on the most serious impediments to a freer, more prosperous America."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and two writing samples to\napplydc@amash.com. Please include \"legislative assistant applicant\" in the\nsubject line. No walk-in applicants or phone.",
    "salary_info": null,
    "contact": "applydc@amash.com",
    "equal_opportunity": null
  }
]