[
  {
    "id": "MEM-265-15",
    "position_title": "Legislative Assistant",
    "office": "Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-24",
    "description": "Democratic Member has an opening for a Legislative Assistant to handle a portfolio of judiciary issues and health care, among other issues. Responsibilities will include developing and tracking legislative initiatives, preparing briefing materials, representing the member in meetings with interested parties, and writing constituent mail and floor statements. An ability to work well with others in a fast-paced team environment and strong writing skills, as well as a sense of humor, are a must.\nThe ideal candidate will have a law degree, previous Hill experience, and ties to Maryland.",
    "responsibilities": [
      "Developing and tracking legislative initiatives",
      "Preparing briefing materials",
      "Representing the member in meetings with interested parties",
      "Writing constituent mail and floor statements"
    ],
    "qualifications": [
      "An ability to work well with others in a fast-paced team environment",
      "Strong writing skills",
      "A sense of humor",
      "Law degree",
      "Previous Hill experience",
      "Ties to Maryland"
    ],
    "how_to_apply": "Please send cover letter with salary expectations, resume, two short writing samples, and a list of references with subject line “Legislative Assistant” to 4mdresumes@mail.house.gov. No calls or drop bys, please.",
    "salary_info": null,
    "contact": "4mdresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-261-15",
    "position_title": "Legislative Correspondent/Press Assistant",
    "office": "Colorado Republican",
    "location": "Washington, DC",
    "posting_date": "2015-08-24",
    "description": "Responsibilities include: management of constituent mail and social media accounts; execution of 499 program; drafting op-eds, press releases, and talking points; coordinating media efforts; and working directly with the Communications Director. Applicants should be able to write quickly and effectively in a fast paced environment. Colorado ties and Hill experience a plus.",
    "responsibilities": [
      "Management of constituent mail and social media accounts",
      "Execution of 499 program",
      "Drafting op-eds, press releases, and talking points",
      "Coordinating media efforts",
      "Working directly with the Communications Director"
    ],
    "qualifications": [
      "Ability to write quickly and effectively in a fast paced environment",
      "Colorado ties a plus",
      "Hill experience a plus"
    ],
    "how_to_apply": "Please send a cover letter, writing sample, and resume to ColoradoRepublican06@gmail.com.",
    "salary_info": null,
    "contact": "ColoradoRepublican06@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-255-15",
    "position_title": "Press Assistant/Legislative Correspondent",
    "office": "Congressman Jeff Denham (CA-10)",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-24",
    "description": "The office of Congressman Jeff Denham (CA-10) seeks a motivated, organized, reliable and detail-oriented candidate to fill the position of Press Assistant/Legislative Correspondent in Washington, D.C.\n\nThe press assistant will assist the communications director in drafting statements and releases, creating graphics, compiling daily clips, preparing remarks and implementing social media strategies. This individual will also assist with an aggressive franked mail program and with legislative research.",
    "responsibilities": [
      "Assist the communications director in drafting statements and releases",
      "Creating graphics",
      "Compiling daily clips",
      "Preparing remarks",
      "Implementing social media strategies",
      "Assist with an aggressive franked mail program",
      "Assist with legislative research"
    ],
    "qualifications": [
      "Strong writing skills",
      "Familiarity with IQ",
      "Graphic design experience",
      "Hill experience preferred but not required",
      "Familiarity with Spanish language preferred but not required"
    ],
    "how_to_apply": "Please send your resume, cover letter and a brief writing sample to Jordan.langdon@mail.house.gov.",
    "salary_info": null,
    "contact": "Jordan.langdon@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-254-15",
    "position_title": "Deputy Press Secretary",
    "office": "Committee on Agriculture, Majority, of the U.S. House of Representatives",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-24",
    "description": "The Deputy Press Secretary will be responsible for, but not limited to, the following duties: compile news clips; create visually compelling graphics, videos, and photographs; maintain the database of reporter contact information; help the Press Secretary update social media; send out press releases; update and post materials on the website; and help the Press Secretary and Communications Director at Committee hearings and markups.\n\nCandidates should have strong writing, editing, and proofreading skills; strong communication skills; knowledge of Adobe Photoshop, Illustrator, and InDesign and the ability to create graphics and presentations; proficiency in AP style; an understanding of print, broadcast, and online media; a thorough knowledge of the legislative process, including procedures and organization of the House; knowledge of current issues and events in which the Committee is involved; a willingness to learn; and the ability to receive constructive criticism. Candidates should work well under pressure. They should also have the ability to exercise discretion and independent judgment in the representation of the Chairman’s position on policy issues.\n\nCandidates should have the ability to work cooperatively and courteously with others and a temperament to communicate with a variety of personalities in a tactful and professional manner.",
    "responsibilities": [
      "compile news clips",
      "create visually compelling graphics, videos, and photographs",
      "maintain the database of reporter contact information",
      "help the Press Secretary update social media",
      "send out press releases",
      "update and post materials on the website",
      "help the Press Secretary and Communications Director at Committee hearings and markups"
    ],
    "qualifications": [
      "strong writing, editing, and proofreading skills",
      "strong communication skills",
      "knowledge of Adobe Photoshop, Illustrator, and InDesign and the ability to create graphics and presentations",
      "proficiency in AP style",
      "an understanding of print, broadcast, and online media",
      "a thorough knowledge of the legislative process, including procedures and organization of the House",
      "knowledge of current issues and events in which the Committee is involved",
      "a willingness to learn",
      "the ability to receive constructive criticism",
      "ability to work well under pressure",
      "ability to exercise discretion and independent judgment in the representation of the Chairman’s position on policy issues",
      "ability to work cooperatively and courteously with others",
      "temperament to communicate with a variety of personalities in a tactful and professional manner"
    ],
    "how_to_apply": "Interested applicants should send a cover letter and resume to AgRepublicanPressJob@mail.house.gov.\nThe body of the email must include the name and contact information for 3 references. Reference letters will not be accepted.\nInclude 2-3 writing samples of relevant press materials.\nNo telephone calls, faxes, or drop-ins, please.",
    "salary_info": "Commensurate with experience",
    "contact": "AgRepublicanPressJob@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-249-15",
    "position_title": "Legislative Assistant",
    "office": "Texas Democrat",
    "location": "Hill",
    "posting_date": "2015-08-24",
    "description": "Active Texas Democrat seeking enthusiastic, well-organized Legislative\nAssistant in a fast-paced team-oriented office. Applicant must be able to\nmulti-task, have strong work ethic and the ability to work flexible hours.\nIdeal candidate should have at least 1-2 years of Hill legislative experience\ncoupled with some knowledge of finance and healthcare policy. This is NOT\nan entry-level position. Individual interested in this position must have strong\nwritten and oral communication skills and the ability to work under pressure\nto meet deadlines. Job description includes assisting the Legislative\nDirector/Deputy Chief of Staff in managing the Congressman's legislative\nagenda, drafting talking points, floor statements, Congressional Record\nentries, briefing memos, hearing questions as well as representing the\nCongressman at meetings both on and off the hill and in the district. Texas\nties are a plus.",
    "responsibilities": [
      "Assisting the Legislative Director/Deputy Chief of Staff in managing the Congressman's legislative agenda",
      "Drafting talking points",
      "Drafting floor statements",
      "Drafting Congressional Record entries",
      "Drafting briefing memos",
      "Drafting hearing questions",
      "Representing the Congressman at meetings both on and off the hill and in the district"
    ],
    "qualifications": [
      "Ability to multi-task",
      "Strong work ethic",
      "Ability to work flexible hours",
      "At least 1-2 years of Hill legislative experience",
      "Knowledge of finance and healthcare policy",
      "Strong written and oral communication skills",
      "Ability to work under pressure to meet deadlines",
      "Texas ties are a plus"
    ],
    "how_to_apply": "Please e-mail resume and cover letter to TXLegislativeAssistant@Mail.House.Gov. NO PHONE CALLS OR DROP-BYS PLEASE.",
    "salary_info": null,
    "contact": "TXLegislativeAssistant@Mail.House.Gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-248-15",
    "position_title": "Scheduler",
    "office": "Republican Member",
    "location": "Capitol Hill",
    "posting_date": "2015-08-24",
    "description": "The scheduler will work closely with the Chief of Staff to manage and prepare the Member’s schedule, respond to scheduling requests and proactively arrange meetings, arrange the Member’s travel, coordinate with district staff, and maintain administrative demands. This is not an entry level position.",
    "responsibilities": [
      "Manage and prepare the Member’s schedule",
      "Respond to scheduling requests and proactively arrange meetings",
      "Arrange the Member’s travel",
      "Coordinate with district staff",
      "Maintain administrative demands"
    ],
    "qualifications": [
      "At least one year of Capitol Hill scheduling experience",
      "Knowledge of the Congressional work setting",
      "Ability to juggle multiple demands under pressure",
      "Maturity, confidentiality, and discretion are essential",
      "Owning or having consistent access to a car is preferred",
      "Ties to the Northeast"
    ],
    "how_to_apply": "POC for resumes submission: Matt.Hutson@mail.house.gov.",
    "salary_info": null,
    "contact": "Matt.Hutson@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-245-15",
    "position_title": "Legislative Director",
    "office": "West Coast Democrat",
    "location": null,
    "posting_date": "2015-08-24",
    "description": "West Coast Democrat is seeking highly organized, hard-working legislative director with extensive knowledge of the legislative process and House Rules. Applicants must have LD experience or a minimum of 3 years Senior LA experience and demonstrate an ability to manage and mentor staff, think strategically, develop and implement legislative plans and achieve results. A successful candidate will have excellent writing, analytical, and oral communications skills along with a good sense of humor.",
    "responsibilities": [],
    "qualifications": [
      "LD experience or a minimum of 3 years Senior LA experience",
      "Ability to manage and mentor staff",
      "Ability to think strategically",
      "Ability to develop and implement legislative plans",
      "Ability to achieve results",
      "Excellent writing skills",
      "Analytical skills",
      "Oral communications skills",
      "Good sense of humor"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume and two short writing samples to westcoastdem2015@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "westcoastdem2015@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-244-15",
    "position_title": "Staff Assistant",
    "office": "West Virginia Republican Congressman",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-24",
    "description": "Duties will include managing front office desk, answering telephones, greeting visitors, conducting and organizing tours, processing flag requests and assisting D.C. staff with various projects.",
    "responsibilities": [
      "Managing front office desk",
      "Answering telephones",
      "Greeting visitors",
      "Conducting and organizing tours",
      "Processing flag requests",
      "Assisting D.C. staff with various projects"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Time management skills",
      "Writing skills",
      "West Virginia ties are preferred"
    ],
    "how_to_apply": "Please send a cover letter and resume to WV03Job@gmail.com with “Staff Assistant” listed in the subject header. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "WV03Job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-221-15",
    "position_title": "Staff Assistant",
    "office": "Tennessee Democratic Congressman",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-24",
    "description": "Duties will include managing front desk, greeting visitors, answering telephones, conducting and organizing tours, processing flag requests, assisting the D.C. staff on various projects, maintaining office equipment and supplies, writing member's correspondence, and serving as intern coordinator.",
    "responsibilities": [
      "Managing front desk",
      "Greeting visitors",
      "Answering telephones",
      "Conducting and organizing tours",
      "Processing flag requests",
      "Assisting the D.C. staff on various projects",
      "Maintaining office equipment and supplies",
      "Writing member's correspondence",
      "Serving as intern coordinator"
    ],
    "qualifications": [
      "Extraordinary organizational skills",
      "Outstanding time management skills",
      "Excellent writing skills",
      "Superlative communications skills",
      "Familiarity with the Microsoft Office Suite",
      "Positive attitude",
      "Sense of humor"
    ],
    "how_to_apply": "Please e-mail cover letter and resume to cohen.jobs@mail.house.gov.\nAbsolutely no phone calls, e-mails or walk-ins, please.",
    "salary_info": null,
    "contact": "cohen.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-213-15",
    "position_title": "Legislative Correspondent",
    "office": "Northern California Democrat",
    "location": null,
    "posting_date": "2015-08-24",
    "description": "Primary responsibilities include coordinating an active mail program with quick response time, researching legislative issues, and drafting responses to constituent inquires. Candidates should have excellent organizational and written skills and the ability to work well as part of a team. This is not an entry level job and previous Hill experience is preferred.",
    "responsibilities": [
      "Coordinating an active mail program with quick response time",
      "Researching legislative issues",
      "Drafting responses to constituent inquires"
    ],
    "qualifications": [
      "Excellent organizational and written skills",
      "Ability to work well as part of a team",
      "Previous Hill experience is preferred"
    ],
    "how_to_apply": "Please send a cover letter, resume, and two recent writing samples to CADemocratResumes@gmail.com.",
    "salary_info": null,
    "contact": "CADemocratResumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-210-15",
    "position_title": "Staff Assistant",
    "office": "Congressman Xavier Becerra",
    "location": "District Office",
    "posting_date": "2015-08-24",
    "description": "As the primary administrative staff member in the District Office, Staff Assistant duties include (but are not limited to): answer phones; handle mail and faxes; greet and direct visitors; maintain order and efficiency of front and back offices; order supplies; organize office files; coordinate vendor service needs; research the status of some legislation; draft some correspondence.\n\nWork on special projects as needed. In the absence of the District Scheduler, the Staff Assistant will serve as back-up and help facilitate any scheduling requests.\n\nCasework duties include (but are not limited to): Assist constituents with their individual cases pertaining to federal agencies. As the “front-line” caseworker, help constituents with non-federal questions to find appropriate resources.\n\nThis position may require work on weekends and holidays.",
    "responsibilities": [
      "Answer phones",
      "Handle mail and faxes",
      "Greet and direct visitors",
      "Maintain order and efficiency of front and back offices",
      "Order supplies",
      "Organize office files",
      "Coordinate vendor service needs",
      "Research the status of some legislation",
      "Draft some correspondence",
      "Work on special projects as needed",
      "Serve as back-up for the District Scheduler and help facilitate any scheduling requests",
      "Assist constituents with their individual cases pertaining to federal agencies",
      "Help constituents with non-federal questions to find appropriate resources"
    ],
    "qualifications": [
      "Strong written, communication, analytical, and organization skills",
      "An ability to relate well with individuals of diverse backgrounds",
      "Impeccable customer service manners",
      "Bachelor’s degree required",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point",
      "Candidate must have an understanding of government agencies and structure (local, county, state and federal)",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines and balance multiple projects",
      "Attention to detail and accuracy is essential",
      "Candidate should demonstrate a positive attitude, commitment to excellence, upbeat demeanor and flexibility",
      "Bilingual skills a plus"
    ],
    "how_to_apply": "All interested individuals should email a cover letter and resume to Resume.California@mail.house.gov. No phone calls please.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "Resume.California@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-207-15",
    "position_title": "Legislative Assistant",
    "office": "Conservative Texan",
    "location": "Washington, DC",
    "posting_date": "2015-08-24",
    "description": "Legislative responsibilities will include, but are not limited to, Agriculture, Energy, Taxes, Judiciary, Environment, and Veterans issues, as well as, drafting memos and providing voting recommendations.",
    "responsibilities": [
      "Agriculture",
      "Energy",
      "Taxes",
      "Judiciary",
      "Environment",
      "Veterans issues",
      "Drafting memos",
      "Providing voting recommendations"
    ],
    "qualifications": [
      "Strong writing and organizational skills",
      "Capitol Hill experience and Texas ties are strongly preferred"
    ],
    "how_to_apply": "All prospective applicants can email cover letter, resume, and writing sample to TXGOPJob@gmail.com.",
    "salary_info": null,
    "contact": "TXGOPJob@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-197-15",
    "position_title": "Executive Assistant/Office Manager",
    "office": "Rep. Keith Ellison (MN-05)",
    "location": "Washington, D.C.",
    "posting_date": "2015-08-24",
    "description": "The Executive Assistant/Office Manager will manage and prepare the Member's schedule, respond to all scheduling requests, arrange the Member's travel, and provide and assist with local travel. The Executive Assistant/Office Manager will order and maintain office supplies, will maintain office personnel files, and will work closely with the staff assistant and interns. This position requires candidates with proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member and his Chief of Staff.",
    "responsibilities": [
      "Manage and prepare the Member's schedule",
      "Respond to all scheduling requests",
      "Arrange the Member's travel",
      "Provide and assist with local travel",
      "Order and maintain office supplies",
      "Maintain office personnel files",
      "Work closely with the staff assistant and interns"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member and his Chief of Staff",
      "Strong written and oral communication skills",
      "Superior organizational skills",
      "Attention to detail",
      "Ability to work in an extremely fast paced office",
      "Flexibility to work late hours on short notice",
      "Owning or having consistent access to a car is required",
      "Minnesota ties a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and writing sample to mn05position@mail.house.gov. Please include references.",
    "salary_info": null,
    "contact": "mn05position@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-153-15",
    "position_title": "Legislative Director",
    "office": "Established Member of Congress from the southeastern US",
    "location": null,
    "posting_date": "2015-08-24",
    "description": "LD will be responsible for driving member legislative initiatives, briefing the member on all policy matters, meeting with relevant public interest groups and constituents, providing real time vote recommendations, and assisting the Chief of Staff on policy matters.\nPosition requires a comprehensive knowledge of House procedures as well as a working knowledge of all current issues debated in the House. Teamoriented skill, outgoing personality, and attention to detail are requirements and staff members with ties to the southeast will be given special consideration.",
    "responsibilities": [
      "Driving member legislative initiatives",
      "Briefing the member on all policy matters",
      "Meeting with relevant public interest groups and constituents",
      "Providing real time vote recommendations",
      "Assisting the Chief of Staff on policy matters"
    ],
    "qualifications": [
      "Current/previous Legislative Directors or Senior Legislative Assistants with experience",
      "Comprehensive knowledge of House procedures",
      "Working knowledge of all current issues debated in the House",
      "Teamoriented skill",
      "Outgoing personality",
      "Attention to detail",
      "Ties to the southeast will be given special consideration"
    ],
    "how_to_apply": "Please send a cover letter, resume, and salary requirements to USHouseStaffJob@gmail.com.",
    "salary_info": null,
    "contact": "USHouseStaffJob@gmail.com",
    "equal_opportunity": null
  }
]