[
  {
    "id": "MEM-036-15",
    "position_title": "Intern",
    "office": "New Jersey Democratic Congressman Frank Pallone (NJ-06)",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "We are seeking personable, hardworking and motivated individuals with excellent oral and written communication skills.\nJob duties will include, but are not limited to: answering phones, assisting staffers with general administrative duties, attending briefings, drafting letters to constituents, and conducting congressional research. New Jersey ties are strongly preferred, but not necessary. A good sense of humor is a plus.",
    "responsibilities": [
      "Answering phones",
      "Assisting staffers with general administrative duties",
      "Attending briefings",
      "Drafting letters to constituents",
      "Conducting congressional research"
    ],
    "qualifications": [
      "Personable",
      "Hardworking",
      "Motivated",
      "Excellent oral and written communication skills",
      "New Jersey ties are strongly preferred, but not necessary",
      "A good sense of humor is a plus"
    ],
    "how_to_apply": "Please email a resume, cover letter, and references to thomas.egan@mail.house.gov, please include your dates and times of availability.",
    "salary_info": "unpaid",
    "contact": "thomas.egan@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-032-15",
    "position_title": "Press Intern",
    "office": "Committee on Education and the Workforce, Democratic Staff",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "The Committee on Education and the Workforce, Democratic Staff is currently\r\nseeking a press intern who would be able to start immediately. Applicants can be\r\nundergraduate or graduate and be willing to commit through mid-May. Interns\r\nperform a variety of tasks that support the staff in our legislative and media work.",
    "responsibilities": [
      "Helping organize and staff Committee press conferences, events and calls",
      "Updating and maintaining social media accounts",
      "Press list and contact management",
      "Drafting of talking points and press releases",
      "Assisting with the production of daily news clips relating to Committee issues",
      "Perform administrative duties related to running the front office"
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should email their cover letter and resume to\r\njobs_ewdems@mail.house.gov. Please include two short, relevant writing\r\nsamples in your application materials. Please visit our website at\r\nhttp://democrats.edworkforce.house.gov/about/internships for more information.",
    "salary_info": null,
    "contact": "jobs_ewdems@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-031-15",
    "position_title": "Intern",
    "office": "Congressman John Ratcliffe (TX-04)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "The Office of Congressman John Ratcliffe (TX-04) is currently seeking interns for the Washington, D.C. office for the Spring 2015 semester.",
    "responsibilities": [
      "Assisting staff with general office duties",
      "Attending hearings/briefings for staff members",
      "Answering phones",
      "Sorting through mail",
      "Drafting response letters",
      "Giving tours of the U.S. Capitol"
    ],
    "qualifications": [
      "Candidates should be highly motivated",
      "Have good communication skills",
      "Having Texas ties is a plus"
    ],
    "how_to_apply": "All interested applicants should send a cover letter and resume to Robert.peters@mail.house.gov.",
    "salary_info": "This position is unpaid, but does offer a great educational experience for anyone with aspirations of working on the Hill.",
    "contact": "Robert.peters@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-029-15",
    "position_title": "Intern",
    "office": "Arizona Democrat",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "Responsibilities include, but aren't limited to, answering phone calls, assisting with the mail program, providing constituent tours, attending briefings, or providing research for the legislative staff. Qualified candidates will have exceptional writing skills, strong communication skills, ability to work in a fast paced working environment, and have an interest in learning more about the legislative process.",
    "responsibilities": [
      "Answering phone calls",
      "Assisting with the mail program",
      "Providing constituent tours",
      "Attending briefings",
      "Providing research for the legislative staff"
    ],
    "qualifications": [
      "Exceptional writing skills",
      "Strong communication skills",
      "Ability to work in a fast paced working environment",
      "Interest in learning more about the legislative process"
    ],
    "how_to_apply": "Send a resume and a cover letter to azdcinternships@gmail.com.",
    "salary_info": null,
    "contact": "azdcinternships@gmail.com",
    "equal_opportunity": "Individuals with Arizona ties, women, and minorities are strongly encouraged to apply."
  },
  {
    "id": "MEM-028-15",
    "position_title": "Summer 2015 Internship",
    "office": "Republican Office of the Committee on Science, Space, and Technology",
    "location": "House of Representatives",
    "posting_date": "2015-01-26",
    "description": "The Republican Office of the Committee on Science, Space, and Technology seeks energetic and self-motivated undergraduate or graduate level students, as well as recent graduates, with an interest in government and public policy for Summer 2015 internship. Working closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), oversight, research, assisting with phone inquiries and providing support to all Committee staff. Background in science a plus.",
    "responsibilities": [
      "Assisting Committee staff with official proceedings (hearings/markups)",
      "Oversight",
      "Research",
      "Assisting with phone inquiries",
      "Providing support to all Committee staff"
    ],
    "qualifications": [
      "Energetic and self-motivated undergraduate or graduate level students, as well as recent graduates",
      "Interest in government and public policy",
      "Background in science a plus"
    ],
    "how_to_apply": "To apply, please send resume and cover letter to ashley.smith@mail.house.gov.",
    "salary_info": null,
    "contact": "ashley.smith@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-027-15",
    "position_title": "Intern",
    "office": "Michigan Office",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "Intern will report to the Intern Coordinator and Chief of Staff.",
    "responsibilities": [
      "performs research (CRS, the Library of Congress, MIN, or other available resources)",
      "sorts and distributes mail",
      "attends committee meetings, intern conferences, and seminars",
      "performs data entry, which involves logging in letters and constituent requests, including names and addresses of constituents",
      "answers the telephones",
      "checks faxes",
      "notes constituent opinions, including their full names, addresses, and all relevant information",
      "greets visitors and signs for deliveries",
      "performs other duties as assigned"
    ],
    "qualifications": [
      "good oral and written communication skills",
      "ability to work cooperatively and courteously with others",
      "flexible schedule - Wednesday work day required",
      "able to work at least 12 hours a week",
      "ability to maintain calm in a high stress environment",
      "preference for students from Michigan",
      "good organizational skills",
      "responsible, dependable and willing to learn"
    ],
    "how_to_apply": "SEND ALL RESUMES AND ONE WRITING SAMPLE TO:",
    "salary_info": null,
    "contact": "CapitolHill14@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-15",
    "position_title": "Spring Internship",
    "office": "Office of Representative Stephen Fincher (TN-08)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "The office of Representative Stephen Fincher (TN-08) is looking for motivated interns for the 2015 Spring semesters in the Washington, D.C. office. Intern responsibilities include assisting the staff with general office duties, attending briefings and hearings, answering phones, sorting mail, giving Capitol tours, and performing various other tasks based on ability and interests. Applicants must possess strong communication skills, have a positive attitude and be well-organized. Internship may be full-time or part-time to fit applicant's schedule. Tennessee ties preferred, but not required.",
    "responsibilities": [
      "Assisting the staff with general office duties",
      "Attending briefings and hearings",
      "Answering phones",
      "Sorting mail",
      "Giving Capitol tours",
      "Performing various other tasks based on ability and interests"
    ],
    "qualifications": [
      "Must possess strong communication skills",
      "Have a positive attitude",
      "Be well-organized"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to TN08.Intern@mail.house.gov.",
    "salary_info": null,
    "contact": "TN08.Intern@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-021-15",
    "position_title": "Spring 2015 Internship Program",
    "office": "Republican office of the Committee on House Administration",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "The Republican office of the Committee on House Administration seeks energetic and self-motivated individuals with an interest in government and public policy, to apply for its full-time Spring 2015 internship program.\nWorking closely with Committee staff, interns will have the opportunity to gain first-hand knowledge of the inner-workings of a congressional committee and learn about the day-to-day administrative operations of the House of Representatives. Interns are responsible for assisting Committee staff with official proceedings (hearings/markups), oversight, research, assisting with phone inquiries, and providing support to all Committee staff. This is a paid internship.",
    "responsibilities": [
      "Assisting Committee staff with official proceedings (hearings/markups)",
      "Oversight",
      "Research",
      "Assisting with phone inquiries",
      "Providing support to all Committee staff"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a cover letter and one page resume to CHARep.Intern@mail.house.gov.",
    "salary_info": "This is a paid internship.",
    "contact": "CHARep.Intern@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-019-15",
    "position_title": "Intern",
    "office": "Congressman Alex X. Mooney (WV-2)",
    "location": "Capitol Hill",
    "posting_date": "2015-01-26",
    "description": "The office of Congressman Alex X. Mooney (WV-2) is seeking full-time, paid and/or unpaid interns for Spring 2015 with immediate availability. Ideal candidates should be strong conservatives with excellent verbal and written communication skills. West Virginia ties are preferred, but not required.",
    "responsibilities": [
      "Answering phones and greeting visitors",
      "Sorting and inputting mail into IQ",
      "Facilitating Capitol tours",
      "Attending meetings/hearings",
      "Assisting staff"
    ],
    "qualifications": [
      "Strong conservatives",
      "Excellent verbal and written communication skills",
      "West Virginia ties are preferred, but not required"
    ],
    "how_to_apply": "Interested candidates should email their resume to Sean McMahon at sean.mcmahon@mail.house.gov with the subject line “Internship Application”.",
    "salary_info": null,
    "contact": "Sean McMahon, sean.mcmahon@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-15",
    "position_title": "Unpaid Intern",
    "office": "Democratic Member of the House",
    "location": "Washington, DC",
    "posting_date": "2015-01-26",
    "description": "Interested applicants submit a resume to Bklynny09@gmail.com.",
    "responsibilities": [
      "To assist in performing research, processing the mail, data entry, reception duties and other office errands, and",
      "To draft floor statements, speeches and memorandums on legislative issues."
    ],
    "qualifications": [
      "Must be a current student - with student identification",
      "Good oral and written communication skills;",
      "Ability to work cooperatively and courteously with others;",
      "Good organizational skills; and",
      "Responsible, dependable and willing to learn.",
      "Flexible schedule - a minimum of 12 hours of work per week, Wednesday work day required."
    ],
    "how_to_apply": "Interested applicants submit a resume to Bklynny09@gmail.com.",
    "salary_info": null,
    "contact": "Bklynny09@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-015-15",
    "position_title": "Unpaid Intern",
    "office": "Democratic Member of the House",
    "location": "Washington, DC",
    "posting_date": "2015-01-26",
    "description": "Responsibilities include assisting with social media campaigns and strategies, writing press releases, talking points and memos, conducting research and assisting the Press Staff with the day-to-day operations.\n\nCandidate should be energetic, enthusiastic and able to thrive in a fast-paced working environment. Creativity is a must. Previous experience in politics and press are not required but candidates should have a general understanding of the governmental process, knowledge of North Carolina, and interest in communications.",
    "responsibilities": [
      "Assisting with social media campaigns and strategies",
      "Writing press releases, talking points and memos",
      "Conducting research",
      "Assisting the Press Staff with the day-to-day operations"
    ],
    "qualifications": [
      "Energetic, enthusiastic, and able to thrive in a fast-paced working environment",
      "Creativity is a must",
      "General understanding of the governmental process",
      "Knowledge of North Carolina",
      "Interest in communications"
    ],
    "how_to_apply": "If interested, please send a cover letter and resume via email",
    "salary_info": null,
    "contact": "NCCongressionalJobs@gmail.com (subject line should read: Social Media Intern). Absolutely no phone calls, e-mails or walk-ins, please.",
    "equal_opportunity": "Minorities and women encouraged to apply, North Carolina ties preferred but not required."
  },
  {
    "id": "MEM-013-15",
    "position_title": "Press Intern",
    "office": "Office of Representative Sam Farr (CA-20)",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "Intern will be responsible for accumulating daily press clips, monitoring local news outlets, drafting social media statements and press releases and generally assisting the Communications Director. Intern will also be asked to assist staff with phones, mail, research, mail correspondence, and constituent tours. CA ties a plus. Sense of humor mandatory! Students welcome to apply.",
    "responsibilities": [
      "Accumulating daily press clips",
      "Monitoring local news outlets",
      "Drafting social media statements and press releases",
      "Assisting the Communications Director",
      "Assisting staff with phones, mail, research, mail correspondence, and constituent tours"
    ],
    "qualifications": [
      "CA ties a plus",
      "Sense of humor mandatory!",
      "Students welcome to apply"
    ],
    "how_to_apply": "Please send resumes and a brief writing sample to Morgan.Keese@mail.house.gov",
    "salary_info": null,
    "contact": "Morgan.Keese@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-012-15",
    "position_title": "Unpaid Intern",
    "office": "Representative Marcia L. Fudge",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "Intern responsibilities include assisting the staff with general office duties, attending briefings and hearings, answering phones, sorting mail, giving Capitol tours, and performing various other tasks as assigned.",
    "responsibilities": [
      "Assisting the staff with general office duties",
      "Attending briefings and hearings",
      "Answering phones",
      "Sorting mail",
      "Giving Capitol tours",
      "Performing various other tasks as assigned"
    ],
    "qualifications": [
      "Strong communication skills",
      "Positive attitude",
      "Well-organized",
      "Ohio ties preferred, but not required"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and writing sample to District11resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "District11resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-011-15",
    "position_title": "Legislative Intern",
    "office": "Chairman Candice S. Miller (R-MI)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "Interns will work in a fast-paced congressional office, gaining valuable exposure and knowledge of the legislative process and the United States Congress.\n\nInterns will also have the opportunity to conduct historical tours of the Capitol, assist with constituent correspondence, and attend legislative briefings, congressional hearings, receptions, and press events.",
    "responsibilities": [
      "Legislative research and writing",
      "Constituent relations",
      "Assisting staff with administrative tasks",
      "Conduct historical tours of the Capitol",
      "Assist with constituent correspondence",
      "Attend legislative briefings, congressional hearings, receptions, and press events"
    ],
    "qualifications": [
      "Good attitude",
      "Strong work ethic",
      "Excellent written and oral communication skills",
      "Ability to find information with little assistance",
      "Ability to work both independently as well as part of a team environment",
      "Strong attention to detail",
      "Working knowledge of current events and policy topics",
      "Willingness to perform a variety of tasks and administrative functions",
      "Michigan ties are strongly preferred; however, candidates from outside the state will be considered",
      "Undergraduate students are strongly encouraged to apply"
    ],
    "how_to_apply": "Send a cover letter, resume, and brief writing sample to MI10Intern@gmail.com",
    "salary_info": "This is an unpaid position but a great opportunity for students seeking academic credit, and the hours are flexible to accommodate the intern’s schedule.",
    "contact": "MI10Intern@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-008-15",
    "position_title": "Congressional Internship",
    "office": "Democratic Congressman",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "Democratic Congressman seeks applicants for full- or part-time unpaid congressional internship for Spring 2015. Duties will include conducting legislative research, drafting memos, assisting with front office duties, and performing basic administrative tasks.",
    "responsibilities": [
      "Conducting legislative research",
      "Drafting memos",
      "Assisting with front office duties",
      "Performing basic administrative tasks"
    ],
    "qualifications": [
      "Candidates must exhibit strong writing and communication skills.",
      "California residents or strong ties to San Diego are preferred."
    ],
    "how_to_apply": "Please send a resume, cover letter and writing sample to ca52internships@gmail.com with “Spring Congressional Internship” in the subject line.",
    "salary_info": "unpaid",
    "contact": "ca52internships@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-006-15",
    "position_title": "Congressional Intern",
    "office": "Representative Debbie Dingell (D-MI)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "This internship position will provide individuals the opportunity to work in a fast-paced Congressional office while receiving hands-on political experience. Duties include answering phones, leading U.S. Capitol tours and assisting staff members with research and special projects. There will also be frequent opportunities to attend legislative hearings of personal interest. The ideal candidate will be motivated; detail orientated and possesses strong communication and writing skills. This is a great opportunity for recent graduates seeking Hill experience. Michigan ties are preferred.",
    "responsibilities": [
      "Answering phones",
      "Leading U.S. Capitol tours",
      "Assisting staff members with research and special projects",
      "Attend legislative hearings of personal interest"
    ],
    "qualifications": [
      "Motivated",
      "Detail orientated",
      "Strong communication and writing skills",
      "Michigan ties are preferred"
    ],
    "how_to_apply": "Interested applicants should submit a resume and cover letter to kevin.rambosk@mail.house.gov.",
    "salary_info": null,
    "contact": "kevin.rambosk@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-005-15",
    "position_title": "Intern",
    "office": "Representative Kevin Brady (TX-08)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "The Office of Representative Kevin Brady (TX-08) is currently seeking paid fulltime interns to start immediately in our Washington, D.C. office. Qualified candidates are well organized, with good oral and written communication skills, and possess a strong interest in learning about the political process and congressional affairs. Duties include but are not limited to, answering phones, compiling briefing binders, batching mail, performing legislative research, and attending briefings. Interns interact heavily with constituents so a positive attitude is a must. Applicants must be detail oriented with a strong work ethic and an eagerness to represent the 8th district of Texas. Previous Hill experience not required.",
    "responsibilities": [
      "Answering phones",
      "Compiling briefing binders",
      "Batching mail",
      "Performing legislative research",
      "Attending briefings"
    ],
    "qualifications": [
      "Well organized",
      "Good oral and written communication skills",
      "Strong interest in learning about the political process and congressional affairs",
      "Positive attitude",
      "Detail oriented",
      "Strong work ethic",
      "Eagerness to represent the 8th district of Texas"
    ],
    "how_to_apply": "Interested Candidates should send a resume and cover letter to: TX08intern@gmail.com.",
    "salary_info": null,
    "contact": "TX08intern@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-002-15",
    "position_title": "Intern",
    "office": "Florida Republican",
    "location": "Capitol Hill",
    "posting_date": "2015-01-26",
    "description": "Interns will work in a fast-paced Congressional Office, gaining valuable exposure and knowledge of the legislative process and the United States Congress. Our office is looking for an intern with a positive attitude, strong work ethic, and excellent written and oral communication skills. Successful interns will be self-starters, take and listen to direction, and be willing to work both independently as well as part of a team environment. Applicants should have a willingness to assist with daily office tasks. Florida ties preferred, but not required. Interns must be able to commit three full days a week (9:00am-6:00pm during Session and 9:00am-5:00pm during Congressional Recess) at minimum. Students welcome to apply.",
    "responsibilities": [
      "Greeting constituents",
      "Handling constituent phone calls",
      "Opening and sorting mail",
      "Assisting staff with administrative tasks",
      "Conduct legislative research",
      "Attend Capitol Hill briefings, congressional hearings and receptions"
    ],
    "qualifications": [
      "Positive attitude",
      "Strong work ethic",
      "Excellent written and oral communication skills",
      "Self-starter",
      "Ability to take and listen to direction",
      "Ability to work independently and as part of a team",
      "Willingness to assist with daily office tasks",
      "Florida ties preferred, but not required",
      "Ability to commit three full days a week (9:00am-6:00pm during Session and 9:00am-5:00pm during Congressional Recess) at minimum",
      "Students welcome to apply"
    ],
    "how_to_apply": "Those interested please send resume and cover letter to FL26Internships@gmail.com.",
    "salary_info": null,
    "contact": "FL26Internships@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-001-15",
    "position_title": "Intern",
    "office": "Congressman C.A. Dutch Ruppersberger",
    "location": "Timonium",
    "posting_date": "2015-01-26",
    "description": "Interns will assist the Congressman and his staff in the overall day-to-day operations of the office by drafting letters of correspondence, processing mail, answering telephones, greeting visitors, and other duties as needed.\n\nWe are a small but fast-paced office and every effort will be made to give interns a worthwhile learning experience. Our internship positions are part-time and unpaid. A minimum time commitment is required. Candidates should be professional, possess strong oral and written communication skills, and have the ability to multitask. Applicants with Maryland ties will be given preference.",
    "responsibilities": [
      "Drafting letters of correspondence",
      "Processing mail",
      "Answering telephones",
      "Greeting visitors",
      "Other duties as needed"
    ],
    "qualifications": [
      "Professional",
      "Strong oral and written communication skills",
      "Ability to multitask",
      "Applicants with Maryland ties will be given preference"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume by January 31st to David.Heitlinger@mail.house.gov with Spring 2015 Internship in the subject line.",
    "salary_info": "unpaid",
    "contact": "David.Heitlinger@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-412-14",
    "position_title": "Congressional Internship",
    "office": "Democratic Congressman",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "Duties will include conducting legislative research, drafting memos, assisting with front office duties, and performing basic administrative tasks. Candidates must exhibit strong writing and communication skills. California residents or strong ties to San Diego are preferred.",
    "responsibilities": [
      "Conducting legislative research",
      "Drafting memos",
      "Assisting with front office duties",
      "Performing basic administrative tasks"
    ],
    "qualifications": [
      "Strong writing and communication skills",
      "California residents or strong ties to San Diego are preferred"
    ],
    "how_to_apply": "Please send a resume, cover letter and writing sample to ca52internships@gmail.com with “Spring Congressional Internship” in the subject line.",
    "salary_info": "unpaid",
    "contact": "ca52internships@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-411-14",
    "position_title": "Intern",
    "office": "House Committee on Science, Space and Technology",
    "location": "Capitol Hill",
    "posting_date": "2015-01-26",
    "description": "The majority staff of the House Committee on Science, Space and Technology is looking for undergraduate and/or graduate interns for Spring 2015 under. Interns will have the responsibilities of providing legislative, general administrative support, answering phones, and other duties as assigned. Interns will be given opportunities to engage in substantive work, attend hearings and educational briefings, and will in all regards be treated as an integral member of the full-time staff. Spring Internships typically run from the beginning of January through the middle of May. Specific dates will be determined with each intern based on their individual schedules. Interns will be assigned to assist the full committee in the front office or with one of our subcommittees (Oversight, Energy, Environment, Research & Technology, and Space). Interns are preferred to work full time, however schedules are worked out on an individual basis. Previous Capitol Hill experience preferred but not required. This is a paid internship.",
    "responsibilities": [
      "Providing legislative support",
      "Providing general administrative support",
      "Answering phones",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Previous Capitol Hill experience preferred but not required"
    ],
    "how_to_apply": "Those interested in an internship opportunity for Spring 2015 are encouraged to submit a resume listing two references and a cover letter to HouseScienceOpenings@gmail.com. No telephone calls, faxes, or drop-ins, please.",
    "salary_info": "This is a paid internship.",
    "contact": "HouseScienceOpenings@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-410-14",
    "position_title": "Press Intern",
    "office": "House Judiciary Committee press office",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "House Judiciary Committee press office seeks motivated, detail-oriented and highly energetic full-time (20+ hours a week) press intern. Duties include compiling daily news clips, issue tracking and research, drafting media releases and other communications materials, maintaining press contact lists, special event support, and conceptualizing social media content. A background in journalism or communications and special skills such as photography, video editing and graphic design a plus, but not required. Undergraduate and graduate students, as well as recent graduates, are encouraged to apply. Michigan ties are a plus. Start and end dates are flexible. This internship is unpaid, but the office will accommodate applicants seeking to earn academic credit.",
    "responsibilities": [
      "Compiling daily news clips",
      "Issue tracking and research",
      "Drafting media releases and other communications materials",
      "Maintaining press contact lists",
      "Special event support",
      "Conceptualizing social media content"
    ],
    "qualifications": [],
    "how_to_apply": "Please submit a one page resume, a short writing sample, and a cover letter that includes date and hours of availability to HouseJudiciaryDems@gmail.com.",
    "salary_info": "This internship is unpaid, but the office will accommodate applicants seeking to earn academic credit.",
    "contact": "HouseJudiciaryDems@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-408-14",
    "position_title": "Internship",
    "office": "Congresswoman Zoe Lofgren’s (CA-19) Washington, D.C. office",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "Interns have the chance to experience the fast-paced atmosphere of a busy Congressional office and gain invaluable work experience. This is an excellent opportunity for those interested in the legislative process.",
    "responsibilities": [
      "Answering phones",
      "Running errands around the Capitol",
      "Attending hearings and briefings",
      "Researching legislation for legislative staff",
      "Answering constituent letters on various issues before the House"
    ],
    "qualifications": [
      "Excellent writing and analytical skills",
      "Demonstrated work ethic",
      "Ability to function in a fast-paced environment",
      "Motivated",
      "Able to multitask",
      "Ability to work well under pressure",
      "California-19 and/or California ties are preferred but not required."
    ],
    "how_to_apply": "Interested applicants should apply through http://lofgren.house.gov/. Please cite Brad Traverse as source of this lead.",
    "salary_info": "unpaid",
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-407-14",
    "position_title": "Intern",
    "office": "Representative Rick Larsen (WA-02)",
    "location": null,
    "posting_date": "2015-01-26",
    "description": "Representative Rick Larsen (WA-02) is currently seeking a full-time intern to start the first week of January with a flexible end date. Ideal candidates have excellent writing and research skills, a positive attitude, and a willingness to complete tasks as assigned.",
    "responsibilities": [
      "Researching and writing Congressional correspondence",
      "Helping constituents find information",
      "Fielding constituent phone calls",
      "Work closely with staff members and assist in various projects"
    ],
    "qualifications": [],
    "how_to_apply": "If interested, please send a resume, cover letter and two references to: taylor.paquette@mail.house.gov. Please include “WA-02 Internship” in the subject line.",
    "salary_info": null,
    "contact": "taylor.paquette@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-405-14",
    "position_title": "Intern",
    "office": "House",
    "location": "Washington, DC",
    "posting_date": "2015-01-26",
    "description": "Our Washington interns will be exposed to a wide range of activities on Capitol Hill. They will be asked to answer phones, research legislation for the Member and legislative staff, attends hearings and briefings, and answer constituent letters on various issues before the House. Interns will need to be able to communicate professionally, balance multiple tasks at once, and have a teachable attitude. As a result, interns will learn about the legislative process, the various functions of a Congressional office, and the way things work on Capitol Hill. It is an invaluable opportunity for both educational and professional development.",
    "responsibilities": [
      "Answer phones",
      "Research legislation for the Member and legislative staff",
      "Attend hearings and briefings",
      "Answer constituent letters on various issues before the House"
    ],
    "qualifications": [
      "Be able to communicate professionally",
      "Balance multiple tasks at once",
      "Have a teachable attitude"
    ],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-404-14",
    "position_title": "Intern",
    "office": "Congressman John Garamendi (CA-03)",
    "location": "Washington, DC",
    "posting_date": "2015-01-26",
    "description": "Congressman John Garamendi (CA-03) is seeking a highly motivated intern to join his Washington, DC office from January through April. Candidates should be collegial, professional, quick learners, and phenomenal team players. Strong oral and written communication skills and close attention to detail are imperative.",
    "responsibilities": [
      "Assisting staff with legislative, administrative, and press related projects",
      "Writing memos and talking points",
      "Attending hearings and meetings",
      "Answering constituent phone calls",
      "Leading tours of the US Capitol",
      "Assisting with scheduling",
      "Sorting and distributing mail",
      "Managing tour and flag requests"
    ],
    "qualifications": [
      "Collegial",
      "Professional",
      "Quick learners",
      "Phenomenal team players",
      "Strong oral and written communication skills",
      "Close attention to detail"
    ],
    "how_to_apply": "Please e-mail a resume, cover letter and dates of availability to Garamendi.Internships@mail.house.gov.",
    "salary_info": "This is an unpaid internship.",
    "contact": "Garamendi.Internships@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-399-14",
    "position_title": "Intern",
    "office": "Office of Congressman Gene Green (TX-29)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "The Office of Congressman Gene Green (TX-29) is currently seeking a full-time intern for our Washington, D.C. office for the spring session (January-May 2015). Qualified candidates are well organized, with good oral and written communication skills, and possess a strong interest in learning about the political process and congressional affairs. This opportunity offers a great opportunity to see the inner workings of a congressional office from a senior member.\nApplicants must be detail oriented with a strong work ethic and an eagerness to represent the 29th district of Texas. Also, an intern with Texas ties and Spanish proficiency is preferred but not mandatory.",
    "responsibilities": [
      "Answering phones",
      "Compiling briefing binders",
      "Performing legislative research",
      "Assisting in press work",
      "Attending briefings"
    ],
    "qualifications": [
      "Well organized",
      "Good oral and written communication skills",
      "Strong interest in learning about the political process and congressional affairs",
      "Detail oriented with a strong work ethic",
      "Eagerness to represent the 29th district of Texas",
      "Texas ties and Spanish proficiency is preferred but not mandatory"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter to our intern coordinator, Kendrick Vela, at Kendrick.Vela@mail.house.gov.",
    "salary_info": null,
    "contact": "Kendrick.Vela@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-398-14",
    "position_title": "Press Internship",
    "office": "Office of a Senior Member of the Ways and Means Committee",
    "location": "Washington, DC",
    "posting_date": "2015-01-26",
    "description": "Press interns are expected to work long hours and commit between 3-5 days per week. Internship duties include, but are not limited to compiling and daily clips, drafting press releases and op-eds, proofreading and editing, maintaining press lists, updating Member's communications calendar, website and social media platforms. Intern may also assist with answering phones, incoming and outgoing mail, addressing constituent concerns, and assisting the Legislative/District office staff. Strong writing skills are needed and familiarity with new media and website development is a plus. Priority will be given to those with journalism or communications education/experience. The ideal candidate will be creative, motivated, mature, detail-orientated, and possess the ability to multi-task under high pressure. This is a great opportunity for college students and recent graduates.",
    "responsibilities": [
      "Compiling and daily clips",
      "Drafting press releases and op-eds",
      "Proofreading and editing",
      "Maintaining press lists",
      "Updating Member's communications calendar, website and social media platforms",
      "Assisting with answering phones, incoming and outgoing mail",
      "Addressing constituent concerns",
      "Assisting the Legislative/District office staff"
    ],
    "qualifications": [
      "Strong writing skills",
      "Familiarity with new media and website development is a plus",
      "Journalism or communications education/experience preferred",
      "Creative, motivated, mature, detail-orientated",
      "Ability to multi-task under high pressure"
    ],
    "how_to_apply": "To apply for the position, please send your cover letter, resume and writing sample addressed to the Comm. Director at ny13intern@gmail.com with the subject: Press Intern.",
    "salary_info": null,
    "contact": "ny13intern@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-396-14",
    "position_title": "Intern",
    "office": "Congressman Mark Meadows (NC-11)",
    "location": "Washington, DC",
    "posting_date": "2015-01-26",
    "description": "Congressman Mark Meadows (NC-11) seeks motivated, detail-oriented, personable and organized interns to join his Washington, DC office for the 2015 spring semester. Applicants should have strong conservative values, excellent communication skills, and a committed work ethic.",
    "responsibilities": [
      "answering phones",
      "processing mail",
      "researching legislation",
      "drafting correspondence",
      "attending hearings and briefings",
      "giving tours of the Capitol",
      "assisting front office staff"
    ],
    "qualifications": [
      "strong conservative values",
      "excellent communication skills",
      "committed work ethic"
    ],
    "how_to_apply": "Interested candidates should email a resume and cover letter to Ashley Howes at ashley.howes@mail.house.gov. North Carolina ties are preferred, but not required",
    "salary_info": "unpaid internship",
    "contact": "Ashley Howes at ashley.howes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-394-14",
    "position_title": "Intern",
    "office": "A Conservative Republican from Florida",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "Responsibilities will include, but not limited to, handling constituent phone calls, composing correspondence, conducting capitol tours, and attending congressional hearings and briefings. Candidates should be professional, organized, and eager to learn. Florida ties are preferred, but all applicants are encouraged to apply.",
    "responsibilities": [
      "Handling constituent phone calls",
      "Composing correspondence",
      "Conducting capitol tours",
      "Attending congressional hearings and briefings"
    ],
    "qualifications": [
      "Professional",
      "Organized",
      "Eager to learn",
      "Florida ties are preferred"
    ],
    "how_to_apply": "Please email your cover letter, resume, and availability to FL11internship@gmail.com.",
    "salary_info": "un-paid",
    "contact": "FL11internship@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-392-14",
    "position_title": "Intern",
    "office": "Congressman Jim Renacci (R-OH)",
    "location": "Washington, D.C.",
    "posting_date": "2015-01-26",
    "description": "Congressman Jim Renacci (R-OH) seeks full time hard working intern for immediate hire.",
    "responsibilities": [
      "Answering phone calls",
      "Assisting with the mail program",
      "Providing constituent tours",
      "Attending various briefings",
      "Providing research for the legislative staff"
    ],
    "qualifications": [
      "Exceptional writing skills",
      "Strong communication skills",
      "Ability to work in a fast paced working environment",
      "Have an interest in learning more about the legislative process"
    ],
    "how_to_apply": "Send a resume and a cover letter to Stephen.Hostelley@mail.house.gov. Ohio candidates are strongly preferred.",
    "salary_info": null,
    "contact": "Stephen.Hostelley@mail.house.gov",
    "equal_opportunity": null
  }
]