[
  {
    "id": "MEM-086-23",
    "position_title": "Legislative Correspondent",
    "office": "Representative Alma Adams (NC- 12)",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "Representative Alma Adams (NC- 12) seeks a Legislative Correspondent to run\na robust correspondence program and assist with official communication.\nA successful candidate will be a strong and efficient writer, intellectually curious,\nand a quick study. They must also work well as a part of a team. Responsibilities\ninclude drafting constituent correspondence that reflects the Congresswoman’s\npolicy priorities, managing incoming and outgoing correspondence, tracking\ncorrespondence data, and working with the rest of the staff to ensure the office is\nmaximally responsive too constituents and well informed of their priorities. North\nCarolina ties and a sense of humor are a plus. Prior Congressional experience also\npreferred.",
    "responsibilities": [
      "Draft tailored letters for constituent inquires that require special research or a nuanced response.",
      "Create and maintain a collection of prepared responses for general legislative inquires.",
      "Ensure that legislative responses to constituents are completed in a timely matter.",
      "Consult with the Legislative Director and Legislative Assistants to ensure the Member’s library of legislative letters are accurate, up to date, and reflective of the Member’s policy position.",
      "Learn and lead office in using Constituent Management System software (Fireside).",
      "Engage with district office staff and respond to inquiries of Member’s policy stances.",
      "Flag district-based organized constituent letter writing campaigns to appropriate district staff.",
      "Attend legislative meetings with constituents and assist with Committee hearings and markups.",
      "Assist Scheduler/Executive Assistant in drafting Member-to-Member correspondence, thank you, and special occasion letters."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and two writing samples to NC12.resume@mail.house.gov and put “LC - FirstName.LastName” in the Subject Line. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate based on race, color, religion, sex, national origin, age, disability, military status, gender identity, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-085-23",
    "position_title": "Bilingual Press Secretary",
    "office": "The Office of Congresswoman Sylvia Garcia (TX-29)",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-13",
    "description": "The Office of Congresswoman Sylvia Garcia (TX-29) seeks a bilingual (English/Spanish) Press Secretary for her Washington, D.C. office.\n\nPrimary responsibilities include, but are not limited to building and maintaining relationships with Houston and DC press; responding to media inquiries; writing press releases and talking points; preparing stories and op-eds for Houston and national media; organizing earned media events in Houston and Washington, D.C.; managing printed and digital paid communications and social media platforms for the Congresswoman; and coordinating and staffing the Congresswoman for interviews and press events, among other things. This is not an entry-level position.",
    "responsibilities": [
      "building and maintaining relationships with Houston and DC press",
      "responding to media inquiries",
      "writing press releases and talking points",
      "preparing stories and op-eds for Houston and national media",
      "organizing earned media events in Houston and Washington, D.C.",
      "managing printed and digital paid communications and social media platforms for the Congresswoman",
      "coordinating and staffing the Congresswoman for interviews and press events, among other things"
    ],
    "qualifications": [
      "must have strong writing skills, prior press and digital experience",
      "the ability to work in a collaborative environment",
      "requires a candidate to track details across communications projects, file timely reports with House, and regularly meet multiple deadlines"
    ],
    "how_to_apply": "Please apply via the following link: https://resumebank.domewatch.us/start?code=UUFg9fO6_",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-084-23",
    "position_title": "Investigative Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Accountability, Democratic (Minority) Staff",
    "location": "District of Columbia",
    "posting_date": "2023-02-13",
    "description": "The Committee on Oversight and Accountability is the principal investigative body for the U.S. House of Representatives. Ranking Member Jamie Raskin (D-MD) seeks an attorney with several years of investigative, oversight, or litigation experience for an Investigative Counsel position on the Democratic staff. In this role, you will work with a team of passionate and supportive colleagues and manage all aspects of high-profile congressional investigations.\n\nPotential day-to-day work includes drafting letters, negotiating with counsel, conducting depositions and transcribed interviews, preparing reports and memoranda, briefing the Ranking Member and other Committee Members, and preparing for congressional hearings. This is not an entry-level position.\n\nExperience with taking or defending depositions is strongly preferred. Previous Hill desired but not required. Candidates with diverse backgrounds and experiences are strongly encouraged to apply.\n\nCandidates must have superior attention to detail, work well under pressure, be self-motivated, and possess excellent written and oral communication skills.",
    "responsibilities": [
      "Drafting letters",
      "Negotiating with counsel",
      "Conducting depositions and transcribed interviews",
      "Preparing reports and memoranda",
      "Briefing the Ranking Member and other Committee Members",
      "Preparing for congressional hearings"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills",
      "Experience with taking or defending depositions is strongly preferred",
      "Previous Hill experience desired but not required"
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Investigative Counsel” in the subject line. Please attach the resume and cover letter as PDFs with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.\n\nApplications must be submitted by 11:59 PM ET on Monday, February 27, 2023.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-083-23",
    "position_title": "DIGITAL STAFFER",
    "office": "Congresswoman Angie Craig (MN-02)",
    "location": "Burnsville, MN",
    "posting_date": "2023-02-13",
    "description": "Congresswoman Angie Craig (MN-02) is in search of a talented Digital/Video Producer for her Burnsville, MN office in a full-time capacity. This position reports to the Communications Director.\n\nThe Digital/Video Producer will work with the Communications Director to create compelling photo and video content for social media, draft and post to the Member’s social media accounts, and assist with other communications duties as needed.\n\nThe ideal candidate should be highly creative, have a strong work ethic and communication skills, a good sense of humor, an eagerness to learn and grow within the office, and a desire to be part of a highly-collaborative, high-achieving team. The candidate should possess a strong attention to detail and be comfortable working with Adobe Creative Suite and Canva. The position is full time with federal benefits, including student loan repayment program (if eligible), transit or parking benefits, and an annual salary of between $50,000 and $60,000 commensurate with experience.",
    "responsibilities": [
      "create compelling photo and video content for social media",
      "draft and post to the Member’s social media accounts",
      "assist with other communications duties as needed"
    ],
    "qualifications": [
      "highly creative",
      "strong work ethic and communication skills",
      "a good sense of humor",
      "an eagerness to learn and grow within the office",
      "a desire to be part of a highly-collaborative, high-achieving team",
      "strong attention to detail",
      "comfortable working with Adobe Creative Suite and Canva"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume, writing sample, and 3 examples of previous digital media or video projects to repcraigpress@mail.house.gov with the subject line “Digital/Video Producer [applicant’s last name]” by March 1, 2023.",
    "salary_info": "an annual salary of between $50,000 and $60,000 commensurate with experience",
    "contact": "repcraigpress@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, or sexual orientation. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-082-23",
    "position_title": "Press/Digital Assistant",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "D.C.",
    "posting_date": "2023-02-13",
    "description": "Congresswoman Susie Lee (NV-03) is seeking a highly motivated, detail-orientated, and energetic individual with experience in communications, digital media and social media, video editing, and graphic design to join her team as a press/digital assistant in the D.C. office. This position will report to the Communications Director.\n\nDaily tasks include drafting and posting content for the member’s social media platforms and website; graphic design; video filming and editing; daily press clips; managing the newsletter program; drafting press releases, talking points, and remarks; and organizing press events. The ideal candidate will be creative, politically astute, have a strong proficiency in crafting social media content across social media platforms, and will be a detail-oriented team player able to handle multiple tasks at once.\n\nExcellent writing and strong organizational skills are essential, along with the ability to be a self-starter while working in a fast-paced environment. Capitol Hill experience and Spanish fluency are a plus, but not required. Proficiency with Adobe Suite, Canva, and constituent management platforms, such as IQ, preferred.",
    "responsibilities": [
      "Drafting and posting content for the member’s social media platforms and website",
      "Graphic design",
      "Video filming and editing",
      "Daily press clips",
      "Managing the newsletter program",
      "Drafting press releases, talking points, and remarks",
      "Organizing press events"
    ],
    "qualifications": [
      "Excellent writing and strong organizational skills are essential",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Capitol Hill experience and Spanish fluency are a plus, but not required",
      "Proficiency with Adobe Suite, Canva, and constituent management platforms, such as IQ, preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, three references, one writing sample, and a digital portfolio or examples of previous digital media, video work, or graphic design products to NV03Resumes@gmail.com with “DC Press/Digital Assistant” in the subject line. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "NV03Resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-081-23",
    "position_title": "Caseworker/Outreach Representative",
    "office": "Congresswoman Lisa Blunt Rochester",
    "location": "Georgetown, DE",
    "posting_date": "2023-02-13",
    "description": "Reporting to the State Director, primary responsibilities include answering casework correspondence and communications from constituents; acting as liaison with Federal, State, and local agencies; preparing correspondence to agency contacts and constituents; staffing the Congresswoman and attending community events, building relationships with a range of constituents and stakeholders throughout Kent and Sussex Counties, and handling administrative tasks as assigned.\n\nThis position requires excellence in constituent relations, service delivery, and community engagement. Duties require work during regular office hours and travel throughout Kent and Sussex Counties is required, including occasional meetings and events during evenings and weekends.",
    "responsibilities": [
      "Answering casework correspondence and communications from constituents",
      "Acting as liaison with Federal, State, and local agencies",
      "Preparing correspondence to agency contacts and constituents",
      "Staffing the Congresswoman and attending community events",
      "Building relationships with a range of constituents and stakeholders throughout Kent and Sussex Counties",
      "Handling administrative tasks as assigned"
    ],
    "qualifications": [
      "Ties to the state",
      "Ability to work in a fast-paced environment",
      "Excellent interpersonal, customer relations, strong writing skills",
      "Interest in public service",
      "Fluency in Spanish is preferred but not required",
      "Valid driver’s license and a clean driving record"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to lbr.jobposting@gmail.com with “Caseworker/Outreach Representative” in the subject line. No phone calls, drop-ins, or emails please.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This is an Equal Opportunity Employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, sexual orientation, military status, marital status, or parental status."
  },
  {
    "id": "MEM-078-23",
    "position_title": "LEGISLATIVE AIDE",
    "office": "Rep. Jim Costa (CA-21)",
    "location": "Washington, DC",
    "posting_date": "2023-02-13",
    "description": "The Legislative Aide will handle a diverse portfolio of issues including natural resources, environment, public lands, and climate change, among others. The Legislative Aide will also assist the legislative team with other projects as assigned, including research and preparation of items related to the Farm Bill.",
    "responsibilities": [
      "Conducting research",
      "Drafting legislation",
      "Taking meetings and building relationships with constituent groups",
      "Providing vote recommendations",
      "Advising the Member on policy issues",
      "Performing other tasks as required"
    ],
    "qualifications": [
      "Prior Capitol Hill or relevant policy experience",
      "Highly motivated, detail-oriented professionals with strong organizational and time-management skills",
      "Positive attitudes, and pride in work",
      "Applicants with ties to California’s 21st Congressional District and the San Joaquin Valley are strongly encouraged to apply."
    ],
    "how_to_apply": "Please e-mail a cover letter, resume, and writing sample in a single PDF to resume@mail.house.gov with “Legislative Aide” in the subject line by February 21, 2023.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "resume@mail.house.gov",
    "equal_opportunity": "The Office of Representative Costa is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-077-23",
    "position_title": "Legislative Correspondent",
    "office": "Congressman Rob Wittman (VA-01)",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "This position works to ensure the relationship between the Member’s Office and constituents remains positive by providing ample information in response to questions, fielding messages in a timely manner, and ensuring constituents receive consistent, accurate information about legislative happenings and the Member’s agenda. They will also assist in the composition of background memos and talking points for the Member’s meetings and engagements, handling issue areas as assigned to support the Legislative Director and Military Legislative Assistant.",
    "responsibilities": [],
    "qualifications": [
      "Excellent writing, communication, and research skills, and the ability to produce quality work in a faced paced environment.",
      "An ability to multitask and work under tight deadlines is necessary.",
      "Previous congressional experience; ties to Virginia’s First District are helpful but not required."
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Carolyn.King@mail.house.gov with “Legislative Correspondent” in the subject line.",
    "salary_info": null,
    "contact": "Carolyn.King@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-076-23",
    "position_title": "Caucus Assistant",
    "office": "Congressional Progressive Caucus",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-13",
    "description": "The Congressional Progressive Caucus seeks a Caucus Assistant based in Washington, D.C. The position requires careful attention to logistics associated with managing the Caucus’ day-to-day activities, assisting with office management responsibilities, scheduling, finance, event planning, and performing other duties as required.",
    "responsibilities": [
      "Organizing the logistics for member-level and staff-level meetings",
      "Routinely preparing and sending materials to CPC member offices",
      "Responding to a variety of inquires from CPC member offices",
      "Assisting with policy and communications projects as assigned",
      "Managing various operations tasks",
      "Assisting with processing office finances."
    ],
    "qualifications": [
      "Capitol Hill, executive assistant, and progressive advocacy experience is preferred.",
      "Ideal candidates will be very detail-oriented with good time-management skills, able to work in a fast-paced environment, and handle last minute changes to the legislative schedule.",
      "Candidates must possess strong writing and organizational skills, a good sense of humor, creativity, the ability to operate under strict deadlines, and be able to work collaboratively with CPC offices and staff.",
      "Ideal candidates should have familiarity with the progressive movement and progressive policy.",
      "This position can involve long hours and will report to the Executive Director."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to ProgressiveCaucusJobs@gmail.com with “Caucus Assistant LastName” in the subject line. Applications will be accepted on a rolling basis.",
    "salary_info": null,
    "contact": "ProgressiveCaucusJobs@gmail.com",
    "equal_opportunity": "The CPC is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or expression, or sexual orientation. Women, people of color, veterans, and LGBTQIA individuals are strongly encouraged to apply."
  },
  {
    "id": "MEM-075-23",
    "position_title": "Press Secretary/Digital Assistant",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07), Chair of the Congressional Progressive Caucus",
    "location": "Washington, DC",
    "posting_date": "2023-02-13",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07), Chair of the Congressional Progressive Caucus, seeks a highly organized, creative, and teamoriented Press Secretary/Digital Assistant to execute a fast-paced and dynamic communications plan. This position reports to the Communications Director and is based in the Washington, DC office.\n\nAn ideal candidate will:\n●Be a proficient writer, with experience writing for a principal\n●Have a knowledge of Adobe Suite, graphic design and video editing skills\n●Have a familiarity with CRMs including IQ\n●Understand Facebook Business Manager and digital advertising\n●Have a deep familiarity with all social media tools (i.e. Instagram, Twitter)\n●Understand the digital media landscape and current digital trends\n●Have a strong record of advocating for progressive values\n●Be willing to work weekends and irregular hours when necessary",
    "responsibilities": [
      "Drafting written materials including press releases, remarks, speeches, enewsletters, talking points, and social media content",
      "Compiling daily press clips and managing proactive media monitoring",
      "Maintaining local and national press lists",
      "Compiling weekly communications report",
      "Capturing video and photos of the Congresswoman for social media and for events",
      "Staying informed about relevant current events in the district and across the country as well as appropriate legislative and non-legislative issues",
      "Maintaining various press archives for the Congresswoman",
      "Supporting logistics for town halls, press conferences, and other public-facing events, both virtual and in-person"
    ],
    "qualifications": [
      "Strong communications skills, including writing, editing, and proofreading",
      "Understanding of print, broadcast, and online media and how to use those tools creatively",
      "Strong organizational skills, and ability to manage multiple tasks at once",
      "Ability to exercise discretion in the representation of the Congresswoman’s position on policy issues",
      "Ability to work cooperatively and courteously with others, including members of the press",
      "Be a proficient writer, with experience writing for a principal",
      "Have a knowledge of Adobe Suite, graphic design and video editing skills",
      "Have a familiarity with CRMs including IQ",
      "Understand Facebook Business Manager and digital advertising",
      "Have a deep familiarity with all social media tools (i.e. Instagram, Twitter)",
      "Understand the digital media landscape and current digital trends",
      "Have a strong record of advocating for progressive values",
      "Be willing to work weekends and irregular hours when necessary"
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Press Secretary/Digital Assistant” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. Washington state and/or district ties are a plus."
  },
  {
    "id": "MEM-073-23",
    "position_title": "SCHEDULER",
    "office": "Congressman Jake Auchincloss (MA-04)",
    "location": "Washington, DC",
    "posting_date": "2023-02-13",
    "description": "Congressman Jake Auchincloss (MA-04) is seeking a highly motivated, detail-orientated, and energetic individual with excellent oral and written communications skills for a Scheduler position in the Washington, DC office.\n\nDaily tasks include managing and maintaining the Member’s daily and long-term DC schedule; coordinating travel, booking flight reservations, and managing logistics for events; evaluating and organizing all incoming meeting and event requests; communicating key information regarding the Member and the Member’s schedule to staff; and working closely with both DC and District staff to ensure smooth daily office operations. Candidates must be available to assist the Member outside of regular business hours.\n\nThis position requires proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member, Chief of Staff, District Director, and District Scheduler. Excellent writing, verbal and strong organizational skills are essential along with the ability to be a self-starter while working in a fast-paced environment. Previous Capitol Hill or scheduling experience is required; this is not an entry level position.\n\nAccess to a car and a clean driving record is preferred.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long-term DC schedule",
      "Coordinating travel, booking flight reservations, and managing logistics for events",
      "Evaluating and organizing all incoming meeting and event requests",
      "Communicating key information regarding the Member and the Member’s schedule to staff",
      "Working closely with both DC and District staff to ensure smooth daily office operations",
      "Assist the Member outside of regular business hours"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member, Chief of Staff, District Director, and District Scheduler",
      "Excellent writing, verbal and strong organizational skills",
      "Ability to be a self-starter while working in a fast-paced environment",
      "Previous Capitol Hill or scheduling experience is required; this is not an entry level position",
      "Access to a car and a clean driving record is preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and one writing sample to AuchinclossJobs@mail.house.gov with “Scheduler – First Name Last Name” in the Subject Line. Applications will be accepted on a rolling basis. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law."
  },
  {
    "id": "MEM-072-23",
    "position_title": "Senior Legislative Assistant or Counsel – Financial Services",
    "office": "Congressman Brad Sherman",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "Congressman Brad Sherman seeks a Legislative Assistant to staff the House\nFinancial Services Committee including the Capital Markets Subcommittee on\nwhich the Congressman serves as ranking Democrat.\n\nThe ideal candidate will have significant experience in financial services issues.\nExperience with issues falling under the jurisdiction of the Capital Markets\nSubcommittee is a major plus. Job responsibilities include monitoring and\ndrafting legislation, representing the Member in meetings/briefings, preparing\nmaterials for committee hearings and markups, maintaining relationships with\nadvocacy groups, interfacing with government agencies, and other tasks and\nassignments as needed.\n\nThe successful candidate will possess excellent written and oral communication\nskills, a solid understanding of the legislative process, and knowledge of, and\nexperience with, the operations of the SEC and other rules-making entities that\ngovern capital markets and securities-related accounting standards.\n\nThis job requires a proven ability to work effectively and independently in a\ndemanding and fast-paced environment. Law degree/bar membership a plus, but\nnot required. This is a mid- to senior-level position in the office.",
    "responsibilities": [
      "monitoring and drafting legislation",
      "representing the Member in meetings/briefings",
      "preparing materials for committee hearings and markups",
      "maintaining relationships with advocacy groups",
      "interfacing with government agencies",
      "other tasks and assignments as needed"
    ],
    "qualifications": [
      "excellent written and oral communication skills",
      "a solid understanding of the legislative process",
      "knowledge of, and experience with, the operations of the SEC and other rules-making entities that govern capital markets and securities-related accounting standards",
      "proven ability to work effectively and independently in a demanding and fast-paced environment",
      "Law degree/bar membership a plus, but not required"
    ],
    "how_to_apply": "Please send cover letter and resume to FSCCapMarketsStaffer@gmail.com",
    "salary_info": null,
    "contact": "FSCCapMarketsStaffer@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-071-23",
    "position_title": "Legislative Staffer",
    "office": "Rep. Marcy Kaptur (D-OH-09)",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "Rep. Marcy Kaptur (D-OH-09), co-chair of the Congressional Ukraine Caucus and a Senior Appropriations Defense Subcommittee member, seeks an experienced legislative staffer to handle a portfolio including defense, foreign affairs, and national security issues.",
    "responsibilities": [],
    "qualifications": [
      "Candidates must be familiar with the defense portfolio, Ukraine and European security issues, the Appropriations process",
      "Have a deep understanding of the legislative process including identifying creative legislation solutions, crafting and advancing legislation, analyzing and briefing a Senior Member of Congress on complex policy issues, and drafting a wide array of written materials (including materials for Committee and Floor activities)",
      "Strong written and verbal communication skills and a demonstrated ability to work collaboratively in a fast-paced environment are critical",
      "At least five years of relevant experience is encouraged as are Congressional experience and Midwest connections"
    ],
    "how_to_apply": "Applicants should email a resume, cover letter, two writing samples, and references as individual files in PDF format to Midwestern.Resume@mail.house.gov “MLA/Foreign Affairs” in the subject line. No phone calls, faxes, emails, or walk-ins, please.",
    "salary_info": null,
    "contact": "Midwestern.Resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-066-23",
    "position_title": "Director of Scheduling",
    "office": "House Democratic Leadership Office",
    "location": "Capitol Hill",
    "posting_date": "2023-02-13",
    "description": "House Democratic Leadership Office seeks a Director of Scheduling to join a three-person team.\n\nCandidates should also be meticulous, well-organized, hard-working, and ready to operate in a high pressure and fast-paced environment. Highest degree of professionalism and confidentiality required, as well as the ability to work a flexible schedule, including long hours and weekends when necessary.",
    "responsibilities": [
      "Supporting the Deputy Chief of Staff for Operations in managing and maintaining the Member’s daily and long term schedules",
      "Coordinating travel arrangements",
      "Managing scheduling requests",
      "Managing the three-person team",
      "Experience working directly with high-level principals."
    ],
    "qualifications": [
      "Meticulous",
      "Well-organized",
      "Hard-working",
      "Ready to operate in a high pressure and fast-paced environment",
      "Highest degree of professionalism and confidentiality required",
      "Ability to work a flexible schedule, including long hours and weekends when necessary",
      "Capitol Hill experience preferred"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and three references to Democraticleaderresumes@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "Democraticleaderresumes@gmail.com",
    "equal_opportunity": "The Office is an Equal Opportunity Employer and as such is committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-063-23",
    "position_title": "Senior Counsel",
    "office": "Congressman Dan Goldman",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "The office of Congressman Dan Goldman, a member of the Select Subcommittee on the Weaponization of the Federal Government, the Committee on Oversight and Accountability, and the Committee on Homeland Security seeks a Senior Counsel.\nInvestigative experience preferred. Duties will include assisting the member with investigations, conducting research, monitoring legislation, representing the member in meetings/briefings, preparing materials for committee hearings, markups, and events, drafting oversight letters, interfacing with government agencies, and covering an issue portfolio.\nWe are proudly an office that is an equal opportunity employer. We do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, military status, sexual orientation, or gender identity or expression.\nSpecial consideration will be given to candidates with ties to NY-10, who speak a second language, and those with prior Congressional experience so please include this information in your cover letter.",
    "responsibilities": [
      "Assisting the member with investigations",
      "Conducting research",
      "Monitoring legislation",
      "Representing the member in meetings/briefings",
      "Preparing materials for committee hearings, markups, and events",
      "Drafting oversight letters",
      "Interfacing with government agencies",
      "Covering an issue portfolio"
    ],
    "qualifications": [
      "Investigative experience preferred",
      "Ties to NY-10 (special consideration)",
      "Speaks a second language (special consideration)",
      "Prior Congressional experience (special consideration)"
    ],
    "how_to_apply": "To apply please send a resume, cover letter, and a writing sample as one PDF to ny10goldmanresumes@gmail.com with “Full Name – Counsel” as the subject line.",
    "salary_info": null,
    "contact": "ny10goldmanresumes@gmail.com",
    "equal_opportunity": "We are proudly an office that is an equal opportunity employer. We do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, military status, sexual orientation, or gender identity or expression."
  },
  {
    "id": "MEM-061-23",
    "position_title": "Subcommittee on Disability Assistance and Memorial Affairs Professional Staff Member",
    "office": "U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "REPORTS TO: Republican Staff Director, Subcommittee on Disability Assistance and Memorial Affairs",
    "responsibilities": [
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Conduct oversight of Subcommittee issue areas, to include Department implementation of laws, regulations, and programs",
      "Monitor legislative needs and developments within committees and on the House floor within specific issue areas of responsibility",
      "Under the guidance of Subcommittee Staff Director, provide advice on policy matters within issue areas and help Subcommittee Staff Director develop and implement strategic and policy goals",
      "Draft hearing, markup and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings",
      "Assist in the proposing and drafting of legislation for the Committee",
      "Meet with congressional staff and internal/external organizations on behalf of the Committee",
      "Perform other duties as assigned by Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "At least three years of congressional or Administration experience resulting in direct, working knowledge of the Committee/Subcommittee’s substantive jurisdiction required; five years strongly preferred",
      "Occasional travel may be required",
      "Excellent writing, editing, and proofreading skills (writing test may be administered prior to an offer being extended)",
      "Excellent oral communication skills",
      "Thorough knowledge of legislative process, and understanding of House Rules",
      "Demonstrate ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions",
      "Knowledge of current issues and events in which the Full Committee leadership is involved",
      "Ability to work long hours, under pressure, and cooperatively and courteously with others"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references, and three writing samples to VAR.Resumes@mail.house.gov with “DAMA Professional Staff Member” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-058-23",
    "position_title": "Legislative Assistant",
    "office": "Rep. Alma S. Adams PH.D. (NC-12)",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-13",
    "description": "The candidate will be responsible for staffing and preparing the Congresswoman for all work and assignments related to the Agriculture Committee. Qualified candidates should have knowledge of agriculture policy, the legislative process, coalition building and be able to maintain relationships with constituent organizations. The Legislative Assistant will work closely with the Legislative Director and Chief of Staff to develop and execute a coordinated legislative strategy for the Member.\n\nThe Legislative Assistant will prepare the Member for Committee hearings and markups and attend meetings with constituents, visitors, and other VIPs. Ties to North Carolina are a plus. This is not and entry level position and relevant experience is required, and Hill experience is preferred.",
    "responsibilities": [
      "Tracks legislation and coordinates co-sponsorship of bills for the Member",
      "Briefs the Member on bills before the House, provides advice on Committee activity, and assists the district office staff with legislative matters that impact the local community",
      "Provides input to help the Communications Director to draft speeches, press releases, op-eds, and Congressional Record statements for the Member",
      "Represents the Member at meetings with constituents and interest groups",
      "Provides district office staff with targeted information for community events and Town Hall meetings",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Experience researching public policy and preparing recommendations for a Member of Congress or other executives/leaders (e.g., Federal department/agency, non-profit organization, private sector)",
      "Strong written and verbal communication skills",
      "Experience making decisions and advising Capitol Hill staff on important issues",
      "Comfortable navigating challenging situations and being politically savvy",
      "Prior experience with forming partnerships and advancing legislative priorities for a Member of Congress",
      "Prioritization and time management skills, with the ability to manage multiple projects at a time",
      "Knowledge of issues in portfolio"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and writing sample to NC12.Resume@mail.house.gov with “Legislative Assistant” in the subject line by COB Wednesday, February 15th.",
    "salary_info": "The position is full time with federal benefits, including student loan repayment program (if eligible), transit or parking benefits, and an annual salary commensurate with experience.",
    "contact": "NC12.Resume@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, or sexual orientation. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-055-23",
    "position_title": "Legislative Director",
    "office": "Rep. Kevin Mullin (CA-15)",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-13",
    "description": "RESPONSIBILITIES:\n\nLeads development and implementation of policy and legislative strategy in close consultation with the Member, Chief of Staff and Deputy Chief of Staff;\nCoordinates closely with the district and communications teams to successfully message on legislative issues and develop legislation in response to constituent concerns and priorities;\nDrafts and edits memos, remarks, background briefs, and committee materials for the Member’s work on the House Natural Resources Committee and House Science, Space, and Technology Committee;\nManages and supervises legislative staff;\nMonitors activity on the House Floor and committees and provides vote recommendations;\nManages and advances an individual portfolio of legislative issues;\nOversees the office’s constituent correspondent system in coordination with the Legislative Correspondent;\nOther special projects and duties as assigned.\nPREFERRED EXPERIENCE:\n4+ years of policy experience, preferably in Congress;\nDeep understanding of the House floor and committee procedures;\nExperience collaborating and forming partnerships to advance a legislative agenda;\nTime management skills and the ability to manage complex workflows under a tight deadline;\nStrong oral and written communication skills.\nThe annual salary for this position is $90,000. The position offers health coverage; retirement benefits with an employer match; paid sick, bereavement, and 20 days vacation leave plus federal holidays; 12 weeks of paid parental leave; 6 weeks of paid FMLA leave; transit or parking benefits; access to life insurance coverage. Rep. Mullin’s office participates in the student loan repayment program.",
    "responsibilities": [
      "Leads development and implementation of policy and legislative strategy in close consultation with the Member, Chief of Staff and Deputy Chief of Staff",
      "Coordinates closely with the district and communications teams to successfully message on legislative issues and develop legislation in response to constituent concerns and priorities",
      "Drafts and edits memos, remarks, background briefs, and committee materials for the Member’s work on the House Natural Resources Committee and House Science, Space, and Technology Committee",
      "Manages and supervises legislative staff",
      "Monitors activity on the House Floor and committees and provides vote recommendations",
      "Manages and advances an individual portfolio of legislative issues",
      "Oversees the office’s constituent correspondent system in coordination with the Legislative Correspondent",
      "Other special projects and duties as assigned"
    ],
    "qualifications": [
      "4+ years of policy experience, preferably in Congress",
      "Deep understanding of the House floor and committee procedures",
      "Experience collaborating and forming partnerships to advance a legislative agenda",
      "Time management skills and the ability to manage complex workflows under a tight deadline",
      "Strong oral and written communication skills"
    ],
    "how_to_apply": "To apply, please email CA15Employment@gmail.com with “Legislative Director” in the subject line and the following application materials attached as one combined PDF: (1) cover letter, (2) resume, and (3) a brief (1 page) unedited writing sample. No phone calls or drop bys, please.",
    "salary_info": "The annual salary for this position is $90,000. The position offers health coverage; retirement benefits with an employer match; paid sick, bereavement, and 20 days vacation leave plus federal holidays; 12 weeks of paid parental leave; 6 weeks of paid FMLA leave; transit or parking benefits; access to life insurance coverage. Rep. Mullin’s office participates in the student loan repayment program.",
    "contact": "CA15Employment@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-052-23",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2023-02-13",
    "description": "The Committee's investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is desirable: government ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "The salary range for this position is $130,441 and $138,856.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-051-23",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2023-02-13",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office.\n\nThe Committee’s financial disclosure counsel are responsible for reviewing financial statements and providing legal advice on a high volume of financial disclosure issues, education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Reviewing financial statements",
      "Providing legal advice on a high volume of financial disclosure issues",
      "Education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "$130,441 and $138,856",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-045-23",
    "position_title": "Digital/Press Associate",
    "office": "Office of Congresswoman Summer Lee",
    "location": "Washington, D.C. or Pittsburgh PA",
    "posting_date": "2023-02-13",
    "description": "The Office of Congresswoman Summer Lee seeks a highly motivated\nDigital/Press Associate to support the Communications Director in all aspects of\nthe office's fast-paced and dynamic communications operation, including\ndeveloping social media strategy and branding, drafting and editing social media\ncopy, designing digital content for the Congresswoman, and media monitoring.\nThis role reports to the Communications Director. Progressive values are a must.",
    "responsibilities": [
      "Support implementation of digital communications and public relations strategies for the Congresswoman;",
      "Compile daily press clips and stay informed about current events in the district and across the country for their impact on the Congresswoman;",
      "Draft social media content and other written materials, and manage all of the Congresswoman's social media accounts (twitter, Instagram, FB, Tiktok)",
      "Develop branding guide, create graphics, film and edit photos and videos, including clipping, captioning and branding;",
      "Manage the Congresswoman's website and set up robust digital archives and analytics trackers for the Congresswoman;",
      "Staff digital events and video recordings with the Congresswoman;",
      "Support with logistics for town halls, press conferences, and other public-facing engagements, both virtual and in-person;",
      "Remain abreast of current legislative and non-legislative issues about which the Congresswoman may be questioned;",
      "Support on administrative functions of the office as needed, such as constituent calls and data entry;",
      "Maintain a good working relationship with the Congresswoman, staff, and constituents;",
      "Work well under pressure, handle stress, and accept performance-based criticism and direction;",
      "Work flexible schedule including long hours, nights and weekends, and perform other duties as assigned."
    ],
    "qualifications": [
      "Strong sense of virality on social media; narrative voice",
      "Ability to perform rapid response based on breaking news, memes and trends",
      "Proven track record developing and executing multi-platform communications and digital campaigns",
      "Writing, editing, and proofreading - especially social media posts",
      "Experience creating content using Adobe Suite (Illustrator, Photoshop and Premiere or Premiere Rush) - or equivalent tools",
      "Strong organizational skills, and ability to manage multiple tasks at once;",
      "Knowledge of news cycle and current issues and events in which the Congresswoman is involved;",
      "Ability to work cooperatively and courteously with others."
    ],
    "how_to_apply": "Please submit your resume, cover letter expanding on how your unique set of experiences suits you to excel in this role, 3 digital/creative samples and 3 references to SummerLeeJobs@mail.house.gov with the subject line “Digital/Press Associate” Digital portfolios or websites also accepted for creative samples.",
    "salary_info": "commensurate with experience, along with a competitive benefits package that includes health insurance, dental, federal student loan payments (terms apply)",
    "contact": "SummerLeeJobs@mail.house.gov",
    "equal_opportunity": "Our office prioritizes building a diverse team committed to advocating for the residents of PA-12. 1-3 years of digital, graphic design, press, organizing, or advocacy experience is strongly recommended. Candidates from BIPOC, LGBTQ+, working class, military, and/or other underrepresented communities are strongly encouraged to apply. As a practice as an office we do not require any pre-requisite degrees. Ties to Pennsylvania preferred, but not required."
  },
  {
    "id": "MEM-043-23",
    "position_title": "Legislative Director",
    "office": "Senior California Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-13",
    "description": "Senior California Democrat seeks a Legislative Director to oversee the Member’s legislative priorities and manage a portfolio centered on healthcare and Social Security.\n\nThis position will be tasked with:",
    "responsibilities": [
      "Managing legislative staff and the Member’s legislative portfolio in close consultation with the Deputy Chief of Staff.",
      "Monitoring the House floor and advising the Member on procedure.",
      "Handling the Member’s healthcare priorities as a senior member of the Energy and Commerce Committee and the House Democratic Caucus Task Force on Aging & Families. The legislative portfolio will be focused on mental health, telehealth, rare diseases, the 340B drug discount program, and public health among other issues."
    ],
    "qualifications": [
      "Hill experience is strongly preferred, but not required.",
      "Not an entry-level position"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and references in a single PDF to seniordemresumes@gmail.com. Please use “Legislative Director” as the subject.",
    "salary_info": null,
    "contact": "seniordemresumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Veterans, women, LGBTQ+ persons, and minority applicants are strongly encouraged to apply."
  },
  {
    "id": "MEM-042-23",
    "position_title": "Constituent Service Representative",
    "office": "Congressman David Trone (MD06)",
    "location": "Frederick, MD",
    "posting_date": "2023-02-13",
    "description": "Congressman David Trone (MD06) is seeking a high-energy, highly-organized, and detail-oriented Constituent Service Representative for his office in Frederick, MD.\n\nIdeal candidates will have 1-2 years of work experience in a relevant field. (public service, political campaigns, issue advocacy, community organizing, etc.)",
    "responsibilities": [
      "Staffer will work out of the District Office in Frederick, MD.",
      "Serve as the official representative for the Member in the community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Monitor and update the Member and District Director on local issues of importance.",
      "Staff and provide logistical support for district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Answer correspondence and verbal communications with constituents in a timely manner.",
      "Office administrative duties as needed."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of the legislative process.",
      "Knowledge of all issues in the district in which the Member is involved.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to MD06.jobs@gmail.com with “Constituent Service Representative - Frederick” in the subject line. No phone calls or walk-ins.",
    "salary_info": "Starting salary for this position is $50,000 plus full benefits.",
    "contact": "MD06.jobs@gmail.com",
    "equal_opportunity": "The Office of Congressman David Trone strongly values the diversity of our employees and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-041-23",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas), on the Ways & Means Committee",
    "location": "Washington, D.C.",
    "posting_date": "2023-02-13",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), on the Ways & Means Committee, seeks an experienced Legislative Assistant to assist with environmental, health care and other issues to be determined.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill or other policy or political experience strongly preferred, as well as a law or graduate degree.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor references to DoggettJobs@mail.house.gov. Use this title on your email: “Experienced LA Applicant” -- No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-024-23",
    "position_title": "Scheduler",
    "office": "Freshman Democrat from Hawai'i",
    "location": "DC and the district",
    "posting_date": "2023-02-13",
    "description": "The Freshman Democrat from Hawai'i is seeking a Scheduler with strong judgment, communication skills, and attention to detail to build and oversee all aspects of scheduling operations for the Member.\n\nThis position requires consistent and effective collaboration with all components of the Member's office. The Scheduler will work directly with the Chief of Staff, District Chief, and other senior staff.",
    "responsibilities": [
      "Building the Member's daily and long-term schedule for DC and the district and managing this system",
      "Responding to all incoming scheduling requests",
      "Booking and coordinating travel back to Hawai'i and within Hawai'i",
      "Ensuring the Member, staff, and external stakeholders have key information about the schedule",
      "Compiling daily briefing materials for the Member and coordinating the collection of information from staff and other sources",
      "Supporting the team with special events and ad hoc projects",
      "Other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a cover letter, resume, and references to hawaii02jobs@gmail.com.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, sexual orientation, or gender identity. Candidates from diverse backgrounds, especially with ties to Hawai'i, are encouraged to apply. Being able to serve as a secondary driver when needed is preferred, but not required."
  },
  {
    "id": "MEM-011-23",
    "position_title": "Communications Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "DC",
    "posting_date": "2023-02-13",
    "description": "The Congressional Black Caucus (CBC) seeks a Communications Director to lead an active communications operation.\n\nThis position manages both the long-term strategic communications strategy and day-to-day press for the Caucus, ranging from drafting statements on news of the day, to responding to press inquiries and pitching stories, to managing the CBC’s social media accounts and website, to setting up press availability opportunities (i.e., press conferences, press calls, or pen/pads), to developing and executing a long-term communications plan.\n\nIn addition to managing the communications of the CBC, this position also serves as a resource to all CBC Member offices to provide any communications counsel they may need.",
    "responsibilities": [
      "Working closely with the Executive Director and Policy Director to raise the policy agenda and platform of the Caucus through strategic messaging, earned media, and public outreach",
      "Substantial experience with and knowledge of Congressional affairs and the legislative process",
      "Experience with media pitching, booking television appearances/interviews, prepping a principal for print & television interviews/appearances",
      "Extensive relationships with DC and National print & television media",
      "Excellent oral and written communication skills",
      "Ability to work under pressure and meet quick deadlines",
      "Experience with communications including, social media, press releases, talking points, etc.",
      "Demonstrated experience working effectively with diverse coalitions"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multitask, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample/portfolio to Vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "Vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-611-22",
    "position_title": "Committee Clerk",
    "office": "Republican Staff of the House Judiciary Committee",
    "location": null,
    "posting_date": "2023-02-13",
    "description": "Clerks are responsible for the preparation of all committee activities, such as hearings and markups. Clerks ensure the committee is run efficiently by maintaining and organizing all committee records as well as assisting with the administrative functions of the committee. Qualified applicants will have at least one year of Hill experience as well as working knowledge of how Congressional committees operate.",
    "responsibilities": [
      "Preparation of all committee activities, such as hearings and markups.",
      "Maintaining and organizing all committee records.",
      "Assisting with the administrative functions of the committee."
    ],
    "qualifications": [
      "At least one year of Hill experience.",
      "Working knowledge of how Congressional committees operate."
    ],
    "how_to_apply": "Candidates can email their resume to Kiley.Bidelman@mail.house.gov.",
    "salary_info": null,
    "contact": "Kiley.Bidelman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-582-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Orange County",
    "posting_date": "2023-02-13",
    "description": "The Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.\n\nUnder the supervision of the Chief of Staff and the District Director, the Field Representative briefs the Member in preparation for district meetings with constituents and acts as the representative for the Member by attending events and meetings. This includes public speaking and certificate presentations.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible scheduling, including nights and weekends",
      "Constituent service oriented; patient empathetic, and desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director, Office of Congresswoman\nSteel Stephanie.Hu@mail.house.gov",
    "salary_info": "Salary range is $49,000-$57,000. Salary commensurate with experience.",
    "contact": "Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  }
]