[
  {
    "id": "MEM-587-21",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Lisa Blunt Rochester (DE-At Large)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "Congresswoman Lisa Blunt Rochester (DE-At Large) seeks an organized and highly motivated self-starter to serve as Staff Assistant in her Washington, DC office. Responsibilities include logging phone calls, greeting visitors, managing front office operations, handling tour and flag requests, assisting with drafting constituent correspondence, overseeing the intern program, providing administrative support to the team, and additional duties as assigned. This position reports directly to the Chief of Staff.",
    "responsibilities": [
      "Logging phone calls",
      "Greeting visitors",
      "Managing front office operations",
      "Handling tour and flag requests",
      "Assisting with drafting constituent correspondence",
      "Overseeing the intern program",
      "Providing administrative support to the team",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Attention to detail",
      "An ability to work under pressure",
      "A strong commitment to public service",
      "Previous Capitol Hill experience and Delaware ties are a plus."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and 1-2 page writing sample to lbr.jobposting@gmail.com with “Staff Assistant Application” in the subject line by Monday, December 27th. No walk-ins, emails, or phone calls please.",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-586-21",
    "position_title": "Professional Staff or Counsel",
    "office": "House Committee on Energy and Commerce Oversight and Investigations Subcommittee",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "The House Committee on Energy and Commerce Oversight and Investigations Subcommittee is seeking a mid-level Professional Staff or Counsel to work on oversight issues related to the Committee’s broad jurisdiction for the Committee’s Democratic staff. Prior familiarity working for or with Congress and area(s) of expertise under the Committee’s jurisdiction—including environment, energy, health care, public health, or consumer protection—is required.",
    "responsibilities": [
      "Staffing congressional hearings",
      "Assisting in the management of investigations of governmental and non-governmental entities",
      "Conducting research, document review, and analysis",
      "Aiding in the drafting of official letters, memoranda, and investigative reports",
      "Helping to coordinate with other subcommittees of the full Committee"
    ],
    "qualifications": [
      "The successful candidate will be a detail-oriented and proactive self-starter with strong communication and writing skills.",
      "A minimum of five years of work experience is required.",
      "An advanced degree is preferred but not required, as experience within the areas of the Committee’s jurisdiction may be equally relevant."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and short writing sample to ecdjobs@mail.house.gov with the subject line, “E&C OI Professional Staff/Counsel.”",
    "salary_info": "Salary is commensurate with experience in the $80K–$90K range.",
    "contact": "ecdjobs@mail.house.gov",
    "equal_opportunity": "People of color, veterans, women, and LGBTQ+ candidates are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-585-21",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Science, Space, and Technology",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The Chairwoman of the House Committee on Science, Space, and Technology seeks a professional staff member for the Committee's Environment Subcommittee.\n\nDuties include staffing hearings; preparing memos, statements, and speeches; conducting outreach to stakeholder groups; drafting legislation; and conducting oversight. Applicant should have familiarity and experience with environmental policy issues. The Subcommittee jurisdiction includes environmental research and standards; environmental research and development programs at the Environmental Protection Agency; climate change research and development; and activities and programs related to weather and weather services, climate, satellites, and oceanic and atmospheric research at the National Oceanic and Atmospheric Administration.\n\nKnowledge of the programs and activities within the Subcommittee's jurisdiction is desirable. Applicant should possess strong writing, organizational, and communications skills, including the ability to articulate technical and policy issues clearly and concisely; the ability to be responsive to and work with Members of the Committee; and the ability to meet tight deadlines. The ideal candidate will have congressional and/or relevant government or industry experience.\n\nThis is not an entry-level position and prior Hill experience is strongly preferred.",
    "responsibilities": [
      "Staffing hearings",
      "Preparing memos, statements, and speeches",
      "Conducting outreach to stakeholder groups",
      "Drafting legislation",
      "Conducting oversight"
    ],
    "qualifications": [
      "Familiarity and experience with environmental policy issues",
      "Knowledge of the programs and activities within the Subcommittee's jurisdiction is desirable",
      "Strong writing, organizational, and communications skills, including the ability to articulate technical and policy issues clearly and concisely",
      "The ability to be responsive to and work with Members of the Committee",
      "The ability to meet tight deadlines",
      "Congressional and/or relevant government or industry experience (ideal)",
      "Prior Hill experience strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": "We are equal opportunity employers; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression. No calls or drop-ins please.",
    "deadline": "2021-01-07"
  },
  {
    "id": "MEM-583-21",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "Responsibilities include welcoming office visitors, answering telephone calls, coordinating flag and tour requests, sorting and processing constituent correspondence, and other administrative duties as assigned. The ideal candidate will be detail-oriented, able to multi-task and have a positive attitude. Connecticut ties are a plus, but not required. Minority candidates are strongly encouraged to apply.",
    "responsibilities": [
      "welcoming office visitors",
      "answering telephone calls",
      "coordinating flag and tour requests",
      "sorting and processing constituent correspondence",
      "other administrative duties as assigned"
    ],
    "qualifications": [
      "detail-oriented",
      "able to multi-task",
      "have a positive attitude",
      "Connecticut ties are a plus, but not required"
    ],
    "how_to_apply": "Interested parties should email a cover letter, resume, writing sample and two references in a single PDF to ct05jobs@mail.house.gov with the following subject line: Full name – Staff Assistant. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "ct05jobs@mail.house.gov",
    "equal_opportunity": "Minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-582-21",
    "position_title": "Staff Assistant/ Full Committee Legislative Coordinator",
    "office": "U.S. House Committee on Veterans’ Affairs (Republican Staff)",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "The front office Staff Assistant and Legislative Coordinator would report directly to the Full Committee Deputy Staff Director and should have excellent oral and communication skills, strong organizational skills, attention to detail, a positive attitude and ability to work cooperatively and courteously with others, and a sense of humor.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Qualified candidates please send resumes only to the following e-mail address: VAR.Resumes@mail.house.gov with “HVAC Republican Staff Assistant” in the subject line. No calls or walk-ins.\nYour resume will be reviewed to determine if you are among the most qualified candidates. If you are one of the top candidates, you will be contacted for an interview.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-578-21",
    "position_title": "Press Secretary",
    "office": "Conservative Colorado member",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "Conservative Colorado member seeks Press Secretary to work under Communications Director for fast-paced office with strong social media presence.",
    "responsibilities": [],
    "qualifications": [
      "Skills in graphic design and digital media strongly preferred."
    ],
    "how_to_apply": "Email co04.resumes@gmail.com with a resume.",
    "salary_info": null,
    "contact": "co04.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-577-21",
    "position_title": "Deputy Chief/Counsel",
    "office": "Conservative Colorado member",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "for judiciary committee portfolio with an emphasis on tech and antitrust issues. Law degree strongly preferred but not required. Comfort with a fast-paced, intense work environment a must.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Email co04.resumes@gmail.com with a resume.",
    "salary_info": null,
    "contact": "co04.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-574-21",
    "position_title": "Clerk/Special Assistant to the Staff Director",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Clerk/Special Assistant to the Staff Director to support the Chief Clerk and Staff Director.\n\nThe candidate will be responsible for administrative tasks, including but not limited to, processing oversight mail, scheduling staff director’s meetings, managing the hearings calendar, managing hearing correspondence, co-leading the transcript review process, preparing hearing invitations, tracking hearing submissions, and documenting member and/or staff attendance.\n\nThe qualified candidate will be extremely organized, have editing skills, be attentive to detail, be hardworking, innovative, and able to handle assigned tasks in a demanding, fast-paced office. Ideal candidates will have a bachelor’s degree, 1-2 years of administrative experience, and congressional experience is preferred, but not required.",
    "responsibilities": [
      "Processing oversight mail",
      "Scheduling staff director’s meetings",
      "Managing the hearings calendar",
      "Managing hearing correspondence",
      "Co-leading the transcript review process",
      "Preparing hearing invitations",
      "Tracking hearing submissions",
      "Documenting member and/or staff attendance"
    ],
    "qualifications": [
      "Extremely organized",
      "Editing skills",
      "Attentive to detail",
      "Hardworking",
      "Innovative",
      "Able to handle assigned tasks in a demanding, fast-paced office",
      "Bachelor’s degree",
      "1-2 years of administrative experience",
      "Congressional experience is preferred, but not required"
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter and resume to E&L.Jobs@mail.house.gov with “Clerk/Special Assistant to the Staff Director” in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-571-21",
    "position_title": "Field Representative",
    "office": "Congressman Jimmy Gomez",
    "location": "Los Angeles, CA",
    "posting_date": "2021-12-20",
    "description": "Congressman Jimmy Gomez seeks a Field Representative, based in his Los Angeles, CA office, to lead the grant program and cover a variety of issues including criminal justice reform, foreign affairs, and other social policy issues.\n\nJob responsibilities include representing the Member at public events, identifying issues related to federal programs, managing correspondence and acknowledgements from the office, organizing outreach events, meeting with",
    "responsibilities": [
      "Representing the Member at public events",
      "Identifying issues related to federal programs",
      "Managing correspondence and acknowledgements from the office",
      "Organizing outreach events",
      "Meeting with constituent and community leaders",
      "Serving as a liaison with federal, state, and local agencies, committees, and interested parties."
    ],
    "qualifications": [
      "Must be comfortable working with the public",
      "Have excellent writing and time management skills",
      "A willingness to collaborate in a team",
      "Show initiative in advancing the Congressman's priorities",
      "Willingness to work flexible hours, including nights and occasional weekends."
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and three writing samples in a PDF format to Gomez.Jobs@mail.house.gov with the subject line “Last Name _ Field Representative.” No calls or drop-ins please.",
    "salary_info": null,
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-570-21",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized and\nprofessional individual for the position of Staff Assistant. The successful\napplicant will be personable, organized, possess excellent communication and\ntime-management skills, the ability to exercise sound, independent judgment, and\nthe ability to work cooperatively and courteously with others.\n\nThis individual will help manage the intern program; including interviewing,\nhiring, and assigning daily tasks. They will also be responsible for maintaining\nthe office's task management system, tasking out memos to staff, and\noccasionally driving the Congressman.\n\nAdditional daily responsibilities include answering phones, processing mail,\nassisting with constituent requests for information, coordinating tours, and other\nadministrative duties supporting the Member and staff as needed.",
    "responsibilities": [
      "Manage the intern program; including interviewing, hiring, and assigning daily tasks.",
      "Responsible for maintaining the office's task management system, tasking out memos to staff.",
      "Occasionally driving the Congressman.",
      "Answering phones.",
      "Processing mail.",
      "Assisting with constituent requests for information.",
      "Coordinating tours.",
      "Other administrative duties supporting the Member and staff as needed."
    ],
    "qualifications": [
      "Personable",
      "Organized",
      "Excellent communication and time-management skills",
      "Ability to exercise sound, independent judgment",
      "Ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to staffassistant.resume@gmail.com.",
    "salary_info": null,
    "contact": "staffassistant.resume@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-567-21",
    "position_title": "Military Legislative Assistant (MLA)",
    "office": "Congressman C.A. Dutch Ruppersberger",
    "location": "D.C.",
    "posting_date": "2021-12-20",
    "description": "Congressman C.A. Dutch Ruppersberger, a Senior Member of the Appropriations\nCommittee, seeks an experienced Military Legislative Assistant (MLA) to join\nour D.C.-based team.\n\nThis is not an entry-level position. Significant Capitol Hill experience is required,\nwith direct legislative expertise handling defense, national security, technology,\ncybersecurity, and veterans’ affairs policy. Candidate should have a strong track\nrecord of creating and translating policy priorities into successful legislative and\nappropriations outcomes. Candidate should be coachable, responsive to feedback.\nCandidate should also be able to work both autonomously and within a wellestablished team. Communication is essential in this job. Travel to the district is\nto be expected.\n\nCandidate should have a good sense of humor, strong interpersonal skills and\nability to develop proactive relationships with relevant stakeholders. Candidate\nwill be expected to frequently brief the Member and demonstrate strong verbal\ncommunication skills. Candidate will work directly with the Congressman, Chief\nof Staff, and Legislative Director to advance the Congressman’s appropriations\nand authorizing priorities.",
    "responsibilities": [
      "Brief the Member",
      "Work directly with the Congressman, Chief of Staff, and Legislative Director to advance the Congressman’s appropriations and authorizing priorities"
    ],
    "qualifications": [
      "Significant Capitol Hill experience is required, with direct legislative expertise handling defense, national security, technology, cybersecurity, and veterans’ affairs policy",
      "Strong track record of creating and translating policy priorities into successful legislative and appropriations outcomes",
      "Coachable, responsive to feedback",
      "Ability to work both autonomously and within a well-established team",
      "Good sense of humor, strong interpersonal skills and ability to develop proactive relationships with relevant stakeholders",
      "Strong verbal communication skills",
      "Baltimore ties are a plus"
    ],
    "how_to_apply": "To apply send a resume, cover letter, policy memo, and three references\nto walter.gonzales@mail.house.gov with the following subject line: [First Name\nLast Name] – Military Legislative Assistant. No phone calls, faxes, or walk-ins,\nplease.",
    "salary_info": null,
    "contact": "walter.gonzales@mail.house.gov",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not\ndiscriminate on the basis of race, color, religion, sex (including marital or\nparental status, sexual orientation, and gender identity), disability, age, or\nnational origin."
  },
  {
    "id": "MEM-565-21",
    "position_title": "Assistant Clerk/Security Manager",
    "office": "House Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "The House Committee on Oversight and Reform, Democratic (Majority) Staff, is\nseeking a detail-oriented and organized Assistant Clerk/Security Manager.\nThe incumbent will work with the Chief Clerk and Deputy Chief Clerk to\ncoordinate logistical aspects of hearings, markups, and Committee meetings.\nOther responsibilities include managing the Legislative Calendar, hearing\ndocuments, Committee archives, and the transcript review process. The\nincumbent will serve as the Committee’s Security Manager and manage classified\nand sensitive materials, briefings, hearings, meetings, etc.\nResponsibilities also include managing security clearances for Members and\nstaff, managing the Committee SCIF, and coordinating as appropriate with the\nHouse Security Office. Candidates must possess excellent attention to detail,\ngood written and verbal communication skills, and be able to handle multiple\nprojects simultaneously in a demanding work environment. A TS or TS/SCI\nclearance, or the ability to obtain one, is required. Prior Hill experience is\nstrongly preferred.",
    "responsibilities": [
      "Coordinate logistical aspects of hearings, markups, and Committee meetings.",
      "Managing the Legislative Calendar",
      "Managing hearing documents",
      "Managing Committee archives",
      "Managing the transcript review process",
      "Serve as the Committee’s Security Manager and manage classified and sensitive materials, briefings, hearings, meetings, etc.",
      "Managing security clearances for Members and staff",
      "Managing the Committee SCIF",
      "Coordinating as appropriate with the House Security Office"
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Good written and verbal communication skills",
      "Ability to handle multiple projects simultaneously in a demanding work environment",
      "A TS or TS/SCI clearance, or the ability to obtain one, is required.",
      "Prior Hill experience is strongly preferred."
    ],
    "how_to_apply": "Interested candidates should e-mail a cover letter and resume to oversightjobs@mail.house.gov, with “Assistant Clerk/Security Manager” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-561-21",
    "position_title": "Counsel",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Subcommittee on Economic and Consumer Policy, Democratic (Majority) Staff",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "The Committee on Oversight and Reform is the principal investigative body for the U.S. House of Representatives. The Subcommittee on Economic and Consumer Policy conducts investigations, writes reports, and holds hearings on a wide range of issues affecting consumers (e.g., marketing e-cigarettes to children; the presence of lead and other toxic metals in baby food).\n\nThe ideal candidate will be a strong writer with prior investigative experience and a demonstrated interest in consumer protection.",
    "responsibilities": [
      "Developing ideas for investigations",
      "Drafting document requests",
      "Reviewing documents",
      "Interviewing witnesses",
      "Writing reports",
      "Preparing for hearings"
    ],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Economic and Consumer Policy” in the subject line. Please use the following formats for file names: “LastName.FirstName.Resume” and “LastName.FirstName.CoverLetter.”",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-559-21",
    "position_title": "Communications Director",
    "office": "Blue Dog Coalition",
    "location": "U.S. House of Representatives",
    "posting_date": "2021-12-20",
    "description": "The Democratic Blue Dog Coalition is seeking an experienced communications professional to serve as the communications director in the U.S. House of Representatives.\n\nThis position serves as a shared staffer who advises the Coalition’s leadership on communications and outreach efforts to maintain the Coalition’s longstanding brand of dedication to fiscal responsibility, a strong national defense, and pragmatic governance. This position works together with the Coalition’s Executive Director and Policy Coordinator, as well as the Coalition’s Co-Chair for Communications and Outreach and other Co-Chairs and their staff to develop strategic positions on policy and legislative issues that fall under the Coalition’s policy focus.\n\nThis position manages both the long-term strategic communications strategy and day-to-day press for the Coalition, ranging from drafting statements on news of the day, to responding to press inquiries and pitching stories, to managing the Coalition’s social media accounts and website, to setting up press availability opportunities (i.e. press conferences, press calls, or pen/pads), to developing and executing a long-term communications plan.\n\nIn addition to managing the communications of the Coalition, this position also serves as a resource to all Coalition Member offices to provide any communications counsel they may need. This position requires someone who is a resourceful team player who can track frequently changing, complex policy and legislative dynamics, understand the priorities and political calculus of individual Blue Dog Members, and manage multiple projects simultaneously.\n\nThis is not an entry level position. Past communications experience in a House frontline office or for a competitive House campaign is a strong plus. Previous Capitol Hill experience is a plus.",
    "responsibilities": [],
    "qualifications": [
      "At least three to four years of previous professional communications experience.",
      "Experience at a college student media organization and/or a bachelor’s degree in journalism, public relations or another related field is a plus, but not required.",
      "Strong writing and editing skills as well as attention to detail. This person will be expected to draft talking points and other messaging materials, press releases, newsletters, op-eds, letters, and other written material coming from the Coalition.",
      "Ability to work well under the pressure of tight deadlines while also managing multiple major projects and approval processes at once.",
      "Ability to work independently as well as in team environments.",
      "Ability to develop and maintain relationships with print, digital and broadcast reporters.",
      "Existing relationships with members of the Capitol Hill press corps is a plus.",
      "Digital experience is a plus.",
      "A strong understanding of narrative and brand management.",
      "Ability to track news of the day and remain knowledgeable of issues the Coalition’s leadership may be expected to weigh in on publicly.",
      "Knowledge of legislative procedures.",
      "Ability to work amicably with a wide variety of personalities, to exercise discretion, to learn quickly, and to get the job done without needing to be reminded. This job requires someone with a diplomatic, cooperative personality."
    ],
    "how_to_apply": "Candidates should submit a cover letter (with salary requirements), resume, at least two writing samples, all three in a PDF format, as attachments to BlueDogResumes@gmail.com with the subject line “Communications Director” by Friday, December 31.",
    "salary_info": null,
    "contact": "BlueDogResumes@gmail.com",
    "equal_opportunity": "The Blue Dog Coalition is an equal opportunity employer and does not discriminate on the bases of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-556-21",
    "position_title": "Director of Financial Disclosure",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The Committee on Ethics seeks an experienced government ethics attorney to serve as the Director of Financial Disclosure for the Committee.\n\nThe Director will oversee the Committee’s Financial Disclosure Office and will manage a nonpartisan staff of attorneys and other professionals. The Financial Disclosure Office is responsible for reviewing and certifying financial statements; providing legal advice on a high volume of financial disclosure issues; and educating and training Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess a minimum of 5 years of experience with government ethics, outstanding analytical and written and oral communication skills, the ability to build consensus, and the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.\n\nExperience in one or more of the following areas is also desirable: ethics counseling and training, accounting, auditing, investment management, taxation, corporate finance, securities law, and familiarity with Congress and its unique institutional prerogatives. Previous management experience preferred.",
    "responsibilities": [
      "Oversee the Committee’s Financial Disclosure Office.",
      "Manage a nonpartisan staff of attorneys and other professionals.",
      "Reviewing and certifying financial statements.",
      "Providing legal advice on a high volume of financial disclosure issues.",
      "Educating and training Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product."
    ],
    "qualifications": [
      "Minimum of 5 years of experience with government ethics.",
      "Outstanding analytical and written and oral communication skills.",
      "Ability to build consensus.",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
      "Experience in one or more of the following areas is also desirable: ethics counseling and training, accounting, auditing, investment management, taxation, corporate finance, securities law, and familiarity with Congress and its unique institutional prerogatives.",
      "Previous management experience preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Director of Financial” in the subject line.",
    "salary_info": "$161,700 to $172,500, with the possibility for discretionary bonuses.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-553-21",
    "position_title": "Professional Staff – Labor",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks a Professional Staff – Labor position based in Washington, DC to provide legislative analysis on a broad range of labor and employment policy.\n\nThe ideal candidate will have excellent writing, analytical, and interpersonal skills, with a proven ability to prioritize, multi-task, and meet tight deadlines in a rigorous environment. Knowledge of the legislative process, prior Hill experience and relevant experience in labor policy is desirable.",
    "responsibilities": [
      "assisting the labor policy team in the formulation of legislative initiatives",
      "working with stakeholders",
      "tracking legislation developments",
      "responding to member staff"
    ],
    "qualifications": [
      "excellent writing, analytical, and interpersonal skills",
      "proven ability to prioritize, multi-task, and meet tight deadlines in a rigorous environment",
      "knowledge of the legislative process, prior Hill experience and relevant experience in labor policy is desirable"
    ],
    "how_to_apply": "To apply, applicants must submit a cover letter, resume, 2 writing samples (3-5 pages), and 3 professional references.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-552-21",
    "position_title": "Labor Policy Counsel",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an\nexperienced attorney for a Labor Policy Counsel position based in Washington, DC to provide legal analysis on legislative issues.\n\nQualified candidates will have policy or legal experience related to employment\nand labor law with a strong emphasis on knowledge of the National Labor\nRelations Act, Fair Labor Standards Act, and Family and Medical Leave Act. In\naddition, expertise with federal prevailing wage laws, child labor laws, guest\nworker programs, workplace safety or federal workers’ compensation laws is\ndesirable.",
    "responsibilities": [],
    "qualifications": [
      "Qualified applicants must have a J.D. with at least 3-5 years of experience in the legal field, with a strong preference for previous executive branch experience and/or relative legislative experience in labor policy.",
      "The candidate should also possess a strong work ethic, should work well in a team, and should be comfortable working in a fast-paced environment."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, 2 writing samples (5-10 pages), and 3 professional references. Please submit all materials to E&L.Jobs@mail.house.gov with “Labor Policy Counsel” in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-551-21",
    "position_title": "Civil Rights Counsel - Labor and Health",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an experienced attorney for a Civil Rights Counsel - Labor and Health position based in Washington, DC to provide legal analysis on legislative issues involving civil rights, labor and health.\nQualified applicants must have a J.D. with at least 5+ years of experience in the legal field, with a strong preference for previous executive branch experience and/or relative legislative experience in labor and health policy. The candidate must demonstrate a strong understanding of civil rights statutes, possess a strong work ethic, should work well in a team, and should be comfortable working in a fast-paced environment.",
    "responsibilities": [],
    "qualifications": [
      "J.D. with at least 5+ years of experience in the legal field",
      "Strong preference for previous executive branch experience and/or relative legislative experience in labor and health policy",
      "Strong understanding of civil rights statutes",
      "Strong work ethic",
      "Ability to work well in a team",
      "Comfortable working in a fast-paced environment"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, 2 writing samples (5-10 pages), and 3 professional references. Please submit all materials to E&L.Jobs@mail.house.gov with “Civil Rights Counsel – Labor and Health” in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-550-21",
    "position_title": "Civil Rights Counsel – Education",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an\nexperienced attorney for a Civil Rights Counsel – Education position based in\nWashington, DC to provide legal analysis on legislative issues involving civil\nrights and education.",
    "responsibilities": [],
    "qualifications": [
      "Must have a J.D. with at least 5+ years of experience in the legal field, with a strong preference for previous executive branch experience and/or relative legislative experience in education policy.",
      "The candidate must demonstrate a strong understanding of civil rights statues, possess a strong work ethic, should work well in a team, and should be comfortable working in a fastpaced environment."
    ],
    "how_to_apply": "To apply, applicants must submit a resume, 2 writing samples (5-10 pages), and 3\nprofessional references. Please submit all materials\nto E&L.Jobs@mail.house.gov with “Civil Rights Counsel – Education” in the\nsubject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, national origin, age, disability, gender identity,\nor sexual orientation. Candidates of diverse backgrounds are strongly encouraged\nto apply."
  },
  {
    "id": "MEM-549-21",
    "position_title": "Oversight Counsel – Labor and Health",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an experienced attorney for an Oversight Counsel – Labor and Health position based in Washington, DC to manage oversight and investigations on the labor and health team.\n\nResponsibilities include organizing oversight hearings, writing investigative reports and executing a complementary legislative and oversight strategy with positive results. Qualified applicants must have a J.D. and relevant policy experience with at least 3-5 years of experience conducting investigations.\n\nExperience in labor and health policy is not a requirement, however preferred.\n\nIn addition, the applicant must have exceptional writing skills, strong attention to detail, and the ability to juggle multiple projects. To apply, applicants must submit a resume, a writing sample (5-10 pages), a writing sample describing an investigation the applicant would like to pursue, and 3 professional references.\n\nThe second writing sample must include a hyperlink to a current news item from any source (newspapers, blogs, or other websites) and two paragraphs detailing why the Committee should investigate the issue presented and the steps the applicant would take to begin an investigation.",
    "responsibilities": [
      "organizing oversight hearings",
      "writing investigative reports",
      "executing a complementary legislative and oversight strategy with positive results"
    ],
    "qualifications": [
      "J.D.",
      "relevant policy experience with at least 3-5 years of experience conducting investigations",
      "exceptional writing skills",
      "strong attention to detail",
      "the ability to juggle multiple projects"
    ],
    "how_to_apply": "Please submit all materials to E&L.Jobs@mail.house.gov with “Oversight Counsel – Labor and Health” in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-548-21",
    "position_title": "Oversight Counsel – Education",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": "Washington, DC",
    "posting_date": "2021-12-20",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks an experienced attorney for an Oversight Counsel – Education position based in Washington, DC to manage oversight and investigations on the education team.\n\nResponsibilities include organizing oversight hearings, writing investigative reports and executing a complementary legislative and oversight strategy with positive results. Qualified applicants must have a J.D. and relevant policy experience with at least 3-5 years of experience conducting investigations.\n\nExperience in education policy is not a requirement, however preferred. In addition, the applicant must have exceptional writing skills, strong attention to detail, and the ability to juggle multiple projects.",
    "responsibilities": [
      "organizing oversight hearings",
      "writing investigative reports",
      "executing a complementary legislative and oversight strategy with positive results"
    ],
    "qualifications": [
      "J.D.",
      "relevant policy experience with at least 3-5 years of experience conducting investigations",
      "exceptional writing skills",
      "strong attention to detail",
      "ability to juggle multiple projects"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, a writing sample (5-10 pages), a writing sample describing an investigation the applicant would like to pursue, and 3 professional references. The second writing sample must include a hyperlink to a current news item from any source (newspapers, blogs, or other websites) and two paragraphs detailing why the Committee should investigate the issue presented and the steps the applicant would take to begin an investigation. Please submit all materials to E&L.Jobs@mail.house.gov with “Oversight Counsel - Education” in the subject line.",
    "salary_info": "Salary commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-546-21",
    "position_title": "Constituent Liaison",
    "office": "Senior Democratic Member of Congress",
    "location": "District Office",
    "posting_date": "2021-12-20",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the District Office of her very active and visible constituent services staff.\n\nConstituent Services staff assists the Member in responding to constituent issues and problems with federal agencies, staying on top of everyday events in the Member’s district, and keeping the community connected to the Member’s work. In addition, constituent services staff also help with neighborhood events.\n\nCandidate must be able to work with patience and skill in resolving the problems of constituents and handle multiple tasks and issues effectively while making sure agencies respond in a timely manner and assuring our office responds to constituent requests and concerns while meeting deadlines. A successful candidate will be able to work independently and think outside the box about various constituent issues and community events. Prior community or casework experience is helpful.",
    "responsibilities": [
      "Assisting the Member in responding to constituent issues and problems with federal agencies",
      "Staying on top of everyday events in the Member’s district",
      "Keeping the community connected to the Member’s work",
      "Help with neighborhood events",
      "Resolving the problems of constituents",
      "Handling multiple tasks and issues effectively while making sure agencies respond in a timely manner",
      "Assuring our office responds to constituent requests and concerns while meeting deadlines"
    ],
    "qualifications": [
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "A working knowledge or strong interest in the District of Columbia and its local government",
      "Bachelor’s degree",
      "Be, or be willing to become, a resident of the District of Columbia"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, two writing samples and references to: dc00.nortonresume@mail.house.gov.",
    "salary_info": "Salary: based on skill and experience level.",
    "contact": "dc00.nortonresume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-545-21",
    "position_title": "Chief Counsel",
    "office": "Congressman Ken Buck, the Ranking Member of House Antitrust Subcommittee and Senior member of the Judiciary Committee",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "Responsibilities include working with the Chief of Staff and Legislative Director to develop legislative strategies and advance the Congressman's priorities through Judiciary Committee hearings and oversight; researching and writing legal memoranda and briefs; conducting executive and judicial branch oversight and investigations; developing and composing oversight letters; developing and drafting legislation; working with communications staff; and meeting with stakeholders.",
    "responsibilities": [
      "Working with the Chief of Staff and Legislative Director to develop legislative strategies and advance the Congressman's priorities through Judiciary Committee hearings and oversight",
      "Researching and writing legal memoranda and briefs",
      "Conducting executive and judicial branch oversight and investigations",
      "Developing and composing oversight letters",
      "Developing and drafting legislation",
      "Working with communications staff",
      "Meeting with stakeholders"
    ],
    "qualifications": [
      "Exceptionally strong writers",
      "Detail-oriented",
      "Able to work under tight deadlines",
      "Able to handle multiple projects at once",
      "Previous Hill experience in strongly advised"
    ],
    "how_to_apply": "Please submit a resume to: co04.resumes@gmail.com",
    "salary_info": null,
    "contact": "co04.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-544-21",
    "position_title": "Scheduler",
    "office": "Bay Area Democrat",
    "location": "Washington DC",
    "posting_date": "2021-12-20",
    "description": "Scheduler will manage all aspects of the Member's daily and long-term schedule in DC and in the district. This individual will work closely with the member, DC and district staff.\nThis person should be well-organized, detail-oriented, self-motivated, and able to work effectively in a fast-paced office.",
    "responsibilities": [
      "Tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating travel for the member",
      "Managing operational and logistical support for the office"
    ],
    "qualifications": [
      "Prior scheduling experience on the Hill or comparable work environment",
      "Well-organized",
      "Detail-oriented",
      "Self-motivated",
      "Able to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Please submit your resume, cover letter and two references to CAHouseJob@mail.house.gov and include “Scheduler” in the subject line.",
    "salary_info": null,
    "contact": "CAHouseJob@mail.house.gov",
    "equal_opportunity": "Women, LGBTQ+, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with California ties."
  },
  {
    "id": "MEM-543-21",
    "position_title": "Digital Director/Press Secretary",
    "office": "Congressman Jim Clyburn, Chairman of the House Select Subcommittee on the Coronavirus Crisis",
    "location": null,
    "posting_date": "2021-12-20",
    "description": "Congressman Jim Clyburn, Chairman of the House Select Subcommittee on the Coronavirus Crisis, seeks a Digital Director/Press Secretary to lead the Majority staff’s digital strategy and support all aspects of the committee’s press operations.\n\nThe ideal candidate will have extensive experience in graphic design and developing social media content, as well as impeccable writing skills and experience drafting and editing press releases, op-eds, and talking points.",
    "responsibilities": [
      "Developing all social media content and actively managing the committee’s social media platforms and website",
      "Developing graphical content for committee reports and visual aids for hearings and other events",
      "Video filming and editing and photography",
      "Working with the house recording studio to manage livestreams for hearings and other events",
      "Working with the Communications Director to draft press releases and other materials",
      "Compiling and maintaining press lists",
      "Responding to media inquiries",
      "Coordinating interviews and press events"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Work well under pressure",
      "Be self-motivated",
      "Willing to be responsive outside of normal business hours",
      "Enjoy working on a team",
      "Several years of congressional or other political experience are preferred."
    ],
    "how_to_apply": "Please send a resume, cover letter, digital portfolio and one short writing sample to SSCCJobs@mail.house.gov, with “Digital Director/Press Secretary” in the subject line.",
    "salary_info": null,
    "contact": "SSCCJobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-542-21",
    "position_title": "District Staff Member",
    "office": "Congressman David Trone (MD06)",
    "location": "Hagerstown and Cumberland District Offices, Western Maryland",
    "posting_date": "2021-12-20",
    "description": "Congressman David Trone (MD06) is seeking a high-energy, highly-organized, and detail-oriented District Staff Member for his offices in Western Maryland.",
    "responsibilities": [
      "Staffer will work out of the Hagerstown and Cumberland District Offices.",
      "Serve as the official representative for the Member in the Western Maryland community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Monitor and update the Member and District Director on local issues of importance.",
      "Staff and provide logistical support for district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Answer correspondence and verbal communications with constituents in a timely manner.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of the legislative process.",
      "Knowledge of all issues and events in the district in which the Member is involved.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to md06.jobs@gmail.com with “District Staff” in the subject line. No phone calls or walk-ins.",
    "salary_info": null,
    "contact": "md06.jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-539-21",
    "position_title": "Staff Assistant",
    "office": "Nevada’s 4th District Democratic Member of Congress",
    "location": "North Las Vegas, Nevada District office",
    "posting_date": "2021-12-20",
    "description": "Nevada’s 4th District Democratic Member of Congress seeks a highly organized, passionate, team-oriented Staff Assistant for a position in our North Las Vegas, Nevada District office. Candidates must be comfortable working with the public, have excellent oral and written communication skills, problem solving abilities.",
    "responsibilities": [
      "Managing the front desk, greeting visitors, processing flag requests, answering phones, conducting tours, overseeing an active mail program",
      "Sorting/batching correspondence, drafting correspondence and ensuring a swift turnaround time",
      "Responding to constituent mail, keeping abreast of legislative developments, and meeting with constituent groups",
      "Assisting District Representatives as needed",
      "Perform all other duties as assigned and required"
    ],
    "qualifications": [
      "Passionate about public service and committed to democratic values",
      "Strong writing, communication skills and be detail-oriented",
      "Have advanced experience with spreadsheets and forms",
      "A poised, confident, self-starter, and team-player with a sense of humor",
      "The ability to work in a high-paced environment.",
      "The ability work weekends and holidays",
      "Have reliable transportation, auto insurance and a clean driving record",
      "Currently enrolled in an ungraduated degree program at a college or university or have a minimum of a bachelor’s degree in the related fields of human services or social work, and a minimum of one-year relevant experience in community or human services."
    ],
    "how_to_apply": "Qualified candidates must include a cover letter, resume, one writing sample and three professional references in a single PDF file. Email submissions to the Director of Administration, nv04resume@mail.house.gov. Subject line must read",
    "salary_info": null,
    "contact": "Director of Administration, nv04resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. Spanish language skills and District ties are a plus."
  },
  {
    "id": "MEM-NV04-02",
    "position_title": "Digital Assistant",
    "office": "Rep. Steven Horsford",
    "location": "Washington, D.C.",
    "posting_date": "2021-12-20",
    "description": "Rep. Steven Horsford is seeking a Digital Assistant to assist the Communications Director with digital communications and media relations. Responsibilities include managing the Congressman's social media accounts, drafting content for social media, assisting with video and graphic content creation, monitoring news coverage, updating media contact lists, and assisting with press events. Nevada ties are a plus. \n\nThis office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation.",
    "responsibilities": [
      "Managing the Congressman's social media accounts",
      "Drafting content for social media",
      "Assisting with video and graphic content creation",
      "Monitoring news coverage",
      "Updating media contact lists",
      "Assisting with press events"
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should email a resume, cover letter, and 2-3 social media writing samples to NV04Resumes@mail.house.gov. Please include Digital Assistant in the subject line.",
    "salary_info": null,
    "contact": "NV04Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation."
  },
  {
    "id": "MEM-NV04-03",
    "position_title": "Legislative Correspondent",
    "office": "Rep. Steven Horsford",
    "location": "Washington, D.C.",
    "posting_date": "2021-12-20",
    "description": "Rep. Steven Horsford is seeking a Legislative Correspondent. Responsibilities include managing a portfolio of issues, drafting constituent correspondence, assisting with legislative research, and other legislative tasks as assigned. Nevada ties are a plus.\n\nThis office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation.",
    "responsibilities": [
      "Managing a portfolio of issues",
      "Drafting constituent correspondence",
      "Assisting with legislative research",
      "Other legislative tasks as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should email a resume, cover letter, and 1-2 writing samples to NV04Resumes@mail.house.gov. Please include Legislative Correspondent in the subject line.",
    "salary_info": null,
    "contact": "NV04Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation."
  },
  {
    "id": "MEM-NV04-04",
    "position_title": "Staff Assistant",
    "office": "Rep. Steven Horsford",
    "location": "Washington, D.C.",
    "posting_date": "2021-12-20",
    "description": "Rep. Steven Horsford is seeking a Staff Assistant to assist with the day-to-day operations of a fast-paced congressional office. Responsibilities include answering phones, greeting visitors, sorting mail, processing flag requests, and assisting with other administrative tasks. Nevada ties are a plus.\n\nThis office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation.",
    "responsibilities": [
      "Answering phones",
      "Greeting visitors",
      "Sorting mail",
      "Processing flag requests",
      "Assisting with other administrative tasks"
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should email a resume and cover letter to NV04Resumes@mail.house.gov. Please include Staff Assistant in the subject line.",
    "salary_info": null,
    "contact": "NV04Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, or sexual orientation."
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-12-20",
    "description": "The Office of Representative Spanberger seeks a motivated, creative, self-starter to join the district constituent services staff as a District Coordinator in the Glen Allen, VA office.\n\nResponsibilities include responding to constituent inquiries, managing constituent casework with federal agencies, working with the legislative team to address constituent concerns, and district outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events. Additional duties as assigned.\n\nIdeal candidates will be motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills and have significant experience interacting with the public.\n\nAdditionally, successful candidates will have a positive, solution-driven personality, demonstrate excellent oral and written communication skills, and show keen attention to detail and an ability to multitask effectively in a fast-paced environment.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events",
      "Additional duties as assigned"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]