[
  {
    "id": "MEM-261-20",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2020-10-26",
    "description": "Responsibilities will run the range of assisting the legislative, constituent services and administrative functions of the office, to include: monitoring and processing constituent mail and other communications, managing constituent tours, and coordinating DC and district office issues. As needed and depending on capability, the position also encompasses legislative correspondent and casework assistance. Direct report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring and processing constituent mail and other communications",
      "Managing constituent tours",
      "Coordinating DC and district office issues",
      "Legislative correspondent assistance (as needed)",
      "Casework assistance (as needed)"
    ],
    "qualifications": [
      "Prior Capitol Hill experience (strong preference)",
      "Hawai'i background (strong preference)",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours, especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-258-20",
    "position_title": "Staff Assistant",
    "office": "Rep. Katie Porter",
    "location": "District Office",
    "posting_date": "2020-10-26",
    "description": "Rep. Katie Porter seeks a highly motivated, resourceful, and organized individual with strong interpersonal skills to serve as a Staff Assistant in the District Office.\nThe ideal candidate will be able to manage multiple tasks, meet deadlines, and work well in a fast-paced environment.\nThe Staff Assistant will work directly with constituents, draft constituent correspondence, manage the front office, and assist with other District Office functions as assigned.",
    "responsibilities": [
      "Answer telephone calls and maintain voicemail. Document relevant information from calls and enter constituent messages into IQ, the office's database.",
      "Manage the front office, greet and screen visitors, monitor delivery and pickup of materials, and assist with various administrative duties.",
      "Receive, process, and enter the office mail in IQ on a daily basis.",
      "Print and mail 499 constituent letters.",
      "Draft constituent correspondence as assigned by the Legislative Correspondent.",
      "Write and mail grant award notification and congratulatory letters.",
      "Conduct casework intake and management as assigned by the Director of Constituent Services and Outreach.",
      "Hire and manage district-based intern on a semester basis.",
      "Staff the Congresswoman as her immediate aide during her time in district, including driving her, ensuring necessary materials, staying on schedule, communicating about or trouble shooting operational issues.",
      "Responsible for the technical needs of the district office, including serving as the liaison to our IT tech consultant, ordering new technology and office supplies.",
      "Provide organizational and operational support to District Office functions through attention to detail, strong work ethic, and positive attitude.",
      "Perform other duties as assigned by the District Director."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please email your resume and cover letter to resumesCA45@mail.house.gov with “Staff Assistant” in the email subject line.",
    "salary_info": null,
    "contact": "resumesCA45@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees."
  },
  {
    "id": "MEM-256-20",
    "position_title": "Digital Press Secretary",
    "office": "House Committee on Oversight and Reform Majority Staff",
    "location": null,
    "posting_date": "2020-10-26",
    "description": "The House Committee on Oversight and Reform Majority Staff seeks an active and reliable Digital Press Secretary.",
    "responsibilities": [
      "Responsibilities include managing the website, crafting content for social media channels, developing graphics and videos, covering hearings and press events, and working with our press team to identify new ways to engage our followers."
    ],
    "qualifications": [
      "Successful candidates will have at least 1 to 2 years of communications and digital experience.",
      "Candidates with diverse backgrounds are strongly encouraged to apply.",
      "Ideal candidates will be proficient in Adobe programs (Photoshop, Illustrator, LightRoom, Premiere Pro, Audition, and After Effects), CMS, CSS, HTML, manual photography, analytics, and enjoy working in a fast-paced, rapid response environment."
    ],
    "how_to_apply": "Please submit a resume and a portfolio of digital work to Oversightpress@mail.house.gov",
    "salary_info": null,
    "contact": "Oversightpress@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-253-20",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2020-10-26",
    "description": "Duties include assisting the technology needs of Committee staff; editing and maintaining the Committee's website; answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee's website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance are strongly encouraged to apply."
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "$38,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-251-20",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2020-10-26",
    "description": "The Committee's Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.\nCandidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.\nExperience in one or more of the following areas is desirable: government ethics; ethics counseling and training; employment law, including the laws governing sexual harassment in the workplace; and criminal law.",
    "responsibilities": [
      "Providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product."
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics; ethics counseling and training; employment law, including the laws governing sexual harassment in the workplace; and criminal law."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-247-20",
    "position_title": "Legislative Assistant",
    "office": "Senior progressive appropriator",
    "location": "Hill",
    "posting_date": "2020-10-26",
    "description": "Senior progressive appropriator seeks a legislative assistant to cover a broad\nportfolio of issues including criminal justice reform, civil and voting rights,\ntransportation, housing, small/minority businesses, and technology.\nResponsibilities include handling appropriations requests and staffing full\ncommittee markups, developing and advancing a proactive legislative agenda on\nracial equity and housing policy, drafting, analyzing legislation, writing policy\nmemos and talking points, working with outside stakeholders, and meeting with\nconstituents.\nIdeal candidates will be outstanding writers, thrive in a fast-paced environment,\nand enjoy working with a variety of stakeholders to advance a robust policy\nagenda.\nPrevious Hill experience is required. The office is an equal opportunity employer;\nwe do not discriminate on the basis of race, color, religion, sex, national origin,\nage, disability, gender identity or expression, or sexual orientation. We strongly\nvalue the diversity of our employees.",
    "responsibilities": [
      "Handling appropriations requests and staffing full committee markups",
      "Developing and advancing a proactive legislative agenda on racial equity and housing policy",
      "Drafting, analyzing legislation",
      "Writing policy memos and talking points",
      "Working with outside stakeholders",
      "Meeting with constituents"
    ],
    "qualifications": [
      "Outstanding writers",
      "Thrive in a fast-paced environment",
      "Enjoy working with a variety of stakeholders to advance a robust policy agenda",
      "Previous Hill experience is required"
    ],
    "how_to_apply": "To apply, send a cover letter, resume and short writing sample to lee.resumes@mail.house.gov with “Legislative Assistant” in the subject line.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees."
  },
  {
    "id": "MEM-246-20",
    "position_title": "Counsel",
    "office": "House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2020-10-26",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks counsel to assist with oversight and investigations on the Education team. Applicants who are not attorneys but who have at least three years of experience conducting investigations are also encouraged to apply.\nExperience in education policy is not a requirement.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, applicants must submit a resume, a pre-prepared writing sample (5-10 pages), and a writing sample describing an investigation the applicant would like to pursue.\nThis second writing sample must include a hyperlink to a current news item from any source (newspapers, blogs, or other websites) and two paragraphs detailing why the Committee should investigate the issue presented and the steps the applicant would take to begin an investigation.\nPlease email resume and both writing samples to E&L.Jobs@mail.house.gov with “Education Oversight” in the subject line. Applications that do not include all requested materials will not be considered.",
    "salary_info": null,
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-206-20",
    "position_title": "Research and Data Analyst",
    "office": "House Office of Diversity and Inclusion",
    "location": null,
    "posting_date": "2020-10-26",
    "description": "In this capacity the Analyst will be responsible for leading data and research collection and analysis for the Office of Diversity and Inclusion. This individual will lead the development of the required diversity report, maintain key metrics and key performance indicators for the Office, and serve as a resource for external and internal diversity best practices.\n\nThis individual will also serve as the project manager for any consultants and/or contractors with whom the Office may engage to support the completion of the diversity report and to develop relevant diversity and inclusion-based training, in collaboration with the Congressional Staff Academy.",
    "responsibilities": [
      "This staffer will assist in the translation of research findings into materials that staff can effectively utilize in their engagements with Members and Member offices.",
      "Provide research support on diversity and inclusion studies, techniques and tools.",
      "Serve as project manager for the diversity report and, where necessary, direct and coordinate activities of external consultants.",
      "Research and study best practices for retention and growth in House employing offices.",
      "Lead data tracking and reporting with a focus on performance and results.",
      "Prepare regular updates and briefing documents on research that is relevant to House employing offices.",
      "Assist with the development and delivery of training sessions and, as needed, conduct presentations at professional conferences and meetings."
    ],
    "qualifications": [
      "Master’s degree in social or behavioral sciences or related field; or equivalent level of experience providing technical assistance, data collections and/or research.",
      "Must have knowledge and experience in diversity, equity, and inclusion research efforts, ideally with a strong background in curriculum development.",
      "Current working knowledge of coalition functioning, evaluation and research.",
      "Quantitative and qualitative evaluation and research skills.",
      "Expertise using relevant software.",
      "Customer-service orientation and ability to work harmoniously with a diverse team.",
      "Ability to work under deadline pressure and extra hours if needed on assignment.",
      "Demonstrated ability to self-motivate, initiate project activities, and work on multiple assignments simultaneously.",
      "Extensive computer skills, including data input."
    ],
    "how_to_apply": "Interested candidates should apply by following the instructions here:\nhttps://house.csod.com/ux/ats/careersite/1/home/requisition/86?c=house\nCandidates will be asked to upload a cover letter, resume, and two writing samples.",
    "salary_info": "Salary commensurate with experience.",
    "contact": null,
    "equal_opportunity": "Women, minority, veterans, people of all political ideologies, and LGBTQ+ candidates are strongly encouraged to apply.\nNo phone calls or drop-ins please."
  }
]