[
  {
    "id": "MEM-190-24",
    "position_title": "Digital and Communications Assistant",
    "office": "Congressman Dwight Evans (D-PA-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-05-20",
    "description": "This is an opportunity to work for a member who serves on the influential Ways and Means Committee and represents part of the largest swing state.\nCongressman Evans is a member of the Congressional Black Caucus who is passionate about housing, health care and fighting gun violence. He represents nearly half of Philadelphia, which will host America’s 250th birthday celebration in 2026 as well as several World Cup games.\nThis position reports directly to the Congressman’s Communications Director.\nCandidates must have strong writing and digital media skills, pay close attention to proofreading and fact-checking, be highly organized, have a problem-solving approach to work, and be capable of thriving in a fast-paced and rapidly changing environment. The ability to meet deadlines is a must. Proficiency with social media tools, graphic design and standard Microsoft Office and Adobe software tools is required. Working knowledge of House processes and procedures is required, and Philadelphia knowledge is preferred.",
    "responsibilities": [
      "drafting daily social media content for all of the Congressman’s official platforms, subject to editing",
      "creating graphics",
      "shooting and editing videos",
      "sending daily news clips",
      "drafting op-eds on a variety of issues and e-newsletters",
      "working with district staff to produce regular virtual and tele-town hall meetings",
      "serving as point person for the Congressman’s annual State of the District report",
      "consistently monitoring, and updating the Congressman’s website",
      "other duties as assigned",
      "Occasional travel to the district may be required."
    ],
    "qualifications": [
      "strong writing and digital media skills",
      "pay close attention to proofreading and fact-checking",
      "be highly organized",
      "have a problem-solving approach to work",
      "be capable of thriving in a fast-paced and rapidly changing environment",
      "The ability to meet deadlines is a must",
      "Proficiency with social media tools, graphic design and standard Microsoft Office and Adobe software tools is required.",
      "Working knowledge of House processes and procedures is required",
      "Philadelphia knowledge is preferred."
    ],
    "how_to_apply": "Qualified candidates should send a cover letter, resume and at least three examples of your work, including at least one writing sample, at least one graphic you have created, and one video you have created and edited to PA03.Resumes@mail.house.gov.",
    "salary_info": "$65,000- $70,000 commensurate with experience",
    "contact": "PA03.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-155-24",
    "position_title": "DIGITAL DIRECTOR OR PRESS SECRETARY",
    "office": "Rep. Tokuda (HI-02)",
    "location": "Washington, D.C.",
    "posting_date": "2024-05-20",
    "description": "Rep. Tokuda (HI-02) seeks an energetic person to join her communications team in her Washington, D.C. office. This individual will work closely with the Communications Director who works in Honolulu. Candidates must have experience in digital media and video editing and will be responsible for managing multiple digital media accounts. This position will also assist with press releases and inquiries, speeches, and mass communications.",
    "responsibilities": [],
    "qualifications": [
      "Strong writing and editing skills with attention to detail",
      "Creative graphic production",
      "Ability to multi-task and work quickly under pressure",
      "Patience, flexibility, and a sense of humor",
      "Candidate must also be able to work occasionally on weekends and evenings."
    ],
    "how_to_apply": "Interested parties should email a cover letter, resume, writing sample, sample social media posts, and two references to Hawaii02jobs@gmail.com",
    "salary_info": null,
    "contact": "Hawaii02jobs@gmail.com",
    "equal_opportunity": null
  }
]