[
  {
    "id": "MEM-550-22",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": "Washington, D.C.",
    "posting_date": "2022-11-14",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "Candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent1.evans@gmail.com. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent1.evans@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-548-22",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2022-11-14",
    "description": "Responsibilities run the range of assisting the legislative, constituent services and administrative functions of the office, to include: monitoring, processing and responding to constituent mail and other communications, managing constituent tours and other needs, and coordinating DC and district office issues. As needed and depending on capability, the position also encompasses legislative duties.\n\nDirect report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring, processing and responding to constituent mail and other communications",
      "Managing constituent tours and other needs",
      "Coordinating DC and district office issues",
      "Legislative duties (as needed)"
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Hawai'i background",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-547-22",
    "position_title": "Constituent Services Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Honolulu office",
    "posting_date": "2022-11-14",
    "description": "The ideal candidate has diverse experience working in the community to address a wide range of statewide and local issues with a strong track record of advocacy for the people of Hawai'i. The position is responsible for assisting the Congressman to address requests for assistance from individual constituents and organizations, primarily but not exclusively with a wide range of federal government programs and activities.\n\nDuties include but are not limited to dealing directly with constituents and federal state and local agencies and organizations. The position also includes interaction with the Congressman’s D.C. office on related legislative and administrative matters, as well as representing the Congressman at community events, such as neighborhood board meetings, and otherwise assisting with the range of activities in the Congressman’s office. Direct report to the Deputy Chief of Staff in the Honolulu office. Although the position may also interact directly with the Congressman and his Washington, D.C. office from time to time. The ideal candidate is an individual who is seeking to live and work in the community that this position is designed to serve.",
    "responsibilities": [
      "Dealing directly with constituents",
      "Dealing with federal state and local agencies and organizations",
      "Interaction with the Congressman’s D.C. office on related legislative and administrative matters",
      "Representing the Congressman at community events, such as neighborhood board meetings",
      "Assisting with the range of activities in the Congressman’s office"
    ],
    "qualifications": [
      "Prior experience especially in comparable duties including customer service or social work",
      "Hawai'i background/community involvement",
      "Experience evaluating, synthesizing and articulating issues in a thoughtful and respectful manner in support of constituents’ needs and the Congressman’s initiatives",
      "Extensive knowledge of a broad range of community resources and services from which to draw on when addressing constituent requests",
      "An interest in government and in assisting others",
      "Initiative",
      "Interpersonal skills",
      "The ability to multitask",
      "Work independently and effectively under pressure",
      "Make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long and sometimes unpredictable hours"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Constituent Services Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-546-22",
    "position_title": "Scheduler",
    "office": "U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C.",
    "posting_date": "2022-11-14",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced and well-organized Scheduler for the Representative’s Washington, D.C. office.",
    "responsibilities": [
      "Developing, coordinating, and managing all aspects of the Representative’s daily and long-term schedule in D.C. and in the district, as well as tracking, evaluating, and responding to all invitations and scheduling requests",
      "Coordinating all travel for the Representative and her staff and other logistical support tasks as required",
      "Working closely with and supporting the Chief of Staff, Deputy Chief of Staff/District Director, Legislative Director and Communications Director to ensure smooth daily schedules and operations."
    ],
    "qualifications": [
      "Passionate about public service and committed to progressive values",
      "A hard worker with excellent attention to detail",
      "Adept at juggling complex schedules, competing priorities",
      "Able to anticipate problems, seek solutions, and effectively communicate them to the Representative and her staff",
      "Able to work long hours, including some nights and weekends",
      "Eager to learn, grow, and thrive in a dynamic and high-paced environment."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, and references. Please send applications to jobs.pramila@mail.house.gov with “Scheduler” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Pramila Jayapal is an equal opportunity employer. Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. State and/or district ties are a plus."
  },
  {
    "id": "MEM-544-22",
    "position_title": "OUTREACH DIRECTOR",
    "office": "Congressman Andy Kim (NJ-03)",
    "location": "New Jersey’s Third Congressional District (Burlington, Mercer & Monmouth Counties, effective January 2023)",
    "posting_date": "2022-11-14",
    "description": "Congressman Andy Kim (NJ-03), seeks a hard working, proactive, strategicallyminded Outreach Director to oversee his outreach team and activities on the ground in New Jersey’s Third Congressional District (Burlington, Mercer & Monmouth Counties, effective January 2023). This is not an entry-level position and previous political, outreach, event-planning and management experience is required.\n\nThe ideal applicant will be a team player, have a demonstrated ability to manage and mentor staff, think strategically, and have experience in formulating and executing successful meetings and events on a wide variety of topics. Successful applicants will work well under pressure, have excellent organization and communications skills, and have good working knowledge of the district including key leaders & stakeholders, employers, and constituent groups. This senior staff position reports to the District Director, Chief of Staff and the Congressman.",
    "responsibilities": [
      "Executes short and long-term strategic planning",
      "Manages the outreach team and all activities on the ground in NJ03 including, but not limited to, monthly town halls, roundtables, meetings, events and proactive work in the community",
      "Monitors community events & activities identifies opportunities for engagement",
      "Coordinates activities and outreach with the casework, grants and policy teams to maximize impact",
      "Builds relationships with district and national stakeholders and advocacy organizations",
      "Takes constituent and advocacy group meetings as necessary",
      "Coordinates the preparation of event memos, staffing plans and post staff follow-up"
    ],
    "qualifications": [
      "4+ years of political, legislative and/or organizing experience",
      "2+ years management experience",
      "Knowledge of or ties to New Jersey’s Third Congressional District are required",
      "Ability to commit occasional night and weekend hours to staff the member or attend events"
    ],
    "how_to_apply": "Email a cover letter, resume, and 2-3 references to NJ03Resumes@mail.house.gov with the subject line, “Outreach Director: [Your Full Name]” Please no unsolicited drop-ins, phone calls, or emails to the office.",
    "salary_info": null,
    "contact": "NJ03Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of all identity groups are encouraged to apply."
  },
  {
    "id": "MEM-543-22",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas), Chair of the Ways & Means Health Subcommittee",
    "location": "Washington, D.C.",
    "posting_date": "2022-11-14",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), Chair of the Ways & Means Health\nSubcommittee seeks an experienced Legislative Assistant to assist with his\nhealth care work and other to be determined issues.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill or other policy or political experience strongly preferred, as well as a law or graduate degree.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor\nreferences to DoggettJobs@mail.house.gov. Use this title on your email:\n“Experienced LA Applicant” -- No drop-ins please.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-541-22",
    "position_title": "Senior Legislative Assistant and Counsel",
    "office": "House Democrat",
    "location": null,
    "posting_date": "2022-11-14",
    "description": "Senior House Democrat seeks a Senior Legislative Assistant and Counsel for the Member’s personal office to staff a portfolio of legislative issues and to serve as council for the office. The duties include providing legal or equivalent service in an agency or private sector employer, advice concerning the full range of legislative issues and with compliance issues.",
    "responsibilities": [],
    "qualifications": [
      "Law degree",
      "Bar membership",
      "Strong policy background",
      "Previous Capitol Hill legislative experience strongly preferred",
      "Clear, concise legal analysis",
      "Political acumen to work closely and collaboratively with constituent, labor and public interest organizations"
    ],
    "how_to_apply": "Applicants should send a resume and cover letter to Legalcongress24@yahoo.com",
    "salary_info": null,
    "contact": "Legalcongress24@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-540-22",
    "position_title": "Legislative Assistant",
    "office": "Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2022-11-14",
    "description": "Democratic House Member seeks to hire mid-level to senior Legislative Assistant for the Washington D.C. office.\n\nThe office seeks an experienced staffer that can manage a portfolio of domestic issues.\n\nA successful candidate will have excellent writing and communication skills, a solid understanding of the legislative process, and a proven ability to work effectively with a congressional legislative team. Press and communications experience is also a plus, but not required.",
    "responsibilities": [
      "Monitoring and drafting legislation",
      "Representing the Member in meetings/briefings",
      "Collaborating with constituent organizations",
      "Preparing materials for committee hearings and markups",
      "Other tasks and assignments as needed"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to congressjob2022@gmail.com",
    "salary_info": null,
    "contact": "congressjob2022@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-535-22",
    "position_title": "Senior Legislative Assistant",
    "office": "Representative Seth Moulton (D-MA)",
    "location": "Washington, D.C.",
    "posting_date": "2022-11-14",
    "description": "Representative Seth Moulton (D-MA) is hiring a hard-working, dynamic, and team-oriented Senior Legislative Assistant for his Congressional Office.\nQualified individuals should have an educational background in science or economics. Salary is commensurate with experience and competitive with similar public service jobs.",
    "responsibilities": [
      "Long-term and short-term legislative planning for the Member and for ensuring progress on the Member's domestic legislative goals within the Legislative Assistant’s portfolio",
      "Staffing the Member for all House Committee on Transportation and Infrastructure activities including full committee and subcommittee hearings and markups",
      "Writing and developing a range of high-quality written materials, including policy reports and policy memos",
      "Tracking policy proposals and implementation in assigned issue areas",
      "Facilitating policy engagements and preparing the Member for high-quality policy discussions",
      "Representing the Member externally by attending policy briefings and meetings",
      "Recommending strategies and tactics on bills and positions",
      "Recommending co-sponsorships of legislation to the Member",
      "Providing the Member with support in building and maintaining positive relationships with other Members, and with constituents and external stakeholders",
      "Carrying out additional duties as required."
    ],
    "qualifications": [
      "A bachelor’s degree is required and advanced degrees are preferred.",
      "A minimum of 2 years of experience on Capitol Hill in domestic policy and/or other legislative experience is preferred.",
      "Depending on professional experience, the candidate may be eligible to start as Senior Legislative Assistant.",
      "Ability to find creative solutions to problems, build and motivate a strong team, and build effective partnerships",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Provides necessary organization, supervision, leadership, and motivation to manage the legislative staff"
    ],
    "how_to_apply": "Please provide a resume and cover letter to ma06.resumes@mail.house.gov, with the subject line “Legislative Assistant” by Wednesday, November 16, 2022.",
    "salary_info": "Salary is commensurate with experience and competitive with similar public service jobs.",
    "contact": "ma06.resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-533-22",
    "position_title": "DIGITAL DIRECTOR / PRESS SECRETARY",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": "Capitol Hill",
    "posting_date": "2022-11-14",
    "description": "Congressman Mark Pocan (WI-02), member of both the House Appropriations and Education & Labor Committees, is seeking a highly motivated, detail-orientated, and energetic individual with experience in digital media strategy and video editing for a Digital Director/Press Secretary position.\n\nDaily tasks include managing and creating content for member’s social media platforms and website; graphic design; video filming and editing; daily press clips; managing in-district media relations; drafting releases, newsletters and advisories; and organizing press events. The ideal candidate will be creative, have a strong proficiency in crafting digital content, experience coordinating with media, and be a detail-oriented team player able to handle multiple tasks at once.\n\nExcellent writing and strong organizational skills are essential, along with the ability to be a self-starter while working in a fast-paced environment. Capitol Hill experience is a plus, but not required. A sense of humor is greatly appreciated, and the position reports to the Communications Director.\n\nThis is not an entry-level position.",
    "responsibilities": [
      "managing and creating content for member’s social media platforms and website",
      "graphic design",
      "video filming and editing",
      "daily press clips",
      "managing in-district media relations",
      "drafting releases, newsletters and advisories",
      "organizing press events"
    ],
    "qualifications": [
      "creative",
      "strong proficiency in crafting digital content",
      "experience coordinating with media",
      "detail-oriented team player able to handle multiple tasks at once",
      "Excellent writing and strong organizational skills",
      "ability to be a self-starter while working in a fast-paced environment",
      "Capitol Hill experience is a plus",
      "A sense of humor is greatly appreciated"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, two writing samples, and an example of previous digital media or graphic design projects to WI02JobOpening@gmail.com with “Digital Director/Press Secretary” in the subject line. Job opening closes COB on Wednesday, November 23rd. No phone calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-531-22",
    "position_title": "Communications Director",
    "office": "California Democrat",
    "location": "Washington, DC",
    "posting_date": "2022-11-14",
    "description": "California Democrat seeks Communications Director to develop and implement a strategic and aggressive communications plan involving local, national, and specialty media.\n\nIdeal candidates have strong political and messaging instincts, and are proactive, detailed-oriented storytellers who work well under tight deadlines in a fast-paced environment. They have a deep interest and enthusiasm for closely following the local and national news cycles, have a deep sense of duty to public service, and are available to work long hours and weekends when necessary.",
    "responsibilities": [
      "Managing day-to-day press operations",
      "Working closely with legislative and district staff in planning press conferences and in-district events",
      "Drafting and editing speeches, press advisories, releases, op-eds, e-newsletters and franked mailings",
      "Managing the Member’s social media accounts and official website",
      "Responding to press inquiries"
    ],
    "qualifications": [
      "Strong political and messaging instincts",
      "Proactive, detailed-oriented storyteller",
      "Ability to work well under tight deadlines in a fast-paced environment",
      "Deep interest and enthusiasm for closely following the local and national news cycles",
      "Deep sense of duty to public service",
      "Available to work long hours and weekends when necessary"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, three writing samples of one page or less, samples of digital media and graphic design projects, and three references with “COMMUNICATIONS DIRECTOR” in the subject line to ca20.jobs@mail.house.gov",
    "salary_info": "The office offers student loan repayment, paid vacation, and sick leave, in addition to other benefits that include health care and retirement.",
    "contact": "ca20.jobs@mail.house.gov",
    "equal_opportunity": "This office is committed to, and benefits from, a diverse staff, and candidates of all backgrounds are encouraged to apply. The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-530-22",
    "position_title": "Staff Assistant",
    "office": "Raleigh District Office of Congresswoman Deborah Ross",
    "location": "Raleigh, NC 27602",
    "posting_date": "2022-11-14",
    "description": "The Raleigh District Office of Congresswoman Deborah Ross is hiring a fulltime Staff Assistant.\nThe position is available to qualified candidates with an undergraduate degree.\nThe position starts December 1, 2022 (negotiable). Employees are expected to\nwork from 9:00am to 5:30pm with evenings and weekends assigned as needed.\nAn ideal candidate will have strong written and oral communication skills, be\norganized with strong attention to detail, will exercise emotional and social\nintelligence at all times, and will take initiative. Employees regularly deal with\nsensitive information and must exercise discretion. A valid driver’s license and\navailable car are required for the position. Candidates are subject to a background\ncheck and online presence check.",
    "responsibilities": [
      "Constituent services (assisting with casework, communicating with constituents as a representative of the office)",
      "Office administration (answering phones, processing mail, greeting guests in the office)",
      "Staffing duties (driving and accompanying Congresswoman Ross to various events)",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Undergraduate degree",
      "Strong written and oral communication skills",
      "Organized with strong attention to detail",
      "Exercise emotional and social intelligence",
      "Take initiative",
      "Discretion",
      "Valid driver’s license and available car"
    ],
    "how_to_apply": "Please submit your resume and a cover letter to Ross.Applications@mail.house.gov.",
    "salary_info": "Based on experience",
    "contact": "Ross.Applications@mail.house.gov",
    "equal_opportunity": "This opportunity is without regard to race, gender, religion, sexual orientation, national origin, ethnicity, age, physical or mental disability, veteran status, or any other characteristic prohibited by state or local law."
  },
  {
    "id": "MEM-522-22",
    "position_title": "Executive Assistant/Scheduler",
    "office": "Senior Republican House Member",
    "location": "DC",
    "posting_date": "2022-11-14",
    "description": "The ideal candidate will have prior scheduling experience on the Hill or a comparable work environment. This person should be well-organized, detailoriented, self-motivated, and able to work effectively in a fast-paced office. The Executive Assistant/Scheduler will handle all incoming scheduling requests and strategically manage the daily and long-term schedule to ensure efficient and seamless operations.",
    "responsibilities": [
      "Handle all incoming scheduling requests",
      "Strategically manage the daily and long-term schedule to ensure efficient and seamless operations"
    ],
    "qualifications": [
      "Strong work ethic",
      "Ability to manage competing demands",
      "Excellent time management and organization skills",
      "Ability to thrive in a fast-paced environment"
    ],
    "how_to_apply": "Please send cover letter and resume to TX.JobListing@mail.house.gov",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "TX.JobListing@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-519-22",
    "position_title": "SCHEDULER",
    "office": "Congressman Don Beyer (VA-08), Chair of the Joint Economic Committee",
    "location": "Washington, DC",
    "posting_date": "2022-11-14",
    "description": "Congressman Don Beyer (VA-08), Chair of the Joint Economic Committee, is seeking a diligent, detail-orientated individual with excellent oral and written communications skills for a scheduler position in the Washington, DC office. Discretion and sound judgment are critical.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long-term schedule",
      "Coordinating travel and managing logistics for events",
      "Evaluating and organizing all incoming meeting and event requests",
      "Communicating key information regarding the Member’s schedule to staff",
      "Working closely with staff to ensure smooth daily office operations"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working closely with staff on a deadline",
      "Previous Capitol Hill or scheduling experience is strongly preferred; this is not an entry level position."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and one writing sample to Beyerstaff@gmail.com with “Scheduler” in the Subject Line. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "Beyerstaff@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-518-22",
    "position_title": "Staff Assistant",
    "office": "House Judiciary Committee",
    "location": null,
    "posting_date": "2022-11-14",
    "description": "The Democratic staff of the House Judiciary Committee seeks a Staff Assistant. Candidates should have excellent organizational skills and strong research, writing, and communication skills.\n\nResponsibilities include overseeing Committee hearing and markup logistics -which often include being physically present; serving as assistant clerk during markups; providing administrative and research support to the Staff Director, Deputy Staff Director/Senior Advisor, and Deputy Staff Director/Chief Counsel; coordinating the Deputy Staff Director/Chief Counsel’s calendar and the Committee’s calendar; co-managing the intern program; and managing Committee administrative needs.",
    "responsibilities": [
      "Overseeing Committee hearing and markup logistics -which often include being physically present",
      "Serving as assistant clerk during markups",
      "Providing administrative and research support to the Staff Director, Deputy Staff Director/Senior Advisor, and Deputy Staff Director/Chief Counsel",
      "Coordinating the Deputy Staff Director/Chief Counsel’s calendar and the Committee’s calendar",
      "Co-managing the intern program",
      "Managing Committee administrative needs"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "Strong research, writing, and communication skills"
    ],
    "how_to_apply": "Please send a resume and cover letter to JDEM.job@mail.house.gov and include “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff reflects the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-513-22",
    "position_title": "Legislative Assistant",
    "office": "Congressman Clay Higgins (LA-03)",
    "location": "Capitol Hill",
    "posting_date": "2022-11-14",
    "description": "The office of Congressman Clay Higgins (LA-03) seeks a highly motivated Legislative Assistant to focus on a portfolio of education, healthcare, immigration, and trade.",
    "responsibilities": [
      "Tracks legislation and other developments in assigned issue areas, briefs the Member for floor and committee work, coordinates with Communication Department to draft floor speeches for the Member, and plans and coordinates co-sponsorships and support of other legislation related to assigned issue areas;",
      "Formulates legislative initiatives for assigned issue areas including planning, coordinating, and scheduling the introduction of legislation, gathering support for a bill or amendment; working with committees on legislation and coordinating legislative support to get the bill passed in the [Senate/House];",
      "Responsible for assigned caucuses, including attending meetings, compiling information, and briefing the Member on pertinent information;",
      "Works with Scheduler, Legislative Director, Chief of Staff, and District Director to plan district events related to assigned issue areas;",
      "Meets with constituents and interest groups related to assigned issue areas and completes meeting notes for each meeting.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "At least two years of Capitol Hill experience",
      "Excellent writing and communication skills"
    ],
    "how_to_apply": "Qualified candidates should email their resume and cover letter with the subject line “Legislative Assistant”",
    "salary_info": null,
    "contact": "Lalegstaffposition@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-510-22",
    "position_title": "Financial Disclosure Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2022-11-14",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Financial Disclosure office.\n\nThe Committee’s financial disclosure counsel are responsible for reviewing financial statements and providing legal advice on a high volume of financial disclosure issues, education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Reviewing financial statements",
      "Providing legal advice on a high volume of financial disclosure issues",
      "Education and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, ethics counseling, accounting, auditing, investment management, taxation, corporate finance, and securities law"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “FD Counsel” in the subject line.",
    "salary_info": "$130,441 and $138,856",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-494-22",
    "position_title": "Staff Assistant/Press Assistant",
    "office": "Democratic Congressman",
    "location": null,
    "posting_date": "2022-11-14",
    "description": "Staff Assistant responsibilities include: answering phones and greeting visitors,\nassisting with tour and flag requests, helping to manage the interns,\nsorting/batching correspondence, drafting letters and providing administrative\nand legislative support as needed.\n\nPress Assistant responsibilities include: compiling press clips,\ndrafting/monitoring social media posts, designing graphics and web content and\nother press duties as assigned. Applicants must have strong writing skills and be a\ndetail oriented team player. Maryland ties and knowledge of Intertrac or IQ are a\nplus.",
    "responsibilities": [
      "Answering phones and greeting visitors",
      "Assisting with tour and flag requests",
      "Helping to manage the interns",
      "Sorting/batching correspondence",
      "Drafting letters",
      "Providing administrative and legislative support as needed",
      "Compiling press clips",
      "Drafting/monitoring social media posts",
      "Designing graphics and web content",
      "Other press duties as assigned"
    ],
    "qualifications": [
      "Strong writing skills",
      "Detail oriented team player",
      "Maryland ties (plus)",
      "Knowledge of Intertrac or IQ (plus)"
    ],
    "how_to_apply": "Interested applicants should e-mail 1) a resume, 2) a cover letter, and 3) two brief\nwriting samples to employment@mail.house.gov with the subject “Staff\nAssistant/Press Assistant: LAST NAME.”",
    "salary_info": null,
    "contact": "employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the\nbasis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status or\nparental status. Women, veterans, people of color and LGBTQ+ candidates are\nstrongly encouraged to apply."
  },
  {
    "id": "MEM-492-22",
    "position_title": "Communications Director",
    "office": "Representative Nanette Diaz Barragan (CA-44)",
    "location": "Washington, D.C.",
    "posting_date": "2022-11-14",
    "description": "Representative Nanette Diaz Barragan (CA-44) seeks an experienced Communications Director to lead a fast-paced and highly engaged press operation. Applicants must be creative, dynamic, proactive, and energetic.\n\nThe Communications Director will serve as the spokesperson and primary communications advisor to the Member. They will be responsible for developing and executing an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.\n\nThe Communications Director will oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member's social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters and franked mailings.\n\nThey are also responsible for working with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging. The Communications Director is responsible for maintaining the Congresswoman's voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman's values and advocacy to a diverse constituent base.\n\nThis is NOT an entry level position. Candidates must have previous press-related experience either on or off Capitol Hill, and fluency in Spanish is preferred. They must be highly organized, proficient in multi-tasking, have strong political judgment and instincts, and possess superior writing, editing, and proofreading skills.",
    "responsibilities": [
      "Serve as the spokesperson and primary communications advisor to the Member.",
      "Develop and execute an aggressive strategic communications plan, including social media, that encompasses local, national, and specialty media outlets.",
      "Oversee day-to-day press operations, including coordinating and managing the press team; responding to media inquiries; booking the Member for interviews; pitching news opportunities to media outlets; planning press conferences and in-district events; managing the Member's social media accounts and official website; editing/drafting speeches, talking points, floor statements, press releases, op-eds, and e-newsletters; and creating and distributing e-newsletters and franked mailings.",
      "Work with the Member, Chief of Staff, Legislative Director, and District Director to develop and coordinate core messaging.",
      "Maintain the Congresswoman's voice across all communications materials, with an emphasis on clarity, relatability, authenticity, and connecting the Congresswoman's values and advocacy to a diverse constituent base."
    ],
    "qualifications": [
      "Must be creative, dynamic, proactive, and energetic.",
      "Previous press-related experience either on or off Capitol Hill.",
      "Fluency in Spanish is preferred.",
      "Must be highly organized and proficient in multi-tasking.",
      "Strong political judgment and instincts.",
      "Superior writing, editing, and proofreading skills.",
      "Los Angeles Metro|Southern California ties are a plus.",
      "Experience with video editing and graphic design are a plus.",
      "Experience with national media contacts both print and digital, as well as with radio/TV bookers and producers is a plus.",
      "Must be willing to work extended hours and oftentimes under time constraints, while maintaining a positive attitude."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter including salary requirements, and two writing samples with the subject line “Communications Director” to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-462-22",
    "position_title": "Policy Advisor",
    "office": "Congressional Asian Pacific American Caucus (CAPAC)",
    "location": "Capitol Hill",
    "posting_date": "2022-11-14",
    "description": "The Congressional Asian Pacific American Caucus (CAPAC) seeks a Policy Advisor to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public.",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with Executive Director and other Caucus staff to advance CAPAC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CAPAC priorities forward",
      "Collaborating with CAPAC Member office staff to further Caucus policy objectives and managing communication with CAPAC policy liaisons",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CAPAC’s policy priorities and familiarity working with the Asian American, Native Hawaiian, and Pacific Islander community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multitask, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to congressional.apa.caucus@gmail.com. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "congressional.apa.caucus@gmail.com",
    "equal_opportunity": null
  }
]