[
  {
    "id": "MEM-043-23",
    "position_title": "Legislative Director",
    "office": "Senior California Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2023-01-23",
    "description": "Senior California Democrat seeks a Legislative Director to oversee the Member’s legislative priorities and manage a portfolio centered on healthcare and Social Security.",
    "responsibilities": [
      "Managing legislative staff and the Member’s legislative portfolio in close consultation with the Deputy Chief of Staff.",
      "Monitoring the House floor and advising the Member on procedure.",
      "Handling the Member’s healthcare priorities as a senior member of the Energy and Commerce Committee and the House Democratic Caucus Task Force on Aging & Families. The legislative portfolio will be focused on mental health, telehealth, rare diseases, the 340B drug discount program, and public health among other issues."
    ],
    "qualifications": [
      "Hill experience is strongly preferred, but not required."
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and references in a single PDF to seniordemresumes@gmail.com. Please use “Legislative Director” as the subject.",
    "salary_info": null,
    "contact": "seniordemresumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Veterans, women, LGBTQ+ persons, and minority applicants are strongly encouraged to apply."
  },
  {
    "id": "MEM-042-23",
    "position_title": "Constituent Service Representative",
    "office": "Congressman David Trone (MD06)",
    "location": "Frederick, MD",
    "posting_date": "2023-01-23",
    "description": "Congressman David Trone (MD06) is seeking a high-energy, highly-organized, and detail-oriented Constituent Service Representative for his office in Frederick, MD.\n\nIdeal candidates will have 1-2 years of work experience in a relevant field. (public service, political campaigns, issue advocacy, community organizing, etc.)",
    "responsibilities": [
      "Staffer will work out of the District Office in Frederick, MD.",
      "Serve as the official representative for the Member in the community.",
      "Act as liaison with federal, district, and local government agencies, political officials, and other community organizations to form effective relationships for the Member.",
      "Provide casework assistance to constituents in a timely and efficient manner; proactively follow up on all open cases until a resolution is reached.",
      "Monitor and update the Member and District Director on local issues of importance.",
      "Staff and provide logistical support for district meetings and events for the Member.",
      "Assess local and casework related issues for problems requiring possible legislative action; make recommendations to the District Director.",
      "Answer correspondence and verbal communications with constituents in a timely manner.",
      "Office administrative duties as needed."
    ],
    "qualifications": [
      "Thoroughness and careful attention to detail.",
      "Ability to work well under pressure while juggling multiple tasks with competing priorities.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Availability to work long hours, including nights and weekends, if needed.",
      "Ability to work cooperatively and courteously with others.",
      "Strong oral and written communication skills.",
      "Thorough knowledge of the legislative process.",
      "Knowledge of all issues in the district in which the Member is involved.",
      "Maryland ties are a plus."
    ],
    "how_to_apply": "To apply, please email a resume and cover letter to MD06.jobs@gmail.com with “Constituent Service Representative - Frederick” in the subject line. No phone calls or walk-ins.",
    "salary_info": "$50,000 plus full benefits",
    "contact": "MD06.jobs@gmail.com",
    "equal_opportunity": "The Office of Congressman David Trone strongly values the diversity of our employees and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-041-23",
    "position_title": "Legislative Assistant",
    "office": "U.S. Rep. Lloyd Doggett (D-Texas), on the Ways & Means Committee",
    "location": "Washington, D.C.",
    "posting_date": "2023-01-23",
    "description": "U.S. Rep. Lloyd Doggett (D-Texas), on the Ways & Means Committee, seeks an\nexperienced Legislative Assistant to assist with environmental, health care and\nother issues to be determined.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communication skills required.",
      "Hill or other policy or political experience strongly preferred, as well as a law or graduate degree.",
      "Texas ties a plus."
    ],
    "how_to_apply": "Send cover letter, resume, brief writing sample, and three work supervisor\nreferences to DoggettJobs@mail.house.gov.",
    "salary_info": null,
    "contact": "DoggettJobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-040-23",
    "position_title": "Scheduler",
    "office": "Congresswoman Lisa Blunt Rochester (DE-At Large)",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "Responsibilities include managing all aspects of the Member's DC schedule; making all travel arrangements; organizing and promptly responding to incoming scheduling requests; managing the Member's time in a productive and timely manner; and coordinating with the District Scheduler and all staff to ensure a smooth operation.\n\nThis is not an entry-level position. The ideal candidate will have prior experience as a scheduler, office manager, or executive assistant, whether on Capitol Hill or off. The ideal candidate will also have excellent attention to detail, a strong work ethic, impeccable organizational skills, the ability to stay calm in stressful situations, superb communication skills, and be able to work seamlessly in a team-oriented environment. This position may require flexible hours and availability by phone/email during evenings and weekends.",
    "responsibilities": [
      "managing all aspects of the Member's DC schedule",
      "making all travel arrangements",
      "organizing and promptly responding to incoming scheduling requests",
      "managing the Member's time in a productive and timely manner",
      "coordinating with the District Scheduler and all staff to ensure a smooth operation"
    ],
    "qualifications": [
      "prior experience as a scheduler, office manager, or executive assistant, whether on Capitol Hill or off",
      "excellent attention to detail",
      "strong work ethic",
      "impeccable organizational skills",
      "the ability to stay calm in stressful situations",
      "superb communication skills",
      "be able to work seamlessly in a team-oriented environment",
      "flexible hours and availability by phone/email during evenings and weekends",
      "ties to Delaware are a plus, but not required"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to lbr.jobposting@gmail.com with “DC Scheduler” in the subject line by COB February 3, 2023. No phone calls, drop-ins, or emails please.",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-038-23",
    "position_title": "Staff Assistant /Executive Assistant (SA/EA)",
    "office": "Congressman Dean Phillips (MN-03)",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "The SA/EA is responsible for staffing the front office during office hours by receiving visitors, answering phone calls, and restocking daily supplies, coordinating all tour and flag requests, supporting the Director of Operations in coordinating and executing the Congressman’s daily schedule, managing all aspects of the intern program, creating and coordinating “radical hospitality” programs for the office, and supporting the office with administrative, legislative, and communications needs as required. This position reports directly to the Legislative Director.",
    "responsibilities": [],
    "qualifications": [
      "the ability to provide a welcoming environment and positive first impression to all visitors of the office",
      "thorough knowledge of office administration, policies, practices, and procedures",
      "a high degree of professionalism",
      "strong organizational and interpersonal skills",
      "an ability to take initiative in a dynamic, fast-paced environment",
      "careful attention to detail",
      "an ability to work cooperatively and courteously with others"
    ],
    "how_to_apply": "Interested candidates should submit a resume and cover letter to Phillips.resumes@mail.house.gov with “Staff Assistant-Executive Assistant_FirstName_Last Name” in the subject line by January 27, 2023.",
    "salary_info": "Salary is commensurate with experience. Minnesota ties are a plus.",
    "contact": "Phillips.resumes@mail.house.gov",
    "equal_opportunity": "The Office of Congressman Dean Phillips is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment."
  },
  {
    "id": "MEM-037-23",
    "position_title": "Legislative Assistant",
    "office": "Congresswoman Mary Miller",
    "location": "Capitol Hill",
    "posting_date": "2023-01-23",
    "description": "Congresswoman Mary Miller is seeking a legislative assistant with an interest in agriculture policy and a strong commitment to conservative values.\nCompetitive candidates have 1-2 years of Capitol Hill/related policy experience, are well-organized, and have excellent writing and interpersonal skills.\nThis is an excellent opportunity to work on the 2023 Farm Bill and issues affecting Rural America. A bachelor’s degree in agricultural economics, agribusiness, or a related field are preferred, but not required. Preference will be given to candidates who have a working knowledge of, and/or experience in, agriculture industries.",
    "responsibilities": [
      "Briefing the Congresswoman on agriculture issues",
      "Covering the Agriculture Committee for the Member, including hearing and mark-up preparation",
      "Tracking legislation in assigned issues areas (additional portfolio issues TBD)",
      "Staffing the Member at meetings and events",
      "Meeting with outside groups and constituents",
      "Occasionally traveling to Illinois for events/key stakeholder meetings"
    ],
    "qualifications": [
      "1-2 years of Capitol Hill/related policy experience",
      "Well-organized",
      "Excellent writing and interpersonal skills",
      "Bachelor’s degree in agricultural economics, agribusiness, or a related field are preferred, but not required",
      "Preference will be given to candidates who have a working knowledge of, and/or experience in, agriculture industries."
    ],
    "how_to_apply": "Please submit your resume to IL15StaffApplications@mail.house.gov, with the subject line: Agriculture Legislative Assistant – First/Last name",
    "salary_info": null,
    "contact": "IL15StaffApplications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-034-23",
    "position_title": "DEPUTY CHIEF OF STAFF / LEGISLATIVE DIRECTOR",
    "office": "Congressman Mark Pocan (WI-02)",
    "location": "Washington, D.C.",
    "posting_date": "2023-01-23",
    "description": "Congressman Mark Pocan (WI-02), member of the House Appropriations Committee, is seeking an experienced and enthusiastic Deputy Chief of Staff / Legislative Director to coordinate and oversee the Member’s legislative agenda, along with advising the Member on legislative activities and managing the legislative staff.\n\nIdeal candidate will have at least 5 years of legislative experience on the Hill. Candidate should possess a strong understanding of the legislative process, including House organization and procedures, as well as managerial experience. Applicant must also demonstrate an ability to manage and mentor staff, think strategically, and have experience in formulating strategic plans for advancing legislation. Prior experience with the Appropriations Committee would be a valuable asset.\n\nExcellent writing, verbal and organizational skills are essential along with the ability to be a self-starter while working in a fast paced environment. A sense of humor is greatly appreciated.",
    "responsibilities": [
      "Coordinate and oversee the Member’s legislative agenda",
      "Advise the Member on legislative activities",
      "Manage the legislative staff"
    ],
    "qualifications": [
      "At least 5 years of legislative experience on the Hill",
      "Strong understanding of the legislative process, including House organization and procedures",
      "Managerial experience",
      "Ability to manage and mentor staff",
      "Ability to think strategically",
      "Experience in formulating strategic plans for advancing legislation",
      "Prior experience with the Appropriations Committee would be a valuable asset",
      "Excellent writing, verbal and organizational skills",
      "Ability to be a self-starter",
      "Ability to work in a fast paced environment"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume and two writing samples to WI02JobOpening@gmail.com with “Deputy CoS / LD” in the Subject Line. Job opening closes COB on Tuesday, January 31st. No phone calls, faxes or drop-ins please.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-017-23",
    "position_title": "Legislative Staffer",
    "office": "U.S. Congressman Ed Case (Hawai’i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-01-23",
    "description": "Primary responsibilities include the full range of management of a diverse and active portfolio of substantive issues. Specific duties include advising, briefing and staffing the Congressman on assigned issues, preparing and advancing related appropriations requests, monitoring related committee (including the Congressman’s Appropriations Committee) and floor activities, drafting, evaluating and advancing legislative initiatives, drafting constituent correspondence, and representing the office in meetings with constituents and others.\n\nDirect report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations and there is routine direct interaction with the Congressman. Preference given to prior federal or state government experience and Hawai‘i background. Applicants are asked to detail these attributes.",
    "responsibilities": [
      "Advising, briefing and staffing the Congressman on assigned issues",
      "Preparing and advancing related appropriations requests",
      "Monitoring related committee (including the Congressman’s Appropriations Committee) and floor activities",
      "Drafting, evaluating and advancing legislative initiatives",
      "Drafting constituent correspondence",
      "Representing the office in meetings with constituents and others"
    ],
    "qualifications": [
      "Initiative",
      "Interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones",
      "Prior federal or state government experience (preferred)",
      "Hawai‘i background (preferred)"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Legislative Staffer” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-032-23",
    "position_title": "District Liaison",
    "office": "Congresswoman Alma Adams (NC-12)",
    "location": "Charlotte District office",
    "posting_date": "2023-01-23",
    "description": "Congresswoman Alma Adams (NC-12) is seeking an organized, detail-oriented individual to serve in the position of District Liaison in a fast-paced and highly collaborative Charlotte District office.\n\nSuccessful candidates will have familiarity with Federal agencies, excellent written and oral communication skills, the ability to exercise discretion and independent judgement, and will be team oriented. Additionally, a strong knowledge and/or connection to Mecklenburg and Cabarrus Counties is preferred, but not required.",
    "responsibilities": [
      "To monitor and update Member/Deputy Chief of Staff on district and local issues.",
      "To answer casework correspondences and verbal communications with constituents",
      "To act as a liaison with federal, district and local agencies on behalf of the Member and constituents.",
      "Managing and navigating constituents’ casework through federal agencies to ensure fair and timely responses to their problems.",
      "Referring constituents to appropriate state or local agencies for non-federal issues",
      "Attending and participating in community meetings and events (including some evenings, weekends, and holidays)",
      "Assessing casework and community activities for matters warranting legislative action.",
      "Acts as the representative for the Member and/or District Director within their area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies,",
      "Acts as a liaison to local, state, and federal officials and other persons or groups to form effective relationships for the Member/office.",
      "Prepares periodic reports for the Deputy Chief of Staff on pending cases and district activities in their assigned issue areas.",
      "Maintains up-to-date files on all cases and categories of information of importance to the office.",
      "Meets attendance requirements as established by the office policy.",
      "Maintains a good working relationship with the Member, staff, and constituents.",
      "Accepts performance-based criticism and directions.",
      "Works well under pressure and handles stress.",
      "Works a flexible schedule including long hours, nights, weekends, and holidays.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Bachelor’s Degree",
      "Background in Social Work, preferred, but not required.",
      "Spanish speaking, preferred, but not required.",
      "Ability to communicate with diverse populations of individuals.",
      "Strong oral and written communication skills;",
      "Working knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone matter;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Positive attitude, willingness to work through tough problems, ability to interact well with the public.",
      "Thoroughness and careful attention to detail.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Knowledge of office policies, practices, and procedures.",
      "Knowledge of office computer applications, software; and",
      "Proficiency in word processing."
    ],
    "how_to_apply": "To apply, please send an email to NC12DistrictCLT@gmail.com with your cover letter, resume, and three references, with contact information. Please use the following format for the subject line: Your full name -District Liaison.\nThe deadline to receive resumes is February 8, 2023 by 5 pm (EST).",
    "salary_info": null,
    "contact": "NC12DistrictCLT@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-031-23",
    "position_title": "Senior Legislative Assistant and/or Counsel",
    "office": "House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2023-01-23",
    "description": "Senior House Democrat seeks a Senior Legislative Assistant and/or Counsel for the Member’s personal office to staff a portfolio of domestic legislative issues and, if the right candidate has a law degree, as counsel.\n\nA successful candidate will have excellent communication skills, a solid understanding of the legislative process, and a proven ability to work effectively with a legislative team.",
    "responsibilities": [
      "Monitoring and drafting legislation",
      "Monitoring the floor",
      "Representing the Member in meetings/briefings",
      "Collaborating with constituent organizations",
      "Preparing materials for committee hearings and markups",
      "Providing the office with Ethics and other compliance advice (if the successful candidate is a lawyer)",
      "Other tasks and assignments as needed"
    ],
    "qualifications": [
      "3 years+ of experience in a congressional office or similar legislative experience off the Hill"
    ],
    "how_to_apply": "Applicants should send a resume and cover letter to congressjobhouse@gmail.com",
    "salary_info": "Salary will range from 70-85k or higher depending on experience and status as an attorney.",
    "contact": "congressjobhouse@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-030-23",
    "position_title": "Staff Assistant",
    "office": "Congresswoman Valerie Foushee",
    "location": "District office",
    "posting_date": "2023-01-23",
    "description": "Congresswoman Valerie Foushee is seeking an organized, detail-oriented individual to serve in the position of Staff Assistant in a fast-paced and highly collaborative District office.",
    "responsibilities": [
      "greeting and engaging visitors and callers, helping them navigate our office, and logging their views and requests in IQ",
      "maintaining an office environment that emphasizes kindness and professionalism",
      "providing administrative support to the constituent services, communication, and operations/administrative teams",
      "recruiting, hiring, and managing district interns",
      "ordering supplies",
      "meticulously and accurately batching correspondence",
      "staffing the Member",
      "other duties as assigned"
    ],
    "qualifications": [
      "exceptional customer service skills",
      "close attention to detail and time management",
      "strong writing and proactive communication skills",
      "an understanding or aptitude for database work",
      "the ability to prioritize and follow through on multiple competing priorities in a fast-paced environment",
      "North Carolina and/or NC-04 ties are preferred, but not required."
    ],
    "how_to_apply": "To apply, please send an email to NC04resumes@mail.house.gov with your cover letter, resume, and three references in one combined PDF attachment. Please use the following format for the subject line: Your full name - Staff Assistant.",
    "salary_info": "$45,000",
    "contact": "NC04resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-029-23",
    "position_title": "District Scheduler/Press Assistant",
    "office": "Congresswoman Andrea Salinas (OR-6)",
    "location": "Oregon",
    "posting_date": "2023-01-23",
    "description": "This position is responsible for managing the Congresswoman’s district schedule including tracking and responding to scheduling requests, assembling all details of the daily Oregon calendar and coordinating all briefing materials for district meetings.\n\nIn addition to scheduling responsibilities, this position will assist the Communications Director with social media, press releases and other communications materials.\n\nOther duties consist of office management responsibilities including answering telephones, mail distribution, purchasing supplies, technology and other administrative duties and special projects.",
    "responsibilities": [
      "Managing the Congresswoman’s district schedule including tracking and responding to scheduling requests",
      "Assembling all details of the daily Oregon calendar",
      "Coordinating all briefing materials for district meetings",
      "Assist the Communications Director with social media",
      "Assist the Communications Director with press releases",
      "Assist the Communications Director with other communications materials",
      "Office management responsibilities including answering telephones",
      "Mail distribution",
      "Purchasing supplies",
      "Technology and other administrative duties and special projects"
    ],
    "qualifications": [
      "Knowledge of Oregon’s 6th congressional district",
      "Working knowledge of social media platforms",
      "A service-oriented attitude",
      "Strong organizational skills",
      "Ability to manage and prioritize multiple tasks at one time",
      "A capacity to work both independently and as part of a team",
      "Strong writing skills with an attention to detail",
      "Spanish-language proficiency is a plus"
    ],
    "how_to_apply": "Please email cover letter and resume to OR06resumes@mail.house.gov with subject line: District Scheduler/Press Assistant.",
    "salary_info": "$55,000 to $65,000 + benefits",
    "contact": "OR06resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and as such is committed to building and maintaining an inclusive and diverse work environment. All qualified candidates are encouraged to apply."
  },
  {
    "id": "MEM-028-23",
    "position_title": "DC STAFF ASSISTANT",
    "office": "U.S. Rep. Bill Pascrell, Jr.",
    "location": "DC",
    "posting_date": "2023-01-23",
    "description": "U.S. Rep. Bill Pascrell, Jr. seeks highly-motivated, detail-oriented staff assistant with excellent written and oral communication skills for DC office.\n\nResponsibilities include general reception duty, member scheduling, addressing constituent requests, managing interns, systems management, and otherwise assisting the Congressman and staff in all functions of the office. New Jersey ties are a plus.",
    "responsibilities": [
      "General reception duty",
      "Member scheduling",
      "Addressing constituent requests",
      "Managing interns",
      "Systems management",
      "Assisting the Congressman and staff in all functions of the office"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, cover letter, and writing sample via email to nj09job@gmail.com. No calls or direct emails please. We will consider applications until the position is filled.",
    "salary_info": "The position is full time with federal benefits, including student loan repayment program (if eligible) and transit or parking benefits.",
    "contact": "nj09job@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status."
  },
  {
    "id": "MEM-026-23",
    "position_title": "Staff Assistant",
    "office": "Congressman Andy Harris, M.D. (MD-01)",
    "location": "Capitol Hill",
    "posting_date": "2023-01-23",
    "description": "The Office of Congressman Andy Harris, M.D. (MD-01) has an immediate opening for an organized, detail-oriented individual to serve in the position of Staff Assistant in a fast-paced and highly collaborative Capitol Hill office with a strong commitment to exceptional constituent service.",
    "responsibilities": [
      "Staffing and managing the front office",
      "Managing mail intake",
      "Answering and managing the phone system",
      "Greeting visitors",
      "Handling tour and flag requests",
      "Providing general office support"
    ],
    "qualifications": [
      "Excellent oral and written communication skills",
      "Great attention to detail",
      "Strong time management skills",
      "Ability to work under pressure",
      "Maryland ties are a plus"
    ],
    "how_to_apply": "Please send resume, cover letter, and writing sample in one PDF document to: MD01jobopenings@mail.house.gov.\nSubject line: 2023 Staff Assistant Opening.\nNo phone calls please.",
    "salary_info": null,
    "contact": "MD01jobopenings@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer."
  },
  {
    "id": "MEM-024-23",
    "position_title": "Scheduler",
    "office": "Freshman Democrat from Hawai'i",
    "location": "DC and the district",
    "posting_date": "2023-01-23",
    "description": "The Freshman Democrat from Hawai'i is seeking a Scheduler with strong judgment, communication skills, and attention to detail to build and oversee all aspects of scheduling operations for the Member.\n\nThis position requires consistent and effective collaboration with all components of the Member’s office. The Scheduler will work directly with the Chief of Staff, District Chief, and other senior staff.",
    "responsibilities": [
      "Building the Member’s daily and long-term schedule for DC and the district and managing this system",
      "Responding to all incoming scheduling requests",
      "Booking and coordinating travel back to Hawai'i and within Hawai'i",
      "Ensuring the Member, staff, and external stakeholders have key information about the schedule",
      "Compiling daily briefing materials for the Member and coordinating the collection of information from staff and other sources",
      "Supporting the team with special events and ad hoc projects",
      "Other duties as assigned"
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please submit a cover letter, resume, and references to hawaii02jobs@gmail.com.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "hawaii02jobs@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, sexual orientation, or gender identity. Candidates from diverse backgrounds, especially with ties to Hawai'i, are encouraged to apply. Being able to serve as a secondary driver when needed is preferred, but not required."
  },
  {
    "id": "MEM-020-23",
    "position_title": "Press Secretary",
    "office": "House Committee on Oversight and Accountability",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "Rep. Jamie Raskin, the Ranking Member of the House Committee on Oversight and Accountability, is seeking a Press Secretary to join the Democratic staff of the Committee.\n\nThe ideal candidate will have strong research and writing skills, be a proactive team player, and be able to multi-task in a fast-paced environment.\n\nThis is not an entry-level position. Successful candidates will have several years of media relations experience. A Bachelor’s degree in journalism, English, public relations, or a closely-related field is preferred. Previous Hill experience is a plus.",
    "responsibilities": [
      "Assisting with rapid response strategies",
      "Drafting press releases, statements and other key materials",
      "Monitoring and pitching press coverage",
      "Building and maintaining relationships with reporters and bookers",
      "Assisting with digital content creation",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Strong research and writing skills",
      "Proactive team player",
      "Able to multi-task in a fast-paced environment",
      "Several years of media relations experience",
      "Bachelor’s degree in journalism, English, public relations, or a closely-related field is preferred",
      "Previous Hill experience is a plus"
    ],
    "how_to_apply": "Please send a resume and cover letter as PDFs to oversightjobs@mail.house.gov, with “Press Secretary” in the subject line. Please attach the resume and cover letter with the file name using the following format:\n“LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Women, LGBTQI+, and BIPOC candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-019-23",
    "position_title": "Chief Counsel",
    "office": "House Committee on Oversight and Accountability",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "Rep. Jamie Raskin, the Ranking Member of the House Committee on Oversight and Accountability, is seeking a Chief Counsel to join the Democratic staff of the Committee.",
    "responsibilities": [
      "Managing a team of investigators",
      "Overseeing investigations, hearings, depositions, transcribed interviews, and briefings",
      "Developing rapid response strategies"
    ],
    "qualifications": [
      "Superior attention to detail",
      "Ability to work well under pressure",
      "Self-motivated",
      "Excellent written and oral communication skills",
      "Several years of congressional oversight and direct investigations experience",
      "Law degree required",
      "Prior management experience is strongly preferred"
    ],
    "how_to_apply": "Please send a resume and cover letter as PDFs to oversightjobs@mail.house.gov, with “Chief Counsel” in the subject line. Please attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please. Responses to this posting may be used to fill additional senior-level vacancies.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Women, LGBTQI+, and BIPOC candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-018-23",
    "position_title": "Constituent Services Liaison (Caseworker)",
    "office": "Congresswoman Valerie Foushee",
    "location": "District office",
    "posting_date": "2023-01-23",
    "description": "Congresswoman Valerie Foushee is seeking an organized, detail-oriented individual to serve in the position of Constituent Services Liaison (Caseworker) in a fast-paced and highly collaborative District office.\n\nThe Constituent Services Liaison (Caseworker) monitors and updates the Member and District Director on district and local issues. This position acts as a liaison to federal, district, and local agencies for the Member and constituents and answers casework correspondence and verbal communications with constituents.\n\nNorth Carolina and/or NC-04 ties are preferred, but not required.",
    "responsibilities": [
      "Acts as the representative for the Member and/or District Director within their area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Member and the District Director of all happenings in their assigned issue areas by screening district media sources and interacting with constituents;",
      "Handles casework assignments, including helping resolve constituents’ issues with federal agencies in a timely and effective manner;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the Legislative Director, District Director, and Chief of Staff;",
      "Monitors scheduled district meetings for the Member with constituents;",
      "Screens and refers cases, when appropriate, to other district offices;",
      "Trains and assist with supervising Staff Assistants, including interns, to handle office matters such as logging incoming and outgoing correspondence, handling visitors, telephone calls, and computer operations;",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework;",
      "Prepares periodic reports for the District Director on pending cases and district activities in their assigned issue areas;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Meets attendance requirements as established by the office;",
      "Maintains a good working relationship with the Member, staff, and constituents;",
      "Accepts performance-based criticism and directions;",
      "Works well under pressure and handles stress;",
      "Works a flexible schedule including long hours, nights and weekends; and",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "At least 2 years of experience; strong academic credentials.",
      "Strong oral and written communication skills;",
      "Working knowledge of legislative process and of House organization and procedures;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Professional telephone matter;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to perform the essential job functions above;",
      "Ability to work cooperatively and courteously with others;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Positive attitude, willingness to work through tough problems, ability to interact well with the public;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities;",
      "Knowledge of office policies, practices, and procedures;",
      "Knowledge of office computer applications; and",
      "Proficiency in word processing.",
      "This is a full-time and in-person position.",
      "Field duties require work during regular office hours and some nights and weekends. Additionally, employees must hold a valid driver’s license.",
      "Employees must be able to work in a moderately noisy work environment without an expectation of privacy."
    ],
    "how_to_apply": "To apply, please send an email to NC04resumes@mail.house.gov with your cover letter, resume, and three references in one combined PDF attachment. Please use the following format for the subject line: Your full name - Constituent Services Liaison.",
    "salary_info": "$50,000-$60,000 (based on experience)",
    "contact": "NC04resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-016-23",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai’i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-01-23",
    "description": "Responsibilities run the range of assisting the legislative, constituent services and administrative functions of the office, to include: monitoring, processing and responding to constituent mail and other communications, managing constituent tours and other needs, and coordinating DC and district office issues. As needed and depending on capability, the position also encompasses legislative duties.\n\nDirect report is to the Chief of Staff although the Congressman is routinely involved in all aspects of his office operations.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring, processing and responding to constituent mail and other communications",
      "Managing constituent tours and other needs",
      "Coordinating DC and district office issues",
      "Legislative duties (as needed and depending on capability)"
    ],
    "qualifications": [
      "Prior Capitol Hill experience",
      "Hawai’i background",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours, especially adjusting to changing time zones"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-015-23",
    "position_title": "Director of Operations",
    "office": "Rep. Josh Gottheimer",
    "location": "DC",
    "posting_date": "2023-01-23",
    "description": "Rep. Josh Gottheimer seeks qualified candidates for the position of Director of Operations in his DC office.\nConsistent with applicable law, the Office requires all staff to be fully vaccinated against COVID-19 as a term and condition of employment unless a medical or religious exemption is approved.",
    "responsibilities": [
      "Ability to perform each of the essential job functions set forth below.",
      "Serving as a member of the Congressman’s senior staff",
      "Supervising the Scheduler and DC Staff Assistant including providing feedback and conducting performance reviews.",
      "Knowledge of and adherence to office policies, procedures, and practices",
      "Managing the scheduling and operations process end to end with minimal direct involvement from the Chief of Staff and other senior staff including:",
      [
        "Working with a variety of stakeholders to balance the Member’s time between commitments.",
        "Working with the Scheduler to evaluate and schedule incoming requests and invitations in DC and the District.",
        "Working with the operations team to ensure that briefing materials are provided for each event and meeting and ensuring that staff have appropriate advance notice of needs.",
        "Ensuring office policies are followed.",
        "Ensuring office supplies and routine office purchases are kept up to date.",
        "Ensuring travel arrangements are properly coordinated."
      ],
      "Other duties as assigned."
    ],
    "qualifications": [
      "A Bachelor’s degree or related job experience",
      "3-5 years of operations experience in a Congressional office, on a political campaign, or in another fast-paced administrative environment.",
      "At least one year of management experience.",
      "Excellent attention to detail, and strong organizational skills.",
      "Sound judgment.",
      "Strong communication skills.",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner",
      "Willingness to accept direction and guidance on performance and process improvements from the Chief of Staff and Member.",
      "The ability to anticipate challenges and proactively offer solutions.",
      "The ability to thrive in a fast-paced environment.",
      "The ability to work flexible hours including long hours, nights, and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Director of Operations - Last Name” as the subject line",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-014-23",
    "position_title": "Legislative Director",
    "office": "Congressman Clay Higgins (LA-03)",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "Congressman Clay Higgins (LA-03) is seeking a Legislative Director for his\nWashington, DC office.",
    "responsibilities": [
      "Serve as the primary legislative policy advisor to the Member",
      "Develop and implement both short-term and long-term legislative plans to help advance the Member’s policy initiatives",
      "Prepare the Member for floor activity, including votes, floor speeches, timing and procedural motions",
      "Prepare the Member for meetings with constituents, interest groups, and other stakeholders",
      "Manage the legislative staff, delegate issue portfolios, and further the development of junior staffers",
      "Coordinate vote recommendations from the legislative staff and present them to the Member",
      "Review legislation and congressional letters for potential co-sponsorship",
      "Oversee constituent correspondence operations, editing mail and ensuring timely delivery."
    ],
    "qualifications": [
      "Candidates should have at least three years of legislative experience."
    ],
    "how_to_apply": "Qualified candidates should email a cover letter and resume to LA03jobs@gmail.com.",
    "salary_info": null,
    "contact": "LA03jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-013-23",
    "position_title": "Subcommittee on Health Professional Staff Member, U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "office": "U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "REPORTS TO: Republican Staff Director, Subcommittee on Health\nCORE RESPONSIBILITIES:\n*Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives\n*Conduct oversight of Subcommittee issue areas, to include Department implementation of laws, regulations, and programs\n*Monitor legislative needs and developments within committees and on the House floor within specific issue areas of responsibility\n*Under the guidance of Subcommittee Staff Director, provide advice on policy matters within issue areas and help Subcommittee Staff Director develop and implement strategic and policy goals\n*Draft hearing, markup and floor statements for the Full Committee leadership and Subcommittee leadership\n*Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings\n*Assist in the proposing and drafting of legislation for the Committee\n*Meet with congressional staff and internal/external organizations on behalf of the Committee\n*Perform other duties as assigned by Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director\nMinimum Qualifications:\n*4-year college degree required\n*At least three years of congressional or Administration experience resulting in direct, working knowledge of the Committee/Subcommittee’s substantive jurisdiction required; five years strongly preferred\n*Occasional travel, both domestic and international, may be required.\nRequired Skills:\n*Excellent writing, editing, and proofreading skills (additional writing sample may be required prior to an offer being extended)\n*Excellent oral communication skills\n*Thorough knowledge of legislative process, and grasp of House Rules\n*Demonstrate ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions\n*Knowledge of current issues and events in which the Full Committee leadership is involved\n*Ability to develop relationships with diverse groups and individuals\n*Ability to work long hours, under pressure, and cooperatively and courteously with others\n*Attention to detail and demonstrated responsiveness to taskings and assignments\nBenefits:\nEmployees may be eligible for the following benefits:\n*Sick and Annual Leave\n*Student Loan Repayment Program\n*Federal Employees Health Benefits Program\n*Thrift Savings Plan\n*Federal Employees' Group Life Insurance Program\n*Federal Long-Term Care (LTC) Insurance\n*Flexible Spending Accounts (FSAFEDS)\n*Dental & Vision Insurance Program (FEDVIP)\n*Metro or Parking Benefits\nOther Information:\nEmployment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant.",
    "responsibilities": [
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Conduct oversight of Subcommittee issue areas, to include Department implementation of laws, regulations, and programs",
      "Monitor legislative needs and developments within committees and on the House floor within specific issue areas of responsibility",
      "Under the guidance of Subcommittee Staff Director, provide advice on policy matters within issue areas and help Subcommittee Staff Director develop and implement strategic and policy goals",
      "Draft hearing, markup and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings",
      "Assist in the proposing and drafting of legislation for the Committee",
      "Meet with congressional staff and internal/external organizations on behalf of the Committee",
      "Perform other duties as assigned by Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "4-year college degree required",
      "At least three years of congressional or Administration experience resulting in direct, working knowledge of the Committee/Subcommittee’s substantive jurisdiction required; five years strongly preferred",
      "Occasional travel, both domestic and international, may be required.",
      "Excellent writing, editing, and proofreading skills (additional writing sample may be required prior to an offer being extended)",
      "Excellent oral communication skills",
      "Thorough knowledge of legislative process, and grasp of House Rules",
      "Demonstrate ability to exercise discretion and independent judgment in the formulation and recommendation of policy positions",
      "Knowledge of current issues and events in which the Full Committee leadership is involved",
      "Ability to develop relationships with diverse groups and individuals",
      "Ability to work long hours, under pressure, and cooperatively and courteously with others",
      "Attention to detail and demonstrated responsiveness to taskings and assignments"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references, and a writing sample to VAR.Resumes@mail.house.gov with “Health Subcommittee Professional Staff” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-012-23",
    "position_title": "Constituent Services Representative",
    "office": "The Office of Congresswoman Jennifer Wexton (VA-10)",
    "location": "Manassas, Virginia District Office",
    "posting_date": "2023-01-23",
    "description": "This staff member is responsible for addressing requests for assistance from individual constituents and organizations with primarily federal government resources and programs. The position also includes interaction with the Congresswoman’s D.C. office on related legislative and administrative matters, as well as staffing the Congresswoman at various events, including some evening and weekend hours.",
    "responsibilities": [],
    "qualifications": [
      "prior experience especially in comparable duties including customer service or social work",
      "Virginia background/community involvement",
      "experience evaluating, synthesizing, and articulating issues in a thoughtful and respectful manner in support of constituents’ needs and the Congresswoman’s initiatives",
      "extensive knowledge of a broad range of community resources and services from which to draw on when addressing constituent",
      "comfortability with documenting casework progression in a computer database and performing research using online tools"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to casework.wexton@mail.house.gov with “Constituent Services Representative” in the subject line. Please, no phone calls, faxes, or drop-ins.",
    "salary_info": null,
    "contact": "casework.wexton@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer, and minority candidates and candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-011-23",
    "position_title": "Communications Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus",
    "location": "DC",
    "posting_date": "2023-01-23",
    "description": "The Congressional Black Caucus (CBC) seeks a Communications Director to lead an active communications operation.\n\nThis position manages both the long-term strategic communications strategy and day-to-day press for the Caucus, ranging from drafting statements on news of the day, to responding to press inquiries and pitching stories, to managing the CBC’s social media accounts and website, to setting up press availability opportunities (i.e., press conferences, press calls, or pen/pads), to developing and executing a long-term communications plan.\n\nIn addition to managing the communications of the CBC, this position also serves as a resource to all CBC Member offices to provide any communications counsel they may need.",
    "responsibilities": [
      "Working closely with the Executive Director and Policy Director to raise the policy agenda and platform of the Caucus through strategic messaging, earned media, and public outreach"
    ],
    "qualifications": [
      "Substantial experience with and knowledge of Congressional affairs and the legislative process",
      "Experience with media pitching, booking television appearances/interviews, prepping a principal for print & television interviews/appearances",
      "Extensive relationships with DC and National print & television media",
      "Excellent oral and written communication skills",
      "Ability to work under pressure and meet quick deadlines",
      "Experience with communications including, social media, press releases, talking points, etc.",
      "Demonstrated experience working effectively with diverse coalitions",
      "An understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Detail-oriented and possess the ability to multitask, work well in a fast-paced setting, and act as a team player.",
      "A demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample/portfolio to Vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "Vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-009-23",
    "position_title": "Legislative Assistant",
    "office": "House Ways and Means Committee",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "Progressive California Democrat and member of the House Ways and Means Committee seeks a Legislative Assistant to handle an active portfolio of health, defense, veterans, climate, and other policy issues as assigned.\n\nThis position will lead the Member’s work on the Ways and Means Subcommittee on Health. Responsibilities include preparing and staffing the Member in hearings and markups, developing and advancing legislation and other policy priorities, researching and advising the Member on policy issues and vote recommendations, drafting talking points and speeches, and representing the Member in meetings and events.",
    "responsibilities": [
      "Preparing and staffing the Member in hearings and markups",
      "Developing and advancing legislation and other policy priorities",
      "Researching and advising the Member on policy issues and vote recommendations",
      "Drafting talking points and speeches",
      "Representing the Member in meetings and events"
    ],
    "qualifications": [
      "Independent worker and self-starter",
      "Capacity to produce high quality work in a fast-paced environment",
      "Strong communication and writing skills",
      "Ability to synthesize complex technical information under tight deadlines",
      "Ability to work well with a variety of competing interest groups and diverse stakeholders",
      "Background in health policy and relevant legislative experience (preferred)",
      "Not an entry level position",
      "Positive attitude",
      "Good sense of humor",
      "Thrive in a team environment"
    ],
    "how_to_apply": "Please e-mail your resume, cover letter, and a short writing sample to ca28.jobs@gmail.com and list “Legislative Assistant” in the subject line.",
    "salary_info": "$70-85,000, commensurate with experience",
    "contact": "ca28.jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer.\nWomen, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply. A full COVID vaccination course, regardless of recovery from prior coronavirus illness, is a condition of employment."
  },
  {
    "id": "MEM-404-22",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Honolulu district office",
    "posting_date": "2023-01-23",
    "description": "Duties include but are not limited to constituent communications including calls for general information and other inquiries and representing the office at community events.\n\nThis position also is responsible for a wide variety of administrative duties, and acts as a liaison to the federal, district and local government agencies on behalf of the Congressman on requests by constituents seeking assistance with individual/group issues. Staff Assistant will report directly to the Deputy Chief of Staff in the Honolulu office, although the position also interacts directly with the Congressman, Chief of Staff, and his Washington, D.C. office.",
    "responsibilities": [
      "Constituent communications including calls for general information and other inquiries",
      "Representing the office at community events",
      "Administrative duties",
      "Liaison to the federal, district and local government agencies on behalf of the Congressman on requests by constituents seeking assistance with individual/group issues"
    ],
    "qualifications": [
      "Prior experience, especially in comparable duties",
      "Hawai'i background/community involvement",
      "Initiative",
      "Strong interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work unpredictable hours as necessary"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-007-23",
    "position_title": "Benefits Investigator, Subcommittee on Disability Assistance and Memorial Affairs, U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "office": "Subcommittee on Disability Assistance and Memorial Affairs, U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "REPORTS TO: Republican Staff Director, Subcommittee on Disability Assistance and Memorial Affairs",
    "responsibilities": [
      "Conduct oversight of Subcommittee issue areas, to include Department of Veterans Affairs (VA) implementation of laws, regulations, and programs",
      "Visit VA Regional Benefits Offices to perform oversight of Subcommittee issue areas locally",
      "Build relationships with internal and external partners, including contacts within the VA and other government agencies, to promote and enact the legislative and oversight agenda of the Subcommittee",
      "Under the guidance of Subcommittee Staff Director, provide advice on policy matters within issue areas and help Subcommittee Staff Director develop and implement strategic and policy goals",
      "Draft hearing, markup and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings",
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Perform other duties as assigned by Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "Bachelor of Arts or Sciences",
      "Congressional, Administration, Government Agency, or relevant industry background experience resulting in direct, working knowledge of the Committee/Subcommittee’s substantive jurisdiction is required; at least three years strongly preferred",
      "May be required to undergo a Public Trust Background Investigation",
      "Occasional travel may be required"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references, and three writing samples to VAR.Resumes@mail.house.gov with “DAMA Benefits Investigator” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-006-23",
    "position_title": "Full Committee General Counsel and Subcommittee on Disability Assistance and Memorial Affairs Professional Staff Member",
    "office": "U.S. House Committee on Veterans’ Affairs, Republican Staff",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "REPORTS TO: Republican Staff Director, Subcommittee on Disability Assistance and Memorial Affairs",
    "responsibilities": [
      "Ensures compliance with House Rules, Committee Rules, Republican Caucus Rules, and parliamentary procedure",
      "Serves as the legal advisor to the Republican Committee Leader and Committee staff",
      "Monitors legislation outside of the Committee, especially bills going to the House Floor, that are relevant to the Committee’s work",
      "Assist the Subcommittee Staff Director in advising the Full Committee leadership and Subcommittee leadership on legislative initiatives",
      "Conduct oversight of Subcommittee issue areas, to include Department implementation of laws, regulations, and programs",
      "Monitor legislative needs and developments within committees and on the House floor within specific issue areas of responsibility",
      "Under the guidance of Subcommittee Staff Director, provide advice on policy matters within issue areas and help Subcommittee Staff Director develop and implement strategic and policy goals",
      "Draft hearing, markup and floor statements for the Full Committee leadership and Subcommittee leadership",
      "Assist in determining Full Committee and Subcommittee hearing topics and prepare for hearings",
      "Assist in the proposing and drafting of legislation for the Committee",
      "Meet with congressional staff and internal/external organizations on behalf of the Committee",
      "Perform other duties as assigned by Subcommittee Staff Director, Full Committee Deputy Staff Director, and Full Committee Staff Director"
    ],
    "qualifications": [
      "Juris Doctor from an ABA accredited law school and admitted to practice law in any state or territory",
      "At least three years of congressional or Administration experience resulting in direct, working knowledge of the Committee/Subcommittee’s substantive jurisdiction required; five years strongly preferred",
      "May be required to undergo a Public Trust Background Investigation",
      "Occasional travel may be required"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, three professional references, and three writing samples to VAR.Resumes@mail.house.gov with “FC General Counsel and DAMA Professional Staff Member” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-005-23",
    "position_title": "Staff Assistant, House Committee on Veterans’ Affairs, Republican Staff",
    "office": "House Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "Provides general administrative support to staff, staffs front office and phones, processes mail, and assists with other duties as assigned.",
    "responsibilities": [
      "Provide front office administrative coverage to include greeting visitors, answering phones, and processing mail.",
      "Maintain files for mail, bills, reports, and public laws, and other legislative papers.",
      "Prepare binders for full committee events (hearings, markups, floor, etc.).",
      "Conduct attendance polls for full committee hearings and markups.",
      "Coordinate floor time requests for Republicans seeking to speak on legislation.",
      "Review the Congressional Record daily for information that impacts the Committee.",
      "Maintain contact lists for committee staff and committee member personal office staff.",
      "Maintain Republican email distribution lists.",
      "Monitor office supplies to ensure that staff have needed supplies.",
      "Serve as the secondary Office Safety Coordinator.",
      "Perform other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references, and three writing samples to VAR.Resumes@mail.house.gov with “Staff Assistant” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-004-23",
    "position_title": "Chief Clerk",
    "office": "Committee on Veterans’ Affairs",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "Position Description",
    "responsibilities": [
      "Ensures timely release of accurate, official hearing and markup documents per House and Committee rules",
      "Prepares hearing room for all Committee hearings, meetings, markups, and GOP roundtables, including preparation of materials for members, the court reporter, and media",
      "Clerks all committee hearings, meetings, and markups",
      "Prepare and release official hearing advisories and meeting notices for the Committee using House Committee Repository",
      "Remains current on House Rules and rule changes relating to the clerk’s duties.",
      "Serves as Office Emergency Coordinator",
      "Manages the front office, including but not limited to answering phones and greeting visitors.",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "Excellent communication skills",
      "Strong organizational skills",
      "Attention to detail",
      "Strong writing, editing, and proofreading skills",
      "Knowledge of the legislative process",
      "Knowledge of House record-keeping requirements",
      "Ability to work cooperatively and courteously with others",
      "Punctual"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, references, and three writing samples to VAR.Resumes@mail.house.gov with “Chief Clerk” in the subject line. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House of Representatives is an equal opportunity employer. All applicants will be considered without regard to race, color, national origin, religion, sex (including marital or parental status), disability, or age. Transportation and all related travel expenses associated with the interview and hiring process must be paid by the applicant."
  },
  {
    "id": "MEM-002-23",
    "position_title": "Policy Advisor",
    "office": "Rep. Marcy Kaptur (D-OH-09)",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "Rep. Marcy Kaptur (D-OH-09) seeks an experienced legislative staffer and Policy Advisor to handle a portfolio including energy and environmental issues (both in the personal office and as a liaison to Appropriations Subcommittee staff in her role as Ranking Member), as well as transportation, technology, infrastructure, and judiciary issues.\n\nCandidates must be familiar with the energy and environment portfolio, the Appropriations process, have a deep understanding of the legislative process including crafting and advancing legislation, analyzing and briefing a Senior Member of Congress on complex policy issues, and drafting a wide array of written materials (including materials for Committee and Floor activities).\n\nExperience with Great Lakes issues and connections to the region are preferred but not required.\n\nStrong written and verbal communication skills and a demonstrated ability to work collaboratively in a fast-paced environment are critical. At least five years of relevant experience is encouraged, and Congressional experience is strongly preferred.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Applicants should email a resume, cover letter, two writing samples, and references as individual files in PDF format to Steve.Katich@mail.house.gov “Appropriations Associate/Advisor” in the subject line. No phone calls, faxes, emails, or walk-ins, please.",
    "salary_info": null,
    "contact": "Steve.Katich@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-626-22",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.\n\nCandidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [],
    "qualifications": [
      "Experience in one or more of the following areas is desirable: government ethics; campaign finance; criminal law; employment law, including the laws governing sexual harassment in the workplace; civil litigation; administrative investigations and adjudications; depositions; and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "$130,441-$138,856",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-625-22",
    "position_title": "STAFF ASSISTANT",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include\nassisting the technology needs of Committee staff; editing and maintaining the\nCommittee's website; answering telephones; assisting with the tracking and\nprocessing of committee correspondence; providing administrative support in\nsetting up committee meetings; and entering data and navigating databases with\naccuracy.\n\nThis is a non-partisan position which requires the ability to serve all Members of\nCongress equally and refrain from political or partisan activity. Applicants must\nhave excellent organizational skills and a professional telephone manner; good\ncomputer skills; proficiency in Microsoft Word and Excel; ability to work\ncooperatively and courteously with others; ability to use good judgment in\nresponding to inquiries and requests; and flexibility in assisting with daily tasks\nand projects.",
    "responsibilities": [
      "Assisting the technology needs of Committee staff",
      "Editing and maintaining the Committee's website",
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills",
      "A professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects",
      "Experience or interest in learning information technology assistance are strongly encouraged to apply"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov\nNO PHONE CALLS PLEASE",
    "salary_info": "This is an entry level position with a starting salary of $47,093 per year.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-620-22",
    "position_title": "Communications Director",
    "office": "Congressional Hispanic Caucus (CHC)",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "The Congressional Hispanic Caucus (CHC) is seeking a Communications Director. Successful candidates should have previous experience working directly with Members of Congress, knowledge of the legislative process, significant Hill experience and/or experience doing advocacy work on issues of importance to Hispanic communities.\n\nThe Communications Director will be responsible for working closely with the Executive Director and CHC Chair to execute the vision of the CHC Chair and members; managing CHC press interns|fellows; developing communications plans and doing extensive press & media outreach; running the CHC social media accounts & website; and working to place CHC Chair and members on television, radio, and in print.\n\nThe ideal candidate will be a self-starter and strong leader; have a strong attention to detail; be highly organized and able to put in place effective and efficient processes to complete required tasks; and have the ability to work in an extremely fast-paced and demanding environment.\n\nAbility to speak and write fluently in Spanish is strongly preferred.\n\nThis is a senior-level position. Non-traditional work hours are expected.\nCandidates should have a minimum of 3-4 years of Capitol Hill or equivalent experience.",
    "responsibilities": [
      "Working closely with the Executive Director and CHC Chair to execute the vision of the CHC Chair and members",
      "Managing CHC press interns|fellows",
      "Developing communications plans and doing extensive press & media outreach",
      "Running the CHC social media accounts & website",
      "Working to place CHC Chair and members on television, radio, and in print"
    ],
    "qualifications": [
      "Substantial experience with and knowledge of Congressional affairs and the legislative process",
      "Knowledge of the CHC's policy agenda",
      "Experience with media pitching, booking television appearances|interviews, prepping a principal for print & television interviews|appearances",
      "Extensive relationships with DC and National print & television media (incl. Spanish language print & television media)",
      "Excellent oral and written communication skills",
      "Ability to work under pressure and meet quick deadlines",
      "Experience with communications including, social media, press releases, talking points, etc.",
      "Demonstrated experience working effectively with diverse coalitions"
    ],
    "how_to_apply": "Submit cover letter, resume, and short writing sample to Liam.Forsythe@mail.house.gov.",
    "salary_info": null,
    "contact": "Liam.Forsythe@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-619-22",
    "position_title": "Executive Director – Congressional Hispanic Caucus (CHC)",
    "office": "Congressional Hispanic Caucus (CHC)",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "The Congressional Hispanic Caucus (CHC) is seeking an Executive Director.\n\nSuccessful candidates should have previous experience working directly with Members of Congress, knowledge of the legislative process, significant Hill experience and/or experience doing advocacy work on issues of importance to Hispanic communities.\n\nThe Executive Director will be responsible for executing the vision of the CHC Chair; managing CHC staff; developing strategy and communications plans; and organizing meetings and strategic planning with the CHC Chair and the CHC’s 42 Members.\n\nThe ideal candidate will be a self-starter and strong leader; have a strong attention to detail; be highly organized and able to put in place effective and efficient processes to complete required tasks; and have the ability to work in an extremely fast-paced and demanding environment.\n\nAbility to speak and write fluently in Spanish is strongly preferred.\n\nThis is a senior-level position. Non-traditional work hours are expected.\n\nCandidates should have a minimum of 3-4 years of Capitol Hill or equivalent experience.",
    "responsibilities": [
      "Executing the vision of the CHC Chair",
      "Managing CHC staff",
      "Developing strategy and communications plans",
      "Organizing meetings and strategic planning with the CHC Chair and the CHC’s 42 Members"
    ],
    "qualifications": [
      "Substantial experience with and knowledge of Congressional affairs and the legislative process",
      "Knowledge of the CHC’s policy agenda",
      "Excellent oral and written communication skills",
      "Ability to work under pressure and meet quick deadlines",
      "Experience with communications including, social media, press releases, talking points, etc.",
      "Leadership and management experience",
      "Demonstrated experience working effectively with diverse coalitions"
    ],
    "how_to_apply": "Submit cover letter, resume, and short writing sample to Liam.Forsythe@mail.house.gov.",
    "salary_info": null,
    "contact": "Liam.Forsythe@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-617-22",
    "position_title": "Professional Staff Member",
    "office": "House Committee on Veterans’ Affairs (Majority), Subcommittee on Technology Modernization",
    "location": "Washington, DC",
    "posting_date": "2023-01-23",
    "description": "Core Responsibilities:\nUnder the supervision of the Subcommittee Staff Director, conduct oversight of the Department of Veterans Affairs (VA) enterprise technology programs and projects, including Electronic Health Record Modernization, as well its information technology operations.\nCollect technical information and translate it into briefings, memoranda, hearing materials, and policy recommendations for a general audience.\nIn addition to information technology, the Subcommittee covers many of VA’s administrative and management functions, including acquisition, project management, finance, procurement, supply chain, and human capital.\nMeet with congressional staff, veteran service organizations, technical organizations, and internal and external stakeholders.\nPerform other duties as assigned by the Subcommittee Staff Director, Committee Staff Director, and Committee Deputy Staff Director.\nQualifications:\nUndergraduate degree\nAt least five years of relevant work experience, including prior congressional committee or federal agency experience\nSome level of subject matter expertise in information technology and federal agency administrative or management issues\nExcellent writing, editing, and proofreading skills\nExcellent oral communication skills\nThoroughness and attention to detail\nDiscretion and sound judgment in formulating and recommending policy positions\nKnowledge of current issues and events relevant to the Committee and VA\nAbility to work long hours, under pressure, while remaining cooperative and courteous\nWork independently as well as in teams\nThis is a full-time, on-site position in Washington, DC.\nSome domestic travel is required.\nBenefits:\nSick and Annual Leave\nFederal Employees Health Benefits Program\nThrift Savings Plan\nFederal Employees Group Life Insurance Program\nFederal Long-Term Care Insurance\nFlexible Spending Accounts (FSAFEDS)\nDental & Vision Insurance Program (FEDVIP)\nFederal Transit Benefit or parking\nStudent Loan Repayment Program",
    "responsibilities": [
      "Under the supervision of the Subcommittee Staff Director, conduct oversight of the Department of Veterans Affairs (VA) enterprise technology programs and projects, including Electronic Health Record Modernization, as well its information technology operations.",
      "Collect technical information and translate it into briefings, memoranda, hearing materials, and policy recommendations for a general audience.",
      "In addition to information technology, the Subcommittee covers many of VA’s administrative and management functions, including acquisition, project management, finance, procurement, supply chain, and human capital.",
      "Meet with congressional staff, veteran service organizations, technical organizations, and internal and external stakeholders.",
      "Perform other duties as assigned by the Subcommittee Staff Director, Committee Staff Director, and Committee Deputy Staff Director."
    ],
    "qualifications": [
      "Undergraduate degree",
      "At least five years of relevant work experience, including prior congressional committee or federal agency experience",
      "Some level of subject matter expertise in information technology and federal agency administrative or management issues",
      "Excellent writing, editing, and proofreading skills",
      "Excellent oral communication skills",
      "Thoroughness and attention to detail",
      "Discretion and sound judgment in formulating and recommending policy positions",
      "Knowledge of current issues and events relevant to the Committee and VA",
      "Ability to work long hours, under pressure, while remaining cooperative and courteous",
      "Work independently as well as in teams",
      "This is a full-time, on-site position in Washington, DC.",
      "Some domestic travel is required."
    ],
    "how_to_apply": "Interested candidates should send their cover letter and resume\nto VAR.Resumes@mail.house.gov with “Technology Modernization\nProfessional Staff Member” in the subject line. Writing samples and references\nmay be requested. No calls or walk-ins, please.",
    "salary_info": null,
    "contact": "VAR.Resumes@mail.house.gov",
    "equal_opportunity": "Employment with the U.S. House of Representatives is at-will. The U.S. House\nof Representatives is an equal opportunity employer. All applicants will be\nconsidered without regard to race, color, national origin, religion, sex (including\nmarital or parental status), disability, or age. Transportation and all related travel\nexpenses associated with the interview and hiring process must be paid by the\napplicant."
  },
  {
    "id": "MEM-611-22",
    "position_title": "Committee Clerk",
    "office": "Republican Staff of the House Judiciary Committee",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "The Republican Staff of the House Judiciary Committee seeks a highly organized and detail-oriented Committee Clerk.\n\nClerks are responsible for the preparation of all committee activities, such as hearings and markups. Clerks ensure the committee is run efficiently by maintaining and organizing all committee records as well as assisting with the administrative functions of the committee. Qualified applicants will have at least one year of Hill experience as well as working knowledge of how Congressional committees operate.",
    "responsibilities": [
      "Preparation of all committee activities, such as hearings and markups.",
      "Maintaining and organizing all committee records.",
      "Assisting with the administrative functions of the committee."
    ],
    "qualifications": [
      "At least one year of Hill experience",
      "Working knowledge of how Congressional committees operate."
    ],
    "how_to_apply": "Candidates can email their resume to Kiley.Bidelman@mail.house.gov.",
    "salary_info": null,
    "contact": "Kiley.Bidelman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-610-22",
    "position_title": "Staff Assistant",
    "office": "Republican Staff of the House Judiciary Committee",
    "location": null,
    "posting_date": "2023-01-23",
    "description": "The Republican Staff of the House Judiciary Committee seeks a Staff Assistant to perform administrative functions, research projects, and other special assignments.",
    "responsibilities": [],
    "qualifications": [
      "Previous Hill experience",
      "Knowledgeable about or interested in the Judiciary Committee",
      "Strong research and writing skills",
      "Demonstrated attention to detail",
      "Ability to multitask in a fast-paced environment",
      "Work well on teams",
      "Willingness to accomplish a variety of assignments quickly and effectively"
    ],
    "how_to_apply": "Candidates can email their resume to Kiley.Bidelman@mail.house.gov.",
    "salary_info": null,
    "contact": "Kiley.Bidelman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-604-22",
    "position_title": "Communications Director",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C. and Seattle, WA",
    "posting_date": "2023-01-23",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced, creative, and highly motivated Communications Director to lead media and strategy efforts for her Washington, D.C. and Seattle, WA offices.\n\nAn ideal candidate will:\n\nPossess strong written and oral communications skills and the ability to multitask while thriving in a fast-paced setting under tight deadlines;\n\nHave experience working directly with local and national reporters, bookers, and other members of the media to proactively pitch stories and respond to inquiries;\n\nThink strategically and creatively while designing, implementing, and evaluating both short and long-term communications plans in addition to leading rapid response efforts;\n\nHave a proven track record of writing in the voice of a principal (op-eds, speeches, statements, messaging, talking points, digital content, etc.) and explaining policy issues in ways that people can easily understand;\n\nKnow how to operate directly with a principal and collaboratively across departments while demonstrating experience managing a team;\n\nUnderstand the digital media landscape and current digital trends, with experience overseeing a digital program;\n\nHave a strong record of advocating for progressive values;\n\nBe willing to staff the Congresswoman for press, and work weekends and irregular hours.",
    "responsibilities": [
      "Developing and executing the office’s communications strategy for Capitol Hill and WA-07, including national and local press, messaging, writing, events, and digital;",
      "Working directly with the Congresswoman to prepare and staff her for interviews, speeches, press conferences, public events, roundtables, and other opportunities;",
      "Building and sustaining strong relationships with local and national reporters (including Capitol Hill reporters, local reporters, and issue-specific reporters at national outlets), editors, columnists, producers, bookers, and advocacy groups;",
      "Proactively and strategically engaging in media outreach, including pitching reporters while also fielding and responding to press inquiries at the local and national levels;",
      "Serving as the spokesperson (on the record, on background, and off the record) for the Congresswoman;",
      "Drafting written materials including press statements, quotes, speeches, remarks, op-eds, press releases and advisories, and talking points;",
      "Designing creative plans to effectively roll out legislation, letters, and other policy initiatives that include press components, and events;",
      "Overseeing a robust, aggressive, engaging, and data-driven online communications program;",
      "Supervising and partnering with the Digital Director, who manages all digital and online content, to maintain strategic messaging across official channels while collaborating with Progressive Caucus staff;",
      "Working collaboratively with the District Office to ensure a consistently strong local/state media presence while collaborating with the legislative team on a daily basis;",
      "Participating in the senior team along with the Chief of Staff, Deputy Chief of Staff, District Director and Legislative Director."
    ],
    "qualifications": [
      "Applicants must have a proven track record of working with the press, and a minimum of two years of experience as a press secretary or communications director is required.",
      "Previous experience on campaigns (political, legislative, or issue-based) and on Capitol Hill is preferred.",
      "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply.",
      "State and/or district ties are a plus."
    ],
    "how_to_apply": "Qualified candidates should include the following in their application:\n\nResume\nCover letter\nThree writing samples including an op-ed or speech and a statement\nPlease send applications to jobs.pramila@mail.house.gov with “Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-582-22",
    "position_title": "Field Representative",
    "office": "Congresswoman Michelle Steel’s District Office",
    "location": "Orange County",
    "posting_date": "2023-01-23",
    "description": "The Field Representative serves an important role in the Member’s Congressional District, acting as a liaison with federal, district, and local agencies for the Member and constituents. They are responsible for strengthening community relations and assessing casework for problems requiring legislative action and/or Congressional oversight.",
    "responsibilities": [
      "Ensure outreach efforts align with the Member’s strategic vision and goals",
      "Coordinate closely with staff to ensure district priorities are reflective in legislative priorities",
      "Build and maintain relationships with constituents and key community leaders",
      "Inform the District Director and Member on up-and-coming issues in the district",
      "Perform constituent services and casework as assigned"
    ],
    "qualifications": [
      "Expertise developing and executing a community relations strategy",
      "Experience in maintaining relationships with constituents and community leaders",
      "Political savvy and comfortable navigating complicated situations",
      "Strong written and verbal communication skills, including public speaking skills",
      "Ability to multi-task, manage time effectively, and adapt to changing priorities",
      "Candidates must be able to work a flexible scheduling, including nights and weekends",
      "Constituent service oriented; patient empathetic, and desire to help constituents"
    ],
    "how_to_apply": "Submit a cover letter and resume to\nStephanie Hu, District Director, Office of Congresswoman\nSteel Stephanie.Hu@mail.house.gov",
    "salary_info": "Salary range is $49,000-$57,000. Salary commensurate with experience.",
    "contact": "Stephanie.Hu@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  }
]