[
  {
    "id": "MEM-383-15",
    "position_title": "Staff Assistant",
    "office": "The Office of Congresswoman Frederica S. Wilson (D-FL-24)",
    "location": "Washington, DC",
    "posting_date": "2015-11-09",
    "description": "The Office of Congresswoman Frederica S. Wilson (D-FL-24) seeks an enthusiastic, highly-organized, and personable Staff Assistant for her Washington, DC office. Responsibilities include driving, supporting Member's daily activities, managing front desk operations, answering telephones, greeting visitors, coordinating tours for visiting guests, processing flag requests, answering constituent requests for general information, and other tasks as assigned.",
    "responsibilities": [
      "Driving",
      "Supporting Member's daily activities",
      "Managing front desk operations",
      "Answering telephones",
      "Greeting visitors",
      "Coordinating tours for visiting guests",
      "Processing flag requests",
      "Answering constituent requests for general information",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Excellent written and interpersonal communications skills",
      "A car",
      "A sense of humor",
      "The ability to work long hours in a fast-paced, team environment",
      "Capitol Hill or comparable experience is preferred, but not required"
    ],
    "how_to_apply": "Interested individuals should email a cover letter, resume, and three references to FL24Applications@gmail.com, with “Staff Assistant” in the subject line, by November 16, 2015. Please, no drop bys or phone calls.",
    "salary_info": null,
    "contact": "FL24Applications@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-379-15",
    "position_title": "Investigator",
    "office": "Democratic Congressional Oversight Subcommittee",
    "location": null,
    "posting_date": "2015-11-09",
    "description": "Democratic Congressional Oversight Subcommittee is seeking an energetic, thoughtful investigator with outstanding written and oral communications skills. Must be self-motivated, diligent, team player adept at conducting extensive research, quickly summarizing key issues and able to juggle multiple tasks. Investigations include a wide range of subjects including energy and environmental topics and issues that impact federal science, space, and homeland security programs. Strong awareness of environmental and public health issues preferred. Attorneys with oversight experience encouraged to apply. Candidate should be comfortable briefing Members of Congress, interviewing federal officials and writing substantive investigative reports. Ideally, candidate is experienced at uncovering allegations of waste, fraud, abuse and mismanagement and is curious, driven and good natured.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Please send a resume and cover letter to SciResumes@mail.house.gov.",
    "salary_info": null,
    "contact": "SciResumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-368-15",
    "position_title": "Staff Assistant",
    "office": "New England Democrat",
    "location": "Washington, DC",
    "posting_date": "2015-11-09",
    "description": "New England Democrat seeks an enthusiastic, motivated, and highlyorganized Staff Assistant for Washington, DC office. Responsibilities include managing front office operations, overseeing intern program, serving as confidential assistant to Chief of Staff and Member, driving Member to meetings and appointments, supporting Member’s daily activities, providing assistance to scheduling and legislative teams, and other tasks as assigned.",
    "responsibilities": [
      "Managing front office operations",
      "Overseeing intern program",
      "Serving as confidential assistant to Chief of Staff and Member",
      "Driving Member to meetings and appointments",
      "Supporting Member’s daily activities",
      "Providing assistance to scheduling and legislative teams",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Access to a vehicle and a clean driving record is required.",
      "New England ties preferred."
    ],
    "how_to_apply": "Applicants should submit cover letter, resume, and brief writing sample to hill.jobs@mail.house.gov. No phone calls or drop-bys.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-354-15",
    "position_title": "Investigator",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2015-11-09",
    "description": "The Committee on Ethics seeks an experienced investigative professional for an investigator position. The Committee’s investigator is responsible for assisting the Committee in all aspects of its investigative work, including researching and reviewing public data sources, forensic research, document review, data collection and analysis, and preparing for and participating in witness interviews. This is a nonpartisan position which requires the ability to assist with impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding organizational, research, and analytical skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, investigative journalism, or financial accounting. Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred.",
    "responsibilities": [
      "Assisting the Committee in all aspects of its investigative work",
      "Researching and reviewing public data sources",
      "Forensic research",
      "Document review",
      "Data collection and analysis",
      "Preparing for and participating in witness interviews"
    ],
    "qualifications": [
      "Outstanding organizational, research, and analytical skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, investigative journalism, or financial accounting.",
      "Experience with document review/management platforms and/or online research services (Lexis/Nexis, Westlaw, CLEAR) also preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigator” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-349-15",
    "position_title": "Legislative Assistant",
    "office": "Conservative southeastern member",
    "location": null,
    "posting_date": "2015-11-09",
    "description": "Conservative southeastern member seeks Legislative Assistant to handle issue areas, assist in drafting legislation, provide policy research, and liaise with constituent groups and stakeholders. Superior writing skill and ideological fit are an absolute must. Successful candidates will have a fluid style, a strong knowledge of English usage, and a passion for the details of written communication. Must be able to produce on deadline. Hill experience preferred but not necessary. Nontraditional resumes welcome.",
    "responsibilities": [
      "Handle issue areas",
      "Assist in drafting legislation",
      "Provide policy research",
      "Liaise with constituent groups and stakeholders"
    ],
    "qualifications": [
      "Superior writing skill",
      "Ideological fit",
      "Fluid style",
      "Strong knowledge of English usage",
      "Passion for the details of written communication",
      "Ability to produce on deadline",
      "Hill experience preferred but not necessary",
      "Nontraditional resumes welcome"
    ],
    "how_to_apply": "Please send a resume and writing samples of varied forms to semember3@gmail.com. No calls, faxes, or drop-ins please.",
    "salary_info": null,
    "contact": "semember3@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-331-15",
    "position_title": "Committee Clerk/Administrator",
    "office": "House Committee Democratic staff",
    "location": "Hill",
    "posting_date": "2015-11-09",
    "description": "House Committee Democratic staff seeks a detail-oriented Committee Clerk/Administrator to handle committee legislative clerk responsibilities as well as office administrator/payroll work. Hill experience strictly required, preferably 2+ years -- this is not an entry-level position. Committee legislative clerk, hearing coordination, or similar experience strongly preferred, familiarity with Congressional payroll and Hill office administrative work a strong plus.",
    "responsibilities": [
      "Handle committee legislative clerk responsibilities",
      "Office administrator/payroll work"
    ],
    "qualifications": [
      "Hill experience strictly required, preferably 2+ years",
      "Committee legislative clerk, hearing coordination, or similar experience strongly preferred",
      "Familiarity with Congressional payroll and Hill office administrative work a strong plus"
    ],
    "how_to_apply": "Please e-mail your resume and cover letter to demcommitteejob@mail.house.gov. No phone calls, please.",
    "salary_info": null,
    "contact": "demcommitteejob@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-302-15",
    "position_title": "District Representative",
    "office": "Congresswoman Norma J. Torres",
    "location": "Ontario, CA District Office",
    "posting_date": "2015-11-09",
    "description": "The District Representative will act as a liaison between constituent groups and Congresswoman Torres, in addition to initiating community outreach projects. The District Representative will respond to in-person, written and telephone inquiries from constituents, as well as make legislative and ceremonial presentations on behalf of Congresswoman Torres. The District Representative will also maintain an awareness and involvement in district affairs, representing the Congresswoman at public events in the district. In addition, the District Representative will work with the Press Secretary to maintain Congresswoman Torres' social media accounts.",
    "responsibilities": [
      "Act as a liaison between constituent groups and Congresswoman Torres",
      "Initiate community outreach projects",
      "Respond to in-person, written and telephone inquiries from constituents",
      "Make legislative and ceremonial presentations on behalf of Congresswoman Torres",
      "Maintain an awareness and involvement in district affairs",
      "Represent the Congresswoman at public events in the district",
      "Work with the Press Secretary to maintain Congresswoman Torres' social media accounts"
    ],
    "qualifications": [
      "Strong public speaking skills",
      "Flexible schedule; the ability to attend early morning, evening and weekend events",
      "The ability to handle difficult situations with courtesy, tact and compassion",
      "Strong writing skills",
      "Problem solving abilities",
      "The ability to exercise a high degree of initiative",
      "The ability to work independently and use good judgment",
      "The ability to maintain confidentiality",
      "Knowledge of the cities, communities and issues of concern to the 35th Congressional District"
    ],
    "how_to_apply": "Qualified candidates should send a cover letter and resume to caldemresumes@gmail.com with “District Representative” in the subject.",
    "salary_info": null,
    "contact": "caldemresumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-297-15",
    "position_title": "Communications Director",
    "office": "Conservative western republican",
    "location": null,
    "posting_date": "2015-11-09",
    "description": "Conservative western republican seeks motivated and aggressive Communications Director to work placement of stories in local district media. Must have demonstrated experience working with various forms of media, pitching stories, and solid verbal and writing skills. Understanding of policy issues and ability to critically think of district implications a must.",
    "responsibilities": [],
    "qualifications": [
      "Demonstrated experience working with various forms of media, pitching stories, and solid verbal and writing skills.",
      "Understanding of policy issues and ability to critically think of district implications a must."
    ],
    "how_to_apply": "Send resume and cover letter to western.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "western.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-292-15",
    "position_title": "Communications Director",
    "office": "Progressive Tennessee Member",
    "location": "DC",
    "posting_date": "2015-11-09",
    "description": "Responsibilities include developing and implementing a coordinated and strategic communications plan; identifying emerging press opportunities; writing press releases, talking points, speeches and op-eds; pitching stories and responding to press inquiries; booking interviews on radio and television; scheduling and organizing press events; managing congressional website, Facebook and Twitter accounts; producing a comprehensive weekly e-newsletter and regular print mailings to constituents; and fostering strong relationships with reporters to secure local and national coverage of the member's work.\n\nMust work closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively. Additionally, CD will be responsible for portions of the office's mail operation. Strong political judgment, good sense of humor and ability to work under short deadlines in a rapidly changing environment is required. Must be comfortable with and show good judgment speaking on the record with press. Ideal candidate will have an existing network of press contacts, strong writing skills, political savvy and ability to strategically connect DC policy with district press opportunities.\n\nIdeal candidate will have at least 3 years' experience in media relations or in journalism. Hill experience and Tennessee ties are a plus, as are knowledge of Judiciary and Transportation issues.",
    "responsibilities": [
      "Developing and implementing a coordinated and strategic communications plan",
      "Identifying emerging press opportunities",
      "Writing press releases, talking points, speeches and op-eds",
      "Pitching stories and responding to press inquiries",
      "Booking interviews on radio and television",
      "Scheduling and organizing press events",
      "Managing congressional website, Facebook and Twitter accounts",
      "Producing a comprehensive weekly e-newsletter and regular print mailings to constituents",
      "Fostering strong relationships with reporters to secure local and national coverage of the member's work",
      "Working closely with DC and district staff to quickly grasp legislative and local issues and communicate them effectively",
      "Responsible for portions of the office's mail operation"
    ],
    "qualifications": [
      "At least 3 years' experience in media relations or in journalism",
      "Strong political judgment",
      "Good sense of humor",
      "Ability to work under short deadlines in a rapidly changing environment",
      "Comfortable with and show good judgment speaking on the record with press",
      "Existing network of press contacts",
      "Strong writing skills",
      "Political savvy",
      "Ability to strategically connect DC policy with district press opportunities",
      "Hill experience and Tennessee ties are a plus",
      "Knowledge of Judiciary and Transportation issues are a plus"
    ],
    "how_to_apply": "Interested parties should send a cover letter, resume and 2 writing samples to cohen.jobs@mail.house.gov.",
    "salary_info": null,
    "contact": "cohen.jobs@mail.house.gov",
    "equal_opportunity": null
  }
]