[
  {
    "id": "MEM-135-18",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member of Congress",
    "location": "Washington, D.C.",
    "posting_date": "2018-05-14",
    "description": "Senior Democratic Member of Congress seeks an energetic, organized, creative, self-starter to join the team of her very active and visible legislative office staff. The candidate must have strong interpersonal skills, be comfortable with managing multiple tasks and work well under pressure.\n\nThe staff assistant is responsible for front office duties, including answering and screening telephone calls, mail distribution, room reservations, and responding to constituent requests for flags, tours, and other information. The staff assistant also serves as intern coordinator by recruiting training, scheduling and assigning duties.",
    "responsibilities": [
      "Front office duties, including answering and screening telephone calls",
      "Mail distribution",
      "Room reservations",
      "Responding to constituent requests for flags, tours, and other information",
      "Intern coordinator by recruiting training, scheduling and assigning duties"
    ],
    "qualifications": [
      "Bachelor's degree",
      "Significant experience interacting with the public",
      "Excellent writing and communication skills",
      "Candidate must be a resident of the District of Columbia or willing to move immediately to D.C., if hired."
    ],
    "how_to_apply": "Interested applicants should send a resume, cover letter, references and two writing samples to: DC00.NortonResume@mail.house.gov.",
    "salary_info": "Salary is based on skill and experience level.",
    "contact": "DC00.NortonResume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-134-18",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2018-05-14",
    "description": "The Committee on Ethics seeks an attorney for the position of counsel in the Office of Advice and Education. The Committee’s Advice and Education counsels are responsible for providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [],
    "qualifications": [
      "Experience in one or more of the following areas is desirable: government ethics; ethics counseling and training; corporate finance; securities law; employment law, including the laws governing sexual harassment in the workplace; and criminal law.",
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-132-18",
    "position_title": "Legislative Assistant",
    "office": "California Congressman and Member on the Education and Workforce Committee",
    "location": "Capitol Hill",
    "posting_date": "2018-05-14",
    "description": "California Congressman and Member on the Education and Workforce Committee seeks Legislative Assistant to handle education policy along with a diverse portfolio of issues. Candidates should have excellent research, writing, and communication skills. Successful candidates should possess strong interpersonal skills and a willingness to work in a team environment. This is not an entry level position and prior legislative experience on Capitol Hill is preferred. Office is an equal opportunity employer.",
    "responsibilities": [
      "Identifying and advancing policy proposals",
      "Committee hearing and mark-up preparation",
      "Meetings with stakeholders",
      "Assisting with constituent correspondence"
    ],
    "qualifications": [
      "Excellent research, writing, and communication skills",
      "Strong interpersonal skills",
      "Willingness to work in a team environment",
      "Prior legislative experience on Capitol Hill is preferred"
    ],
    "how_to_apply": "Qualified candidates should send resume, cover letter, and one writing sample to CADemocratResumes@gmail.com.",
    "salary_info": null,
    "contact": "CADemocratResumes@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer."
  },
  {
    "id": "MEM-131-18",
    "position_title": "Communications Director",
    "office": "Congresswoman Debbie Dingell, MI-12",
    "location": "Washington, DC",
    "posting_date": "2018-05-14",
    "description": "Congresswoman Debbie Dingell, MI-12, is seeking an experienced and proactive Communications Director to lead media and outreach efforts in her Washington, DC office. The Communications Director will oversee the planning and implementation of overall media strategy and manage the dayto-day communications operation.",
    "responsibilities": [
      "working with local and national reporters",
      "proactively engaging in media outreach",
      "managing online communications",
      "writing press releases, speeches and op-eds",
      "work collaboratively with legislative and district staff and closely with the Member",
      "must possess strong written and oral communications skills and the ability to work effectively in a fast-paced setting"
    ],
    "qualifications": [
      "a minimum of two years of communications experience as a press secretary or communications director is required"
    ],
    "how_to_apply": "Qualified candidates may send their resume, cover letter and two writing samples to MI12.CommsDirector@mail.house.gov. Applications must be received by COB on Friday, May 4.",
    "salary_info": null,
    "contact": "MI12.CommsDirector@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-130-18",
    "position_title": "Legislative Assistant, or Senior Legislative Assistant",
    "office": "Senior Democrat",
    "location": null,
    "posting_date": "2018-05-14",
    "description": "Senior Democrat seeks Legislative Assistant, or Senior Legislative Assistant depending on qualifications, to handle work on the Financial Services Committee and other issues. Candidates should have substantial experience with financial services issues and substantial Congressional experience. The successful applicant will possess strong writing and oral communication skills, work well with others, be comfortable in a fast-paced environment, and understand the legislative process.",
    "responsibilities": [],
    "qualifications": [
      "Substantial experience with financial services issues",
      "Substantial Congressional experience",
      "Strong writing and oral communication skills",
      "Ability to work well with others",
      "Comfortable in a fast-paced environment",
      "Understand the legislative process"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter, resume, and three writing samples to financeservicesla@gmail.com. No phone calls or drop-ins please.",
    "salary_info": null,
    "contact": "financeservicesla@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-129-18",
    "position_title": "Staff Assistant",
    "office": "Long Island House Democrat",
    "location": "Washington, DC",
    "posting_date": "2018-05-14",
    "description": "Duties will include managing front office operations, acting as tour coordinator, managing internship program, special event & meeting coordination, managing tracking systems for legislative and correspondence, and acting as the office's technological point person.",
    "responsibilities": [
      "Managing front office operations",
      "Acting as tour coordinator",
      "Managing internship program",
      "Special event & meeting coordination",
      "Managing tracking systems for legislative and correspondence",
      "Acting as the office's technological point person"
    ],
    "qualifications": [
      "Excellent communication skills",
      "Ability to work well under pressure in a fast-paced environment",
      "Team player",
      "Multi-tasking abilities",
      "Enthusiasm",
      "Good sense of humor",
      "Keen attention to detail"
    ],
    "how_to_apply": "Please send resume and cover letter to NY03.resumes@gmail.com.",
    "salary_info": null,
    "contact": "NY03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-128-18",
    "position_title": "Legislative Director",
    "office": "Senior Democratic House member and Committee Ranking Member",
    "location": "Capitol Hill",
    "posting_date": "2018-05-14",
    "description": "Primary responsibilities include developing policy and legislative initiatives and advising Member on all legislative issues. Position will manage long-term and short-term legislative planning; monitor legislative activity on the House floor; supervise all legislative staff in the personal office; ensure effective coordination between the personal office and committee office; and assist with hearing preparation as needed. The successful candidate will be a results-oriented problem solver with experience supervising staff and a proven track record of developing and advancing legislation. Excellent oral and written communication skills, timemanagement skills, and the ability to quickly analyze and summarize complex legislative details are essential. Graduate degree and extensive experience on Capitol Hill are required.",
    "responsibilities": [
      "Developing policy and legislative initiatives",
      "Advising Member on all legislative issues",
      "Manage long-term and short-term legislative planning",
      "Monitor legislative activity on the House floor",
      "Supervise all legislative staff in the personal office",
      "Ensure effective coordination between the personal office and committee office",
      "Assist with hearing preparation as needed"
    ],
    "qualifications": [
      "Results-oriented problem solver",
      "Experience supervising staff",
      "Proven track record of developing and advancing legislation",
      "Excellent oral and written communication skills",
      "Time-management skills",
      "Ability to quickly analyze and summarize complex legislative details are essential",
      "Graduate degree and extensive experience on Capitol Hill are required"
    ],
    "how_to_apply": "To apply, please e-mail a cover letter and resume with the words “Legislative Director” in the subject line to job_09@live.com. Please paste the cover letter and resume directly in the body of the email.",
    "salary_info": null,
    "contact": "job_09@live.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-124-18",
    "position_title": "Staff Assistant",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2018-05-14",
    "description": "The Committee on Ethics has an opening for a Staff Assistant. Duties include: answering telephones; assisting with the tracking and processing of committee correspondence; providing administrative support in setting up committee meetings; and entering data and navigating databases with accuracy. This is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [
      "Answering telephones",
      "Assisting with the tracking and processing of committee correspondence",
      "Providing administrative support in setting up committee meetings",
      "Entering data and navigating databases with accuracy"
    ],
    "qualifications": [
      "Excellent organizational skills and a professional telephone manner",
      "Good computer skills",
      "Proficiency in Microsoft Word and Excel",
      "Ability to work cooperatively and courteously with others",
      "Ability to use good judgment in responding to inquiries and requests",
      "Flexibility in assisting with daily tasks and projects"
    ],
    "how_to_apply": "Please email cover letter and resume with “Staff Assistant” in the subject line to ethicsjobs@mail.house.gov.",
    "salary_info": "$30,000 per year",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  }
]