[
  {
    "id": "MEM-632-23",
    "position_title": "Staff Assistant",
    "office": "U.S. Representative Steven Horsford",
    "location": "Nevada",
    "posting_date": "2023-12-18",
    "description": "The Office of U.S. Representative Steven Horsford is currently seeking a highly motivated and organized individual to join our team as a Staff Assistant. Our office is dedicated to serving the constituents of Nevada and ensuring their voices are heard in the U.S. House of Representatives. This is an excellent opportunity for individuals passionate about public service and eager to contribute to the legislative process.",
    "responsibilities": [
      "Constituent Services:",
      "Receive, catalog, and respond to constituent letters, emails, and other forms of communication.",
      "Assist constituents with various issues, inquiries, and requests.",
      "Manage and respond to constituent correspondence, emails, and phone calls.",
      "Office Administration:",
      "Greets constituents, visitors, and other VIPs to provide a welcoming environment and positive first impression of the office",
      "Handles incoming calls and captures constituent requests to ensure consideration by Member office",
      "Manage the process of constituent mail",
      "Provide administrative support, including managing the legislative office's calendar and appointments.",
      "Maintain organized records of constituent communications and related materials.",
      "Assist in scheduling meetings and events for the legislative team.",
      "Signs for deliveries and forwards all materials delivered to ensure timely and appropriate handling",
      "Maintains literature regarding the district and House offices to distribute to visitors",
      "Legislative Support:",
      "Conduct research on legislative issues and policy matters.",
      "Draft correspondence, memos, and other written materials.",
      "Assist legislative staff with bill tracking and analysis.",
      "Conduct Tours:",
      "Facilitate tours of the U.S. Capitol for constituents and visitors."
    ],
    "qualifications": [
      "Bachelor's degree in a relevant field or equivalent work experience.",
      "Strong written and verbal communication skills.",
      "Excellent organizational and multitasking abilities.",
      "Proficiency in Microsoft Office Suite and other relevant software.",
      "Ability to work collaboratively in a fast-paced environment.",
      "Previous experience in a legislative office or related field is a plus."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and two writing samples (no longer than one page) and three professional references to NV04Resume@mail.house.gov. Please use “Staff Assistant Resume - [Your Last Name, First name]” in the subject line. The deadline for resumes until filled. All submissions must be in a single PDF file.",
    "salary_info": null,
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "U.S. Representative Steven Horsford is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status."
  },
  {
    "id": "MEM-631-23",
    "position_title": "Legislative Correspondent/Legislative Aide",
    "office": "Congresswoman Lois Frankel (FL-22)",
    "location": "Washington, D.C.",
    "posting_date": "2023-12-18",
    "description": "Congresswoman Lois Frankel (FL-22), Member of the House Appropriations Committee, Chairwoman of the Democratic Women’s Caucus, and Co-Chair of the Women, Peace, and Security Caucus, is hiring a legislative correspondent/legislative aide to assist in drafting letters to respond to constituent messages, take meetings with constituents, and assist the legislative team with other projects as needed, with opportunities to develop a legislative portfolio.\n\nApplicants must be comfortable working in a fast-paced and team-oriented environment. Excellent writing skills and attention to detail are required. Previous experience with the Hill is strongly preferred. This is not an entry level position, and individuals with internship-only experience will not be considered.",
    "responsibilities": [
      "Drafting letters to respond to constituent messages",
      "Taking meetings with constituents",
      "Assisting the legislative team with other projects as needed",
      "Develop a legislative portfolio (opportunities for)"
    ],
    "qualifications": [
      "Comfortable working in a fast-paced and team-oriented environment",
      "Excellent writing skills",
      "Attention to detail",
      "Previous experience with the Hill is strongly preferred",
      "This is not an entry level position, and individuals with internship-only experience will not be considered."
    ],
    "how_to_apply": "Please visit tinyurl.com/FL22LC and fill out the Google Form to apply. Applications will be reviewed on a rolling basis and the final deadline to apply is January 7, 2024.",
    "salary_info": "$55,000-$65,000 depending on experience, with additional benefits including health insurance and student loan payments.",
    "contact": null,
    "equal_opportunity": "Women, people of color, LGBTQ+ people, and members of other minority or marginalized groups are strongly encouraged to apply. We are an equal opportunity employer and do not discriminate against candidates on the basis of race, ethnicity, religion, sex, gender, sexual orientation, gender identity, disability status, or veteran status."
  },
  {
    "id": "MEM-630-23",
    "position_title": "Communications Director",
    "office": "Representative Josh Gottheimer",
    "location": "Washington, DC",
    "posting_date": "2023-12-18",
    "description": "Representative Josh Gottheimer seeks an experienced Communications Director for their Washington, DC office.",
    "responsibilities": [
      "Developing and implementing an aggressive media and communications strategy;",
      "Serving as the on-the-record spokesperson and primary media liaison for the Member;",
      "Proactively seeking local and national interviews with radio, print, television, and new media outlets;",
      "Maintaining good, working relationships with members of the press corps;",
      "Overseeing the implementation of a multi-faceted Franked communications program with a large budget;",
      "Drafting talking points, speeches, press releases, media advisories, op-eds, and statements for the Member;",
      "Organizing, coordinating, and staffing events with the media;",
      "Managing all members of the Communications team;",
      "Managing the process for the updates to social media platforms and the office website;",
      "Managing the organization and distribution of the daily news clips for the Member and office staff;",
      "Working closely with the District Office to ensure coverage of local priorities;",
      "And working closely with the legislative team to ensure coverage of the Member’s policy priorities."
    ],
    "qualifications": [
      "A Bachelor’s degree or related job experience;",
      "3-5 years of communications experience in a Congressional office, on a political campaign, or in another fast-paced environment;",
      "Excellent attention to detail;",
      "Sound judgment;",
      "Strong communication skills;",
      "Capacity to communicate with a wide variety of personalities in a tactful, courteous, and professional manner;",
      "Willingness to accept direction and guidance on performance and process improvements form the Chief of Staff and Member;",
      "The ability to anticipate challenges and proactively offer solutions;",
      "The ability to thrive in a fast-paced environment;",
      "And the ability to work flexible hours including long hours, nights, and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a resume and cover letter with “Communications Director” as the subject line to NJ5Jobs@mail.house.gov",
    "salary_info": null,
    "contact": "NJ5Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-629-23",
    "position_title": "Scheduler",
    "office": "Congressman Raul Ruiz (CA-25)",
    "location": "Washington, DC",
    "posting_date": "2023-12-18",
    "description": "The Office of Congressman Raul Ruiz (CA-25) seeks an experienced Scheduler to be based in his Washington, DC office. This is not an entry-level position. Candidates must have exceptional organizational skills, meticulous attention to detail, the ability to prioritize and manage multiple tasks under tight deadlines, and the ability to work under pressure in a fast-paced environment.\n\nThe Scheduler maintains the Member’s daily and long-term schedule, coordinates all official travel, and acts as a liaison for the Member with other congressional offices, constituents, and distinguished guests including executives from the public, private, and nonprofit sectors.",
    "responsibilities": [
      "Receives, organizes, and responds to all incoming scheduling requests with diligence",
      "Briefs the Member on all scheduling activities of the Washington, DC, and district offices on a daily basis",
      "Collects all relevant logistical and background information for all items on the schedule",
      "Works with the Member, Chief of Staff and District Director to determine and finalize the Member’s daily schedule and daily briefing materials",
      "Updates the Member and relevant staff of any scheduling changes throughout the day",
      "Monitors and tracks the Member’s incoming telephone calls, manages messages, and returns calls as requested",
      "Coordinates official travel arrangements and staffing of the Member",
      "Collects receipts for travel and office related expenses, and works with financial administrator to reconcile and submit credit cards accounts and member reimbursements",
      "Reports directly to the Chief of Staff"
    ],
    "qualifications": [
      "The ideal candidate will have congressional work experience and prior scheduling or office management experience, bilingual candidates preferred.",
      "District or California ties are a plus."
    ],
    "how_to_apply": "To apply, please send a cover letter and resume to ca25resumes@mail.house.gov. with “Scheduler: [Your Name]” as the subject line. Deadline to apply is December 26, 2023.",
    "salary_info": "The salary range for this position is $55,000 - $65,000 per year, depending on experience, and the position is eligible for transit benefits and student loan repayment assistance.",
    "contact": "ca25resumes@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply."
  },
  {
    "id": "MEM-628-23",
    "position_title": "Health Policy Director",
    "office": "Office of Congresswoman Diana DeGette (CO-01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-12-18",
    "description": "The Office of Congresswoman Diana DeGette (CO-01) is seeking a hardworking, motivated, and experienced Health Policy Director to assist with the health portfolio related to the Member’s work on the House Committee on Energy & Commerce.\n\nThe primary responsibilities for this position will be leading the Member’s existing health initiatives, identifying new areas for legislative action, and coordinating with relevant Energy & Commerce committee staff, other Member offices, and outside stakeholders. Additional duties may be assigned based on experience and office needs.\n\nThis is NOT an entry level position: 2+ years’ experience working on health policy is required, and previous experience working in advocacy and organizing is preferred. The ideal candidate is organized, detail-oriented and resilient in the face of a fast-paced and ever-changing environment. The ideal candidate is also proactive and comfortable working with diverse staff, community members and constituents. Colorado ties or western state connections are a plus. Advanced degree is preferred.",
    "responsibilities": [
      "Leading the Member’s existing health initiatives",
      "Identifying new areas for legislative action",
      "Coordinating with relevant Energy & Commerce committee staff, other Member offices, and outside stakeholders",
      "Additional duties may be assigned based on experience and office needs."
    ],
    "qualifications": [
      "2+ years’ experience working on health policy is required",
      "Previous experience working in advocacy and organizing is preferred",
      "Organized, detail-oriented and resilient in the face of a fast-paced and ever-changing environment",
      "Proactive and comfortable working with diverse staff, community members and constituents",
      "Colorado ties or western state connections are a plus",
      "Advanced degree is preferred"
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to DeGette.Employment@mail.house.gov by Wednesday, January 3, 2024.",
    "salary_info": "$80,000 - $90,000 per year",
    "contact": "DeGette.Employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-627-23",
    "position_title": "Energy and Environment Legislative Assistant/Policy Director",
    "office": "Office of Congresswoman Diana DeGette (CO-01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-12-18",
    "description": "The Office of Congresswoman Diana DeGette (CO-01) is seeking a hardworking, motivated, and experienced Energy and Environment Legislative Assistant/Policy Director to assist with the energy and environment portfolio related to the Member’s work on the House Committee on Energy & Commerce, particularly in her role as Ranking Member on the Energy & Climate subcommittee.\n\nAdditional duties may be assigned based on experience and office needs.\n\nThis is NOT an entry level position: 2+ years’ experience working on energy and environmental issues is required, and previous experience working in advocacy and organizing is preferred. The ideal candidate is organized, detail-oriented and resilient in the face of a fast-paced and ever-changing environment. The ideal candidate is also proactive and comfortable working with diverse staff, community members and constituents. Colorado ties or western state connections are a plus. Advanced degree is preferred.",
    "responsibilities": [
      "Leading the Member’s existing energy and environment initiatives",
      "Identifying new areas for legislative action",
      "Coordinating with Member’s subcommittee staff, other Member offices, and outside stakeholders"
    ],
    "qualifications": [
      "2+ years’ experience working on energy and environmental issues is required",
      "Previous experience working in advocacy and organizing is preferred",
      "Organized and detail-oriented",
      "Resilient in the face of a fast-paced and ever-changing environment",
      "Proactive and comfortable working with diverse staff, community members and constituents",
      "Colorado ties or western state connections are a plus",
      "Advanced degree is preferred"
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to DeGette.Employment@mail.house.gov by Wednesday, January 3, 2024.",
    "salary_info": "$80,000 - $90,000 per year",
    "contact": "DeGette.Employment@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-623-23",
    "position_title": "Digital Director",
    "office": "Congressman Juan Ciscomani (AZ-06)",
    "location": "Capitol Hill",
    "posting_date": "2023-12-18",
    "description": "This person will work with the Communications Director to manage the congressman’s rapid response and digital presence, including but not limited to social media, graphics, video filming and editing, newsletter creation, website management and digital ads. Graphic design and video skills are required.\nThe office is looking for a creative self-starter who can jump quickly in a fastpaced environment. Ideal candidates have 2 or more years of experience, with at least 1 year of experience on Capitol Hill.",
    "responsibilities": [
      "Manage the congressman’s rapid response and digital presence",
      "Social media management",
      "Graphics creation",
      "Video filming and editing",
      "Newsletter creation",
      "Website management",
      "Digital ads"
    ],
    "qualifications": [
      "Graphic design and video skills are required",
      "Creative self-starter",
      "Ability to jump quickly in a fast-paced environment",
      "2 or more years of experience",
      "At least 1 year of experience on Capitol Hill"
    ],
    "how_to_apply": "Applicants should send their resume and 3-5 portfolio samples to paige.lindgren@mail.house.gov",
    "salary_info": null,
    "contact": "paige.lindgren@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-622-23",
    "position_title": "Health Legislative Assistant",
    "office": "Office of Congressman Steven Horsford",
    "location": "4th District of Nevada",
    "posting_date": "2023-12-18",
    "description": "The Office of Congressman Steven Horsford representing the 4th District of Nevada, is seeking a dynamic and dedicated individual to serve as a Health Legislative Assistant. The successful candidate will play a pivotal role in developing and executing legislative initiatives focused on health care, seniors, social security, and immigration, contributing to impactful policy changes that directly impact the constituents of the 4th District.",
    "responsibilities": [
      "Legislative Initiatives: Develop and execute legislative initiatives within the assigned portfolio, concentrating on health care, seniors, social security, and immigration. Monitor legislative developments on the House floor and committees, staying informed on relevant issues.",
      "Building Support: Gather support for bills or amendments from other Members and relevant interest groups, fostering collaboration and consensus-building.",
      "Vote Recommendations: Provide informed vote recommendations based on thorough analysis and understanding of the legislative landscape.",
      "Policy Drafting: Draft, develop, and negotiate legislative text with the respective committee, ensuring alignment with the Congressman's objectives.",
      "Committee Preparedness: Staff and prepare the Congressman for committee briefings, hearings, and markups related to the assigned portfolio.",
      "Research and Analysis: Conduct research using various tools to acquire, analyze, and interpret data. Present findings to the Congressman, Senior Management, and other stakeholders on issues impacting Congressional District 4."
    ],
    "qualifications": [
      "Strong interpersonal skills with the ability to communicate effectively with diverse communities.",
      "Ability to navigate challenging conversations among diverse groups and build consensus.",
      "Commitment to public service, strong work ethic, and the ability to perform under pressure.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "Interested candidates should submit a cover letter,\nresume, two writing samples (no longer than two pages), and three professional\nreferences to NV04Resume@mail.house.gov with \"Legislative Assistant, [Last\nName, First Name]\" in the subject line. All submissions must be in a single PDF\nfile.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "NV04Resume@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-619-23",
    "position_title": "SCHEDULER",
    "office": "Congressman Mark Pocan (WI-02), member of the House Appropriations Committee",
    "location": "Washington, DC",
    "posting_date": "2023-12-18",
    "description": "Congressman Mark Pocan (WI-02), member of the House Appropriations Committee, is seeking a highly motivated, detail-orientated, and energetic individual with excellent oral and written communications skills for a scheduler position in the Washington, DC office.\n\nDaily tasks include managing and maintaining the Member’s daily and long-term DC, state and national schedule; coordinating travel, booking flight reservations, and managing logistics for events; evaluating and organizing all incoming meeting and event requests; communicating key information regarding the Member and the Member’s schedule to staff; and working closely with both DC and District staff to ensure smooth daily office operations. Candidates must be available to assist the member outside of regular business hours.\n\nThis position requires candidates with proven experience in administrative roles, knowledge of the Congressional work setting, and comfort working one-on-one with the Member, Chief of Staff and District Director. Excellent writing, verbal and strong organizational skills are essential along with the ability to be a selfstarter while working in a fast paced environment. A sense of humor is greatly appreciated. Previous Capitol Hill or scheduling experience is required; this is not an entry level position and title could also include “Director of Scheduling” if candidate has previous experience in that area.",
    "responsibilities": [
      "Managing and maintaining the Member’s daily and long-term DC, state and national schedule",
      "Coordinating travel, booking flight reservations, and managing logistics for events",
      "Evaluating and organizing all incoming meeting and event requests",
      "Communicating key information regarding the Member and the Member’s schedule to staff",
      "Working closely with both DC and District staff to ensure smooth daily office operations"
    ],
    "qualifications": [
      "Proven experience in administrative roles",
      "Knowledge of the Congressional work setting",
      "Comfort working one-on-one with the Member, Chief of Staff and District Director",
      "Excellent writing, verbal and strong organizational skills",
      "Ability to be a self-starter while working in a fast paced environment",
      "Previous Capitol Hill or scheduling experience is required"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and one writing sample to WI02JobOpening@gmail.com with “Scheduler” in the Subject Line.",
    "salary_info": null,
    "contact": "WI02JobOpening@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation."
  },
  {
    "id": "MEM-614-23",
    "position_title": "Legislative Director",
    "office": "Congressman Gabe Amo (RI-01)",
    "location": "Washington, D.C.",
    "posting_date": "2023-12-18",
    "description": "The Legislative Director will oversee the office’s policy agenda in close collaboration with the Member, Chief of Staff, and communications and district staff. The Legislative Director will be responsible for managing the legislative team, a legislative portfolio, formulating legislative strategies, and other duties as assigned.",
    "responsibilities": [
      "Oversee the office’s policy agenda",
      "Manage the legislative team",
      "Manage a legislative portfolio",
      "Formulate legislative strategies",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Strong track record of managing, training, and supervising a team in a fast-paced environment.",
      "Experience developing strong relationships with stakeholders, making policy recommendations",
      "Firm grasp of committee, floor, and other House procedures.",
      "Strong verbal and written communication skills.",
      "Driven, creative, and committed to furthering a collaborative work environment.",
      "Rhode Island ties are a plus."
    ],
    "how_to_apply": "To apply, send in a single PDF with a resume, cover letter, and brief writing sample, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to RI01AmoJobs@gmail.com, with the following subject line: “Full Name – Legislative Director.”",
    "salary_info": null,
    "contact": "RI01AmoJobs@gmail.com",
    "equal_opportunity": "The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-612-23",
    "position_title": "Press Assistant",
    "office": "House Committee on Oversight and Accountability, Democratic Staff",
    "location": null,
    "posting_date": "2023-12-18",
    "description": "House Oversight and Accountability Committee Democrats, under the leadership of Ranking Member Jamie Raskin, seek a diligent and creative press assistant to join our office. The press assistant will work closely with the communications director, press secretary, and digital director and play a key role in executing the office’s communications priorities.",
    "responsibilities": [
      "Compiling daily clips and monitoring breaking news across media",
      "Drafting messaging materials, such as: social content, talking points, and press releases",
      "Managing press lists",
      "Conducting research",
      "Assisting the press office with logistical and administrative support, such as coordinating events",
      "Generating and implementing new ideas to advance our message",
      "Other duties as assigned"
    ],
    "qualifications": [
      "Qualified candidates should have professional experience in communications or journalism and Capitol Hill experience.",
      "Ideal candidates will be competent writers, detail-oriented, self-sufficient, collaborative, and able to produce highquality work under tight deadlines and while multitasking.",
      "Familiarity with graphic design and video production software (e.g. Canva, Adobe Suite), Cision, and TV Eyes is preferred but not required."
    ],
    "how_to_apply": "To apply, please email oversightpress@mail.house.gov with the subject line “Last Name.First Name—COA Press Assistant.” Please submit the following materials attached in one pdf: cover letter, resume, and short writing sample.",
    "salary_info": null,
    "contact": "oversightpress@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-611-23",
    "position_title": "Communications Director",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Washington, D.C. and District",
    "posting_date": "2023-12-18",
    "description": "Congresswoman Susie Lee (NV-03) seeks an experienced Communications Director to lead and execute an aggressive and innovative communications strategy for a battleground district. In close collaboration with the Member, Chief of Staff, and legislative and district teams, the Communications Director will oversee the Member’s communications agenda and manage a fast-paced communications team in the district and D.C. This position reports to the Chief of Staff and is not an entry level position.\n\nThe Communications Director will also oversee franked communications and a robust 499 program.",
    "responsibilities": [
      "Maintaining relationships with both national and local reporters, organizing and replying to inquiries, and proactively pitching stories",
      "Drafting and editing press releases",
      "Developing media strategies to roll out legislative wins",
      "Spearheading communications components of district outreach and events",
      "Running an aggressive and responsive social media program",
      "Writing op-eds, talking points, newsletters, mailers, letters, and speeches",
      "Managing and coaching the communications team",
      "Working collaboratively with District Office and legislative staff to amplify the office’s work"
    ],
    "qualifications": [
      "3-5 years of political communications experience",
      "A strong history of drafting all forms of communications materials",
      "Sharp attention to detail",
      "Experience managing a team",
      "A track record of successfully pitching national and local media outlets",
      "Prior experience managing franked communications is a plus",
      "Experience in digital media, including social media and graphic/video design is a plus",
      "The ideal candidate is collaborative, creative, energetic, detail-oriented, able to multi-task, politically astute, and willing to work long hours in a fast-paced and demanding setting",
      "Nevada ties are a plus",
      "Prior Hill experience is preferred"
    ],
    "how_to_apply": "To apply, send in a single PDF a resume, cover letter, writing sample of 1,000 words or fewer, and three references (including name, current title and organization, phone number, email, and relationship to the reference) to nv03resumes@gmail.com, with the following subject line: “Full Name – Communications Director.”",
    "salary_info": null,
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-546-23",
    "position_title": "Member Services Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": null,
    "posting_date": "2023-12-18",
    "description": "The Congressional Black Caucus (CBC) seeks a Member Services Director who is exceptionally motivated, dynamic, strategic, and detail-oriented to engage with CBC Member offices and outside partners to advance a robust member services portfolio.\n\nThe Member Services Director will be expected to proactively build strong relationships across CBC Member offices and develop strategic opportunities for Member engagement advancing shared priorities. The individual will also be expected to coordinate with CBC staff to field and respond to inquiries and requests for support from Member offices and respond to and share external opportunities for Member engagement as they arise.\n\nThe Member Services Director is also responsible for assisting in overseeing all aspects of caucus operations, logistics, designated administrative responsibilities and to support caucus leadership.",
    "responsibilities": [
      "Conducting regular outreach to Member offices to build relationships with staff, share opportunities for Member or staff participation in events, messaging, and other efforts, and identify new ideas for collaboration with Member offices",
      "Sharing resources with Member offices and working with CBC, congressional, and external staff to develop high-quality materials for Member office use",
      "Drafting regular newsletters for Member offices with relevant updates and opportunities, as well as for external audiences to uplift Member engagement on CBC issues",
      "Developing a network of external partners working on issues relevant to the CBC and Member offices",
      "Maintaining staff contact information and distribution lists",
      "Provides orientation and training for new staff",
      "Assists departing employees with necessary administrative procedures (i.e., returning keys, House I.D. cards, and other office property; obtaining forwarding addresses, work files, and records)",
      "Supervises the mail operations and the administrative files and personnel records",
      "Assists staff in scheduling House or Capitol rooms for outside group functions",
      "Organize and facilitate meetings and other strategic convenings to support institutional",
      "change, policies, and programmatic work",
      "Oversees operations for CBC including organizing weekly meetings and events",
      "Provides logistical support for all programming",
      "Works with the CBC personal office staffs and coordinates with the CBC Schedulers to implement the Caucus’ priorities",
      "Builds and maintains databases of internal and external stakeholders"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "Candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume to vincent.evans@mail.house.gov.\nNo walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-508-23",
    "position_title": "Press Secretary/Digital Director (PS/DD)",
    "office": "Congresswoman Shontel Brown (OH-11)",
    "location": "Washington, DC",
    "posting_date": "2023-12-18",
    "description": "Working with the Communications Director, located in the District, the PS/DD will develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence. Other primary responsibilities include but are not limited to developing, editing, and producing graphics, videography, and other creative tools to enhance messaging; fielding press requests from local and national media; producing the Member’s newsletters; drafting releases and advisories, speeches , and talking points.\n\nThe successful candidate will have a creative and strategic approach to visual and graphic design, excellent oral and written communications skills, an ability to handle multiple assignments on tight deadlines, a desire to hone the Member’s voice, a strong collaborative approach to cross functional teaming, and a good sense of humor. They will also have a working knowledge of the legislative process, procedures, and organization of the House, with a proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately. Ohio ties are a plus, but not required, but proven effective digital and videography experience is required.\n\nThis is not an entry level position. The ideal candidate will have at least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level.",
    "responsibilities": [
      "Develop, coordinate, and implement digital and traditional media and communication strategies that highlight the Member’s work and advance her robust online/digital presence.",
      "Developing, editing, and producing graphics, videography, and other creative tools to enhance messaging.",
      "Fielding press requests from local and national media.",
      "Producing the Member’s newsletters.",
      "Drafting releases and advisories, speeches , and talking points."
    ],
    "qualifications": [
      "A creative and strategic approach to visual and graphic design.",
      "Excellent oral and written communications skills.",
      "An ability to handle multiple assignments on tight deadlines.",
      "A desire to hone the Member’s voice.",
      "A strong collaborative approach to cross functional teaming.",
      "A good sense of humor.",
      "A working knowledge of the legislative process, procedures, and organization of the House.",
      "A proven ability to build strong, collaborative relationships while working in a crisis-oriented environment and handling stress appropriately.",
      "Proven effective digital and videography experience is required.",
      "At least three years of Hill and/or other communications experience in a policy or constituent services environment with an emphasis on professional digital media, videography, and general communications proficiency beyond the intern level."
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume, two writing and one creative samples to Ohio11Resumes@mail.house.gov with the subject line “Press Secretary – Last Name, First Initial.” No drop-ins, direct emails to staff or phone calls, please. The position is open until filled, but applications will be screened as they are received.",
    "salary_info": "The salary is flexible and dependent upon proven experience and expertise.",
    "contact": "Ohio11Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-468-23",
    "position_title": "Investigative Counsel",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2023-12-18",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks one attorney with 5-10 years of experience to serve as Investigative Counsel.\n\nThe Investigative Counsel reports to the Staff Director and Chief Counsel and will be responsible for conducting sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives and advising the Staff Director and Chief Counsel on legal and policy matters.\n\nThe OCE is seeking attorneys interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Counsel would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Review information received by OCE, discern possible violations, and identify facts requiring further investigation",
      "Plan, organize and conduct investigations regarding allegations and advise the Staff Director and Chief Counsel regarding appropriate evaluation of cases",
      "Advise the Staff Director and Chief Counsel on legal issues in matters under investigation and on broader legal and policy issues involved in the operations of OCE",
      "Draft lengthy and detailed memoranda, reports, and referrals for Board consideration and potential public release",
      "Developing investigative strategies and implementing investigative plans",
      "Reviewing evidence and data in order to analyze, develop, and provide detailed written and oral reports of findings",
      "Identifying information to substantiate or disprove allegations and assess the likely sources of that information",
      "Collecting and reviewing documents, electronic media, and physical evidence",
      "Interviewing witnesses and subjects",
      "Performing other duties as assigned"
    ],
    "qualifications": [
      "Demonstrated ability to conduct and direct complex legal research and present the results in a clear, precise and persuasive manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Strong legal judgment and demonstrated professional integrity",
      "Experience auditing large sets of data or evidence and providing detailed analysis",
      "Desirable but not required:\n*Investigative experience with high-profile and sensitive matters;\n*Experience with investigations involving public officials;\n*Experience with campaign finance or ethics law;\n*Experience conducting interviews or depositions;\n*Experience writing public reports or legal documents; and\n*Advanced proficiency in development and use of electronic databases, and other computer skills including knowledge of current information technology tools related to investigations",
      "Ability to:\n*work independently or as part of an investigative team;\n*manage multiple tasks and projects;\n*work well under pressure and tight time deadlines; and\n*exercise discretion and independent judgment"
    ],
    "how_to_apply": "Please send cover letter, short writing sample, and resume (electronic submissions preferred) to:",
    "salary_info": null,
    "contact": "Omar S. Ashmawy\nStaff Director and Chief Counsel\nOffice of Congressional Ethics\nUnited States House of Representatives\nP.O. Box 895\nWashington, DC 20515-0895\nOCEJOB@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), the Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2023-12-18",
    "description": "The Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-354-23",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": "Capitol Hill",
    "posting_date": "2023-12-18",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public. The Policy Director’s responsibilities will include:",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  }
]