[
  {
    "id": "MEM-498-23",
    "position_title": "Outreach and Grants Coordinator",
    "office": "Congresswoman Hillary Scholten",
    "location": "Grand Rapids, Michigan",
    "posting_date": "2023-10-02",
    "description": "Congresswoman Hillary Scholten seeks an enthusiastic, highly organized, creative, and self-motivated professional to serve as Outreach and Grants Coordinator in her Grand Rapids, Michigan office.\n\nThe Outreach and Grants Coordinator will develop and implement, with the District Director, a long-term strategic community engagement plan that prioritizes assisting the community in accessing available grants and resources. This position will include intentional and targeted outreach aimed at learning about community needs and stakeholder projects that could be eligible for federal grants. This individual will work to disseminate information regarding available federal grants, assist interested grant applicants in navigating the federal grant process and track awards to Michigan's 3rd Congressional District.",
    "responsibilities": [
      "Develop an active outreach campaign to include meetings with community leaders, attending community gatherings and creating community events;",
      "Develop and maintain accurate and up-to-date database of community contacts",
      "Create, develop, and promote grant and community workshops for key community stakeholders to learn about the grant support the Member's office can provide to the community;",
      "Develop, distribute and maintain monthly grant updates to flag grant opportunities, highlight key deadlines, promote grants work, and elevate key successes within the community;",
      "Act as a liaison to community stakeholders and other persons or groups interested in federal funding opportunities to form effective relationships for the Member;",
      "Staff the Member at scheduled district meetings with constituents and other key stakeholders;",
      "Attend district events as a representative of the Member;",
      "Prepare periodic reports for the Member and other team members",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Strong oral and written communication skills in English;",
      "Strong presentation skills in English;",
      "Ability to connect community priorities to the Member's legislative and committee work;",
      "Knowledge of all issues and events in the district in which the Member is involved;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner;",
      "Proficiency in word processing;",
      "Ability to work well under pressure and able to manage stress effectively;",
      "Access to consistent and reliable transportation; and",
      "Ability to work in a flexible schedule periodically including long hours, nights and weekends."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume, and 3 professional references by Thursday October 12, 2023 to scholtenjobs@gmail.com with the subject “Grants and Outreach Coordinator: LAST NAME”.",
    "salary_info": "$65,000-$80,000 (Commensurate with experience)\nThe position is eligible for student loan repayment assistance, and parking. This is an in-person position, with remote work opportunities.",
    "contact": "scholtenjobs@gmail.com",
    "equal_opportunity": "The Office of Congresswoman Hillary Scholten is an Equal Opportunity Employer does not discriminate in employment on the basis of race, color, religion, sex (including pregnancy and gender identity), national origin, political affiliation, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factors. Diverse candidates are encouraged to apply."
  },
  {
    "id": "MEM-497-23",
    "position_title": "Legislative Director",
    "office": "Office of Congresswoman Hillary Scholten",
    "location": null,
    "posting_date": "2023-10-02",
    "description": "On Team Scholten, the Legislative Director plays an essential leadership role in the office, managing the legislative team and overseeing a portfolio of the Congresswoman’s Transportation and Infrastructure Committee, as well as Appropriations, Defense, Foreign Affairs, Energy, and Trade.\n\nThis position reports to the Chief of Staff and works closely with the COS in assisting with the formulation of the Member’s policy and legislative strategy while uplifting the legislative team in their work.\n\nThe ideal candidate for this job has Michigan ties and Hill experience. This is not an entry level position.\n\nThe position is eligible for transit benefits, student loan repayment assistance, and parking. This is an in-person position, with remote work opportunities.",
    "responsibilities": [
      "Partners with the Member and senior staff to develop the Member’s legislative strategy",
      "Ensures that all legislative staff are positioned to support and implement the Member’s legislative strategy, including mentoring newly hired or promoted legislative staff",
      "Leads weekly legislative meeting, ensuring team is prepared to report out their work, committee updates, and votes of the week to the Member",
      "Works with committee staff to advance legislation sponsored by the Member",
      "Builds coalitions with Member offices, committees, caucuses and key external stakeholders to advance the Member’s policy priorities through the legislative process",
      "Drafts legislative memos, talking points, opening statements for committee hearings, and floor speeches for the Member",
      "Meets with VIPs, and executives from private, government, and non-profit sectors to discuss the Member’s legislative priorities and initiatives",
      "Works with the Legislative Counsel’s office to draft bills sponsored by the Member",
      "Maintains knowledge of legislation affecting the district and legislation in which the Member is a principal sponsor or cosponsor",
      "Coordinates with Legislative Correspondence to ensure all legislative mail is addressed",
      "Collaborates with the Chief of Staff and Member to make decisions regarding the hiring of legislative staff",
      "Provides regular updates to congresswoman on pertinent news and legislative update",
      "Trains and supervises legislative staff to ensure that staff comply with office policies, practices, and procedures",
      "Schedules and directs legislative staff meetings to ensure all tasks are handled and assigned"
    ],
    "qualifications": [
      "Michigan ties",
      "Hill experience",
      "Not an entry level position"
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume, and 3 professional references by Tuesday, October 10, 2023 to scholtenjobs@gmail.com with the subject “Legislative Director: LAST NAME”.",
    "salary_info": "$90,000-110,000, commensurate with experience",
    "contact": "scholtenjobs@gmail.com",
    "equal_opportunity": "The Office of Congresswoman Hillary Scholten is an equal opportunity employer and does not discriminate on the basis of race, ethnicity, religion, sex, national origin, age, disability, sexual orientation or gender identity. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-496-23",
    "position_title": "Communications Assistant",
    "office": "The Office of Congressman Rob Wittman (VA01)",
    "location": null,
    "posting_date": "2023-10-02",
    "description": "This position is responsible for developing a proactive constituent communications strategy and plan. Primary responsibilities include: writing weekly email newsletters for targeted constituent coalitions, overseeing website management and updates, branding through graphic design, managing social media, overseeing the telephone town hall program, and maintaining the Member’s photo and video database. They will work with the communications director to find new ways grow the congressman’s following and maintain synergy across communications materials.",
    "responsibilities": [
      "Writing weekly email newsletters for targeted constituent coalitions",
      "Overseeing website management and updates",
      "Branding through graphic design",
      "Managing social media",
      "Overseeing the telephone town hall program",
      "Maintaining the Member’s photo and video database"
    ],
    "qualifications": [
      "A strong candidate will be a creative, proactive communicator familiar with social media, the legislative process, website maintenance, as well as photography, graphic design, and video editing.",
      "Excellent written and oral skills are required.",
      "An ability to multitask and work under tight deadlines is necessary.",
      "Candidates must have previous congressional or political communications experience",
      "Ties to Virginia’s First District are helpful but not required."
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to Julianne.Heberlein@mail.house.gov with “Communications Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Julianne.Heberlein@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-495-23",
    "position_title": "Communications Director",
    "office": "Congresswoman Dina Titus (D-NV-1)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "Congresswoman Dina Titus (D-NV-1) is seeking an experienced Communications Director to lead media efforts in a fast- paced Washington, D.C. office. We are looking for a self-starting professional with a strong background in political communications, media relations, and social media management.\n\nThe ideal candidate will have a deep understanding of both national and local media and be capable of developing and implementing strategic communication and digital plans. This is not an entry-level position, and a successful candidate must have 2-5 years of communications experience in a relevant setting.",
    "responsibilities": [
      "Strategic Communications: Develop and execute strategic communication plans in collaboration with senior staff and the legislative team, ensuring alignment with the Congresswoman's priorities and legislative initiatives.",
      "Media Relations: Cultivate and maintain strong relationships with local and national print, radio, and broadcast media professionals.",
      "Media Outreach: Successfully pitch the Congresswoman to both local and national TV, radio, and print media, positioning her effectively on key issues.",
      "Event Planning: Plan and manage press conferences, tele-townhalls, roundtables, and other events in both Washington, D.C., and the district.",
      "Media Engagement: Prepare, brief, and accompany the Congresswoman for media interviews, press conferences, roundtables, and other public engagements.",
      "Content Creation: Draft talking points, speeches, press releases, op-eds, and other materials in the Congresswoman's voice.",
      "Social Media Management: Manage the Congresswoman's social media presence, including drafting engaging content, clipping interviews, and creating graphics for various platforms.",
      "Website Maintenance: Ensure that the office website features timely and relevant content.",
      "Current Affairs: Stay informed about current news and legislative issues that may impact the Congresswoman's work."
    ],
    "qualifications": [
      "Exceptional Communication Skills: Strong writing, editing, and proofreading skills.",
      "Media Proficiency: Deep understanding of print, broadcast, and online media.",
      "Experience: 2-5 years of experience in developing communication strategy for elected officials, government agencies, non-profit organizations, or similar entities.",
      "Team Player: Expertise in advising others on communication strategy and the ability to work effectively with a team and Member of Congress.",
      "Deadline-Oriented: Capable of producing communications materials under tight deadlines.",
      "Strategic Thinker: Politically savvy and skilled at navigating challenging situations with the press and staff.",
      "Adaptability: Ability to work flexible hours, including long hours, nights, and weekends, as needed.",
      "Constructive Feedback: Willingness to accept performance-based criticism and direction.",
      "Relationship Building: Ability to maintain positive working relationships with the Congresswoman, staff, and media professionals."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, and two writing samples to NV01jobs@gmail.com with \"Application: Rep. Titus Communications Director\" in the subject line.\nApplications will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "NV01jobs@gmail.com",
    "equal_opportunity": "Our office is committed to promoting diversity and inclusivity. We are an equal opportunity employer and do not discriminate on the basis of race, color, religion, national origin or citizenship status, sex, gender identity or expression, pregnancy, sexual orientation, age, disability, or military status."
  },
  {
    "id": "MEM-494-23",
    "position_title": "Communications Staffer",
    "office": "Office of Congresswoman Jennifer McClellan (VA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "The Office of Congresswoman Jennifer McClellan (VA-04) seeks a proactive, creative, and digital-savvy individual to join her D.C.-based communications team. This position reports directly to the Communications Director and will play an integral role in the office’s press and digital operation. Title, responsibilities, and pay for this position are flexible and commensurate with experience.\n\nThe ideal candidate will be creative in how they develop and grow the Member’s digital platforms, be proficient in Adobe Creative Suite, understand social media metrics, graphic design, and video production, be detail-oriented, and possess strong written and verbal communication skills.",
    "responsibilities": [
      "Managing social media pages",
      "Writing compelling social copy",
      "Developing creative graphics, videos, and other digital collateral",
      "Maintaining the Member’s website",
      "Compiling daily press clips",
      "Assisting in the execution of virtual and in-person press events",
      "Supporting the Communications Director in drafting and sending other press materials, including press releases, media advisories, op-eds, and other content"
    ],
    "qualifications": [
      "Prior communications experience required.",
      "Capitol Hill or other political communications experience preferred.",
      "Virginia ties are a plus."
    ],
    "how_to_apply": "To apply please send a resume, cover letter, and writing sample to VA04.Jobs@mail.house.gov.",
    "salary_info": "$60,000-$75,000",
    "contact": "VA04.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, gender identity, sexual orientation, religious affiliation, national origin, age, or military, marital, or parental status. The office prioritizes building a diverse team: women and candidates from BIPOC, LGBTQ+, and other underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-493-23",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Congressman Glenn Ivey (MD-04)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "Congressman Glenn Ivey (MD-04) seeks an affable, driven, and informed student\nof politics and government who possesses strong writing, organizational, and\ntime-management skills to serve as the face and first point-of-contact for the\nWashington, D.C., office.\n\nWorking for this freshman office represents an opportunity to build something\ndynamic and lasting from the ground up, particularly for a Member of Congress\nwho is a great communicator and cares deeply about the well-being and\nprofessional development of his staff. His posts on the Judiciary and Homeland\nSecurity Committees grant him and his staff a role in the most active and pressing\nissues of the day. Every member on staff, including in this role, handles a\nportfolio of issues and meets with advocacy groups.",
    "responsibilities": [
      "Managing the front office and greeting visitors",
      "Overseeing the internship program",
      "Coordinating and processing flag and tour requests",
      "Helping manage the constituent-correspondence program",
      "Providing administrative support for the office",
      "Other tasks as assigned"
    ],
    "qualifications": [
      "Excellent attention to detail",
      "Strong communication skills and work ethic",
      "A good sense of humor",
      "An eagerness to learn and grow within the office",
      "A desire to be part of a highly-collaborative, high-achieving team",
      "Ties to the district, Spanish proficiency, and prior Hill experience are all pluses worth mentioning."
    ],
    "how_to_apply": "Please submit a cover letter; resume, including two-to-three references; and\nwritten sample of any form or substance that best showcases your writing talent.\nIf you are able, please also attach – or have someone send on your behalf – a\nletter or email of recommendation from a congressional staffer. Send these\nmaterials to md04resumes@gmail.com with the subject line: “Full Name – Staff\nAssistant.”",
    "salary_info": "Title and pay will be commensurate with work experience.",
    "contact": "md04resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply, and this office is an\nequal-opportunity employer that does not discriminate on the basis of race, color,\nreligion, sex, sexual orientation, gender identity and expression, national origin,\ndisability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-490-23",
    "position_title": "Scheduler",
    "office": "Office of Congressman Jamie Raskin (MD-08)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "The Office of Congressman Jamie Raskin (MD-08) seeks a Scheduler to work in the Washington, D.C. office in a full-time capacity.\nCandidates must have exceptional organizational and communications skills, scrupulous attention to detail, effective time management, and thrive in a fastpaced team environment.\nThe successful candidate will have knowledge of the congressional work setting, ability to balance competing demands and work well under pressure, and possess sound judgement and a professional and discreet demeanor. The position requires a willingness to work non-traditional hours when required. Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred. Ties to Maryland’s 8th District, humor, and a facility with other languages are a plus.",
    "responsibilities": [
      "developing, coordinating and managing all aspects of the Members's schedule and logistics in D.C. and in the district",
      "tracking, evaluating, and responding to all invitations and scheduling requests",
      "leading scheduling meetings",
      "communicating key information and scheduling changes to the Congressman, staff, and stakeholders in a timely and efficient manner",
      "coordinating with legislative and press staff on events and briefing materials, and coordinating with the district office, committee staff, other Members offices, and with the campaign team on political scheduling requests",
      "assisting the Chief of Staff with office operations",
      "other duties as assigned"
    ],
    "qualifications": [
      "exceptional organizational and communications skills",
      "scrupulous attention to detail",
      "effective time management",
      "thrive in a fast-paced team environment",
      "knowledge of the congressional work setting",
      "ability to balance competing demands and work well under pressure",
      "sound judgement and a professional and discreet demeanor",
      "willingness to work non-traditional hours when required",
      "Capitol Hill or other relevant administrative, operations, or scheduling experience is strongly preferred",
      "Ties to Maryland's 8th District, humor, and a facility with other languages are a plus"
    ],
    "how_to_apply": "To apply, please send an email to MD08.Resumes@mail.house.gov with “Scheduler: Last Name” in the subject line and the following application materials attached as one combined PDF:\n•Cover letter (not to exceed two pages) – please customize your letter to this position\n•Resume\n•Two writing samples\n•Three references – for each reference, please include name, current title/office, phone.",
    "salary_info": null,
    "contact": "MD08.Resumes@mail.house.gov",
    "equal_opportunity": "Candidates from diverse backgrounds and underrepresented communities are strongly encouraged to apply. The U.S. House of Representatives is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, military status, gender identity and expression, marital status, parental status, or sexual orientation, or any other characteristic protected by applicable law, in any of its activities or operations."
  },
  {
    "id": "MEM-489-23",
    "position_title": "Staff Assistant",
    "office": "Midwest Democrat",
    "location": "Washington D.C.",
    "posting_date": "2023-10-02",
    "description": "Primary responsibilities include managing the front office, answering and logging telephone calls, managing constituent requests for flags and tours, assisting with constituent correspondence, recruiting and managing interns, supporting legislative and communications staff, and other administrative duties.\n\nIdeal candidates will be motivated self-starters with excellent oral, written, and interpersonal communication skills, strong organizational skills, demonstrate an ability to think quickly when troubleshooting, and maintain a positive demeanor in a busy environment. Candidate must be able to drive member, though does not need to provide their own vehicle. Capitol Hill or other relevant experience is preferred. Illinois ties are a plus.",
    "responsibilities": [
      "Managing the front office",
      "Answering and logging telephone calls",
      "Managing constituent requests for flags and tours",
      "Assisting with constituent correspondence",
      "Recruiting and managing interns",
      "Supporting legislative and communications staff",
      "Other administrative duties"
    ],
    "qualifications": [
      "Motivated self-starters with excellent oral, written, and interpersonal communication skills",
      "Strong organizational skills",
      "Ability to think quickly when troubleshooting",
      "Maintain a positive demeanor in a busy environment",
      "Ability to drive member, though does not need to provide their own vehicle",
      "Capitol Hill or other relevant experience is preferred",
      "Illinois ties are a plus"
    ],
    "how_to_apply": "Please submit a cover letter, resume, and writing sample to IL10.Jobs@mail.house.gov and list “Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "IL10.Jobs@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable federal law. Applicants with disabilities who require reasonable accommodation to participate in the application or hiring processes are encouraged to request an accommodation at any time during those processes."
  },
  {
    "id": "MEM-481-23",
    "position_title": "District Director",
    "office": "Representative Jason Crow (CO-6)",
    "location": "Aurora, CO",
    "posting_date": "2023-10-02",
    "description": "We are looking for an experienced leader who can serve as the Congressman's primary advisor in the district office, manage a talented team, and maintain strong relationships with community leaders and stakeholders.\nThis is not an entry level position.",
    "responsibilities": [],
    "qualifications": [
      "Strong oral and written communications skills",
      "Thoroughness and careful attention to detail",
      "The temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner"
    ],
    "how_to_apply": "Candidates should submit a resume and cover letter with the subject line “District Director” to: co06.resumes@mail.house.gov. No phone calls, faxes, or drop-ins, please",
    "salary_info": null,
    "contact": "co06.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-478-23",
    "position_title": "Member Services Coordinator",
    "office": "House Committee on Natural Resources Democratic Staff",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "The Democratic staff of the House Natural Resources Committee (HNRC) seeks\nan extremely detail-oriented, organized, and motivated member services\ncoordinator who will report to the Staff Director. Candidates should be passionate\nabout issues within the Committee’s jurisdiction and have excellent interpersonal\nskills.",
    "responsibilities": [
      "Tracking and facilitating member attendance at official committee proceedings, including hearings, markups, and roundtable events.",
      "Conducting regular outreach to committee Member offices to build relationships with staff, sharing opportunities for Member or staff participation in events, messaging, and other efforts, and identifying new ideas for collaboration with Member offices.",
      "Maintaining staff contact information and distribution list.",
      "Ensuring the logistical execution of outreach and engagement activities, including providing advance staffing for committee travel, securing venues, identifying potential vendors and contractors, and ensuring logistical requirements and needs are met.",
      "Cultivating interest and participation of Committee members in committee activities.",
      "Developing memoranda and reports for committee staff on Committee member priorities, needs, and interests.",
      "Other duties as assigned."
    ],
    "qualifications": [
      "Demonstrates an awareness of and sensitivity to the needs and concerns of individuals from diverse cultures, backgrounds, and orientations. Understands how HNRC issues intersect with racism, economic, public health, and social inequality in the U.S. and has a passion for working to dismantle these systems.",
      "Knowledge of the committee’s jurisdiction, legislative process, and of House organization and procedures.",
      "Expert political acumen, judgment, discretion, and command of nuance.",
      "Exceptional written and verbal communication skills and ability to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "High levels of organization, especially while managing numerous and often competing tasks, deadlines, and contacts.",
      "Ability to work cooperatively and courteously with others.",
      "Experience in a member services role with a stakeholder constituency group preferred."
    ],
    "how_to_apply": "To apply, address your application materials\nto NRDems.Resumes@mail.house.gov with the subject line “HNRC Member\nServices Coordinator” by COB Friday, October 20, 2023. Include a cover letter,\nresume, and two writing samples.\nThis posting will be removed from the website once the position has been filled.\nhttps://democrats-naturalresources.house.gov/contact/job-postings",
    "salary_info": "Salary is commensurate with experience. The office offers\nbenefits, including competitive options for health, dental, vision, and life\ninsurance; retirement match; student loan repayment program and transit/parking\nbenefits.",
    "contact": "NRDems.Resumes@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis\nof race, color, religion, sex, gender identity or expression, national origin, age,\ndisability, military status, parental status, marital status, sexual orientation, or any\nother factor or basis prohibited by applicable federal law. Applicants with\ndisabilities who require reasonable accommodation to participate in the\napplication or hiring processes are encouraged to request an accommodation at\nany time during those processes."
  },
  {
    "id": "MEM-477-23",
    "position_title": "Digital Assistant or Manager",
    "office": "Congressman Jason Crow (CO-6)",
    "location": "Washington, DC",
    "posting_date": "2023-10-02",
    "description": "This position will help develop and implement the office's digital and social media strategy. The Digital Assistant/Manager will also manage clips for the office, film videos and write scripts for the member, and edit video, and create graphics.",
    "responsibilities": [],
    "qualifications": [
      "Ideal candidates will be able to quickly develop creative and punchy digital content.",
      "Video editing and photography experience is a plus.",
      "Colorado ties are preferred but not required."
    ],
    "how_to_apply": "Candidates should submit a resume, cover letter, one-page writing sample, and if available, any videography or photography portfolio, with the subject line “Digital Staffer” to: co06.resumes@mail.house.gov. No phone calls, faxes, or drop-ins, please.",
    "salary_info": null,
    "contact": "co06.resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-472-23",
    "position_title": "Speechwriter",
    "office": "Congresswoman Rosa DeLauro (CT-03)",
    "location": "Washington, DC",
    "posting_date": "2023-10-02",
    "description": "Congresswoman Rosa DeLauro (CT-03) seeks experienced, hardworking team player with outstanding writing skills and sound political judgment to serve as Speechwriter in her Washington, DC office.\n\nThis is not an entry level position.\n\nThe ideal candidate should have significant speechwriting experience, a collaborative approach to writing, and work well under pressure and with tight deadlines.",
    "responsibilities": [
      "Production of all speeches",
      "Talking points",
      "Scripts for pre-recorded videos",
      "Other written materials as needed"
    ],
    "qualifications": [
      "Flexible",
      "Highly dependable",
      "Organized",
      "Proactive",
      "Working knowledge of issues facing Congress",
      "Strong oral and written communication skills",
      "Proven ability to write quickly and crisply",
      "Ability to target messages for specific audiences",
      "Talent for creatively researching and succinctly describing complex issues"
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, resume, three writing samples, and references to CT03jobs@gmail.com with the subject line “Speechwriter Vacancy.” No calls or walk-ins, please.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CT03jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer. Candidates of diverse backgrounds are encouraged to apply. Connecticut ties are a plus. This office requires all staff and interns to complete a full SARS-CoV2 vaccination course, regardless of recovery from prior coronavirus illness, as a condition of employment."
  },
  {
    "id": "MEM-470-23",
    "position_title": "Legislative Assistant",
    "office": "Representative Peltola",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "Representative Peltola seeks an experienced Legislative Assistant for her\nWashington, D.C. office to manage her Health and Education portfolio.\nPrimary responsibilities include advising the Representative on all legislative\nmatters related to healthcare and education. This staffer will be expected to work\nclosely with other Hill offices and relevant Committee staff on the\nRepresentative’s legislative priorities in this portfolio.",
    "responsibilities": [
      "Advising the Representative on all legislative matters related to healthcare and education.",
      "Working closely with other Hill offices and relevant Committee staff on the Representative’s legislative priorities in this portfolio."
    ],
    "qualifications": [
      "Self-starter and critical thinker with excellent written and verbal communication skills.",
      "Ability to work both independently and in a collaborative setting.",
      "Previous Hill experience is required, with a minimum of 2-3 years of Hill experience preferred."
    ],
    "how_to_apply": "Interested candidates should email a resume and cover letter to akresumes@mail.house.gov",
    "salary_info": null,
    "contact": "akresumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-468-23",
    "position_title": "Investigative Counsel",
    "office": "Office of Congressional Ethics (OCE)",
    "location": "Washington, DC",
    "posting_date": "2023-10-02",
    "description": "The Office of Congressional Ethics (OCE), an independent, non-partisan investigative entity established by the United States House of Representatives, seeks one attorney with 5-10 years of experience to serve as Investigative Counsel.\n\nThe Investigative Counsel reports to the Staff Director and Chief Counsel and will be responsible for conducting sensitive inquiries into allegations of possible violations of federal law and ethical standards of conduct by current Members, Officers and Staff of the House of Representatives and advising the Staff Director and Chief Counsel on legal and policy matters.\n\nThe OCE is seeking attorneys interested in the OCE’s work supporting ethics and transparency within the House of Representatives. The Investigative Counsel would join a small, Washington, DC-based, investigative team, and would be eligible to apply for hybrid work accommodations combining in-person core days and remote work.",
    "responsibilities": [
      "Review information received by OCE, discern possible violations, and identify facts requiring further investigation",
      "Plan, organize and conduct investigations regarding allegations and advise the Staff Director and Chief Counsel regarding appropriate evaluation of cases",
      "Advise the Staff Director and Chief Counsel on legal issues in matters under investigation and on broader legal and policy issues involved in the operations of OCE",
      "Draft lengthy and detailed memoranda, reports, and referrals for Board consideration and potential public release"
    ],
    "qualifications": [
      "Demonstrated ability to conduct and direct complex legal research and present the results in a clear, precise and persuasive manner",
      "Thoroughness and careful attention to detail",
      "Strong oral and written communication skills",
      "Strong legal judgment and demonstrated professional integrity",
      "Experience auditing large sets of data or evidence and providing detailed analysis",
      "Desirable but not required:",
      "*Investigative experience with high-profile and sensitive matters;",
      "*Experience with investigations involving public officials;",
      "*Experience with campaign finance or ethics law;",
      "*Experience conducting interviews or depositions;",
      "*Experience writing public reports or legal documents; and",
      "*Advanced proficiency in development and use of electronic databases, and other computer skills including knowledge of current information technology tools related to investigations",
      "Ability:",
      "*work independently or as part of an investigative team;",
      "*manage multiple tasks and projects;",
      "*work well under pressure and tight time deadlines; and",
      "*exercise discretion and independent judgment"
    ],
    "how_to_apply": "Please send cover letter, short writing sample, and resume (electronic submissions preferred) to:",
    "salary_info": null,
    "contact": {
      "name": "Omar S. Ashmawy",
      "title": "Staff Director and Chief Counsel",
      "office": "Office of Congressional Ethics",
      "address": "P.O. Box 895\nWashington, DC 20515-0895",
      "email": "OCEJOB@mail.house.gov"
    },
    "equal_opportunity": null
  },
  {
    "id": "MEM-464-23",
    "position_title": "Press Secretary / Digital Director / Deputy Communications Director",
    "office": "Congresswoman Diana DeGette (D-CO)",
    "location": "Washington, D.C. or Denver, CO",
    "posting_date": "2023-10-02",
    "description": "Congresswoman Diana DeGette (D-CO) is seeking a highly motivated, detailorientated communications professional for a vacancy in her communications\nshop. This position can be based out of either DeGette’s Washington, D.C. or\nDenver, CO office.\n\nThe ideal candidate will be creative, have strong writing and organizational skills,\nand a proficiency in crafting digital content — as well as experience coordinating\nwith media. Being a detail-oriented team player is essential, along with the ability\nto be a self-starter and work on multiple projects at once in a fast-paced\nenvironment. A good attitude and friendly demeanor are greatly appreciated.\n\nCapitol Hill experience or Colorado ties are a plus, but not required.",
    "responsibilities": [
      "overseeing digital content for the member’s social media platforms and website",
      "graphic design",
      "video filming and editing",
      "taking photographs",
      "drafting releases, newsletters, advisories, talking points, speeches, and more",
      "organizing press events",
      "compiling daily press clips",
      "This position will coordinate closely with and report to the Communications Director."
    ],
    "qualifications": [],
    "how_to_apply": "Qualified candidates should submit a cover\nletter, resume, two writing samples, and an example of previous digital media or\ngraphic design projects to DeGette.Comms@mail.house.gov with their last name\nin the subject line. Applications will be considered on a rolling basis until the\nposition is filled. No phone calls, faxes, or drop-ins please.",
    "salary_info": "The salary range for the position is commensurate with experience and expected\nto fall within $55,000 – $65,000 annually. Both title and salary are negotiable\nbased on experience.",
    "contact": "DeGette.Comms@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate based on\nrace, color, religion, sex, sexual orientation, gender identity and expression,\nnational origin, disability, military status, age, marital status, or parental status.\nCandidates from all backgrounds are encouraged to apply."
  },
  {
    "id": "MEM-463-23",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee (MI-08)",
    "location": "Washington, D.C.",
    "posting_date": "2023-10-02",
    "description": "The legislative assistant will be responsible for important issues areas such as worker and family support, education, labor, transportation, among other issues, in a fast-paced congressional office for a member of House Democratic Leadership on the Ways and Means Committee and Budget Committee.",
    "responsibilities": [
      "Drafting bills and amendments",
      "Developing strategic plans to advance legislation through Congress",
      "Staffing committee meetings",
      "Interacting with constituents and district stakeholders, committee/leadership committee staff and federal agencies",
      "Writing policy briefing memos and talking points"
    ],
    "qualifications": [
      "Self-starting personality",
      "Passion for public service",
      "Strong written and verbal communication skills",
      "Eagerness to work on a team in a collaborative office environment",
      "A minimum three years of relevant work experience is required",
      "Michigan ties preferred"
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to kildeejobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "kildeejobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-462-23",
    "position_title": "Communications Director",
    "office": "Office of Congresswoman Alma S. Adams, Ph.D.",
    "location": "Washington DC or the Charlotte, NC District Office",
    "posting_date": "2023-10-02",
    "description": "The Communications Director is expected to work closely with the Chief of Staff, Deputy Chief of Staff / District Director, and the Legislative Director to develop and execute a comprehensive and aggressive strategic plan to inform constituents and the media about Congresswoman Adams and her work as a member of congress.\n\nThis includes making media pitches, organizing press events, and reviewing, drafting, and finalizing statements, talking points/speeches, press releases, media advisories, and other messaging (e.g., newsletters and social media). Finally, the Communications Director will oversee all Franked communications, which includes mailers. Successful candidates will be exceptional writers and have strong experience working in fast-paced environments and implementing aggressive communications plans. North Carolina ties strongly preferred.\n\nView the full job description attached.",
    "responsibilities": [
      "Develop strategic communications plans and work closely with the DC and District Offices to implement successful media strategies;",
      "Produce written and visual content for the office, including but not limited to press releases, statements, social media post and weekly newsletters;",
      "Manage, mentor, and grow the communications team, focusing on staff professional development, skill building, and efficient workflows;",
      "Build and sustain strong relationships with North Carolina and national print, online, radio, and broadcast media (reporters, producers, editors, columnists, etc), and remain ready to identify creative ways to pitch the Member;",
      "Prepare, brief, and staff the Member for media interviews, press conferences, roundtables, and other engagements;",
      "Draft and edit office materials, talking points, speeches, press releases, op-eds, and other materials as necessary; and",
      "Speak on background or on the record with reporters when necessary and act as a media liaison for the Member."
    ],
    "qualifications": [
      "Bachelor’s Degree in a relevant field or equivalent professional experience;",
      "Previous Capitol Hill, campaign or political experience strongly preferred;",
      "Exceptionally strong writing, editing, and proofreading skills;",
      "Previous on the record experience;",
      "Experience managing others and promoting professional development;",
      "Deep understanding of print, broadcast, and online media and how to successfully create and leverage opportunities in each;",
      "Strategic thinker, politically savvy, and ability to manage competing priorities and develop solutions under tight deadlines;",
      "Ability to work well with others, willingness to take initiative, manage competing priorities, and turn around high-quality products under tight deadlines are a must; and",
      "Works a flexible schedule, including long hours on nights and weekends."
    ],
    "how_to_apply": "Qualified candidates should submit a cover letter, a resume, three references, and three writing samples to NC12.resume@mail.house.gov with “[NAME] – Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "NC12.resume@mail.house.gov",
    "equal_opportunity": "Rep. Alma S. Adams’ office provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2023-10-02",
    "description": "The Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  },
  {
    "id": "MEM-448-23",
    "position_title": "Professional Staff Member",
    "office": "House Armed Services Committee Democrats",
    "location": null,
    "posting_date": "2023-10-02",
    "description": "The House Armed Services Committee Democrats are seeking a Professional Staff Member for the Military Personnel Subcommittee.\n\nThe Military Personnel Subcommittee jurisdiction includes: policy and programs and accounts related to military personnel and their families, Reserve Component integration and employment, military health care, military education, dependent schools, POW/MIA issues, Morale, Welfare and Recreation, commissaries, cemeteries under the jurisdiction of the Department of Defense, the Uniform Code of Military Justice, military retirement issues, and the civilian and contract workforce.\n\nThis is not an entry level position. Candidates with a law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred. The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees. A successful candidate will be required to obtain and maintain a security clearance.",
    "responsibilities": [
      "Advising Members of Congress on military justice and other military personnel policy matters",
      "Evaluating budget requests and legislative proposals",
      "Preparing for committee hearings and briefings",
      "Developing and drafting proposal for inclusion in the annual National Defense Authorization Act"
    ],
    "qualifications": [
      "Law degree and experience with the Uniform Code of Military Justice (UCMJ) are strongly preferred",
      "Successful candidate will be required to obtain and maintain a security clearance"
    ],
    "how_to_apply": "Please submit a cover letter, resume, two-to-three references, to hasc.dememployment@mail.house.gov with the subject line: “Full Name – PSM – Military Personnel.” We will accept applications until the position is filled.",
    "salary_info": null,
    "contact": "hasc.dememployment@mail.house.gov",
    "equal_opportunity": "The Committee is an is an Equal Opportunity Employer and strongly values the diversity of its employees."
  },
  {
    "id": "MEM-354-23",
    "position_title": "Policy Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": "Capitol Hill",
    "posting_date": "2023-10-02",
    "description": "The Congressional Black Caucus (CBC) seeks a Policy Director to manage the Caucus’ policy agenda, including crafting and executing effective legislative strategies to advance Caucus policy priorities, representing the Caucus as point of contact on all policy engagements, working with Members’ staff to advance legislative proposals, developing materials to support the goals and mission of the Caucus, and promoting the Caucus both internally within the House of Representatives and externally to the public. The Policy Director’s responsibilities will include:",
    "responsibilities": [
      "In conjunction with Members, developing Caucus’ policy priorities and strategic objectives",
      "Executing Caucus’ policy agenda through nuanced understanding of community stances",
      "Working collaboratively with the Executive Director and other Caucus staff to advance CBC’s work internally on Capitol Hill and through deep engagement with stakeholder entities to push CBC priorities forward",
      "Collaborating with CBC Member office staff to further Caucus policy objectives and managing communication with CBC policy councils",
      "Collaborating with communications staff to convey legislative positions and wins into external messaging through statements, social media, and press engagement",
      "Organizing policy-focused events for Caucus members and external stakeholder participation"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "This is not an entry-level position and candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume, and writing sample to vincent.evans@mail.house.gov. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-305-23",
    "position_title": "DPCC COMMUNICATIONS DIRECTOR",
    "office": "House Democratic Policy and Communications Committee",
    "location": "Capitol Hill",
    "posting_date": "2023-10-02",
    "description": "The House Democratic Policy and Communications Committee seeks an experienced Communications Director.\n\nThe Communications Director will work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats; create messaging guidance, event suggestions, sample releases, and other communications tools; help Democratic offices pitch stories, hold strong local press events, and position Members in the media; and assist in bolstering paid communications programs in Democratic offices.\n\nThe Communications Director is also expected to assist with the planning and execution of regular DPCC message meetings and policy dinners; support DPCC outreach initiatives; and assist with daily tasks and long-term planning. Spanish language fluency and experience with constituency media is strongly preferred.\n\nThis is not an entry-level position; a strong background in communications on Capitol Hill is required. DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply.",
    "responsibilities": [
      "Work with the Executive Director to design and execute strategies that advance the message priorities and values of House Democrats",
      "Create messaging guidance, event suggestions, sample releases, and other communications tools",
      "Help Democratic offices pitch stories, hold strong local press events, and position Members in the media",
      "Assist in bolstering paid communications programs in Democratic offices",
      "Assist with the planning and execution of regular DPCC message meetings and policy dinners",
      "Support DPCC outreach initiatives",
      "Assist with daily tasks and long-term planning"
    ],
    "qualifications": [
      "Strong background in communications on Capitol Hill is required",
      "Spanish language fluency and experience with constituency media is strongly preferred"
    ],
    "how_to_apply": "To apply, please email jobs.DPCC@mail.house.gov with the following application materials attached as one combined PDF: 1. Cover letter; 2. Resume; 3. Two writing samples, with one coming from work on Capitol Hill; and 4. Two references including name, current title and organization, phone number, email, and a one-sentence description of your relationship to the reference (we will not contact these references without contacting you first).",
    "salary_info": null,
    "contact": "jobs.DPCC@mail.house.gov",
    "equal_opportunity": "DPCC is an equal opportunity employer and does not discriminate based on race, religion, disability, age, ethnicity, national origin, sex, gender, LGBTQ+ identification, family status, or military status. Women, people of color, and other members of traditionally underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-300-23",
    "position_title": "Legislative Director",
    "office": "Congressman Steven Horsford (NV-O4)",
    "location": "Capitol Hill",
    "posting_date": "2023-10-02",
    "description": "Congressman Steven Horsford (NV-O4) seeks a highly motivated, hard-working, skilled and experienced Legislative Director to help shape and manage a robust legislative portfolio.\n\nCongressman Horsford is a member of the Armed Services and Financial Services Committees, Chair of the Congressional Black Caucus, and an active frontline member. Previous legislative experience on Capitol Hill is required, and Nevada ties are a plus.\n\nIdeal candidates will have experience managing and mentoring staff, thinking strategically and will possess a sophisticated understanding of the legislative process, along with excellent writing, organizational and time management skills.\n\nThe ideal candidate will primarily be responsible for managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues.\n\nCandidates should be creative, proactive and self-motivated, and have an ability to operate effectively under pressure and work closely in a team atmosphere in this fast-moving, dynamic office.",
    "responsibilities": [
      "Managing a legislative portfolio that consists of healthcare, taxes, gun violence prevention, and other issues."
    ],
    "qualifications": [
      "Previous legislative experience on Capitol Hill is required",
      "Nevada ties are a plus",
      "Experience managing and mentoring staff",
      "Strategic thinking",
      "Sophisticated understanding of the legislative process",
      "Excellent writing skills",
      "Excellent organizational skills",
      "Excellent time management skills",
      "Creative",
      "Proactive",
      "Self-motivated",
      "Ability to operate effectively under pressure",
      "Ability to work closely in a team atmosphere"
    ],
    "how_to_apply": "Interested candidates must include a cover letter, resume, two page max writing sample and three professional references in a single PDF file.\nEmail submissions to the Director of Administration, Selena Harvey at nv04resumes@mail.house.gov. Subject line must read \"Legislative Director Application.\"",
    "salary_info": "Salary is competitive and commensurate with experience, along with generous benefits and professional development opportunities.",
    "contact": "Selena Harvey at nv04resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, age, disability, military status, marital or parental status. Women, people of color and LGBTQAI+ candidates are strongly encouraged to apply, as are candidates with Nevada ties."
  },
  {
    "id": "MEM-NV04-23",
    "position_title": "Legislative Director",
    "office": "Representative last name",
    "location": null,
    "posting_date": "2023-10-02",
    "description": null,
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "No calls please. Individuals selected for an interview will be contacted.",
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  }
]