[
  {
    "id": "MEM-141-24",
    "position_title": "Community Liaison – Island County",
    "office": "U.S. Rep. Rick Larsen",
    "location": "Everett Office",
    "posting_date": "2024-03-25",
    "description": "The Island County Community Liaison serves as Rep. Larsen’s representative to\nWhidbey and Camano islands.\n\nAs part of our district outreach team, the primary role of this position is to\ncoordinate issues involving the federal government with officials from federal,\nstate and local governments, as well as constituents, businesses, organized labor\nand other organizations. The Outreach Assistant – North Counties staffer is\nexpected to develop relationships with our district stakeholders to learn the\ndetails of projects and policy concerns and to respond to their interests in federal\npolicy development.\n\nIn addition to the geographic responsibility for communities in Island County,\nthis position also covers military and veterans affairs and engagement with the\nU.S. Coast Guard.\n\nThe Island County Community Liaison is based in Rep. Larsen’s Everett, WA\noffice and reports directly to the District Director. Together, the district staff\nworks in harmony with the staff in Washington, D.C., and all staff members\nreport to the Chief of Staff.",
    "responsibilities": [
      "Serve as an official representative for Rep. Larsen at meetings, forums and\npublic events",
      "Build and maintain relationships with constituents, businesses, labor, non-profit\norganizations, federal agencies, local government, and other stakeholders in\nIsland County",
      "Travel regularly throughout the district to monitor local issues, projects and\nactivities",
      "Work with Washington D.C.-based staff on federal policy development and\ninterpretation for local stakeholders",
      "Event planning, including Rep. Larsen’s district schedule"
    ],
    "qualifications": [
      "Strong understanding of Island County and experience with outreach activities\nworking with government, cultural communities, the business community,\norganized labor and local stakeholder groups",
      "Ability to exercise discretion and independent thinking while working as part of\na team on sensitive projects and issues",
      "Strong writing ability",
      "Flexibility to work nights and weekends",
      "Valid driver’s license and vehicle",
      "Comfort discussing issues with groups both small and large, including public\nspeaking"
    ],
    "how_to_apply": "Interested candidates should send a resume and cover letter\nto ryan.casey@mail.house.gov or:\n\nOffice of U.S. Rep. Rick Larsen\nC/O Ryan Casey\nDistrict Director\n2930 Wetmore Avenue, Ste. 9F\nEverett, WA 9820",
    "salary_info": "The annual salary for this position depends on relevant experience and ranges\nfrom $55,000 - $65,000.",
    "contact": "ryan.casey@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the\nbasis of race, sex, color, age, religion, national origin, sexual orientation, gender\nidentity, or disability. We are committed to building and maintaining an\norganization that reflects the needs and diverse community we serve."
  },
  {
    "id": "MEM-137-24",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Congresswoman Lisa Blunt Rochester (DE-At Large)",
    "location": "Washington, DC",
    "posting_date": "2024-03-25",
    "description": "Congresswoman Lisa Blunt Rochester (DE-At Large) seeks an organized and\nhighly motivated self-starter to serve as Staff Assistant/Legislative\nCorrespondent in her Washington, DC office.",
    "responsibilities": [
      "logging phone calls",
      "greeting visitors",
      "managing front office operations",
      "handling tour and flag requests",
      "assisting with drafting constituent correspondence and managing the mail program",
      "overseeing the intern program",
      "providing administrative support to the team",
      "additional duties as assigned",
      "This position reports directly to the Chief of Staff and works closely with the Legislative Aide on the mail program."
    ],
    "qualifications": [
      "excellent oral and written communication skills",
      "attention to detail",
      "an ability to work under pressure",
      "a collaborative spirit",
      "a strong commitment to public service",
      "Previous Capitol Hill experience and Delaware ties are a plus."
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and two brief writing samples (1-2\npages each) to lbr.jobposting@gmail.com with “Staff Assistant/Legislative\nCorrespondent Application” in the subject line by COB Tuesday, April 2nd. No\nwalk-ins, emails, or phone calls please.",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the\nbasis of race, sex, color, age, religion, disability, national origin, uniformed\nstatus, sexual orientation, or gender identity. Candidates from diverse\nbackgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-136-24",
    "position_title": "Military Legislative Assistant",
    "office": "House GOP Appropriator",
    "location": "Capitol Hill",
    "posting_date": "2024-03-25",
    "description": "Members serves on the Military Construction Subcommittee and has many military equities in-district. Portfolio would include national security, foreign affairs, defense and veterans issues.",
    "responsibilities": [],
    "qualifications": [
      "1-3 years of Capitol Hill experience"
    ],
    "how_to_apply": "Resumes can be sent to housegopemployment@gmail.com",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-135-24",
    "position_title": "PRESS SECRETARY",
    "office": "The Office of Congresswoman Joyce Beatty (OH-03)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "The Office of Congresswoman Joyce Beatty (OH-03) seeks an experienced Press Secretary for her Washington, D.C. office. Candidates must be able to manage media relations, press opportunities, and messaging for a senior member of Congress. This role reports to the Communications Director.\n\nThis is not an entry-level position. Candidates with established, active relationships with top-tier national media outlets and on-the-record experience will receive preferred consideration. Ohio ties are preferred, but not required.",
    "responsibilities": [
      "Serve as the primary contact for media requests, pitching and securing media opportunities in top-tier national outlets, coordinating necessary preparations, messaging, and risk management.",
      "Advance press events and staff the Member as needed for media engagements.",
      "Establish and maintain relationships with Ohio media, and activate current relationships with national, and D.C.-based media.",
      "Draft and distribute media materials including press releases, statements, media advisories, and op-eds.",
      "Assist with developing social media content creation, including rapid response.",
      "Complete special projects.",
      "Develop and execute media strategy as part of the office’s larger communications strategy."
    ],
    "qualifications": [],
    "how_to_apply": "Please submit your resume and cover letter to oh3.jobs@mail.house.gov using the following subject header: PRESS SECRETARY: First name, Last name.",
    "salary_info": "Salary is competitive and commensurate with experience.",
    "contact": "oh3.jobs@mail.house.gov",
    "equal_opportunity": "The Office of Congresswoman Beatty is an Equal Opportunity Employer who does not discriminate in employment based on race, color, religion, sex (including pregnancy and gender identity), national origin, sexual orientation, marital status, disability, genetic information, age, membership in an employee organization, retaliation, parental status, military service, or other non-merit factor. LGBTQ+, and minority candidates as well as candidates from underrepresented groups are encouraged to apply."
  },
  {
    "id": "MEM-133-24",
    "position_title": "Scheduler",
    "office": "Office of Rep. Pence (IN-06)",
    "location": "Washington D.C",
    "posting_date": "2024-03-25",
    "description": "The Office of Rep. Pence (IN-06) is seeking a well-organized, personable Scheduler in his Washington D.C office. This role is responsible for the Congressman’s schedule and travel plans, coordinating and responding to scheduling requests, and supervising the office’s Staff Assistant and interns to ensure the office is managed effectively.\n\nFurther responsibilities include filing financial forms and overseeing routine office expenses. This role also serves as the Office Emergency Coordinator. A strong applicant would exhibit strong organizational and interpersonal skills, the ability to plan effectively and adjust as needed, as well as an ability to work collaboratively with other staff in the office.\n\nA candidate who is hired for this position will work under the current Director of Operations until his departure at the end of June, after which they will take over all of his former responsibilities.",
    "responsibilities": [
      "Responsible for the Congressman’s schedule and travel plans",
      "Coordinating and responding to scheduling requests",
      "Supervising the office’s Staff Assistant and interns",
      "Filing financial forms",
      "Overseeing routine office expenses",
      "Serves as the Office Emergency Coordinator"
    ],
    "qualifications": [
      "Strong organizational skills",
      "Strong interpersonal skills",
      "Ability to plan effectively and adjust as needed",
      "Ability to work collaboratively with other staff in the office"
    ],
    "how_to_apply": "Please submit a resume and references to gopjobonthehill@gmail.com",
    "salary_info": null,
    "contact": "gopjobonthehill@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-131-24",
    "position_title": "Executive Director",
    "office": "For Country Caucus",
    "location": "Washington, DC",
    "posting_date": "2024-03-25",
    "description": "Established in 2019, the For Country Caucus of 30 veterans in the U.S. House is one of the most productive bipartisan caucuses in Congress, having helped pass more than 100 laws with a focus on national security, national service, and veterans affairs. The caucus works alongside a group of bipartisan senators and others to pass bicameral legislation for the nation. The For Country Caucus is seeking an Executive Director to help lead the caucus in its next chapter of growth.",
    "responsibilities": [
      "Lead the For Country Caucus staff, which includes a communications director.",
      "Work with the bipartisan For Country Caucus leadership to shape the caucus strategy.",
      "Manage and help develop relationships for the For Country Caucus with other stakeholders in Congress.",
      "Manage and help develop relationships for the For Country Caucus with external stakeholders that can assist with advancing bipartisan legislation, including veteran service organizations.",
      "Plan and execute For Country Caucus bi-monthly meetings for Members of Congress and staff.",
      "Help identify and coordinate high-profile guest speakers.",
      "Plan and execute For Country Caucus semi-annual service events and bipartisan Congressional Delegations.",
      "Manage the For Country Caucus budget.",
      "Advance For Country Caucus legislative priorities, to include shaping and executing internal and external communications.",
      "Represent the For Country Caucus in meetings with House leadership, Committee staff, Senate staff, and external organizations and stakeholders."
    ],
    "qualifications": [
      "At least four years of work experience in policy, communications, or government affairs.",
      "Dedication to promoting bipartisan respect, civility, and government cooperation.",
      "Entrepreneurial spirit and a demonstrated ability to work independently.",
      "Strong understanding of the House legislative process and the National Defense Authorization Act.",
      "Comfort working in a fast-paced, dynamic environment within a collaborative team setting",
      "Excellent organizational, written, and verbal communication skills.",
      "Exceptional judgment."
    ],
    "how_to_apply": "Please submit your resume and a cover letter detailing your relevant experience and interest in the position to ForCountryCaucus@mail.house.gov",
    "salary_info": "Salary is commensurate with experience and ranges from $90,000-110,000.",
    "contact": "ForCountryCaucus@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-129-24",
    "position_title": "Legislative Director",
    "office": "Congresswoman Rashida Tlaib, representing Michigan's 12th Congressional District",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "The Legislative Director provides visionary and strategic planning on legislative priorities and helps with implementation of these priorities based on the district, member and office goals. The Legislative Director will be responsible for leading implementation of Rep. Tlaib's core issues which include economic justice, environmental justice, housing affordability, corporate accountability and so much more.",
    "responsibilities": [],
    "qualifications": [
      "Strong organization and time management skills",
      "Polished and professional writing",
      "Robust leadership, mentorship and management abilities",
      "Proactive and creative problem-solving",
      "The ability to operate and deliver under tight deadlines in high-pressure situations",
      "A strong understanding of the legislative process, and 3-4 years of Hill experience minimum is strongly advised",
      "Well-qualified candidates will have strong relationships with progressive stakeholders and other congressional offices",
      "A strong commitment to progressive ideals is necessary to thrive in this role",
      "A passion for human rights, economic and social justice and grassroots organizing are also important"
    ],
    "how_to_apply": "To apply, please email Rashida.Jobs@mail.house.gov (SUBJECT: Legislative Director, YOUR NAME) with a cover letter, resume and 2-3 references by Monday, April 1st.",
    "salary_info": "The starting salary for this position is $100,000 with some flexibility based on experience.",
    "contact": "Rashida.Jobs@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQIA+, and other members of other marginalized communities are strongly encouraged to apply. The office is an equal opportunity employer and does not discriminate based on race, color, religion, sex, sexual orientation, national origin, disability, military status, age, marital status."
  },
  {
    "id": "MEM-127-24",
    "position_title": "Legislative Assistant",
    "office": "Office of Congresswoman Diana DeGette (CO-01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "The Office of Congresswoman Diana DeGette (CO-01) is seeking an experienced Legislative Assistant to manage a diverse portfolio that includes issues in the jurisdiction of several House committees, especially Agriculture, Energy & Commerce, Science, Space and Technology, and/or Transportation & Infrastructure. This position is exclusively based in the Washington, D.C. office.\n\nThe primary responsibilities for this position will be leading and advancing the assigned issue areas, identifying new areas for legislative action, and coordinating with other Members and outside stakeholders. Additional duties will be assigned based on experience and office needs.\nThis is not an entry level position. Previous experience working in a Congressional office is required, and experience working on agriculture, animal welfare, consumer protection, commerce, postal, space, technology, telecommunications, tax, trade, transportation, and/or immigration issues is preferred.\nThe ideal candidate is hardworking and motivated; organized, detail-oriented and resilient in the face of a fast-paced and ever-changing environment. The ideal candidate is also proactive and comfortable working with diverse staff, community members and constituents. Our team values professionalism, positivity, strategic thinking, and good humor. Colorado or western state ties are a plus. The salary range for this position is $63,000 – $73,000 annually, commensurate with experience.",
    "responsibilities": [
      "Leading and advancing the assigned issue areas",
      "Identifying new areas for legislative action",
      "Coordinating with other Members and outside stakeholders",
      "Additional duties will be assigned based on experience and office needs."
    ],
    "qualifications": [
      "Previous experience working in a Congressional office is required",
      "Experience working on agriculture, animal welfare, consumer protection, commerce, postal, space, technology, telecommunications, tax, trade, transportation, and/or immigration issues is preferred.",
      "The ideal candidate is hardworking and motivated; organized, detail-oriented and resilient in the face of a fast-paced and ever-changing environment.",
      "The ideal candidate is also proactive and comfortable working with diverse staff, community members and constituents.",
      "Our team values professionalism, positivity, strategic thinking, and good humor.",
      "Colorado or western state ties are a plus."
    ],
    "how_to_apply": "Interested applicants should send an email with their resume and cover letter in a single PDF to DeGette.Employment@mail.house.gov by Friday, March 29. Please include last name and position in email subject line, e.g. “Legislative Assistant - [Last Name].” No drop-ins, emails, or social media invitations please.",
    "salary_info": "$63,000 – $73,000 annually, commensurate with experience.",
    "contact": "DeGette.Employment@mail.house.gov",
    "equal_opportunity": "The Office is an equal opportunity employer; women, people of color, members of the LGBTQ+ community, and members of other traditionally underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-126-24",
    "position_title": "District Representative/Constituent Caseworker",
    "office": "Office of Congresswoman Hillary Scholten",
    "location": "District",
    "posting_date": "2024-03-25",
    "description": "The Office of Congresswoman Hillary Scholten is seeking a highly organized and motivated District Representative/Constituent Caseworker to serve as a link between the Congresswoman’s office and her constituents.\n\nDistrict Representative responsibilities include helping constituents to resolve issues with federal agencies, meeting with constituents, and serving as a liaison to locate, state, and federal officials or groups to form effective relationships for the Congresswoman.",
    "responsibilities": [
      "Manage a high volume of incoming constituent correspondence via phone, email, and mail.",
      "Conduct research to fully understand constituent inquiries and resolve cases in a timely manner.",
      "Liaise with federal agencies to inquire about the status of cases and resolve bureaucratic issues.",
      "Maintain detailed records and case files using a database.",
      "Attend community outreach events and build relationships with local stakeholders."
    ],
    "qualifications": [
      "1-2 years of customer service, administrative, or office experience.",
      "Strong verbal and written communication skills.",
      "Excellent organizational abilities and attention to detail.",
      "Ability to prioritize, multi-task and meet deadlines.",
      "Proficiency with Microsoft Office Suite and database management.",
      "Knowledge of federal agencies and programs a plus.",
      "Commitment to providing exceptional constituent service."
    ],
    "how_to_apply": "All interested candidates are encouraged to submit a cover letter, resume and three (3) references to District Director Khristian Silvis at Khristian.Silvis@mail.house.gov.",
    "salary_info": "$50,000 to $60,000 - Commensurate on experience",
    "contact": "Khristian.Silvis@mail.house.gov",
    "equal_opportunity": "All applicants will be considered without regard to race, color, religion, sex (including marital or parental status), sexual orientation, gender identity, disability, age, or national origin."
  },
  {
    "id": "MEM-125-24",
    "position_title": "District Staff Assistant",
    "office": "Office of Congresswoman Katherine M. Clark (MA-5)",
    "location": "District Office",
    "posting_date": "2024-03-25",
    "description": "The Staff Assistant greets visitors, answers the telephone, processes mail, assists with constituent casework, drafts correspondence, and performs other administrative duties as needed. The Staff Assistant is also responsible for overseeing a robust internship program, including recruiting, interviewing, hiring, and supervising interns.\n\nThis role requires impeccable judgment and the ability to prioritize myriad tasks. The ideal candidate should be personable, organized, and detail-oriented.\n\nApplicants must possess excellent verbal and written communication skills and the ability to work cooperatively with others.\n\nOffice staff are currently working in person, remotely, or in a hybrid model depending on the needs and safety of the office.",
    "responsibilities": [
      "Manages the office intern program, ensuring smooth front office operational duties",
      "Works with constituent services representatives to ensure efficient casework intake using the office’s internal database",
      "Assists persons who have appointments with the Member or other staff Members and works closely with the District Director to ensure that the Members’ appointments are on time",
      "Maintains literature regarding the District and DC offices for distribution to visitors",
      "Coordinates the filing and indexing of all correspondence",
      "Maintains office inventory and signs for deliveries",
      "Provides orientation and training for new staff",
      "Supervises the reception desk, mail operations, and administrative files",
      "Assumes responsibility for overall office appearance and layout",
      "Maintains the office answering machine or voice mail",
      "Screens and refers cases, when appropriate, to other offices",
      "Logs in all incoming and outgoing mail and incoming telephone calls relating to casework or opinions",
      "Facilitates annual student engagement initiatives on behalf of the office",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "Impeccable judgment and the ability to prioritize myriad tasks",
      "Personable, organized, and detail-oriented",
      "Excellent verbal and written communication skills",
      "Ability to work cooperatively with others"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, & 2 writing samples to Jobs.MA05@mail.house.gov.\nAll materials will be reviewed on a rolling basis.",
    "salary_info": null,
    "contact": "Jobs.MA05@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. Diverse candidates, women, and LGBTQ+ persons are strongly encouraged to apply."
  },
  {
    "id": "MEM-122-24",
    "position_title": "Military Legislative Assistant",
    "office": "Congressman Donald Norcross (NJ-1)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "Congressman Donald Norcross (NJ-1), Ranking Member of the Subcommittee on Tactical Air and Land Forces of the House Armed Services Committee, is accepting applications for a senior Military Legislative Assistant position on his legislative team.\n\nCompetitive applicants should have an extensive knowledge of defense, foreign affairs, and veterans budgets, policies, and programs. Responsibilities are typical of a House legislative assistant with emphasis on: managing related authorization and appropriations requests; staffing committee hearings, briefings, markups, and floor action; developing and advancing legislative and program priorities; making cosponsor and vote recommendations; writing policy and program memos and talking points; and working directly with defense, foreign affairs, and veterans agencies, interest groups, industries, and constituents. This is not an entry-level position and closer consideration will go to applicants with prior Hill or military experience.",
    "responsibilities": [
      "managing related authorization and appropriations requests",
      "staffing committee hearings, briefings, markups, and floor action",
      "developing and advancing legislative and program priorities",
      "making cosponsor and vote recommendations",
      "writing policy and program memos and talking points",
      "working directly with defense, foreign affairs, and veterans agencies, interest groups, industries, and constituents"
    ],
    "qualifications": [
      "extensive knowledge of defense, foreign affairs, and veterans budgets, policies, and programs",
      "prior Hill or military experience"
    ],
    "how_to_apply": "Interested candidates should submit a resume and two writing samples (one narrative style and one bulleted issue brief, each 1 page max) with the subject line “MLA – [Last Name]” to cd1jobs@mail.house.gov by March 28th, 2024 Applications will be considered on a rolling basis.",
    "salary_info": null,
    "contact": "cd1jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-120-24",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Paul Gosar (Arizona's - 09)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "The main functions of the Staff Assistant are to support the operational functions of the office and staff needs. Applicants should be highly organized with excellent written and communication skills. The applicant must be able to multi-task, be punctual and meet deadlines all with a professional positive attitude.",
    "responsibilities": [
      "Field, log and direct incoming calls to the designated staffer",
      "Log and monitor incoming mail",
      "Oversee the D.C. office internship program",
      "Staff the Congressman at events and meetings as needed",
      "Draft correspondence",
      "Coordinate with staff on administrative tasks and projects",
      "Coordinate all constituent Capitol and White House tour requests",
      "Must be willing to work long and irregular hours when we are in session",
      "Be willing to drive the Congressman as needed. Parking will be provided."
    ],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume, cover letter, two references and two short writing samples to Lukas.Bacon@mail.house.gov with “DC Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Lukas.Bacon@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-116-24",
    "position_title": "Military & Veterans Constituent Service Representative (CSR)",
    "office": "Congresswoman Katherine M. Clark",
    "location": "District Office",
    "posting_date": "2024-03-25",
    "description": "The District Office of Congresswoman Katherine M. Clark is currently accepting applicants for the position of Military & Veterans Constituent Service Representative (CSR). The CSR monitors and updates the Member and District Director on district and local issues as well as serves as a liaison to federal, district, and local agencies for the member and constituents.\n\nThis position is responsible for a wide range of outreach, relationship management, event coordination, and correspondence. We're looking for someone who has great judgment, keen political skills, is quick on their feet and ready to seize opportunities (or create them). The ideal candidate is efficient but highly detail oriented and is a strong written and oral communicator.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman within their area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the Congresswoman and the District Director of all happenings in their assigned issue areas by screening district media sources and interacting with constituents;",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Member;",
      "Manages casework portfolio as assigned, assesses casework for problems requiring legislative action, and makes recommendations to the District Director and/or Chief of Staff;",
      "Monitors scheduled district meetings with constituents for the Member;",
      "Screens and refers cases, when appropriate, to other district offices and local agencies;",
      "Prepares periodic reports for the District Director on pending cases and district activities in their assigned portfolio;",
      "Continually screens active cases and acts as liaison with constituents to ensure that their cases are handled in a responsive manner;",
      "Maintains up-to-date files on all cases and categories of information of importance to the office;",
      "Performs other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested applicants should submit a cover letter, resume, & 2 writing samples to: Jobs.MA05@mail.house.gov.",
    "salary_info": null,
    "contact": "Jobs.MA05@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status.\n\nDiverse candidates, women, and LGBTQ+ persons are strongly encouraged to apply."
  },
  {
    "id": "MEM-112-24",
    "position_title": "Communications Director",
    "office": "Rep. Rob Menendez (NJ-08)",
    "location": "Washington D.C.",
    "posting_date": "2024-03-25",
    "description": "Congressman Rob Menendez (NJ-08), Member of the House Committees on Transportation and Infrastructure (T&I) and Homeland Security, is seeking an experienced, collaborative, and hardworking Communications Director in his Washington D.C. office.\n\nThis position will manage and coordinate all communications activities and serve as the primary communications advisor and media contact for the Member and the Office. This includes working closely with the Chief of Staff, Legislative Director, and District Director to develop and execute a comprehensive communications strategy and ensure that the Office is reaching constituents and members of the press on DC and District events and news. Responsibilities include managing and executing a proactive franking/mass communications program; managing the Digital Manager/Press Assistant; drafting press releases, talking points, floor speeches, and communications memos; maintaining relationships with local and national press; addressing media inquiries; developing, advancing, and staffing press events; and performing other press duties as assigned.",
    "responsibilities": [
      "Managing and coordinating all communications activities",
      "Serving as the primary communications advisor and media contact for the Member and the Office",
      "Working closely with the Chief of Staff, Legislative Director, and District Director to develop and execute a comprehensive communications strategy",
      "Ensuring that the Office is reaching constituents and members of the press on DC and District events and news",
      "Managing and executing a proactive franking/mass communications program",
      "Managing the Digital Manager/Press Assistant",
      "Drafting press releases, talking points, floor speeches, and communications memos",
      "Maintaining relationships with local and national press",
      "Addressing media inquiries",
      "Developing, advancing, and staffing press events",
      "Performing other press duties as assigned"
    ],
    "qualifications": [
      "Three or more years of relevant communications experience",
      "The ability to work well under pressure and cooperatively with colleagues",
      "A good understanding of both Washington D.C. and local media landscapes",
      "Excellent writing, editing, and proofreading skills",
      "Strong oral communication skills",
      "Spanish speakers and New Jersey ties are a plus"
    ],
    "how_to_apply": "Interested candidates are encouraged to submit a cover letter; two writing samples including a press release, newsletter, or franking/mass communications example; and resume in one PDF document to NJ08.resumes@gmail.com with the following subject line: “Full Name – Communications Director.”",
    "salary_info": null,
    "contact": "NJ08.resumes@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex (including marital or parental status), color, age, religion, national origin, sexual orientation, gender identity, or disability."
  },
  {
    "id": "MEM-103-24",
    "position_title": "STAFF ASSISTANT",
    "office": "Congresswoman Nancy Pelosi (San Francisco)",
    "location": "San Francisco",
    "posting_date": "2024-03-25",
    "description": "The office of Congresswoman Nancy Pelosi is seeking strong candidates for a\nStaff Assistant position in her San Francisco district office.\n\nThis position supports the base operational functions of the office and staff needs.\n\nApplicants should be highly organized with excellent written and oral communication skills, the ability to multi-task, think creatively and meet deadlines all while maintaining a positive, results-driven demeanor as the constituent-facing contact for the office.",
    "responsibilities": [
      "Field and direct incoming calls to the appropriate staff member",
      "Track and summarize local and state news",
      "Process and monitor incoming mail",
      "Track and maintain office inventory and supplies",
      "Oversee district Congressional intern program",
      "Assist in staffing events and meetings for the Speaker Emerita",
      "Prepare daily, weekly and monthly reports summarizing correspondence, gifts and other relevant items",
      "Draft official correspondence for approval and dissemination",
      "Coordinate with staff on administrative tasks and projects",
      "Assist with constituent services and casework"
    ],
    "qualifications": [
      "Must be willing to work long and irregular hours, including some nights and weekends.",
      "Multi-lingual skills and media experience are preferred, but not essential.",
      "Knowledge of the City & County of San Francisco, California's 11th Congressional District and the State of California is valuable.",
      "An ability to think creatively and meet deadlines is essential."
    ],
    "how_to_apply": "Please send resume, cover letter and writing sample\nto resume.ca11@mail.house.gov with “SF Staff Assistant” in the subject line.\nResumes will NOT be reviewed without a cover letter and writing sample. NO\nphone calls or walk-ins please.",
    "salary_info": "Salary will be commensurate with experience.",
    "contact": "resume.ca11@mail.house.gov",
    "equal_opportunity": "Congresswoman Pelosi's office is an Equal Opportunity Employer and strongly values the diversity of its employees."
  },
  {
    "id": "MEM-102-24",
    "position_title": "Staff Assistant",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "Primary responsibilities include assisting the legislative, constituent services and administrative functions of the office, to include monitoring, processing and responding to constituent mail and other communications, managing constituent tours and other needs, and coordinating D.C. and Honolulu office issues. As needed and depending on capability, the position also encompasses legislative duties. Direct report is to the Chief of Staff, although the Congressman is routinely involved in all aspects of his office operations.\n\nThe position also requires initiative, interpersonal skills, the ability to multitask, work independently and effectively under pressure, make decisions and solve problems, orientation to detail, excellent verbal communication and writing skills, and long hours especially adjusting to changing time zones.",
    "responsibilities": [
      "Assisting the legislative, constituent services and administrative functions of the office",
      "Monitoring, processing and responding to constituent mail and other communications",
      "Managing constituent tours and other needs",
      "Coordinating D.C. and Honolulu office issues",
      "Legislative duties (as needed and depending on capability)"
    ],
    "qualifications": [
      "Initiative",
      "Interpersonal skills",
      "Ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours, especially adjusting to changing time zones",
      "Prior Capitol Hill experience (strong preference)",
      "Hawai'i background (strong preference)"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Staff Assistant” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-101-24",
    "position_title": "Legislative Staffer",
    "office": "U.S. Congressman Ed Case (Hawai'i - 01)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "Primary responsibilities include the full range of management of a diverse and active portfolio of substantive issues. Specific duties include advising, briefing and staffing the Congressman on assigned issues, preparing and advancing related appropriations requests, monitoring related committee (including the Congressman's Appropriations Committee) and floor activities, advancing legislative initiatives, drafting constituent correspondence, and representing the office in meetings with constituents and others. Direct report is to the Chief of Staff, although the Congressman is routinely involved in all aspects of his office operations and there is routine direct interaction with the Congressman.\n\nThe position also requires initiative, interpersonal skills, the ability to multitask, work independently and effectively under pressure, make decisions and solve problems, orientation to detail, excellent verbal communication and writing skills, and long hours especially adjusting to changing time zones.\n\nStrong preference given to commensurate Capitol Hill experience, and Hawai'i background and knowledge is highly valued though not required. Applicants are asked to detail these attributes.",
    "responsibilities": [
      "Advising, briefing and staffing the Congressman on assigned issues",
      "Preparing and advancing related appropriations requests",
      "Monitoring related committee (including the Congressman's Appropriations Committee) and floor activities",
      "Advancing legislative initiatives",
      "Drafting constituent correspondence",
      "Representing the office in meetings with constituents and others"
    ],
    "qualifications": [
      "Initiative",
      "Interpersonal skills",
      "The ability to multitask",
      "Ability to work independently and effectively under pressure",
      "Ability to make decisions and solve problems",
      "Orientation to detail",
      "Excellent verbal communication and writing skills",
      "Ability to work long hours especially adjusting to changing time zones",
      "Commensurate Capitol Hill experience (strong preference)",
      "Hawai'i background and knowledge (highly valued)"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, three references and two short writing samples to HI01resumes@gmail.com with “DC Legislative Staffer” in the subject line. Please, no phone calls, faxes or drop-ins.",
    "salary_info": null,
    "contact": "HI01resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-100-24",
    "position_title": "Press Secretary / Communications Director",
    "office": "Rep. Raul Ruiz’s office",
    "location": "Washington, DC",
    "posting_date": "2024-03-25",
    "description": "Rep. Ruiz (CA-25), member of the Energy and Commerce Committee, seeks an energetic and well-organized professional to manage his communications portfolio. The position is based in Washington, DC and will travel to the district as needed. Candidates must have professional fluency in both English & Spanish. Candidates should be self-motivated, diligent, a team player, and able to develop and maintain relationships with local state, and national media reporters. The ideal candidate will have a passion for practical policies that unite the country and digital organizing / communications in all formats. Other duties include developing messaging and talking points; overseeing all communications materials, including press releases, website content, franked mail, and social media accounts; working with policy staff on short- and long-term communications goals; and regularly briefing and staffing the member.\n\nThis position will mentor /manage appropriate press interns in all offices. This is not an entry-level position.",
    "responsibilities": [
      "Developing messaging and talking points",
      "Overseeing all communications materials, including press releases, website content, franked mail, and social media accounts",
      "Working with policy staff on short- and long-term communications goals",
      "Regularly briefing and staffing the member",
      "Leading, managing & optimizing production needs surrounding virtual & inperson town hall meetings, public forums, & press conferences & creating graphics & media presentations when required",
      "Proactively pitching national/local media and developing media strategy",
      "Creating e-newsletters & managing the franked mailers process for the office",
      "Tracking press and social media analytics"
    ],
    "qualifications": [
      "Strong written and oral communications skills (writing, editing, proofreading) with at least two years of political communications experience including producing Op-Ed’s, Press Releases & other communications",
      "Understanding of print, broadcast, & online social media tools / platforms (Instagram, Facebook, Twitter, CanvaPro, Adobe Premier, etc.)",
      "Strong skills & experience producing excellent written & visual content, including graphics & video, for a variety of social media platforms",
      "An ability to amplify media coverage & grow its impact",
      "Thorough knowledge of the legislative process, procedures & organization of the House – a plus",
      "Knowledge of current issues & events in which the Congressman is involved in",
      "Ability to with legislative staff on short / long-term communications goals",
      "Ability to exercise discretion & judgment in the representation of the Congressman's position on policy issues",
      "Must have the ability to prioritize duties & manage staff in a fast-paced work environment while meeting rapid timelines",
      "Ability to translate complex policy issues into simple language, creating talking point summaries"
    ],
    "how_to_apply": "Interested applicants should send a cover letter, resume, and two writing samples (one English and one Spanish on two different topics) to: CA25Resumes@mail.house.gov with the “Press Secretary /Communications Director- [NAME]” in the subject line.",
    "salary_info": "title and salary based on experience",
    "contact": "CA25Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages people of all identity groups to apply."
  },
  {
    "id": "MEM-099-24",
    "position_title": "District Office Staff Assistant",
    "office": "Congresswoman's Office",
    "location": "District Office",
    "posting_date": "2024-03-25",
    "description": "The District Office Staff Assistant greets visitors, answers the telephone, and answers constituent requests for general information, tours, and other inquiries.\nThis position also monitors delivery and pickup of materials, maintains the front office, and assists with various administrative and legislative duties.",
    "responsibilities": [
      "Answers and screens telephone calls for the Congresswoman and other staff members",
      "Greets and screens visitors",
      "Assists persons who have appointments with the Congresswoman or other staff members and works closely with the District Director to ensure that the Congresswoman's appointments are on time",
      "Responds to constituent requests for flags, tours and other information",
      "Maintains literature regarding the district and House offices for distribution to visitors",
      "Signs for deliveries and forwards all materials delivered to the office to appropriate staff and/or Congresswoman in a timely manner",
      "Orders all office supplies and maintains office equipment",
      "Facilitate constituent commendation process",
      "Manages office recycling program",
      "Reviews and clips relevant articles in newspapers and publications",
      "Assists with receptionist duties as needed",
      "Maintains the office answering machine or voicemail",
      "Ensures that requests for assistance are directed to the appropriate staff member in a timely manner",
      "Documents visitor opinions, including full name, address, and all relevant information",
      "Performs general typing and administrative assignments",
      "Maintains a good working relationship with the Congresswoman, staff, and constituents",
      "Accepts performance-based criticism and direction",
      "Meets attendance requirements as established by the office",
      "Ability to work cooperatively and courteously with others",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Works well under pressure and handles stress",
      "Works a flexible schedule including occasional nights and weekends",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "At least one year of office experience is preferred; administrative training is beneficial.",
      "Ability to use and troubleshoot photocopier, facsimile machine, telephone, and other office equipment",
      "Careful attention to detail",
      "Excellent writing and proofreading skills",
      "Ability to perform essential job functions above",
      "Professional telephone manner",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant and professional manner",
      "Ability to work cooperatively and courteously with others",
      "Knowledge of office policies, practices, and procedures",
      "Knowledge of office computer applications including Microsoft Office",
      "Proficiency in word processing"
    ],
    "how_to_apply": "Please e-mail your resume and cover letter to NC04Resume@mail.house.gov and list “Name – District Office Staff Assistant” in the subject line.",
    "salary_info": null,
    "contact": "NC04Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-098-24",
    "position_title": "Outreach Coordinator",
    "office": "Congresswoman Valerie Foushee",
    "location": "District Office",
    "posting_date": "2024-03-25",
    "description": "Congresswoman Valerie Foushee seeks a creative and motivated Outreach Coordinator in her District Office to implement a strong constituency-based outreach program.\n\nThe Outreach Coordinator monitors and updates the Congresswoman and District Director on district and local issues. This role is responsible for seeking opportunities for the Congresswoman and the office to maintain an active presence within the community. This position will help build and maintain relationships with key stakeholders and work to address local issues on the federal level.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman within their area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies",
      "Informs the Congresswoman and the District Director of all happenings in their assigned issue areas by screening district media sources and interacting with constituents",
      "Acts as a liaison to local, state and federal officials and other persons or groups to form effective relationships for the Congresswoman",
      "Monitors scheduled district meetings for the Congresswoman with constituents",
      "Prepares periodic reports for the District Director on district activities in assigned issue areas",
      "Maintains a good working relationship with the Congresswoman, staff, and constituents",
      "Works well under pressure and handles stress",
      "Works a flexible schedule including some nights and weekends",
      "Performs other duties as assigned"
    ],
    "qualifications": [
      "Prior experience working for an elected official or prior experience managing staff, volunteers, or interns on a campaign or organization.",
      "Strong written and oral communications skills and the ability to work effectively in a fast-paced environment",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant and professional manner",
      "Excellent organizational skills and careful attention to detail",
      "Ability to think strategically and creatively",
      "Knowledge of issues and events in the district in which the Congresswoman has been involved as well as a good understanding of federal-level policy work",
      "Understanding of the federal legislative process as well as federal agencies and departments",
      "Ability to work cooperatively and courteously with others",
      "Valid driver’s license and access to a car",
      "Willingness to work evenings, weekends."
    ],
    "how_to_apply": "Please e-mail your resume and cover letter to NC04Resume@mail.house.gov and list “Name – Outreach Assistant” in the subject line.",
    "salary_info": null,
    "contact": "NC04Resume@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-094-24",
    "position_title": "Legislative Director",
    "office": "House GOP Appropriator",
    "location": "Capitol Hill",
    "posting_date": "2024-03-25",
    "description": "House GOP Appropriator seeks an experienced Legislative Director with at least 3 years of Capitol Hill experience to manage various portfolios and oversee committee activity.",
    "responsibilities": [],
    "qualifications": [
      "At least 3 years of Capitol Hill experience"
    ],
    "how_to_apply": "Resumes can be sent to housegopemployment@gmail.com",
    "salary_info": null,
    "contact": "housegopemployment@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-091-24",
    "position_title": "Staff Assistant",
    "office": "Senior Democratic Member",
    "location": null,
    "posting_date": "2024-03-25",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized, and professional individual to serve in the role of Staff Assistant.\n\nThe successful applicant will be personable, organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.\n\nDaily tasks include answering phones, processing incoming correspondence, assisting with constituent requests for information, coordinating tours, and other administrative duties supporting the Member and staff as needed. We are especially interested in talking with tech savvy individuals familiar with Apple products, Zoom, Outlook and WebEx.",
    "responsibilities": [
      "Answering phones",
      "Processing incoming correspondence",
      "Assisting with constituent requests for information",
      "Coordinating tours",
      "Other administrative duties supporting the Member and staff as needed"
    ],
    "qualifications": [
      "Personable",
      "Organized",
      "Excellent communication skills",
      "Excellent time-management skills",
      "Ability to exercise sound, independent judgment",
      "Ability to work cooperatively and courteously with others",
      "Tech savvy individuals familiar with Apple products, Zoom, Outlook and WebEx"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to staffassist24@yahoo.com. No walk-in applicants or phone calls, please.",
    "salary_info": null,
    "contact": "staffassist24@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-090-24",
    "position_title": "Legislative Correspondent",
    "office": "Senior Democratic Member",
    "location": null,
    "posting_date": "2024-03-25",
    "description": "Senior Democratic Member is seeking an enthusiastic, well organized and professional individual to serve as Legislative Correspondent. The successful applicant will be well-organized, possess excellent writing skills, be able to operate and maintain sophisticated databases, and produce quality mail and email lists.\n\nThis individual will help manage the constituent communications program, including monitoring the flow of incoming and outgoing correspondence, keeping the constituent database current, responding to constituent correspondence, and working with legislative and communications staff to maintain a proactive constituent outreach program.",
    "responsibilities": [
      "Manage the constituent communications program",
      "Monitor the flow of incoming and outgoing correspondence",
      "Keep the constituent database current",
      "Respond to constituent correspondence",
      "Work with legislative and communications staff to maintain a proactive constituent outreach program"
    ],
    "qualifications": [
      "Well-organized",
      "Excellent writing skills",
      "Able to operate and maintain sophisticated databases",
      "Produce quality mail and email lists"
    ],
    "how_to_apply": "To apply, please send a resume and a cover letter to legcor24@yahoo.com. No walk-in applicants or phone interviews.",
    "salary_info": null,
    "contact": "legcor24@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-086-24",
    "position_title": "Communications Director",
    "office": "Office of Congressman Jake Auchincloss (MA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2024-03-25",
    "description": "The Office of Congressman Jake Auchincloss (MA-04), a member of the Transportation & Infrastructure Committee and the Select Committee on China, seeks an experienced Communications Director to join his Washington, D.C. office. The position requires some travel to the district to support media relations and press events.\n\nThe Communications Director serves as the Member’s primary communications and media strategist. They work closely with the Chief of Staff, Legislative Director, and District Director to develop and execute a coordinated plan to inform the media on issues that are important to the Member and oversee day-to-day press operations. The Communications Director also manages and oversees the office’s communication team (e.g., Press Assistant).\n\nThe Communications Director will be responsible for developing and executing an ambitious communications strategy to maximize the Member’s visibility nationally and in the district; drafting press releases, statements, speeches, and talking points; maintaining relationships and booking interviews with national and local press outlets; pitching stories and responding to reporter inquiries; assisting with social media; and other duties as assigned.\n\nThis is not an entry-level position. Candidates should have previous communications experience, possess exceptional writing skills, experience writing in the voice of a principal, and experience working across all media, directly with local and national reporters, bookers, and other members of the media to proactively pitch stories and respond to inquiries. Candidates should be detail-oriented and highly motivated to serve on an active team.",
    "responsibilities": [
      "Partners with the Member and leadership team to develop and implement media and communications strategies",
      "Identifies national and local opportunities to promote the Member’s policies and priorities",
      "Monitors local, national, and digital media coverage to measure the overall effectiveness of the Member’s communications strategy and messaging",
      "Pitches reporters while also fielding and responding to press inquiries at the local and national levels",
      "Drafts talking points, floor statements, op-eds, press releases, media advisories, Congressional Record statements, and speeches to develop comprehensive communications for the Member",
      "Prepares the Member for media interviews, press conferences, public events, roundtables, and other speaking engagements",
      "Acts as the spokesperson (on the record, on background, and off the record) to serve as a formal representative for the Member",
      "Builds and maintains strong relationships with local and national reporters (including Capitol Hill reporters, local reporters, and issue-specific reporters at national outlets), editors, columnists, producers, bookers, and advocacy groups to maintain connections and coordinate events with the media",
      "Coordinates with external parties to execute successful national press events",
      "Organizes workload to prioritize tasks in accordance with varying deadlines and ensure work is completed in an efficient and effective manner",
      "Understands differing perspectives and opinions to navigate conflicts and develop solutions effectively",
      "Oversees the work of the office's communication team staff, including the biweekly newsletter process",
      "Coordinates the franked/paid communications process end-to-end, works with the Chief of Staff to develop plan and budget"
    ],
    "qualifications": [
      "Strategic Thinking: Able to identify and articulate long-term objectives and develop clear messaging and specific action steps across all media channels to achieve team’s goals",
      "Attention to Detail: Performs work thoroughly and accurately; acts conscientiously when attending to detail.",
      "Decision Making: Makes sound, well-informed, and objective decisions; perceives the impact and implications of decisions. Commits to action to accomplish organizational goals. Maintains appropriate levels of confidentiality.",
      "Media Relations: Works with various media outlets to effectively provide information on the Member’s objectives and activities.",
      "Verbal Communication: Makes clear and convincing oral presentations that are appropriate to listeners and situations. Listens effectively, attends to nonverbal cues, and responds appropriately.",
      "Written Communication: Writes in a clear, concise, organized, and convincing manner for the intended audience."
    ],
    "how_to_apply": "To apply, send via email a single PDF with a resume, writing sample, and 2 on the record examples to AuchinclossJobs@mail.house.gov with the following subject line: “Full Name – Communications Director.” Applications will be accepted on a rolling basis.",
    "salary_info": "$95,000 - $105,000",
    "contact": "AuchinclossJobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status), national origin, age, disability, gender identity, sexual orientation, or any other characteristic protected by applicable law. Our office encourages candidates of diverse backgrounds to apply."
  },
  {
    "id": "MEM-085-24",
    "position_title": "Staff Assistant",
    "office": "Rep. French Hill (AR02)",
    "location": "Washington D.C.",
    "posting_date": "2024-03-25",
    "description": "Primary responsibilities include, but are not limited to, answering phones, processing mail, greeting visitors, processing flag and tour requests, supporting the staff's day to day activities, various office management tasks, and assisting with long-term projects.\n\nArkansas ties are preferred.",
    "responsibilities": [
      "Answering phones",
      "Processing mail",
      "Greeting visitors",
      "Processing flag and tour requests",
      "Supporting the staff's day to day activities",
      "Various office management tasks",
      "Assisting with long-term projects"
    ],
    "qualifications": [
      "clear communication skills for verbal and written correspondence",
      "a professional demeanor and a positive disposition while interacting with visitors",
      "ability to creatively problems solve in a fast-paced environment",
      "time management skills including the ability to prioritize, and track work status"
    ],
    "how_to_apply": "Applicants should send their resume and cover letter to AR02.Applications@mail.house.gov, with the subject line 'Staff Assistant'.",
    "salary_info": null,
    "contact": "AR02.Applications@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-070-24",
    "position_title": "Staff Assistant",
    "office": "Congressman Greg Casar (D-TX35)",
    "location": "Washington DC",
    "posting_date": "2024-03-25",
    "description": "This person will be responsible for managing front office operations, answering telephone calls and emails, processing mail, tracking and maintaining office supplies and equipment, co-supervising interns, and assisting with staffing events and meetings, among other tasks. This person will provide support to the district office in responding to constituent needs.\n\nThis person will also serve as the office tour coordinator and will be responsible for managing constituent requests for Capitol and White House tours, as well as constituent requests for flags.",
    "responsibilities": [
      "Managing front office operations",
      "Answering telephone calls and emails",
      "Processing mail",
      "Tracking and maintaining office supplies and equipment",
      "Co-supervising interns",
      "Assisting with staffing events and meetings",
      "Serving as the office tour coordinator",
      "Managing constituent requests for Capitol and White House tours",
      "Managing constituent requests for flags"
    ],
    "qualifications": [
      "Strong organizational, time management, project management, and interpersonal skills.",
      "Familiarity with the federal government is preferred.",
      "Ties to the District, Texas, and Spanish language fluency are preferred but not required."
    ],
    "how_to_apply": "Interested applicants should submit the required documentation below.\nApplications will be accepted on a rolling basis and the first round of interviews will begin on February 26. Due to the volume of applications, we will only contact applicants whose applications move forward to the interview phase.\nPlease no calls, direct emails, or walk-ins:\n1.Fill out an application via the link: https://airtable.com/apppdXuCnxKM0TqUY/pagYymcukVNglJush/form\n2.In the application link, submit one combined PDF of a cover letter, resume, contact information of 2 references, and a one-page writing sample that describes “Why do you want to work for Congressman Greg Casar? What experiences translate to the roles and needs of the office?”",
    "salary_info": "$55,000",
    "contact": null,
    "equal_opportunity": "The Office of Congressman Greg Casar is an equal opportunity employer; we do not discriminate based on race, color, religion, sex, gender identity or expression, national origin, age, disability, military status, parental status, marital status, sexual orientation, or any other factor or basis prohibited by applicable."
  },
  {
    "id": "MEM-546-23",
    "position_title": "Member Services Director, Congressional Black Caucus (CBC)",
    "office": "Congressional Black Caucus (CBC)",
    "location": null,
    "posting_date": "2024-03-25",
    "description": "The Congressional Black Caucus (CBC) seeks a Member Services Director who\nis exceptionally motivated, dynamic, strategic, and detail-oriented to engage with\nCBC Member offices and outside partners to advance a robust member services\nportfolio.\n\nThe Member Services Director will be expected to proactively build strong\nrelationships across CBC Member offices and develop strategic opportunities for\nMember engagement advancing shared priorities. The individual will also be\nexpected to coordinate with CBC staff to field and respond to inquiries and\nrequests for support from Member offices and respond to and share external\nopportunities for Member engagement as they arise.\n\nThe Member Services Director is also responsible for assisting in overseeing all\naspects of caucus operations, logistics, designated administrative responsibilities\nand to support caucus leadership.",
    "responsibilities": [
      "Conducting regular outreach to Member offices to build relationships with staff, share opportunities for Member or staff participation in events, messaging, and other efforts, and identify new ideas for collaboration with Member offices",
      "Sharing resources with Member offices and working with CBC, congressional, and external staff to develop high-quality materials for Member office use",
      "Drafting regular newsletters for Member offices with relevant updates and opportunities, as well as for external audiences to uplift Member engagement on CBC issues",
      "Developing a network of external partners working on issues relevant to the CBC and Member offices",
      "Maintaining staff contact information and distribution lists",
      "Provides orientation and training for new staff;",
      "Assists departing employees with necessary administrative procedures (i.e., returning keys, House I.D. cards, and other office property; obtaining forwarding addresses, work files, and records);",
      "Supervises the mail operations and the administrative files and personnel records;",
      "Assists staff in scheduling House or Capitol rooms for outside group functions;",
      "Organize and facilitate meetings and other strategic convenings to support institutional",
      "change, policies, and programmatic work;",
      "Oversees operations for CBC including organizing weekly meetings and events",
      "Provides logistical support for all programming",
      "Works with the CBC personal office staffs and coordinates with the CBC Schedulers to implement the Caucus’ priorities",
      "Builds and maintains databases of internal and external stakeholders"
    ],
    "qualifications": [
      "Qualified candidates must have an understanding of CBC policy priorities and familiarity working with the African American community.",
      "Outstanding writing and communication skills, sound political judgment, and the ability to work closely and collaboratively with multiple Member offices and key stakeholders are essential.",
      "Top candidates should also be detail-oriented and possess the ability to multi-task, work well in a fast-paced setting, and act as a team player.",
      "Candidates should have a demonstrated understanding of House and Senate legislative processes."
    ],
    "how_to_apply": "To apply, please send a cover letter, resume to vincent.evans@mail.house.gov.\nNo walk-ins or calls please.",
    "salary_info": null,
    "contact": "vincent.evans@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-451-23",
    "position_title": "Legislative Director/Counsel",
    "office": "Office of the Rep. Maxine Waters (D-CA-43), Ranking Member of the House Committee on Financial Services (FSC)",
    "location": "Capitol Hill",
    "posting_date": "2024-03-25",
    "description": "The Office of the Rep. Maxine Waters (D-CA-43) the Ranking Member of the House Committee on Financial Services (FSC), has an immediate need for an experienced policy professional and manager to be the Member’s Legislative Director/Counsel.\n\nThe Legislative Director will focus on the Member’s non-FSC policy priorities including civil rights issues. Working closely with the Chief of Staff and Communications Director the Legislative Director will aim to ensure the Member’s strategic legislative vision is implemented. This is not an entry-level position. The ideal candidate will have significant previous experience working in legislative roles on Capitol Hill.",
    "responsibilities": [
      "Ensures legislative staff focuses on Member’s policy goals.",
      "Proposes policy positions and formulate legislative solutions.",
      "Recommends strategies and tactics on advancing Member’s legislative priorities.",
      "Handles short-term and long-term legislative planning for the Member.",
      "Manages direction of legislative team.",
      "Monitors and reports floor action to the Member and the Chief of Staff.",
      "Writes and reviews legislative memos.",
      "Works with legislative team to develop vote recommendations.",
      "Coordinates responses to legislative mail.",
      "Communicates and strategizes with the District Director and/or district office staff on policy initiatives targeted towards constituents.",
      "Maintains up-to-date status reports on all legislation affecting the district, legislation sponsored by the Member, legislation on which the Member is an original, lead cosponsor, and legislation on which the Member is a cosponsor.",
      "Oversees activities in the office in the absence of the Chief of Staff.",
      "Performs other duties as assigned."
    ],
    "qualifications": [
      "Juris Doctor degree required.",
      "Ability to work in face-paced environment with high-profile Member.",
      "Prior experience as a Legislative Director or Senior Legislative Assistant strongly preferred.",
      "3 – 6 years of Capitol Hill experience strongly preferred.",
      "At least 2 years of management experience.",
      "Thorough understanding of the legislative process",
      "Expertise and/or experience in judiciary related issues, e.g., civil rights, women’s rights, gun policy, constitutional law, etc., and foreign affairs strongly preferred.",
      "Strong leadership and organizational skills.",
      "Strong time management skills.",
      "Excellent oral and written communication skills.",
      "Managing complex, multi-stakeholder initiatives and driving collaborative processes.",
      "Availability to work long hours.",
      "Flexible and adaptable to a variety of personalities and situations.",
      "Familiarity with California and/or district 43 preferred but not required."
    ],
    "how_to_apply": "Interested candidates should submit a resume, cover letter and at least 2 references to stephanie.moore@mail.house.gov with “Legislative Director/Counsel” in the subject line. This position will remain open until filled. Incomplete applications may not be considered.",
    "salary_info": "Commensurate with experience.",
    "contact": "stephanie.moore@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and will consider all applicants without regard to race, color, religion, sex, marital or parental status, sexual orientation, gender identity, national origin, disability or national origin."
  }
]