[
  {
    "id": "MEM-455-22",
    "position_title": "Staff Assistant",
    "office": "Southern California Democratic Office",
    "location": "Capitol Hill",
    "posting_date": "2022-08-29",
    "description": "Southern California Democratic Office seeks Staff Assistant to join front office team.\nCandidates should be well-organized, hard-working, and detail-oriented. High degree of professionalism required, as well as an ability to work a flexible schedule, including long hours. Duties include answering telephone calls, greeting visitors, supervising interns, assisting legislative staff, and driving the Member.",
    "responsibilities": [
      "Answering telephone calls",
      "Greeting visitors",
      "Supervising interns",
      "Assisting legislative staff",
      "Driving the Member"
    ],
    "qualifications": [
      "Capitol Hill experience and California ties preferred.",
      "Spanish language skills a plus.",
      "MUST have a reliable and safe vehicle and driving record."
    ],
    "how_to_apply": "Email cover letter, resume, and references to: ryan.viessman@mail.house.gov with subject heading \"Staff Assistant Position.\"\nPlease no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ryan.viessman@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-452-22",
    "position_title": "Congressional Aide",
    "office": "The Office of Congresswoman Dina Titus (NV-01)",
    "location": "Las Vegas Nevada",
    "posting_date": "2022-08-29",
    "description": "ABOUT US: Congresswoman Dina Titus (NV-01) seeks a highly motivated fulltime Congressional Aide for the district office in Las Vegas Nevada.\n\nTHE OPPORTUNITY: This position acts as a liaison to federal, state, and local municipal agencies on behalf of the Congresswoman and constituents. The position can also entail casework correspondence and verbal communications. The ideal candidate is mission-driven, passionate, and excited about serving the people of Nevada's 1st Congressional District. This person must deeply understand the landscape of the district, its critical stakeholders and be able to act as the Congresswoman’s representative. Portfolios and areas of focus may change depending on the candidate.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman in the Las Vegas office, which can include but is not limited to answering casework correspondence, meeting with constituents and stakeholders, and serving as a liaison with federal, state, and local municipal agencies.",
      "Informs the District Director and the Director of Constituent Services of all happenings in the assigned regions by screening district media sources and interacting with constituents and community organizations.",
      "Has a deep understanding of casework issues and can administer effective intergovernmental solutions.",
      "Assesses casework for problems that require legislative action and makes recommendations.",
      "Prepares periodic reports for the District Director and Director of Constituent Services on pending cases and district activities."
    ],
    "qualifications": [
      "Strong oral and written communication skills.",
      "Thorough knowledge of Southern Nevada.",
      "A valid driver’s license, reliable transportation and appropriate automobile insurance.",
      "Service-oriented attitude, strong organizational skills, proficiency at prioritizing and managing multiple projects at one time",
      "A capacity to work both independently and as part of a team",
      "Thorough knowledge of local, state, and federal agencies and departments.",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to exercise discretion and independent judgment in fulfillment of casework responsibilities.",
      "Prior experience in government, the non-profit sector, community or grassroots organizing is preferred",
      "Spanish language fluency, orally and written, a plus."
    ],
    "how_to_apply": "To apply, please email a cover letter and resume to NV01resumes@gmail.com with the following subject line: [First Name Last Name] - District Representative",
    "salary_info": "This is a salary position and comes with a competitive benefits package that includes health insurance, dental, and can include federal student loan payments.",
    "contact": "NV01resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin. Constituents of the district or those deeply familiar will also be prioritized. No phone calls, faxes, or walk-ins, please."
  },
  {
    "id": "MEM-450-22",
    "position_title": "Senior Legislative Assistant",
    "office": "Senior Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2022-08-29",
    "description": "The ideal candidate will handle a wide range of domestic policy matters.\n\nResponsibilities include monitoring and drafting legislation, representing the Member in meetings/briefings, collaborating with constituent organizations, preparing materials for committee hearings and markups, and other tasks and assignments as needed.\n\nThe Legislative Assistant will possess excellent writing and communication skills, a solid understanding of the legislative process, and a proven ability to work effectively in a fast-paced office. Press and communications experience is also a plus, but not required.",
    "responsibilities": [
      "monitoring and drafting legislation",
      "representing the Member in meetings/briefings",
      "collaborating with constituent organizations",
      "preparing materials for committee hearings and markups",
      "other tasks and assignments as needed"
    ],
    "qualifications": [
      "excellent writing and communication skills",
      "a solid understanding of the legislative process",
      "a proven ability to work effectively in a fast-paced office",
      "Press and communications experience is also a plus, but not required."
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to hillleg24@gmail.com",
    "salary_info": null,
    "contact": "hillleg24@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-449-22",
    "position_title": "Legislative Counsel",
    "office": "Democratic House Member's personal office",
    "location": "Capitol Hill",
    "posting_date": "2022-08-29",
    "description": "Democratic House Member seeks a Legislative Counsel for the Member's personal office to staff a portfolio of domestic policy issues and to provide the Member and other staff with advice concerning legal issues impacting legislative efforts and compliance with ethic rules.\n\nThe ideal applicant will have a law degree, bar membership and a strong policy background. Previous Capitol Hill legislative experience strongly preferred. The position requires clear, concise legal analysis as well as the political acumen to work closely and collaboratively with constituent, labor and public interest organizations.",
    "responsibilities": [],
    "qualifications": [
      "Law degree",
      "Bar membership",
      "Strong policy background",
      "Previous Capitol Hill legislative experience strongly preferred",
      "Clear, concise legal analysis skills",
      "Political acumen to work closely and collaboratively with constituent, labor and public interest organizations"
    ],
    "how_to_apply": "Applicants should send a resume and cover letter to hillleg2022@yahoo.com",
    "salary_info": null,
    "contact": "hillleg2022@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-447-22",
    "position_title": "Legislative Correspondent",
    "office": "Midwestern Republican office",
    "location": "Capitol Hill",
    "posting_date": "2022-08-29",
    "description": "Midwestern Republican office is seeking a Legislative Correspondent to handle\nthe constituent correspondence portfolio. This position is responsible for\ncommunicating with and responding to constituents, working with staff to stay\nupdated on legislative activity, and being current on in-district and policy matters.",
    "responsibilities": [
      "Sorting and Batching constituent mail",
      "Corresponding with constituents who contact the office through phone calls, letters, and email responses",
      "Writing constituent response letters/emails/etc",
      "Managing/Updating letter library",
      "Keeping up to date on floor proceedings",
      "Consulting with legislative staff to ensure constituent responses are up to date",
      "Providing support to legislative staff as needed"
    ],
    "qualifications": [
      "Capitol Hill experience",
      "Strong written and verbal communications skills",
      "Ability to meet deadlines and work independently",
      "Can balance multiple projects simultaneously",
      "Ability to conduct policy research",
      "Basic knowledge of House floor proceedings and the legislative process"
    ],
    "how_to_apply": "Interested candidates should submit resume and 2 writing samples to house.gopjob2021@gmail.com with 'Legislative Correspondent Position' in the subject line.",
    "salary_info": null,
    "contact": "house.gopjob2021@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-443-22",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Senior Democratic Appropriator",
    "location": "DC",
    "posting_date": "2022-08-29",
    "description": "Senior Democratic Appropriator seeks a Staff Assistant/Legislative Correspondent in her DC office. The ideal candidate is organized, detail oriented, able to multitask effectively in a fast-paced environment and has strong interpersonal skills.\n\nThe position also includes responsibility for office correspondence management and assisting legislative staff to draft constituent correspondence and other duties as needs arise in this fast-paced office.",
    "responsibilities": [
      "Tasks associated with front office such as receptionist duties, answering phones, greeting visitors, sorting mail, processing flag requests, booking and coordinating tours, and assisting with the office's internship program."
    ],
    "qualifications": [
      "Must possess excellent written and oral communication skills, attention to detail, professionalism, exceptional time management skills, and an ability to work collaboratively, and flexibility in assisting with daily tasks and projects.",
      "Ohio ties a plus, but not a requirement."
    ],
    "how_to_apply": "To apply, send a cover letter, resume, 2 writing samples to midwestern.resume@mail.house.gov with “STAFF ASSISTANT / LEGISLATIVE CORRESPONDENT” in the subject line. The deadline for submission is Wednesday August 31st.",
    "salary_info": null,
    "contact": "midwestern.resume@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate based on race, color, religion, sex, national origin, age, disability, gender identity, or expression, or sexual orientation."
  },
  {
    "id": "MEM-442-22",
    "position_title": "Caseworker",
    "office": "Congressman Jimmy Gomez",
    "location": "Los Angeles, CA",
    "posting_date": "2022-08-29",
    "description": "Congressman Jimmy Gomez, a California member of the Ways and Means Committee, seeks an organized, detail-oriented individual to serve in the position of Caseworker in his fast-paced and highly collaborative Los Angeles office. The selected candidate will work closely with the District Director and Director of Casework Services. Good judgment, strong customer service skills, a passion for public service and availability to work some evenings and weekends are required. Candidates should have excellent oral and written communication skills, the capacity to exercise discretion and independent judgment with minimal supervision, great attention to detail, strong time management skills, an ability to work under pressure to meet tight deadlines, and strong interpersonal skills. Fluency in Spanish is preferred but not required.",
    "responsibilities": [],
    "qualifications": [
      "Good judgment",
      "Strong customer service skills",
      "A passion for public service",
      "Availability to work some evenings and weekends",
      "Excellent oral and written communication skills",
      "The capacity to exercise discretion and independent judgment with minimal supervision",
      "Great attention to detail",
      "Strong time management skills",
      "Ability to work under pressure to meet tight deadlines",
      "Strong interpersonal skills",
      "Fluency in Spanish is preferred but not required"
    ],
    "how_to_apply": "Candidates should submit a cover letter, resume, and three writing samples in a PDF format to Gomez.Jobs@mail.house.gov with the subject line “Last Name _ Caseworker” by Thursday, September 15, 2022.",
    "salary_info": "Salary is commensurate with experience. The minimum starting salary for this position is $50,000.\nThe Office offers excellent benefits, including employer paid health, dental and vision insurance for employees and their family, Student Loan Repayment Benefits, and employer contributions to retirement savings plan. Paid time off includes, per year: 15 vacation days (increasing to 21 days for individuals with over 3 years of federal employment and 27 for individuals with over 15 years of federal employment), 12 sick days, 5 bereavement days and 12 weeks of paid family and medical leave. The office is closed for 14 holidays.",
    "contact": "Gomez.Jobs@mail.house.gov",
    "equal_opportunity": "The office is firmly committed to ensuring that all employees, interns, detailees, and fellows work in an environment free from discrimination, harassment, or intimidation on the basis of race, color, religion, sex, pregnancy, gender stereotyping, gender identity, sexual orientation, national origin, age (40 or over), disability, military status, genetic information, or any basis prohibited by the Congressional Accountability Act or House Rules."
  },
  {
    "id": "MEM-440-22",
    "position_title": "Legislative Director",
    "office": "Congressman Alma S. Adams, Ph.D.",
    "location": "Washington, DC",
    "posting_date": "2022-08-29",
    "description": "The LD will help drive the proactive legislative agenda for the office, developing and implementing the strategy to push policy priorities and legislative goals; supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio, and manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.\n\nThe LD will work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations. The LD will also help ensure coordination between DC and district offices on important legislative updates and district-based events and projects.\n\nThis is not an entry level position; extensive Hill experience and knowledge of the legislative process are required.",
    "responsibilities": [
      "Drive the proactive legislative agenda for the office.",
      "Develop and implement the strategy to push policy priorities and legislative goals.",
      "Supervise and mentor the legislative staff while advising on the Congresswoman’s legislative portfolio.",
      "Manage their own legislative portfolio, which will include work on the Black Maternal Health Caucus.",
      "Work closely in conjunction with the Chief of Staff and senior leadership team to ensure legislative strategy is incorporated into overall operations.",
      "Help ensure coordination between DC and district offices on important legislative updates and district-based events and projects."
    ],
    "qualifications": [
      "Crisp and thorough written and oral communications skills",
      "An entrepreneurial and self starting attitude",
      "Strong attention to detail",
      "Creativity",
      "Team player",
      "Extensive Hill experience and knowledge of the legislative process are required.",
      "Supervisory experience and expertise on healthcare policy is strongly preferred."
    ],
    "how_to_apply": "Qualified applicants should submit a cover letter, resume, and two writing samples to nc12.resume@mail.house.gov. Candidates from BIPOC, LGBT+, working class, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with North Carolina ties. Due to the volume of applications we receive, we will only contact you if we decide to move forward with your application. Please no calls, direct emails, or walk-ins.",
    "salary_info": null,
    "contact": "nc12.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation."
  },
  {
    "id": "MEM-437-22",
    "position_title": "Staff Assistant",
    "office": "California House Democrat",
    "location": "Washington D.C.",
    "posting_date": "2022-08-29",
    "description": "Ideal candidate will be a motivated self-starter with outstanding customer service, excellent time-management, and strong organizational skills.\n\nPrimary responsibilities include: managing the front office including answering and logging telephone calls; recruiting and managing interns; managing constituent requests for flags and tours; supporting legislative and communications staff; assisting with constituent mail responses and other administrative duties.\n\nIdeal candidates will have relevant experience, excellent oral, written, and interpersonal skills, demonstrate the ability to think on their feet to solve problems, and maintain a positive demeanor in a busy and fast-paced environment.\n\nThis office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply.\n\nCandidates with California ties are preferred but not required.",
    "responsibilities": [
      "managing the front office including answering and logging telephone calls",
      "recruiting and managing interns",
      "managing constituent requests for flags and tours",
      "supporting legislative and communications staff",
      "assisting with constituent mail responses and other administrative duties"
    ],
    "qualifications": [
      "relevant experience",
      "excellent oral, written, and interpersonal skills",
      "demonstrate the ability to think on their feet to solve problems",
      "maintain a positive demeanor in a busy and fast-paced environment"
    ],
    "how_to_apply": "Please submit a resume and cover letter in a single PDF document to ca07jobs@gmail.com with “Staff Assistant - DC” in the subject line. No walk-ins or phone calls.",
    "salary_info": null,
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-434-22",
    "position_title": "Press Secretary",
    "office": "Congresswoman Rashida Tlaib (MI-13)",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-29",
    "description": "The Press Secretary manages and coordinates Washington, D.C. activities, including media contacts for the Member and the D.C. office in consultation with the Communications Director.\n\nThe Press Secretary reports directly to the Communications Director, and acts under the guidance of the of the Communications Director in consultation with the Chief of Staff.\n\nDuties will also include managing social media platform for the office, assisting in briefing the Member for interviews, and writing floor speeches for the Member and collaboration with other office staff.\n\nThis position will often involve evening and weekend work, so a strong candidate will be able to work a flexible schedule with comp time provided. Michigan ties are highly desirable, but not required.",
    "responsibilities": [
      "Remains abreast of current legislative and non-legislative issues about which the Member may be questioned",
      "Together with the Communications Director, evaluates current events and media reports in the district and the nation for their impact on the Member",
      "Maintains a good working relationship with the Member, staff, media, and constituents",
      "Assist with building a robust digital communications apparatus, including social media, multimedia work and a brand strategy",
      "Provide support of communications operations as needed for the member and staff"
    ],
    "qualifications": [
      "Candidates must be proactive, have strong attention to detail, and the ability to multitask effectively in a fast-paced environment",
      "A bachelor's degree in journalism, communications, public relations or a closely related field preferred, but not required, including strong academic credentials; and at least two years of congressional experience. Alternatively, a minimum two of years of related experience or training is required"
    ],
    "how_to_apply": "TO APPLY, e-mail a cover letter and detailed resume to Rashida.jobs@mail.house.gov with “Press Secretary” in the subject line along with a digital portfolio, writing sample, and at least two references.",
    "salary_info": "Starting salary for this position is $58,000.00, with some flexibility based on experience.",
    "contact": "Rashida.jobs@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and women, people of color, members of the LGBTQ+ community, and members of other traditionally underrepresented communities are encouraged to apply."
  },
  {
    "id": "MEM-431-22",
    "position_title": "Staff Assistant",
    "office": "OFFICE of REPRESENTATIVE MIKE LEVIN (CA 49th Congressional District)",
    "location": "Oceanside or Dana Point, CA",
    "posting_date": "2022-08-29",
    "description": "This position is responsible for managing the front desk and all administrative duties of a Congressional district office. The staff member in this role interacts regularly with constituents, responds to correspondence and verbal communications with constituents, and occasionally staffs the Member of Congress. This staff member may be located in the Oceanside or Dana Point office but may be required to travel on occasion to the other office.",
    "responsibilities": [
      "Manages the front desk",
      "Collaborates with other district and Washington, D.C. Staff Assistants to log all incoming mail, telephone calls, and correspondence",
      "Tracks office supplies",
      "Assists with recruiting, interviewing, training, and management of district interns",
      "Oversees production and tracking of certificates and proclamations",
      "Screens phone calls and refers cases, when appropriate, to other district office",
      "Scans and sends invoices to DC office",
      "Maintains records of incoming grants, constituent recognition and thank you letters",
      "Meets attendance requirements as established by the office",
      "Maintains a good working relationship with the Congressman, staff, and constituents",
      "Performs other duties as assigned",
      "Takes initiative to identify needs and takes action to complete tasks required",
      "Knowledge of office policies, practices, and procedures"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Familiarity with local, state, and federal agencies and departments",
      "Familiarity with issues and events in the district in which the Congressman is involved",
      "Proficiency with word processing and spreadsheets",
      "Professional telephone manner",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Ability to perform the essential job functions above",
      "Ability to work cooperatively and courteously with others",
      "Thoroughness and careful attention to detail"
    ],
    "how_to_apply": "Please send resume, cover letter, and three professional references to: CA49.applications@mail.house.gov",
    "salary_info": null,
    "contact": "CA49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-430-22",
    "position_title": "District Representative",
    "office": "Member of Congress",
    "location": "Dana Point",
    "posting_date": "2022-08-29",
    "description": "The staff member in this position acts as a liaison to federal, district,\nand local agencies for the Member of Congress and constituents. The District\nRepresentative is charged with helping constituents with casework and engaging\nthe residents of the 49th Congressional District, including planning meetings and\nevents with the Member of Congress.\n\nThis position is based in Dana Point.",
    "responsibilities": [
      "The person in this role is specifically responsible for building and maintaining relationships with communities in South Orange County, the veteran and military-connected communities throughout CA-49, and more.",
      "This role involves handling constituent casework with various federal agencies, with a focus on the Veterans Affairs Administration and the Department of Defense.",
      "Other responsibilities include planning and staffing in-district events, meetings, and site visits; working closely with the District Office and Washington, DC office staff on local and assigned policy issues and areas; and establishing relationships with local military and veterans groups, including attendance at key meetings and ensuring the office is tracking events and functions to facilitate the Member’s attendance."
    ],
    "qualifications": [
      "Successful applicants should have a thorough knowledge of California’s 49th district, familiarity with the military and veterans communities, a service-oriented attitude, strong organizational skills, proficiency at prioritizing and managing multiple projects at one time, a capacity to work both independently and as part of a team, and strong written and oral communications skills.",
      "Preference may be given to residents of the 49th District.",
      "Veterans and applicants with military connections are encouraged to apply."
    ],
    "how_to_apply": "Please send resume, cover letter, three professional references, and writing sample to ca49.applications@mail.house.gov",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-427-22",
    "position_title": "Legislative Director",
    "office": "Congresswoman Jahana Hayes (CT-05)",
    "location": "Washington, DC",
    "posting_date": "2022-08-29",
    "description": "Congresswoman Jahana Hayes (CT-05) seeks an experienced Legislative Director to oversee the legislative team in the Washington, DC office.\n\nThis is not an entry-level position and significant Capitol Hill experience is required. The Legislative Director will manage a large and diverse portfolio, while creatively and effectively identifying new policy areas to pursue. The ideal candidate will demonstrate an ability to manage and mentor staff, think strategically, and advance legislation and policy initiatives.",
    "responsibilities": [
      "Manage a legislative team of 4-5 staff;",
      "Develop a legislative strategy in close consultation with the Member and Chief of Staff;",
      "Set goals and develop strategic plans to meet those goals;",
      "Consistently monitor Congressional proceedings and develop strategies for best advancing the Member's goals;",
      "Work collaboratively as part of a team to accomplish goals;",
      "In consultation with the communications staff, ensure accomplishments are communicated to constituents and stakeholders in the district."
    ],
    "qualifications": [
      "Excellent verbal and written communication skills;",
      "Ability to concisely communicate in real time and under pressure important and often complex policy issues;",
      "Capability to manage a team of policy professionals and develop communication and analytical skills in that team;",
      "Clear understanding of the legislative process and ability to execute a legislative strategy; and",
      "Excellent organization and time management skills and ability to prioritize tasks."
    ],
    "how_to_apply": "Interested parties should e-mail a concise cover letter including salary requirements, a resume, and two short writing samples (one narrative style and one issue brief) to CT05jobs@mail.house.gov with the following subject line: Full Name – Legislative Director. No phone calls or walk-ins, please.",
    "salary_info": null,
    "contact": "CT05jobs@mail.house.gov",
    "equal_opportunity": "Women and minority candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-425-22",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Republican Conference",
    "location": "Capitol Hill",
    "posting_date": "2022-08-29",
    "description": "A conservative Member of the Republican Conference on an “A“ committee seeks a Legislative Correspondent with strong writing skills.\n\nThe Staff Assistant/Legislative Correspondent will work with the Legislative Director to respond to constituent inquiries and maintain a legislative portfolio while assisting senior staff with various projects. They will serve as the first point of contact for our office, coordinate constituent arrangements including tours and flag requests, and assist the staff with the daily responsibilities and duties of a Congressional office.\n\nThe ideal candidate will be detail-orientated, creative, possess a strong willingness and desire to learn and grow, and have an interest in legislative issues and a strong work ethic.\n\nCapitol Hill experience and Tennessee ties are preferred but not required.",
    "responsibilities": [
      "Work with the Legislative Director to respond to constituent inquiries",
      "Maintain a legislative portfolio",
      "Assist senior staff with various projects",
      "Serve as the first point of contact for our office",
      "Coordinate constituent arrangements including tours and flag requests",
      "Assist the staff with the daily responsibilities and duties of a Congressional office."
    ],
    "qualifications": [
      "Detail-orientated",
      "Creative",
      "Strong willingness and desire to learn and grow",
      "Interest in legislative issues",
      "Strong work ethic",
      "Capitol Hill experience (preferred)",
      "Tennessee ties (preferred)"
    ],
    "how_to_apply": "Interested applicants should submit their resume with the subject line “Staff Assistant/Legislative Correspondent—First Name, Last Name”",
    "salary_info": null,
    "contact": "leah.bane@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-424-22",
    "position_title": "Press Assistant/Digital Director",
    "office": "Republican Conference",
    "location": "Capitol Hill",
    "posting_date": "2022-08-29",
    "description": "A conservative Member of the Republican Conference on an “A” committee is\nexpanding his communications team, and to that end seeks a Press\nAssistant/Digital Director.\n\nThe Press Assistant/Digital Director will report directly to the Communications\nDirector and be responsible for managing and creating digital content for all\nsocial media channels, including graphics and videos, tracking and analyzing\ndaily press clips and weekly social media traffic, maintaining and updating the\npress list monthly, and other communications-centric duties as assigned and as\ntheir experience grows.\n\nThe ideal candidate will be detail-orientated, creative, and have an interest or\nexperience in digital communications and a strong work ethic. This is an\nexcellent opportunity for a current or former Congressional intern (or similar\nposition) or a current or former Staff Assistant interested in pursuing a career in\nCommunications in an office with a growing Communications Department.\n\nCapitol Hill experience and Tennessee ties are preferred but not required.",
    "responsibilities": [
      "managing and creating digital content for all social media channels, including graphics and videos",
      "tracking and analyzing daily press clips and weekly social media traffic",
      "maintaining and updating the press list monthly",
      "other communications-centric duties as assigned"
    ],
    "qualifications": [
      "detail-orientated",
      "creative",
      "interest or experience in digital communications",
      "strong work ethic",
      "Capitol Hill experience and Tennessee ties are preferred but not required"
    ],
    "how_to_apply": "Interested applicants should submit their resume with the subject line “Press Assistant/Digital Director—First Name, Last Name” to dylan.jones@mail.house.gov",
    "salary_info": null,
    "contact": "dylan.jones@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-423-22",
    "position_title": "Scheduler",
    "office": "Congressman Tom McClintock (CA-04)",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-29",
    "description": "The Scheduler will be expected to work closely with the Chief of Staff to coordinate the Member's DC schedule, arrange travel plans, and manage day to day logistics. Additionally, this role will oversee the office's intern program.",
    "responsibilities": [
      "Works with the Member, Chief of Staff, and District Director to determine and finalize the Member's daily and long-term schedule.",
      "Manage all incoming meeting requests and invitations.",
      "Coordinates all travel arrangements.",
      "Process/schedule all incoming tour requests.",
      "Manage the office's internship program."
    ],
    "qualifications": [
      "Able to coordinate and manage several scheduling activities with multiple parties",
      "Able to manage varying priorities and adapt to rapidly changing situations impacting the schedule",
      "Experience handling sensitive information and maintaining confidentiality",
      "Adaptable and organized with a keen attention to detail",
      "Strong decision-making skills and comfortable navigating challenging situations",
      "Works well under pressure"
    ],
    "how_to_apply": "Interested candidates should send resumes and cover letters to gopwesternjobs1776@gmail.com.",
    "salary_info": null,
    "contact": "gopwesternjobs1776@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-421-22",
    "position_title": "Staff Assistant",
    "office": "Congressman Earl Blumenauer",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-29",
    "description": "As staff assistant, this person will provide administrative support to the staff, recruit and manage the office interns, greet visitors, answer phones, and check voicemails, and respond to constituent requests for services including tours and flags. Additionally, they will assist the Legislative Correspondent with their duties.\nThe ideal candidate will be enthusiastic, detail-oriented, an excellent writer, and comfortable in a fast-paced environment.",
    "responsibilities": [
      "Provide administrative support to the staff",
      "Recruit and manage the office interns",
      "Greet visitors",
      "Answer phones and check voicemails",
      "Respond to constituent requests for services including tours and flags",
      "Assist the Legislative Correspondent with their duties"
    ],
    "qualifications": [
      "Enthusiastic",
      "Detail-oriented",
      "Excellent writer",
      "Comfortable in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and writing sample to Resume.Blumenauer@mail.house.gov with “Staff Assistant” in the subject line.",
    "salary_info": "$50,000 - $60,000, depending on experience",
    "contact": "Resume.Blumenauer@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply, as are candidates with Oregon ties."
  },
  {
    "id": "MEM-416-22",
    "position_title": "Legislative Aide",
    "office": "House leadership",
    "location": null,
    "posting_date": "2022-08-29",
    "description": "Senior progressive appropriator and member of House leadership seeks a\nLegislative Aide to help manage constituent casework and manage a small\nlegislative portfolio to include: Fin Serv, Tax and Trade, Veterans, Animals,\nPostal Services and Sports.",
    "responsibilities": [
      "Acts as the representative for the Congresswoman within his or her area of responsibility including answering casework correspondence, meeting with constituents, verbal communications with constituents, and serving as a liaison with federal, district, and local agencies;",
      "Informs the District Director of all happenings in his or her assigned issue areas by screening district media sources and interacting with constituents;",
      "Assesses casework for problems requiring legislative action and makes recommendations to the District Director and Chief of Staff/Legislative Director",
      "Works with the Legislative Director and Chief of Staff to formulate and advance legislative initiatives for assigned issue areas",
      "Tracks legislation and coordinates co-sponsorship of bills for the Member",
      "Provides input to help the Communications Director to draft speeches, press releases, op-eds, and Congressional Record statements for the Member"
    ],
    "qualifications": [
      "Strong progressive values",
      "Experience researching public policy and preparing recommendations for a Member of Congress or other executives/leaders (e.g., Federal department/agency, non-profit organization, private sector)",
      "Strong written and verbal communication skills",
      "Experience making decisions and advising senior leaders on important issues",
      "Comfortable navigating challenging situations and being politically savvy",
      "Prior experience with forming partnerships and advancing legislative priorities for a Member of Congress",
      "Prioritization and time management skills, with the ability to manage multiple projects at a time",
      "Knowledge of issues in portfolio"
    ],
    "how_to_apply": "To apply, send a cover letter, resume and short writing sample\nto lee.resumes@mail.house.gov with “Legislative Aide” in the subject line.",
    "salary_info": null,
    "contact": "lee.resumes@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and\nexpression, national origin, disability, military status, age, marital status, or\nparental status. People of color and people from underrepresented groups are\nstrongly encouraged to apply."
  },
  {
    "id": "MEM-412-22",
    "position_title": "STAFF ASSISTANT",
    "office": "Congressman Matt Cartwright (PA-08)",
    "location": "Capitol Hill",
    "posting_date": "2022-08-29",
    "description": "Staff Assistant for Capitol Hill front desk duties, including answering phones, greeting visitors, recruiting and managing D.C. interns, processing flag and tour requests, and other office-supporting administrative tasks.\nSome communications and constituent correspondence work is also included in the job.",
    "responsibilities": [
      "Answering phones",
      "Greeting visitors",
      "Recruiting and managing D.C. interns",
      "Processing flag and tour requests",
      "Other office-supporting administrative tasks",
      "Communications work",
      "Constituent correspondence"
    ],
    "qualifications": [],
    "how_to_apply": "Candidates should send resume and cover letter to democratic.hilljob@gmail.com.",
    "salary_info": "$45,000",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer committed to building and maintaining an inclusive and diverse work environment. Women, candidates of color, and LGBTQ+ candidates are encouraged to apply."
  },
  {
    "id": "MEM-410-22",
    "position_title": "Digital Media Manager",
    "office": "Congressman Dwight Evans (D-PA-03)",
    "location": "Washington, D.C.",
    "posting_date": "2022-08-29",
    "description": "The primary function of this job will be supporting the Congressman’s communication platforms to ensure his priorities and message extend to as many constituents as possible. This position reports directly to the Congressman’s Communications Director. Candidates must have strong writing and digital media skills, be highly organized, energetic, and be capable of thriving in a fast-paced and rapidly changing environment. The ability to meet deadlines is a must. Proficiency with social media tools and standard Microsoft Office and Adobe software tools is required. District knowledge and familiarity is preferred.",
    "responsibilities": [
      "Drafting daily social media content on all of the Congressman’s official platforms",
      "Creating graphics",
      "Editing videos",
      "Sending daily news clips",
      "Drafting op-eds on a variety of issues and e-newsletters",
      "Working with district staff to produce regular virtual and tele-town hall meetings",
      "Coordinating the draft of the Congressman’s annual State of the District report",
      "Consistently monitoring and updating the Congressman’s website"
    ],
    "qualifications": [
      "Strong writing and digital media skills",
      "Highly organized and energetic",
      "Capable of thriving in a fast-paced and rapidly changing environment",
      "Ability to meet deadlines",
      "Proficiency with social media tools and standard Microsoft Office and Adobe software tools",
      "District knowledge and familiarity is preferred"
    ],
    "how_to_apply": "Qualified candidates should send a cover letter, resume and three examples of your work, including at least one writing sample to PA03.Resumes@mail.house.gov.",
    "salary_info": null,
    "contact": "PA03.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-409-22",
    "position_title": "Outreach Manager",
    "office": "U.S. House of Representatives",
    "location": "District",
    "posting_date": "2022-08-29",
    "description": "The Outreach Manager monitors and updates the Member and District Director on district and local issues in respective region. This position is responsible for overseeing and executing outreach activities that maintain and strengthen relationships between the Member and community leaders, constituents and organizations as well as helping constituents navigate the services and assistance with the federal government. This position assists with office operations, constituent casework, participates in community projects and events, and actively works to implement the outreach throughout the region. This position reports directly to the District Director.",
    "responsibilities": [
      "Serve as eyes and ears of the Congresswoman in the respective region of District",
      "Identify, develop and maintain relationships with key stakeholders and constituency groups.",
      "Create and maintain contact list of community and constituency group leaders for assigned outreach issue areas;",
      "Recommend strategic outreach planning and the development resulting from Congresswoman’s legislative agenda and priorities",
      "Engage constituent groups and their leadership to identify public policy problems & discuss legislative objectives and foster collaboration through advanced outreach;",
      "Develop forward looking events, town hall meetings and discussions to convey the office message and engage local residents.",
      "Attend related meetings and events to listen & learn from constituents and to communicate the status of specific legislation and Congresswoman’s priorities;",
      "Responsible for the general administrative operations",
      "Respond and triage constituent calls and mail; respond to walk-in constituents, stakeholders, etc.",
      "Casework Issues:",
      "Prepare certificates, proclamations, etc. for local and regional entities in coordination with staff assistant",
      "Compose letters of support as requested by various stakeholders, recognize constituents for their achievements in the community as well as thank you and follow up notes for meetings/events in region",
      "Identify casework of significant public interest and assess casework for problems that may require legislative action and make recommendations to District Director, Deputy District Director and Senior Casework Liaison.",
      "Assist constituents and businesses who have issues or problems interacting with the Federal government and act as a liaison to federal agencies.",
      "Work in coordination with the Scheduler and District Director to strategically plan events and activities",
      "Represent and staff the Congresswoman at meetings/events with advocates / businesses / organizations / constituents",
      "Prepare Congresswoman for district meeting/events",
      "Provide information on upcoming events by scanning newspapers, city/town websites, social media, chamber emails, etc.",
      "Assist in planning and executing events as well as advancing events",
      "Work with Communications Team to help publicize major district events in the region",
      "Recommend and help prepare Congresswoman for press opportunities pertaining to local issues in region",
      "Drive the Congresswoman to meetings/events when appropriate.",
      "Other related duties as required"
    ],
    "qualifications": [
      "Bachelor’s degree in a related field (may be substituted for two or more years of related experience)",
      "Strong organizational, research, writing and communication skills",
      "At least a basic knowledge of legislative process;",
      "Thorough knowledge of local, state and federal agencies and departments;",
      "Relationships with key stakeholders and knowledge of district issues and events in the district;",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
      "Ability to work cooperatively and courteously with others;",
      "Thoroughness and careful attention to detail;",
      "Ability to exercise discretion and independent judgment in fulfillment of casework and outreach responsibilities;",
      "Knowledge of office computer applications; and proficiency in word processing."
    ],
    "how_to_apply": "Interested applicants should send a resume and cover letter to raul.martinez@mail.house.gov",
    "salary_info": null,
    "contact": "raul.martinez@mail.house.gov",
    "equal_opportunity": null
  }
]