[
  {
    "id": "MEM-168-16",
    "position_title": "Scheduler",
    "office": "California Democrat",
    "location": "DC and district",
    "posting_date": "2016-06-13",
    "description": "California Democrat is seeking an exceptionally organized and hard-working scheduler to develop and maintain Member’s DC and district schedule.\nThis is not an entry level position and previous scheduling experience is preferred.",
    "responsibilities": [
      "planning domestic and international travel logistics",
      "assisting with the Member’s personal correspondence",
      "maintaining office records",
      "other projects as assigned by the Member and/or Chief of Staff"
    ],
    "qualifications": [
      "excellent attention to detail while working in a fast-paced environment",
      "exhibit good judgement",
      "have a positive attitude",
      "work well in a team environment",
      "previous scheduling experience is preferred"
    ],
    "how_to_apply": "Interested applicants should submit a cover letter and resume to ca07jobs@gmail.com.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ca07jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-167-16",
    "position_title": "Communications Director",
    "office": null,
    "location": null,
    "posting_date": "2016-06-13",
    "description": "Seeking a Communications Director to develop and implement aggressive communications strategy with local and national media. Ideal applicant is a quick and clean writer, detail-oriented, able to juggle numerous tasks successfully and best under tight deadlines. Responsibilities include writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters; coordinating interviews with reporters, setting up press events and press conferences, developing relationships with the media; implementing district outreach activities (as it relates to press); responding to media inquiries and coordinating the office’s online and social media operations. Requires strong written and oral communication skills, creativity, and the ability to work well with legislative and district office staff. An ideal candidate will possess a minimum of 3-5 years of communications experience, a demonstrated understanding of federal politics and policy and a desire to work in a fast-paced and fluid environment. Bilingual a plus. Valid driver’s license desired. Availability for Evening and Weekend assignments is required.",
    "responsibilities": [
      "Writing press releases, speeches, op-eds, talking points, franked mail pieces and newsletters",
      "Coordinating interviews with reporters, setting up press events and press conferences",
      "Developing relationships with the media",
      "Implementing district outreach activities (as it relates to press)",
      "Responding to media inquiries",
      "Coordinating the office’s online and social media operations"
    ],
    "qualifications": [
      "Strong written and oral communication skills",
      "Creativity",
      "Ability to work well with legislative and district office staff",
      "Minimum of 3-5 years of communications experience",
      "Demonstrated understanding of federal politics and policy",
      "Desire to work in a fast-paced and fluid environment",
      "Bilingual a plus",
      "Valid driver’s license desired",
      "Availability for Evening and Weekend assignments is required"
    ],
    "how_to_apply": "Qualified applicants should send a cover letter, resume and three writing samples to ResumeNY@mail.house.gov. Please be sure to put COMMUNICATIONS DIRECTOR in the subject line. PLEASE NO WALK-INS OR PHONE CALLS.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-166-16",
    "position_title": "District Scheduler / Office Manager",
    "office": "Bay Area legislative office",
    "location": "California",
    "posting_date": "2016-06-13",
    "description": "Responsibilities include coordinating the legislator’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments; serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district; coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans; working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters. Also responsible for assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties. Opportunities for additional responsibilities commensurate with skills and abilities.",
    "responsibilities": [
      "Coordinating the legislator’s California schedule by making travel and meeting arrangements while anticipating and responding to day-to-day developments",
      "Serving as the office's primary point of contact for constituents, elected officials, and nonprofit and advocacy organizations seeking meetings in the district",
      "Coordinating with staff (including field, legislative, press, and campaign) to identify schedule priorities, and then working proactively to make short- and long-term decisions to implement plans",
      "Working directly with the district director, the legislator, and his family, on logistics for work, travel, and personal matters",
      "Assisting the Capitol office and District Director on maintaining financial and expense records, and with various administrative duties"
    ],
    "qualifications": [
      "Highly organized",
      "Detail oriented",
      "Possess strong writing skills",
      "Have experience working in a fast-paced office",
      "Ability to maintain a professional, flexible, and cheerful demeanor while managing multiple and competing tasks and projects"
    ],
    "how_to_apply": "Please send cover letter and resume to CA02.Requests@mail.house.gov.",
    "salary_info": null,
    "contact": "CA02.Requests@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-164-16",
    "position_title": "Legislative Assistant",
    "office": "House Veterans' Affairs Committee",
    "location": "Washington",
    "posting_date": "2016-06-13",
    "description": "New England Democrat and member of the House Veterans' Affairs Committee seeks legislative assistant for Washington office. Applicants should possess excellent writing skills, energy, enthusiasm, attention to detail, the ability to work in a fast-paced team environment, and a good sense of humor. Legislative portfolio includes, but is not limited to, work on Veterans' Affairs Committee issues, healthcare, and defense. Previous experience in veterans or health care policy is required. Responsibilities include developing proactive legislative initiatives, tracking legislation, drafting correspondence and statements, and representing the Member in meetings. New England ties preferred and veterans strongly encouraged to apply.",
    "responsibilities": [
      "Developing proactive legislative initiatives",
      "Tracking legislation",
      "Drafting correspondence and statements",
      "Representing the Member in meetings"
    ],
    "qualifications": [
      "Excellent writing skills",
      "Energy",
      "Enthusiasm",
      "Attention to detail",
      "Ability to work in a fast-paced team environment",
      "Good sense of humor",
      "Previous experience in veterans or health care policy is required",
      "New England ties preferred",
      "Veterans strongly encouraged to apply"
    ],
    "how_to_apply": "Applicants should send cover letter, resume, and two writing samples to hill.jobs@mail.house.gov. No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "hill.jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-162-16",
    "position_title": "Veteran Affairs Caseworker/Field Representative",
    "office": "Congresswoman Dina Titus of Nevada",
    "location": "Las Vegas District Office",
    "posting_date": "2016-06-13",
    "description": "Successful candidates will have previous experience in social work, familiarity with federal agencies, excellent written and oral communication skills, be team-oriented, and comfortable working both independently and as part of a team. Strong knowledge or connection with Nevada's First Congressional District is a plus. Availability for evening and weekend assignments is required.",
    "responsibilities": [],
    "qualifications": [
      "Previous experience in social work",
      "Familiarity with federal agencies",
      "Excellent written and oral communication skills",
      "Team-oriented",
      "Comfortable working both independently and as part of a team",
      "Strong knowledge or connection with Nevada's First Congressional District is a plus",
      "Availability for evening and weekend assignments is required"
    ],
    "how_to_apply": "Interested candidates should send their resume and cover letter to Mike.Naft@mail.house.gov. Please write 'Caseworker' in the subject line of your email message.",
    "salary_info": null,
    "contact": "Mike.Naft@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-161-16",
    "position_title": "Executive Assistant/Scheduler",
    "office": "California Democrat",
    "location": null,
    "posting_date": "2016-06-13",
    "description": "California Democrat is seeking a highly organized, hard-working executive assistant/scheduler to develop and maintain Member's official schedule both short and long term, and to organize domestic and international travel logistics. This position also works closely with the chief of staff on administrative duties.",
    "responsibilities": [],
    "qualifications": [
      "Excellent written and oral communications skills and attention to detail",
      "Exhibit good judgement",
      "Efficiently problem solve",
      "Possess a positive attitude",
      "Work well in a team environment",
      "Have a good sense of humor",
      "Previous scheduling experience preferred"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume and writing sample",
    "salary_info": "Salary commensurate with experience.",
    "contact": "cademocrat.scheduler@gmail.com",
    "equal_opportunity": "Office is an equal opportunity employer."
  },
  {
    "id": "MEM-157-16",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "Senior Democratic Member",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-13",
    "description": "Senior Democratic Member seeks an energetic, detail-oriented individual with excellent oral and written communication skills for the position of Staff Assistant/Legislative Correspondent in his busy Washington office. Daily tasks include greeting visitors, processing flag and tour requests, training and supervising interns, and providing support to the congressman and legislative staff. Legislative Correspondent responsibilities include management of an active constituent correspondence program, which includes monitoring the flow of incoming and outgoing mail and responding to mail and email in both form and individual letters in a timely manner. Candidates should have excellent writing, editing and multi-tasking skills, possess patience and a good sense of humor, strong communication skills, sharp attention to detail, the ability to work well with others, and good time management skills. Experience with the Intranet Quorum database and Microsoft Office desired. Knowledge of or ties to Georgia are a plus but not required.",
    "responsibilities": [
      "Greeting visitors",
      "Processing flag and tour requests",
      "Training and supervising interns",
      "Providing support to the congressman and legislative staff",
      "Management of an active constituent correspondence program",
      "Monitoring the flow of incoming and outgoing mail",
      "Responding to mail and email in both form and individual letters in a timely manner"
    ],
    "qualifications": [
      "Excellent writing and editing skills",
      "Multi-tasking skills",
      "Patience",
      "Good sense of humor",
      "Strong communication skills",
      "Sharp attention to detail",
      "Ability to work well with others",
      "Good time management skills",
      "Experience with the Intranet Quorum database and Microsoft Office desired",
      "Knowledge of or ties to Georgia are a plus but not required"
    ],
    "how_to_apply": "Please send resume and cover letter to COStoCHJ@gmail.com. Please absolutely no phone calls or drop-ins.",
    "salary_info": null,
    "contact": "COStoCHJ@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-154-16",
    "position_title": "Military Legislative Assistant (MLA)",
    "office": "Southern Democratic Member",
    "location": null,
    "posting_date": "2016-06-13",
    "description": "This is not a senior position. It is important that the MLA have experience with military or a strong military background, familiarity with the NDAA, overall budgeting, and the ability to track major acquisition and RDT&E programs. Additionally, prior legislative experience with the Defense Authorization and Appropriations Process is preferred. An ability to multitask and work under tight deadlines is necessary. Georgia ties are helpful. Candidates that can engage in creative policy-making are encouraged to apply.",
    "responsibilities": [],
    "qualifications": [
      "Experience with military or a strong military background",
      "Familiarity with the NDAA, overall budgeting",
      "Ability to track major acquisition and RDT&E programs",
      "Prior legislative experience with the Defense Authorization and Appropriations Process (preferred)",
      "Ability to multitask and work under tight deadlines",
      "Georgia ties (helpful)",
      "Ability to engage in creative policy-making"
    ],
    "how_to_apply": "Interested applicants should email a cover letter and resume to costochj@gmail.com.",
    "salary_info": null,
    "contact": "costochj@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-153-16",
    "position_title": "Scheduler/Office Manager",
    "office": "Southern Democratic Office",
    "location": "Washington, D.C.",
    "posting_date": "2016-06-13",
    "description": "The staffer will maintain the Member’s official schedule, travel plans, and related records. Brief the Member on scheduling activities in Washington and present proposed meetings to Chief of Staff and Member for input. Coordinates the scheduling of press, interview, radio, and television with the Communications Director. This is not an entry-level position. Metropolitan Atlanta-ties a plus.",
    "responsibilities": [
      "Maintain the Member’s official schedule, travel plans, and related records.",
      "Brief the Member on scheduling activities in Washington.",
      "Present proposed meetings to Chief of Staff and Member for input.",
      "Coordinates the scheduling of press, interview, radio, and television with the Communications Director."
    ],
    "qualifications": [
      "Not an entry-level position.",
      "Metropolitan Atlanta-ties a plus."
    ],
    "how_to_apply": "Please send inquiries to COStoCHJ@gmail.com.",
    "salary_info": null,
    "contact": "COStoCHJ@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-152-16",
    "position_title": "Communications Director",
    "office": "House Committee on Science, Space and Technology (Majority)",
    "location": null,
    "posting_date": "2016-06-13",
    "description": "The House Committee on Science, Space and Technology (Majority) is seeking experienced candidates for the position of Communications Director. The successful candidate will be a strong writer who can communicate public policy on a District, state and national level and can operate in a fast-moving, high pressure environment. Candidate will be responsible for managing committee press team and coordinating with professional staff, as well as working with press secretaries in Committee Members' personal offices. Qualified candidates must be able to draft op-eds and press releases, and proactively work with the local and national media.",
    "responsibilities": [
      "Managing committee press team",
      "Coordinating with professional staff",
      "Working with press secretaries in Committee Members' personal offices",
      "Draft op-eds and press releases",
      "Proactively work with the local and national media"
    ],
    "qualifications": [
      "At least three years of professional experience"
    ],
    "how_to_apply": "Please submit a resume and writing sample to house.science.committee@mail.house.gov. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "house.science.committee@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-151-16",
    "position_title": "Legislative Correspondent",
    "office": "Florida Progressive Democrat",
    "location": "Capitol Hill",
    "posting_date": "2016-06-13",
    "description": "Florida Progressive Democrat seeks Legislative Correspondent with excellent writing, research, and communications skills as well as the ability to work in a fast-paced team environment. The ideal candidate will have a sense of humor, be a detail-oriented self-starter who is willing to take on additional tasks as assigned.",
    "responsibilities": [],
    "qualifications": [
      "At least 1 year of related Capitol Hill experience",
      "Car and driver’s license",
      "Familiarity with IQ constituent management system",
      "Florida ties and Spanish speaker are a plus"
    ],
    "how_to_apply": "Please send resume, cover letter including salary requirement, references, and two independently written examples of legislative correspondence to FL09job@gmail.com. No emails, calls or drop by please.",
    "salary_info": null,
    "contact": "FL09job@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-150-16",
    "position_title": "Director of Administration",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2016-06-13",
    "description": "The Committee on Ethics seeks an experienced office administrator to serve as the Director of Administration for the Committee. The Director of Administration will oversee the Committee’s administrative functions and will manage a nonpartisan administrative staff who are responsible for ensuring the efficient operation of the Committee’s work. This is a nonpartisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity.",
    "responsibilities": [],
    "qualifications": [
      "Minimum of 5 years of experience with government administrative process",
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment",
      "Experience in one or more of the following areas is also desirable: accounting, office administration, and familiarity with Congress.",
      "Previous management experience preferred."
    ],
    "how_to_apply": "Please email resume, cover letter, and a list of references to ethicsjobs@mail.house.gov. Please include the phrase “Director of Administration” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-149-16",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": null,
    "posting_date": "2016-06-13",
    "description": "The Committee on Ethics seeks an experienced attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity. Candidates must possess outstanding analytical and written/oral communications skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee. Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and financial accounting.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics, criminal law, civil litigation, administrative investigations and adjudications, depositions, and financial accounting."
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  }
]