[
  {
    "id": "MEM-242-19",
    "position_title": "Communications Director",
    "office": "Congresswoman Lisa Blunt Rochester (DE-At Large)",
    "location": "Washington, D.C.",
    "posting_date": "2019-06-10",
    "description": "Congresswoman Lisa Blunt Rochester (DE-At Large) is seeking a highly motivated, creative, and experienced Communications Director to lead her media and outreach efforts, based in her Washington, D.C. office. The ideal candidate will be able to work collaboratively, possess excellent written and oral communication skills, has the ability to work in a fast-paced environment under tight deadlines, and has an excellent understanding of print, digital, and other media landscapes.\n\nThis position is responsible for regularly drafting speeches, media advisories, press releases, and talking points, among other written materials. Ideal candidates will be able to think strategically and offer creative communication ideas to advance the Congresswoman’s agenda. The position will oversee a press assistant in the Wilmington office.",
    "responsibilities": [
      "Drafting speeches",
      "Drafting media advisories",
      "Drafting press releases",
      "Drafting talking points"
    ],
    "qualifications": [
      "Minimum of two years of relevant experience"
    ],
    "how_to_apply": "Interested candidates should send a cover letter and resume to lbr.jobposting@gmail.com with “Communications Director” in the subject line by COB June 21st. No phone calls, drop-ins, or emails please.",
    "salary_info": null,
    "contact": "lbr.jobposting@gmail.com",
    "equal_opportunity": "This is an Equal Opportunity Employer."
  },
  {
    "id": "MEM-238-19",
    "position_title": "Counsel/Professional Staff",
    "office": "House Select Committee on the Climate Crisis",
    "location": null,
    "posting_date": "2019-06-10",
    "description": "The House Select Committee on the Climate Crisis is seeking a mid-level professional staff member or counsel to work on climate mitigation policy for the Committee’s Democratic staff. Previous experience (at least three years) working on climate mitigation and decarbonization policy is required. Successful candidates will be detail-oriented and possess strong communication and writing skills. Advanced degree preferred but not required for all positions, as experience in climate policy may be equally relevant.",
    "responsibilities": [
      "Planning and staffing congressional hearings",
      "Conducting in-depth analysis on policy options for deep decarbonization",
      "Writing and editing",
      "Communicating with stakeholders"
    ],
    "qualifications": [
      "At least three years of experience working on climate mitigation and decarbonization policy",
      "Detail-oriented",
      "Strong communication and writing skills",
      "Advanced degree preferred but not required"
    ],
    "how_to_apply": "Please send resume and cover letter to SCCCDjobs@mail.house.gov with “Counsel/Professional Staff” in the subject line. No calls, please.",
    "salary_info": "Salary commensurate with skills and experience.",
    "contact": "SCCCDjobs@mail.house.gov",
    "equal_opportunity": "The Committee is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-238-19",
    "position_title": "Communications Director",
    "office": "Texas Member Congressional office",
    "location": "Washington, D.C.",
    "posting_date": "2019-06-10",
    "description": "Senior Democratic Texas Member seeks an experienced Communications\nDirector based in Washington, D.C. Congressional office. This position will\nplan and execute a proactive earned media and digital constituent outreach\nstrategy. This is a senior staff role requiring a minimum of 3 years of previous\nHill or political communications experience.\n\nThe Communications Director will require a tremendous amount of writing,\nand the aptitude to oversee all press and communications responsibilities.\nCandidates should be proactive, detail-oriented and have demonstrated\nexperience in national, local, and digital media. This is not an entry-level\nposition.\n\nCommunications Director is expected to have a close working relationship\nwith the House Science, Space, and Technology Committee's media team.\nDallas ties are preferred, but not necessary. Occasional district travel may be\nnecessary.",
    "responsibilities": [
      "Develop strong relationships with local/national media; know local TV media markets, radio stations, and newspapers to elevate Member's profile on key issues",
      "Work closely with district team to plan messaging and plan local press events in the district",
      "Develop and execute communications strategies for the office using best practices",
      "Write talking points, press releases, op-eds, speeches, and more",
      "Book and prepare member for interviews",
      "Produce a weekly communications report for the Congressman and provide regular communications updates to staff",
      "Create and oversee digital communications outreach including e-newsletter, website, and social media platforms"
    ],
    "qualifications": [
      "Political savvy",
      "Exceptional self-starter",
      "Creative/forward thinking",
      "Strong writing, editing, and proofreading skills",
      "Able to meet tight deadlines",
      "Detail oriented",
      "Team player",
      "Flexible schedule"
    ],
    "how_to_apply": "Interested candidates should send their cover letter, resume, and three sample writings to TX30.Jobs@gmail.com \"Communications Director\" in the subject line. No walk-ins or calls please.",
    "salary_info": null,
    "contact": "TX30.Jobs@gmail.com",
    "equal_opportunity": "Equal Opportunity Employer. Women, people of color, LGBTQ+ individuals\nand members of other underrepresented communities are strongly encouraged\nto apply."
  },
  {
    "id": "MEM-235-19",
    "position_title": "Executive Assistant/Scheduler",
    "office": "DC office",
    "location": "DC",
    "posting_date": "2019-06-10",
    "description": "Seeking an Executive Assistant/Scheduler for the DC office. This is not an entry level position. The ideal candidate will be a seasoned, experienced professional with the ability to manage all aspects of the Member’s DC and district schedule, including travel arrangements and logistics. The Executive Assistant/Scheduler will handle all incoming scheduling requests and strategically manage the daily and long-term schedule to ensure efficient and seamless operations.",
    "responsibilities": [],
    "qualifications": [
      "Strong work ethic",
      "Ability to manage competing demands",
      "Excellent time management and organization skills",
      "Ability to thrive in a fast-paced environment"
    ],
    "how_to_apply": "Please send cover letter and resume to TX.JobListing@mail.house.gov",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "TX.JobListing@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-232-19",
    "position_title": "Budget Analyst",
    "office": "Congressional committee",
    "location": null,
    "posting_date": "2019-06-10",
    "description": "Congressional committee seeks experienced Budget Analyst for human\nservices policy portfolio. The job requires strong skills in written and oral\ncommunication, policy analysis, and quantitative analysis, as well as the\nability to work effectively under tight deadline. The ideal candidate will have\nseveral years of experience in federal budgeting, familiarity with the\nlegislative process, background in human services policy, and a master's\ndegree in public policy or related field. Experience at OMB, CBO, or agency\nbudget office a plus. The ability to be a quick learner and be adaptable as\ncircumstances change is at least as important as depth of subject matter\nexpertise.",
    "responsibilities": [],
    "qualifications": [
      "strong skills in written and oral communication",
      "policy analysis",
      "quantitative analysis",
      "ability to work effectively under tight deadline",
      "several years of experience in federal budgeting",
      "familiarity with the legislative process",
      "background in human services policy",
      "master's degree in public policy or related field",
      "ability to be a quick learner",
      "adaptable as circumstances change"
    ],
    "how_to_apply": "Email resume, two BRIEF writing samples (2 to 4 pages each), and cover\nletter with subject line “analyst position” to BudgetDemocrat.Jobs@mail.house.gov– no phone calls or walk-ins.",
    "salary_info": null,
    "contact": "BudgetDemocrat.Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-230-19",
    "position_title": "Advice and Education Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-06-10",
    "description": "The Committee on Ethics seeks an attorney for the position of Counsel in the Office of Advice and Education. The Committee’s Advice and Education counsels are responsible for reviewing financial disclosure statements, providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product.\n\nThis is a non-partisan position which requires the ability to serve all Members of Congress equally and refrain from political or partisan activity. Candidates must possess outstanding analytical and written and oral communication skills, as well as the sound judgment necessary to evaluate the sensitive matters that arise before the Committee.",
    "responsibilities": [
      "Reviewing financial disclosure statements",
      "Providing a high volume of ethics advice, education, and training to Members of Congress and their staff through frequent telephone calls, in-person meetings, and written work product"
    ],
    "qualifications": [
      "Outstanding analytical and written and oral communication skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable: government ethics; ethics counseling and training; corporate finance; securities law; employment law, including the laws governing sexual harassment in the workplace; and criminal law"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “A&E Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-228-19",
    "position_title": "Staff Assistant",
    "office": "Office of Congresswoman Linda Sanchez",
    "location": "District Office- Norwalk, CA",
    "posting_date": "2019-06-10",
    "description": "The Staff Assistant position is primarily charged with (but not limited to) answering phones, greeting constituents and visitors, sorting incoming mail, writing correspondence, and assisting the District Office staff with additional tasks. Successful candidates will possess strong communication skills, the ability to multitask, attention to detail, political instinct, the ability to prioritize in a fast-paced environment. They must also work cooperatively and courteously with others and have the temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner.",
    "responsibilities": [
      "Answering phones",
      "Greeting constituents and visitors",
      "Sorting incoming mail",
      "Writing correspondence",
      "Assisting the District Office staff with additional tasks"
    ],
    "qualifications": [
      "Strong communication skills",
      "Ability to multitask",
      "Attention to detail",
      "Political instinct",
      "Ability to prioritize in a fast-paced environment",
      "Ability to work cooperatively and courteously with others",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner"
    ],
    "how_to_apply": null,
    "salary_info": null,
    "contact": null,
    "equal_opportunity": null
  },
  {
    "id": "MEM-228-19",
    "position_title": "Caseworker",
    "office": "Office of Congresswoman Linda Sanchez",
    "location": "38th Congressional District",
    "posting_date": "2019-06-10",
    "description": "Casework responsibilities involve assisting constituents of the 38th Congressional District resolve problems with federal agencies or find the appropriate state or local contact for non-federal issues. The candidate should be persistent and detail-orientated, and put a priority on facilitating resolutions and expediting priority requests. Knowledge of California state and federal government agencies and experience in customer service will be highly regarded.",
    "responsibilities": [
      "Assisting constituents of the 38th Congressional District resolve problems with federal agencies",
      "Finding the appropriate state or local contact for non-federal issues",
      "Facilitating resolutions and expediting priority requests"
    ],
    "qualifications": [
      "Office/administrative experience",
      "Strong organizations skills; attention to detail.",
      "Good computer skills, including proficiency and experience with Microsoft Word, Excel, Outlook, Publisher and Power Point.",
      "Strong communication, analytical, and organization skills; an ability to relate well with individuals of diverse backgrounds; and impeccable customer service manners.",
      "Candidate must have a thorough understanding of government agencies and structure (county, state, and federal).",
      "Must be able to work efficiently and effectively as a member of a team, be able to meet strict deadlines, balance multiple projects simultaneously, and work under pressure.",
      "Candidates should demonstrate a positive attitude, commitment to excellence, upbeat demeanor, flexibility, and sense of humor.",
      "Candidate should have graduated from an accredited four-year college or university with a bachelor’s degree."
    ],
    "how_to_apply": "Interested applicants should submit their resume and cover letter via email to: CA38Jobs@mail.house.gov Please indicate the title of the position in the subject line. No phone calls or walk-ins accepted.",
    "salary_info": "Salary will depend on the experience of the applicant.",
    "contact": "CA38Jobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-224-19",
    "position_title": "Investigative Counsel",
    "office": "Committee on Ethics",
    "location": "Washington, DC",
    "posting_date": "2019-06-10",
    "description": "The Committee on Ethics seeks an attorney for an investigative counsel position. The Committee’s investigative counsels are responsible for conducting investigations and adjudicatory and disciplinary proceedings regarding Members and staff of the U.S. House of Representatives. This is a nonpartisan position which requires the ability to conduct impartial investigations and refrain from political or partisan activity.",
    "responsibilities": [
      "Conducting investigations",
      "Adjudicatory proceedings",
      "Disciplinary proceedings regarding Members and staff of the U.S. House of Representatives"
    ],
    "qualifications": [
      "Outstanding analytical and written/oral communications skills",
      "Sound judgment necessary to evaluate the sensitive matters that arise before the Committee",
      "Experience in one or more of the following areas is desirable:",
      "government ethics",
      "criminal law",
      "employment law, including the laws governing sexual harassment in the workplace",
      "civil litigation",
      "administrative investigations and adjudications",
      "depositions",
      "financial accounting"
    ],
    "how_to_apply": "Please email resume, cover letter, and short writing sample to ethicsjobs@mail.house.gov. Please include the phrase “Investigative Counsel” in the subject line.",
    "salary_info": "Salary commensurate with experience.",
    "contact": "ethicsjobs@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-218-19",
    "position_title": "Communications Director",
    "office": "Office of U.S. Representative Pramila Jayapal (WA-07)",
    "location": "Washington, D.C. and Seattle, WA",
    "posting_date": "2019-06-10",
    "description": "The Office of U.S. Representative Pramila Jayapal (WA-07) seeks an experienced, creative and highly motivated Communications Director to lead media and outreach efforts in her Washington, D.C. and Seattle, WA offices.",
    "responsibilities": [
      "Serve as the primary spokesperson for the Congresswoman;",
      "Develop strong relationships with local and national reporters, editors, producers, bookers, and social media influencers;",
      "Proactively engage in media outreach, including pitching and fielding press inquiries;",
      "Manage the development of press releases, speeches and op-eds;",
      "Oversee a robust and aggressive online communications program;",
      "Supervise a Press Secretary and Digital Specialist;",
      "Prepare and staff the Congresswoman for district press events and media interviews; and",
      "Work collaboratively with the District Office to ensure a strong local/state media presence."
    ],
    "qualifications": [
      "Work collaboratively with the Congresswoman and her senior leadership team;",
      "Possess strong written and oral communications skills and the ability to work effectively in a fast-paced setting under tight deadlines;",
      "Understand the digital media landscape and current digital trends, with experience overseeing a digital/social media program;",
      "Think strategically and creatively;",
      "Have a strong record of advocating for progressive values;",
      "Be willing to work weekends and irregular hours.",
      "This is a very senior level position, and a minimum of two years of communications experience as a press secretary or communications director is required.",
      "State and/or district ties are a plus."
    ],
    "how_to_apply": "Qualified candidates should include in their application: resume, cover letter, three writing samples (including one speech) and three references.\nPlease send applications to jobs.pramila@mail.house.gov with “Communications Director” in the subject line. No calls or drop-ins please.",
    "salary_info": null,
    "contact": "jobs.pramila@mail.house.gov",
    "equal_opportunity": "Women, people of color, LGBTQ+ individuals, new Americans, people with disabilities, and members of other underrepresented communities are strongly encouraged to apply."
  },
  {
    "id": "MEM-217-19",
    "position_title": "Communications Director",
    "office": "Congresswoman Yvette D. Clarke",
    "location": "Washington, D.C.",
    "posting_date": "2019-06-10",
    "description": "Responsibilities include communications planning and press strategy for D.C. and the district; drafting press materials including: remarks, talking points, newsletters, statements, press releases, and media advisories; pitching media events; assisting with the management of the Congresswoman’s social media accounts; interview preparation; and overseeing the office’s franked mail and digital programs.\n\nThe ideal candidate is a strong writer, politically savvy, detail-oriented, flexible, creative, and a self-starter. Occasional travel to the district and nontraditional hours - including night and weekend work - should be expected. Strong ties to New York press preferred.",
    "responsibilities": [
      "Communications planning and press strategy for D.C. and the district",
      "Drafting press materials including: remarks, talking points, newsletters, statements, press releases, and media advisories",
      "Pitching media events",
      "Assisting with the management of the Congresswoman’s social media accounts",
      "Interview preparation",
      "Overseeing the office’s franked mail and digital programs"
    ],
    "qualifications": [
      "Strong writer",
      "Politically savvy",
      "Detail-oriented",
      "Flexible",
      "Creative",
      "Self-starter",
      "Strong ties to New York press preferred"
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, and three writing samples to ResumeNY@mail.house.gov and include “Communications Director” in the subject line.",
    "salary_info": null,
    "contact": "ResumeNY@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-216-19",
    "position_title": "Caseworker/Field Representative",
    "office": "Congresswoman Jackie Speier",
    "location": "San Mateo district office",
    "posting_date": "2019-06-10",
    "description": "Congresswoman Jackie Speier seeks a proactive, strategic, and communityoriented individual with casework and outreach experience for the position of Caseworker/Field Representative in her San Mateo district office.",
    "responsibilities": [
      "Handle constituent requests and casework on behalf of constituents with applicable federal agencies.",
      "Work closely with other caseworkers and legislative staff on constituent services and outreach efforts.",
      "Establish and maintain relationships with local organizations, community leaders, and elected officials in the district.",
      "Keep track of key issues in the communities and develop outreach efforts and course of action to Member relative to issue work.",
      "Assist with events and other activities.",
      "Staff the Member at meetings and events or attend on behalf of the Congresswoman.",
      "Conduct research, draft memos and letters for constituent outreach and Member support.",
      "Availability to work night and/or weekends as necessary to attend events and community meetings.",
      "Provide administrative assistance as needed, including answering phones, writing correspondence, and greeting constituents."
    ],
    "qualifications": [
      "B.A. or equivalent degree.",
      "Experience working in a fast-paced environment.",
      "Excellent verbal and written communication skills.",
      "Must have car and valid driver's license; you will receive mileage reimbursement for travel to and from work-related events and meetings."
    ],
    "how_to_apply": "Interested applicants should submit a cover letter, resume and writing sample (2-3 pages) to:",
    "salary_info": "Pay is commensurate with experience.\nHealth, dental, vision, transit, retirement and life-insurance benefits available.\nFederal student loan repayment program available, if eligible.",
    "contact": "CA14Jobs@mail.house.gov",
    "equal_opportunity": null
  }
]