[
  {
    "id": "MEM-411-21",
    "position_title": "Military Legislative Assistant (MLA)",
    "office": "Congresswoman Susie Lee (NV-03)",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "Congresswoman Susie Lee (NV-03), Member of the Appropriations Committee,\nseeks an experienced Military Legislative Assistant (MLA) to join her\nWashington, D.C.-based legislative team.\n\nThis is not an entry-level position. Significant Capitol Hill experience is required, with direct legislative expertise handling defense, national security, foreign relations, and veterans affairs policy. Candidate should have a strong track record of translating policy priorities into successful legislative outcomes. Candidate should have a low-ego, strong-team player and collaborative work ethic.\n\nCandidate will be expected to frequently brief the Member and demonstrate strong verbal communication skills. Candidate will work directly with the Congresswoman, Chief of Staff, and Legislative Director to advance the Congresswoman’s authorizing and appropriations priorities.\n\nCandidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin. Nevada ties are a plus.",
    "responsibilities": [],
    "qualifications": [
      "Significant Capitol Hill experience is required",
      "Direct legislative expertise handling defense, national security, foreign relations, and veterans affairs policy",
      "Strong track record of translating policy priorities into successful legislative outcomes",
      "Low-ego, strong-team player and collaborative work ethic",
      "Strong verbal communication skills",
      "Nevada ties are a plus"
    ],
    "how_to_apply": "To apply send a resume, cover letter, and policy memo no later than 5pm on October 15th to nv03resumes@gmail.com with the following subject line: [First Name Last Name] – Military Legislative Assistant. No phone calls, faxes, or walk-ins, please.",
    "salary_info": null,
    "contact": "nv03resumes@gmail.com",
    "equal_opportunity": "Candidates of diverse backgrounds are encouraged to apply. The office does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-410-21",
    "position_title": "Operations Manager",
    "office": "House Office of Diversity & Inclusion (ODI)",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "The House Office of Diversity & Inclusion (ODI) seeks a detail-oriented and\nwell-organized Operations Manager.\nAs the Operations Manager, you will be responsible for providing direct\nadministrative and scheduling support to the Director and the rest of the ODI\nTeam. As a strong candidate, you will be proactive, have excellent written and\noral communication skills and attention to detail, be able to anticipate problems\nand offer solutions, communicate clearly in a fast-paced environment, manage\ncompeting priorities, and work effectively with different teams.",
    "responsibilities": [
      "Responsible for general reception and administrative duties, including but not\nlimited to answering phones, taking meeting notes, managing supplies/vendors,\nand drafting correspondence;",
      "Provides direct administrative and scheduling support to the Director of ODI;",
      "Maintains team calendar and coordinates all internal and external\nmeetings/events;",
      "Manages the calendars of appointments for the Candidate Services team,\nincluding scheduling intake meetings, resume reviews, and mock interviews;",
      "Manages the intake and dissemination of requests sent to the ODI team;",
      "Support the drafting, reviewing, and editing of regular office reports;",
      "Performs duties with a high level of professionalism while maintaining tact and\nconfidentiality;",
      "Effectively utilizes office technology/equipment to keep the office wellorganized and to function smoothly;",
      "Performs other duties and projects as assigned."
    ],
    "qualifications": [
      "Bachelor’s degree and 3 years of experience in an administrative role",
      "Experience supporting a team in a fast-paced environment and detailed oriented",
      "Knowledge of technology/office equipment and willingness to learn new\ninformation systems and software; proficiency in the use of computer\napplications and in Microsoft 365 applications (e.g., Excel, PowerPoint, Word,\nTeams, OneDrive)"
    ],
    "how_to_apply": "Interested candidates should apply by submitting a cover letter and a resume\nusing this\nlink: https://house.csod.com/ux/ats/careersite/1/home/requisition/339?c=house",
    "salary_info": "Salary commensurate with experience.",
    "contact": "No phone calls or drop-ins, please.",
    "equal_opportunity": "The office is an equal opportunity\nemployer; we do not discriminate on the basis of race, sex, color, age, religion,\ndisability, national origin, military status, sexual orientation, or gender identity or\nexpression. We strongly value the diversity of our employees and encourage\ncandidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-408-21",
    "position_title": "Staff Assistant",
    "office": "Moderate West Coast Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "Moderate West Coast Democrat seeks highly-motivated, well organized, and detail-oriented Staff Assistant for the Washington, D.C. office. Applicants must possess excellent written and verbal communication skills.",
    "responsibilities": [
      "front office reception",
      "answering phones",
      "receiving and caring for constituents and guests of the office",
      "setting up and performing Capitol tours",
      "coordinating the internship program and supervising interns",
      "monitoring the order and operation of the office space and supplies",
      "assisting the Member and staff as assigned",
      "driving the Member to events as necessary"
    ],
    "qualifications": [
      "ability to work under pressure",
      "a strong commitment to public service",
      "an understanding of what it takes to be a part of a successful team effort",
      "A valid driver’s license, daily access to an automobile and a good driving record are necessities.",
      "Ties to California, central coast, are strongly preferred.",
      "Previous Capitol Hill experience as an intern or staff assistant is also preferred but not necessary."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume, one writing sample of one page or less and two references with “STAFF ASSISTANT” in the subject line to ca20.jobs@mail.house.gov",
    "salary_info": null,
    "contact": "ca20.jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-401-21",
    "position_title": "Digital Director",
    "office": "Congressman Jamaal Bowman (NY-16)",
    "location": "DC",
    "posting_date": "2021-10-12",
    "description": "The Office of Congressman Jamaal Bowman (NY-16) is seeking a talented, motivated Digital Director to be based in our DC office.\nThe Congressman holds a wide-reaching and impactful voice on digital platforms. As Digital Director, you would be responsible for driving the Congressman’s message forward, growing the reach on our social media platforms, and developing creative ways to continue to reach diverse audiences. Equally important, this person will utilize digital platforms to inform constituents on the Congressman’s work in DC as well as resources available to them.\nAt a high level, this person will be tasked with creating the strategy and executing on the digital platforms. This person will also oversee the Congressman’s brand on digital platforms.",
    "responsibilities": [
      "Creating and scheduling daily content for the Congressman’s Twitter, Facebook, Instagram, and YouTube pages",
      "Creating graphics",
      "Editing videos",
      "Managing the Congressman’s website",
      "Archiving photos and other digital materials",
      "Providing general support to the communications team as needed, including staffing the Congressman for press events and interviews and drafting talking points and statements",
      "Drafting statements, advisories and press releases"
    ],
    "qualifications": [
      "Experience in graphic design and video editing and feel comfortable using the Adobe Suite",
      "Able to work quickly under pressure",
      "Stay abreast of topical news and trending conversations",
      "A belief in the ability for policy to transform people’s lives, especially those most marginalized by systemic racism"
    ],
    "how_to_apply": "To apply, complete the questions and tasks at this link: https://airtable.com/shrB4ZtVEPSbU57bo\nEarly applicants will get priority. Application closes on October 18, 2021.",
    "salary_info": "The salary for this position will range between $50,000-$65,000 depending on skill level and experience.",
    "contact": null,
    "equal_opportunity": "BIPOC, LGBTQIA and those with New York City/Westchester County ties are encouraged to apply. Hip Hop lovers and enthusiasts encouraged as well!"
  },
  {
    "id": "MEM-400-21",
    "position_title": "Staff Assistant",
    "office": "Congressman Frank Pallone",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "The office of Congressman Frank Pallone seeks a Staff Assistant who will be responsible for performing a variety of duties central to Washington, D.C. office operations. The ideal candidate must be detail-oriented, well organized, and accustomed to a fast-paced work environment.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "Candidates of all backgrounds are encouraged to apply by submitting a resume and cover letter to resume.nj06@mail.house.gov.",
    "salary_info": null,
    "contact": "resume.nj06@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-396-21",
    "position_title": "Staff Assistant",
    "office": "Member’s office",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "The Staff Assistant role performs vital tasks in a Member’s office. Staff Assistants often provide the first impression of the Member office to constituents and guests. The ideal candidate has a strong customer service orientation, organizational skills, and can multitask.",
    "responsibilities": [
      "Provides a welcoming environment and positive first impression of the Member’s office to constituents and visitors.",
      "Handles all incoming calls with promptness, poise, and professionalism.",
      "Captures input from constituents on policy matters for the Member office’s consideration and response.",
      "Ensures constituent casework is distributed to appropriate district staff in an efficient manner.",
      "Ensures U.S. mail is received, recorded, and distributed to the appropriate staff members.",
      "Any other tasks and special projects that may be assigned."
    ],
    "qualifications": [
      "Proficient communication skills for verbal and written correspondence",
      "Ability to work with a team and provide keen attention to detail to support the needs of multiple staff members and leaders in the office",
      "Professional demeanor and an upbeat disposition while interacting with visitors, staff members, and stakeholders in a fast-paced, highly dynamic environment",
      "Time management skills including the ability to prioritize and track work status",
      "Some familiarity with constituent service case life cycle"
    ],
    "how_to_apply": "Interested candidates should submit a resume to md07resumes@mail.house.gov",
    "salary_info": null,
    "contact": "md07resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-395-21",
    "position_title": "Director of Operations",
    "office": "Office of Congressional Ethics",
    "location": "United States House of Representatives",
    "posting_date": "2021-10-12",
    "description": "The Office of Congressional Ethics, an independent, non-partisan investigative entity within the United States House of Representatives, seeks an experienced and highly qualified Director of Operations. The Director of Operations reports to the Staff Director and Chief Counsel. The successful candidate will be responsible for maintaining the office’s overall efficient operation.",
    "responsibilities": [
      "Assume lead in maintaining office to include oversight of administrative operations and office budget;",
      "Procure and maintain equipment and other resources for the office;",
      "Monitor all personnel matters and ensure that office policies and procedures are followed;",
      "Maintain office accounts and payroll accounts in accordance with the regulations of the House;",
      "Provide administrative support to the OCE staff and the Board of the Office in the connection with their official duties;",
      "Support investigative staff with routine case-related tasks; and",
      "Manage citizen outreach."
    ],
    "qualifications": [
      "Extensive office management experience (minimum three years);",
      "Ability to manage multiple tasks and projects and to work well under pressure;",
      "Thoroughness and careful attention to detail;",
      "Strong oral and written communication skills;",
      "Ability to exercise discretion and independent judgment;",
      "Proficiency in word processing, development and use of spreadsheets, data management systems, and other computer skills;",
      "Proficiency using House budget, payroll, and voucher software;",
      "Strong organizational, budgeting, correspondence management, and filing skills; and",
      "Temperament to communicate with a variety of personalities in a tactful and professional manner."
    ],
    "how_to_apply": "Please send cover letter and resume to OCEJobs@mail.house.gov, addressed to Omar Ashmawy, Staff Director and Chief Counsel",
    "salary_info": null,
    "contact": "Omar Ashmawy",
    "equal_opportunity": null
  },
  {
    "id": "MEM-394-21",
    "position_title": "Legislative Assistant",
    "office": "Rep. Tom Suozzi (D-NY)",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "Rep. Tom Suozzi (D-NY), a member of the House Committee on Ways and Means, seeks a legislative assistant who will be responsible for handling a diverse array of policy areas including energy, the environment, transportation, infrastructure, appropriations and other domestic policy areas as assigned.\n\nResponsibilities will include but are not limited to, drafting and advancing legislation, hearing preparation, and writing statements. This is not an entry-level position. Applicants should have prior and relevant legislative experience working for a Member office or a committee, and a track record of delivering legislative results.\n\nCandidates must be a team player, organized, dependable, detailed oriented and have strong oral, written and interpersonal communication skills. Advanced degrees and ties to NY are a plus.",
    "responsibilities": [
      "drafting and advancing legislation",
      "hearing preparation",
      "writing statements"
    ],
    "qualifications": [
      "prior and relevant legislative experience working for a Member office or a committee",
      "track record of delivering legislative results",
      "team player",
      "organized",
      "dependable",
      "detailed oriented",
      "strong oral, written and interpersonal communication skills",
      "advanced degrees and ties to NY are a plus"
    ],
    "how_to_apply": "Interested candidates should submit a cover letter and resume to ny03.resumes@gmail.com.",
    "salary_info": null,
    "contact": "ny03.resumes@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-393-21",
    "position_title": "Staff Assistant",
    "office": "Florida Democratic House office",
    "location": "Washington, DC",
    "posting_date": "2021-10-12",
    "description": "Responsibilities include managing front office operations, answering and logging phone calls, greeting visitors, handling tour and flag requests, maintaining inventories, providing administrative support to the Member, Chief of Staff, and Scheduler, and additional duties as needed.\n\nCandidates should have excellent oral and written communication skills, attention to detail, an ability to work under pressure, and a strong commitment to public service. Previous Capitol Hill, customer service, or receptionist experience are strongly preferred.",
    "responsibilities": [
      "managing front office operations",
      "answering and logging phone calls",
      "greeting visitors",
      "handling tour and flag requests",
      "maintaining inventories",
      "providing administrative support to the Member, Chief of Staff, and Scheduler",
      "additional duties as needed"
    ],
    "qualifications": [
      "excellent oral and written communication skills",
      "attention to detail",
      "an ability to work under pressure",
      "a strong commitment to public service",
      "Previous Capitol Hill, customer service, or receptionist experience are strongly preferred."
    ],
    "how_to_apply": "Please submit a resume, cover letter, and a 1-page writing sample in a single PDF document to FL10.resume@mail.house.gov with “DC Staff Assistant” and your full name in the subject line. No walk ins or phone calls, please.",
    "salary_info": null,
    "contact": "FL10.resume@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and does not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity. Women, people of color, and candidates from diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-390-21",
    "position_title": "COMMUNICATIONS DIRECTOR",
    "office": "Congresswoman Teresa Leger Fernandez (NM-03)",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "Congresswoman Teresa Leger Fernandez (NM-03) is seeking an experienced and self-motivated Communications Director to manage the office's press and communications operations in her Washington, D.C. office.\n\nThis is not an entry-level position and previous political communications experience, preferably on Capitol Hill, is required. Candidates must possess strong writing skills, the ability to operate in a fast-paced office under deadlines, and be able to work collaboratively with both the DC and district teams.\n\nThe Communications Director manages the Staff/Press Assistant. This senior staff position reports to the Chief of Staff and the Congresswoman and works closely with the entire senior staff team. Bilingual abilities in English/Spanish are preferred. Women, people of color, LGBTQ+ individuals, people with disabilities and members of other underrepresented communities are strongly encouraged to apply. New Mexico ties are a plus.",
    "responsibilities": [
      "Managing the day-to-day press operations and outreach",
      "Handling interview requests",
      "Proactively pitching to media",
      "Preparing and staffing the Congresswoman for events and interviews",
      "Drafting press releases, speeches, newsletters, mailers, talking points, and op-eds",
      "Developing and seeking out content for the digital/social media program"
    ],
    "qualifications": [
      "previous political communications experience, preferably on Capitol Hill",
      "strong writing skills",
      "the ability to operate in a fast-paced office under deadlines",
      "be able to work collaboratively with both the DC and district teams"
    ],
    "how_to_apply": "Interested candidates should email their cover letter and resume in one attachment to NM03.Resumes@mail.house.gov with the subject line “Communications Director.” No phone calls or walk-ins please.",
    "salary_info": null,
    "contact": "NM03.Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-389-21",
    "position_title": "Legislative Counsel",
    "office": "House Judiciary Subcommittee on Crime, Terrorism, and Homeland Security",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "The House Judiciary Subcommittee on Crime, Terrorism, and Homeland Security seeks a hard-working lawyer with experience in criminal law (preferably with the Federal Criminal Code) to serve as legislative counsel.\n\nResponsibilities include: serving as a resource for Democratic Members of the Judiciary Committee on matters involving federal criminal law, criminal justice reform, domestic terrorism, and firearms policy; drafting and reviewing legislation; coordinating hearings and witnesses; preparing Members for hearings and markups; drafting statements, memos, and briefing materials; and providing guidance to other offices within the Democratic Caucus on crime-related matters.",
    "responsibilities": [
      "Serving as a resource for Democratic Members of the Judiciary Committee on matters involving federal criminal law, criminal justice reform, domestic terrorism, and firearms policy",
      "Drafting and reviewing legislation",
      "Coordinating hearings and witnesses",
      "Preparing Members for hearings and markups",
      "Drafting statements, memos, and briefing materials",
      "Providing guidance to other offices within the Democratic Caucus on crime-related matters"
    ],
    "qualifications": [
      "A strong background in criminal law is required, with knowledge of Department of Justice issues, and criminal justice issues relating to prosecutions.",
      "Exceptional writing skills, sound political judgment, and the ability to work closely and collaboratively with other congressional offices and advocacy organizations are essential."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter, and writing sample to JDEM.Job@mail.house.gov. Please include “Crime Counsel” in the subject line.",
    "salary_info": null,
    "contact": "JDEM.Job@mail.house.gov",
    "equal_opportunity": "The Committee strives to ensure that our staff represents the diversity of the country’s population; candidates from minority backgrounds are strongly encouraged to apply. The Committee does not discriminate on the basis of race, color, religion, sex (including marital or parental status, sexual orientation, and gender identity), disability, age, or national origin."
  },
  {
    "id": "MEM-388-21",
    "position_title": "Legislative Counsel",
    "office": "Bay Area Democrat",
    "location": "Capitol Hill",
    "posting_date": "2021-10-12",
    "description": "Bay Area Democrat seeks a highly organized and dedicated Legislative Counsel to manage his work on the Judiciary Committee, as well as defense and foreign policy portfolios.",
    "responsibilities": [
      "Developing hearing memos and staffing for hearings and markups",
      "Developing legislative proposals and strategy",
      "Preparing memos, floor statements and remarks",
      "Representing him in meetings with constituents and outside groups"
    ],
    "qualifications": [
      "Previous Capitol Hill experience and JD is required",
      "Women, LGBTQ+, and/or other underrepresented communities are strongly encouraged to apply, as well as candidates with California ties."
    ],
    "how_to_apply": "Please submit your resume, cover letter, two references, and one writing sample to CAHouseJob@mail.house.gov and include “Legislative Counsel” in the subject line.",
    "salary_info": null,
    "contact": "CAHouseJob@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-387-21",
    "position_title": "Press and Digital Manager/Legislative Correspondent",
    "office": "Northeastern House Democrat",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "This role will support all aspects of a demanding communications operation, with responsibilities including but not limited to drafting press materials such as releases, background memos, talking points and op-eds; creating content for paid and organic social media on various platforms; and maintaining the website.\n\nThe press and digital manager/legislative correspondent will also execute the office’s mail program, with assistance from Legislative Fellows, interns, and the Staff Assistant.",
    "responsibilities": [
      "Drafting press materials such as releases, background memos, talking points and op-eds",
      "Creating content for paid and organic social media on various platforms",
      "Maintaining the website",
      "Executing the office’s mail program"
    ],
    "qualifications": [
      "Demonstrated interest and experience in communications and Democratic politics",
      "Proficiency with a variety of graphic design and video production tools",
      "Capability of meeting tight deadlines",
      "Strong written and oral communications skills",
      "Ability to think creatively and strategically"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, two professional writing samples and two digital content samples to democratic.hilljob@gmail.com.",
    "salary_info": "$50,000",
    "contact": "democratic.hilljob@gmail.com",
    "equal_opportunity": "Office is an Equal Opportunity Employer committed to building and maintaining an inclusive and diverse work environment. Women, candidates of color, and LGBTQ+ candidates are strongly encouraged to apply."
  },
  {
    "id": "MEM-386-21",
    "position_title": "Staff/Communications Assistant",
    "office": "Congressman Earl Blumenauer",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "Congressman Earl Blumenauer is seeking a Staff/Communications Assistant to serve in his Washington, D.C. Office.\n\nCommunications responsibilities include compiling press clips, preparing graphics, video production, drafting press releases and newsletters, drafting constituent correspondence, and other communication assignments as directed.\n\nAs staff assistant, this person will provide administrative support to the staff, recruit and manage the office interns, greet visitors and answer phones when the office reopens, and respond to constituent requests for services including tours and flags. Additionally, they will assist both the Communications Director and the Legislative Correspondence Manager with their duties.\n\nThe ideal candidate will be enthusiastic about communications work, detailoriented, an excellent writer, and comfortable in a fast-paced environment. Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply, as are candidates with Oregon ties.",
    "responsibilities": [
      "compiling press clips",
      "preparing graphics",
      "video production",
      "drafting press releases and newsletters",
      "drafting constituent correspondence",
      "other communication assignments as directed",
      "provide administrative support to the staff",
      "recruit and manage the office interns",
      "greet visitors and answer phones when the office reopens",
      "respond to constituent requests for services including tours and flags",
      "assist both the Communications Director and the Legislative Correspondence Manager with their duties"
    ],
    "qualifications": [
      "enthusiastic about communications work",
      "detail-oriented",
      "an excellent writer",
      "comfortable in a fast-paced environment"
    ],
    "how_to_apply": "To apply, please submit a resume, cover letter, and writing sample to Resume.Blumenauer@mail.house.gov with “Staff/Communications Assistant” in the subject line.",
    "salary_info": null,
    "contact": "Resume.Blumenauer@mail.house.gov",
    "equal_opportunity": "Our office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status. People of color and people from underrepresented groups are strongly encouraged to apply, as are candidates with Oregon ties."
  },
  {
    "id": "MEM-385-21",
    "position_title": "Legislative Assistant",
    "office": "Congressman Dan Kildee (MI-05)",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "The legislative assistant will be responsible for important issues areas such as taxes, budget, housing, financial services, and small business, among other issues, in a fast-paced congressional office for a member of House Democratic Leadership on the Ways and Means Committee, Budget Committee and Science, Space and Technology Committee.",
    "responsibilities": [
      "drafting bills and amendments",
      "developing strategic plans to advance legislation through Congress",
      "staffing committee meetings",
      "interacting with constituents, district stakeholders, committee/leadership committee staff and federal agencies",
      "writing policy briefing memos and talking points"
    ],
    "qualifications": [
      "self-starting personality",
      "strong written and verbal communication skills",
      "a desire to continually learn and grow",
      "an eagerness to work on a team in a collaborative office environment",
      "Previous work or interest in community development, economic development and municipal finance is a plus.",
      "This is not an entry-level position.",
      "A minimum three years of experience is required.",
      "Michigan ties preferred."
    ],
    "how_to_apply": "Qualified candidates should submit a resume, cover letter and a writing sample to Michigan05jobs@gmail.com. Please no walk-ins or phone calls.",
    "salary_info": null,
    "contact": "Michigan05jobs@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-384-21",
    "position_title": "Scheduler | Executive Assistant",
    "office": "Congresswoman Nanette Diaz Barragán (CA-44)",
    "location": "Southern California | Los Angeles Metro area",
    "posting_date": "2021-10-12",
    "description": "Congresswoman Nanette Diaz Barragán (CA-44) seeks an experienced scheduler.\nMain responsibilities include maintaining the Member’s daily and long-term schedules for both DC and the District; organizing and evaluating all incoming meeting requests and invitations; keeping the Member on schedule throughout the day; working with legislative and communications staff to ensure the Member is prepared for events/meetings; coordinating travel arrangements; processing and managing expenses and reimbursements for the Member; and communicating with constituents by phone and email to address requests, concerns, and questions. Additional responsibilities include other administrative tasks.",
    "responsibilities": [
      "Maintaining the Member’s daily and long-term schedules for both DC and the District",
      "Organizing and evaluating all incoming meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Coordinating travel arrangements",
      "Processing and managing expenses and reimbursements for the Member",
      "Communicating with constituents by phone and email to address requests, concerns, and questions",
      "Other administrative tasks"
    ],
    "qualifications": [
      "Highly organized",
      "Detail-oriented and able to multi-task",
      "Resourceful",
      "Team-oriented",
      "Positive attitude",
      "Availability outside of regular business hours including some weekend availability as needed",
      "Previous scheduling experience (at least one year in a similar position)",
      "Los Angeles Metro area ties and Spanish fluency are a plus."
    ],
    "how_to_apply": "Interested candidates should send a cover letter, resume and three references with “SCHEDULER” in the subject line to CA44Resumes@mail.house.gov.",
    "salary_info": "Salary is commensurate with experience.",
    "contact": "CA44Resumes@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, sexual orientation, gender identity and expression, national origin, disability, military status, age, marital status, or parental status."
  },
  {
    "id": "MEM-379-21",
    "position_title": "Operations Manager",
    "office": "Office of Congresswoman Marilyn Strickland",
    "location": "Washington DC",
    "posting_date": "2021-10-12",
    "description": "Responsibilities include working with the Chief of Staff to maintain the Member’s daily and long-term DC schedule; organizing and evaluating all DCbased meeting requests and invitations; keeping the Member on schedule throughout the day; and working with legislative and communications staff to ensure the Member is prepared for events/meetings.\n\nThis position will also play an active role in office operations. This staffer will be the office’s Financial Administrator and manage the day-to-day office finances, including processing reimbursements, bills, and payroll. The Operations Manager is the primary point of contact for House support offices and works with IT to ensure that staff/interns are appropriately set up with technology. The staffer also co-manages the DC Staff Assistant/Press Assistant and District-based Executive Assistant, providing guidance on front office operations, the DC internship program, and district scheduling.",
    "responsibilities": [
      "Working with the Chief of Staff to maintain the Member’s daily and long-term DC schedule",
      "Organizing and evaluating all DCbased meeting requests and invitations",
      "Keeping the Member on schedule throughout the day",
      "Working with legislative and communications staff to ensure the Member is prepared for events/meetings",
      "Manage the day-to-day office finances, including processing reimbursements, bills, and payroll",
      "Primary point of contact for House support offices",
      "Works with IT to ensure that staff/interns are appropriately set up with technology",
      "Co-manages the DC Staff Assistant/Press Assistant and District-based Executive Assistant, providing guidance on front office operations, the DC internship program, and district scheduling"
    ],
    "qualifications": [
      "Must be highly organized, proactive, and able to work as part of a team in a fast-paced environment",
      "Ideal candidate is solutions oriented",
      "Customer service experience and prior scheduling or office administration familiarity",
      "Requires availability outside of regular business hours"
    ],
    "how_to_apply": "Applicants should submit a cover letter, resume, and three references to WA10Resumes@gmail.com using “Operations Manager” and their name in the subject line. No phone calls or drop-ins, please.",
    "salary_info": null,
    "contact": "WA10Resumes@gmail.com",
    "equal_opportunity": "The office is an equal opportunity employer; we do not discriminate on the basis of race, sex, color, age, religion, disability, national origin, uniformed status, sexual orientation, or gender identity or expression. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-374-21",
    "position_title": "STAFF ASSISTANT",
    "office": "Oceanside office",
    "location": "Oceanside, CA",
    "posting_date": "2021-10-12",
    "description": "This position is responsible for managing the front desk and all administrative duties of the Oceanside office. The staff member in this role interacts regularly with constituents and answers correspondence and verbal communications with constituents. This staff member is located primarily in the Oceanside, CA office, but may be required to travel on occasion to the Dana Point office.",
    "responsibilities": [
      "Manages the front desk",
      "Collaborates with Dana Point Staff Assistant and Legislative Correspondent to log all incoming mail and correspondence",
      "Tracks office supplies",
      "Assists with recruiting, interviewing, training and management of Oceanside interns",
      "Oversees production and tracking of certificates and proclamations",
      "Manages the Congressional App Challenge program and other projects, as assigned",
      "Screens phone calls and refers cases, when appropriate, to other district office",
      "Sorts incoming mail",
      "Scans and sends invoices to DC office",
      "Logs all incoming and outgoing mail and incoming telephone calls relating to casework in IQ",
      "Maintains records of incoming grants, constituent recognition and thank you letters",
      "Prepares material for the Weekly Report",
      "Meets attendance requirements as established by the office",
      "Maintains a good working relationship with the Congressman, staff, and constituents",
      "Performs other duties as assigned",
      "Takes initiative to identify needs and takes action to complete tasks required",
      "Knowledge of office policies, practices, and procedures"
    ],
    "qualifications": [
      "Strong oral and written communication skills",
      "Familiarity with local, state, and federal agencies and departments",
      "Familiarity with all issues and events in the district in which the Congressman is involved",
      "Proficiency with word processing and spreadsheets",
      "Professional telephone manner",
      "Temperament to communicate with a variety of personalities in a tactful, pleasant, and professional manner",
      "Ability to perform the essential job functions above",
      "Ability to work cooperatively and courteously with others",
      "Thoroughness and careful attention to detail"
    ],
    "how_to_apply": "Please send resume, cover letter, and three professional references to: CA49.applications@mail.house.gov",
    "salary_info": null,
    "contact": "CA49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer; we do not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity or expression, or sexual orientation. We strongly value the diversity of our employees and encourage candidates from diverse backgrounds to apply, including women, people of color, and members of the LGBTQIA community."
  },
  {
    "id": "MEM-373-21",
    "position_title": "Press Secretary/Digital Director",
    "office": "Rep. Frederica S. Wilson",
    "location": "DC- and district-based",
    "posting_date": "2021-10-12",
    "description": "The Office of Rep. Frederica S. Wilson seeks an experienced, creative, and techsavvy press secretary/digital director to join our communications team.\n\nThe press secretary/digital director will work closely with the communications director to implement an ambitious communications strategy. Candidates should have strong writing and creative skills, strong editing and proofreading skills, work well under pressure, and the availability to work long hours when necessary.\n\nThe ideal candidate will have at least one year or one federal campaign cycle of communications experience, including digital strategy, social media management, content creation, editing of graphics, photos, and videos using software including Adobe Creative Cloud. The candidate should have experience with Facebook business manager, Google Ads, and digital analytics. This is not an entry level position.\n\nCandidates from diverse backgrounds and with Florida ties are encouraged to apply. Fluency in Spanish or Kreyòl is a plus.",
    "responsibilities": [
      "Managing the member’s social media accounts, website, media lists, newsletters, mailers, advertisements, communications schedule, and other resources",
      "Compiling daily press clips, leading communications briefings, monitoring analytic data",
      "Assisting in the development of materials intended for the media, such as press releases, talking points, emails, advisories, pitches, media kits, and reports",
      "Creating graphics, editing photos, and videos",
      "Planning and staffing virtual, DC- and district-based events such as press conferences, tele-townhalls, and roundtables.",
      "Building relationships with local and national reporters",
      "Maximizing the member’s visibility through digital solutions",
      "Pitching innovative strategies to expand the Congresswoman’s reach on social media and elsewhere",
      "Photographing the Congresswoman at press conferences and other events",
      "Managing press interns and fellows"
    ],
    "qualifications": [
      "At least one year or one federal campaign cycle of communications experience, including digital strategy, social media management, content creation, editing of graphics, photos, and videos using software including Adobe Creative Cloud.",
      "Experience with Facebook business manager, Google Ads, and digital analytics.",
      "Strong writing and creative skills, strong editing and proofreading skills, work well under pressure, and the availability to work long hours when necessary.",
      "Candidates from diverse backgrounds and with Florida ties are encouraged to apply.",
      "Fluency in Spanish or Kreyòl is a plus."
    ],
    "how_to_apply": "Please submit your resume, cover letter, two writing samples, and a digital sample to FL24.Resumes@mail.house.gov and include “Press Secretary/Digital Director” in the subject line.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-371-21",
    "position_title": "Staff Assistant/Legislative Correspondent",
    "office": "The Office of Congresswoman Frederica S. Wilson",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "The Office of Congresswoman Frederica S. Wilson seeks an energetic, motivated, and organized individual to serve as a staff assistant/legislative correspondent.",
    "responsibilities": [
      "managing front desk operations",
      "driving the member",
      "managing constituent correspondence",
      "coordinating tours",
      "supervising interns",
      "greeting visitors",
      "processing flag requests",
      "other duties as assigned"
    ],
    "qualifications": [
      "team player who excels in a fast-paced environment",
      "possesses excellent communication and organizational skills",
      "can handle unforeseen events well",
      "Applicants must have access to a car and a clean driving record"
    ],
    "how_to_apply": "To apply, please submit a resume, a writing sample, and a cover letter to FL24.Resumes@mail.house.gov and include “Staff Assistant/Legislative Correspondent” in the title. No calls, please.",
    "salary_info": null,
    "contact": "FL24.Resumes@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-370-21",
    "position_title": "Counsel",
    "office": "The House Committee on Education and Labor (Democratic staff)",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "The House Committee on Education and Labor (Democratic staff) seeks Counsel to manage oversight and investigations on the education and labor team.\n\nResponsibilities include organizing oversight hearings, writing investigative reports and executing a complementary legislative and oversight strategy with positive results. Qualified applicants must have a J.D. and relevant policy experience with at least 3-5 years of experience conducting investigations.\n\nExperience in education and labor policy is not a requirement, however preferred. In addition, the applicant must have exceptional writing skills, strong attention to detail, and the ability to juggle multiple projects.",
    "responsibilities": [
      "Organizing oversight hearings",
      "Writing investigative reports",
      "Executing a complementary legislative and oversight strategy with positive results"
    ],
    "qualifications": [
      "J.D.",
      "Relevant policy experience with at least 3-5 years of experience conducting investigations",
      "Exceptional writing skills",
      "Strong attention to detail",
      "The ability to juggle multiple projects"
    ],
    "how_to_apply": "To apply, applicants must submit a resume, a writing sample (5-10 pages), a writing sample describing an investigation the applicant would like to pursue, and 3 professional references. The second writing sample must include a hyperlink to a current news item from any source (newspapers, blogs, or other websites) and two paragraphs detailing why the Committee should investigate the issue presented and the steps the applicant would take to begin an investigation.\n\nPlease submit all materials to E&L.Jobs@mail.house.gov with “Counsel” in the subject line.",
    "salary_info": "The salary range is $85K - $100K, commensurate with education and experience.",
    "contact": "E&L.Jobs@mail.house.gov",
    "equal_opportunity": "The office is an equal opportunity employer and does not discriminate on the basis of race, color, religion, sex, national origin, age, disability, gender identity, or sexual orientation. Candidates of diverse backgrounds are strongly encouraged to apply."
  },
  {
    "id": "MEM-368-21",
    "position_title": "Field Representative/Caseworker",
    "office": "Rural Oregon Republican Congressman",
    "location": "Eastern Oregon",
    "posting_date": "2021-10-12",
    "description": "Rural Oregon Republican Congressman seeks a driven and organized individual to serve as a Field Representative/Caseworker in the Representative's Eastern Oregon district office. Ideal candidates will have excellent written and verbal communication skills, impeccable time management skills, and an ability to meet deadlines in a fast-paced environment.",
    "responsibilities": [
      "Acts as the grass roots representative for the Member within his or her area of responsibility including answering casework correspondence, verbal communications with constituents, and acting as liaison with federal, district, and local agencies. The individual will also engage with city, county, district, the chamber of commerce, and other groups to form effective relationships with the Member;",
      "Assesses casework for issues requiring legislative action and makes recommendations to the District Director and/or Chief of Staff;",
      "Maintains up-to-date files on all cases and categories of information significant to the office;",
      "Prepares reports for the Congressman and Chief of Staff on district activities in his or her assigned issue areas; and",
      "performs other duties as assigned."
    ],
    "qualifications": [],
    "how_to_apply": "Interested candidates should email a cover letter and resume to ResumesOR@mail.house.gov.",
    "salary_info": null,
    "contact": "ResumesOR@mail.house.gov",
    "equal_opportunity": null
  },
  {
    "id": "MEM-367-21",
    "position_title": "Legislative Assistant",
    "office": "Congressman Mike Levin (D-CA)",
    "location": "Washington, D.C.",
    "posting_date": "2021-10-12",
    "description": "Congressman Mike Levin (D-CA) is seeking a legislative assistant for a policy portfolio that includes energy, environment, and climate change issues. The position covers his work on the House Natural Resources Committee and Select Committee on the Climate Crisis. The portfolio will also include other policy issues as needed.\n\nThis individual will work with the legislative director and chief of staff to advance and execute the Congressman’s legislative agenda both on and off committee.",
    "responsibilities": [
      "Staffing the Congressman at hearings and markups",
      "Developing and analyzing legislation and policy",
      "Drafting remarks, hearing questions, talking points, and memos",
      "Maintaining strong relationships with constituent and stakeholder groups",
      "Drafting letters to stakeholders, the Administration, and other Members",
      "Staffing the Congressman in meetings and at other events"
    ],
    "qualifications": [
      "Experience working on environment policy issues",
      "Strong written and verbal communications skills",
      "A knowledge of House legislative processes",
      "Should work well on a team",
      "District ties and prior legislative experience in a House or Senate office are a plus"
    ],
    "how_to_apply": "To apply, please send a resume, cover letter, and writing sample to ca49.applications@mail.house.gov.",
    "salary_info": null,
    "contact": "ca49.applications@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-365-21",
    "position_title": "APPROPRIATIONS ASSOCIATE/COUNSEL",
    "office": "Rep. Marcy Kaptur",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "Rep. Marcy Kaptur seeks a highly experienced and professional legislative staffer to handle a portfolio including energy/environment (both in the personal office and as a liaison to her appropriations subcommittee staff in her role as Chair), as well as transportation and infrastructure.\n\nCandidates must be familiar with the energy and environment portfolio, the appropriations process, advancing legislation, analyzing and briefing on complex policy issues, and drafting a wide array of written materials (including materials for Committee and Floor activities).\n\nExperience with Great Lakes issues, the Army Corps of Engineers, and the Environmental Protection Agency is strongly encouraged. Strong written and verbal communication skills, and a demonstrated ability to work collaboratively in a fast-paced environment are critical. A minimum of five years of relevant and congressional experience is required.",
    "responsibilities": [],
    "qualifications": [
      "Familiar with the energy and environment portfolio",
      "Familiar with the appropriations process",
      "Experience advancing legislation",
      "Experience analyzing and briefing on complex policy issues",
      "Experience drafting a wide array of written materials (including materials for Committee and Floor activities)",
      "Experience with Great Lakes issues, the Army Corps of Engineers, and the Environmental Protection Agency is strongly encouraged.",
      "Strong written and verbal communication skills",
      "Demonstrated ability to work collaboratively in a fast-paced environment",
      "A minimum of five years of relevant and congressional experience is required."
    ],
    "how_to_apply": "Applicants should email a resume, cover letter, two writing sample, and references as individual files in PDF format to Steve.Katich@mail.house.gov with “Appropriations Associate” in the subject line. No phone calls, faxes, emails, or walk-ins, please.",
    "salary_info": null,
    "contact": "Steve.Katich@mail.house.gov",
    "equal_opportunity": "This office is an equal opportunity employer and strongly encourages candidates from diverse backgrounds to apply."
  },
  {
    "id": "MEM-364-21",
    "position_title": "Legislative Assistant",
    "office": "Senior Democratic House Member",
    "location": "Washington D.C.",
    "posting_date": "2021-10-12",
    "description": "The Legislative Assistant will be responsible for drafting and monitoring legislation, preparing materials for committee hearings and markups, representing the Member in meetings/briefings, working with constituent organizations, and performing other tasks as assigned.",
    "responsibilities": [
      "Drafting and monitoring legislation",
      "Preparing materials for committee hearings and markups",
      "Representing the Member in meetings/briefings",
      "Working with constituent organizations",
      "Performing other tasks as assigned"
    ],
    "qualifications": [
      "A strong understanding of the legislative process",
      "Excellent writing and communication skills",
      "A demonstrated ability to work effectively in a fast-paced office"
    ],
    "how_to_apply": "Candidates should send a resume, cover letter, and two writing samples to genleg2024@gmail.com",
    "salary_info": null,
    "contact": "genleg2024@gmail.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-363-21",
    "position_title": "Staff Assistant",
    "office": "U.S. House of Representatives, Committee on Oversight and Reform, Democratic (Majority) Staff",
    "location": "District of Columbia",
    "posting_date": "2021-10-12",
    "description": "The House Committee on Oversight and Reform Democratic Staff has an opening for a Staff Assistant. Duties include: answering telephones; receiving visitors at the front desk; assisting with the tracking and processing of committee correspondence; receiving, tracking and processing large document productions; providing administrative support for committee hearings, markups and meetings; entering data and navigating databases with accuracy; and proofreading documents and correspondence for style and typographical errors.",
    "responsibilities": [
      "answering telephones",
      "receiving visitors at the front desk",
      "assisting with the tracking and processing of committee correspondence",
      "receiving, tracking and processing large document productions",
      "providing administrative support for committee hearings, markups and meetings",
      "entering data and navigating databases with accuracy",
      "proofreading documents and correspondence for style and typographical errors"
    ],
    "qualifications": [
      "excellent organizational and time management skills",
      "the ability to work cooperatively and courteously with others",
      "strong written and oral communication skills",
      "proficiency in Microsoft Word, Excel, and Zoom and WebEx web conferencing platforms",
      "good judgment and discretion",
      "flexibility in assisting with daily tasks and projects",
      "One year of prior Capitol Hill experience is strongly preferred."
    ],
    "how_to_apply": "Please send a resume and cover letter to oversightjobs@mail.house.gov, with “Staff Assistant” in the subject line.\nPlease attach the resume and cover letter with the file name using the following format: “LastName.FirstName.Resume” and “LastName.FirstName.Cover Letter.” No unsolicited calls, emails, or drop-ins, please.",
    "salary_info": null,
    "contact": "oversightjobs@mail.house.gov",
    "equal_opportunity": "Candidates with diverse backgrounds and experiences are strongly encouraged to apply."
  },
  {
    "id": "MEM-362-21",
    "position_title": "Legislative Assistant",
    "office": "Senior House Democratic Member of Foreign Affairs Committee",
    "location": null,
    "posting_date": "2021-10-12",
    "description": "Senior House Democratic Member of Foreign Affairs Committee seeks legislative assistant to handle work on that committee and related issues.\n\nIn addition to a strong interest and experience in foreign policy issues and the operations of U.S. foreign affairs agencies, the successful applicant will be organized, possess excellent communication and time-management skills, the ability to exercise sound, independent judgment, and the ability to work cooperatively and courteously with others.",
    "responsibilities": [],
    "qualifications": [],
    "how_to_apply": "To apply, please send a resume and a cover letter to foreignpolicyla@yahoo.com.",
    "salary_info": null,
    "contact": "foreignpolicyla@yahoo.com",
    "equal_opportunity": null
  },
  {
    "id": "MEM-163-21",
    "position_title": "DISTRICT COORDINATOR",
    "office": "Office of Representative Spanberger",
    "location": "Glen Allen, VA",
    "posting_date": "2021-10-12",
    "description": "The Office of Representative Spanberger seeks a motivated, creative, self-starter to join the district constituent services staff as a District Coordinator in the Glen Allen, VA office.\n\nAdditional duties as assigned.",
    "responsibilities": [
      "Responding to constituent inquiries",
      "Managing constituent casework with federal agencies",
      "Working with the legislative team to address constituent concerns",
      "District outreach to include staffing the Congresswoman, representing the office, listening to district stakeholders, and updating the community at district events"
    ],
    "qualifications": [
      "Motivated self-starters with strong interpersonal, customer service, time-management, and organizational skills",
      "Significant experience interacting with the public",
      "Positive, solution-driven personality",
      "Excellent oral and written communication skills",
      "Keen attention to detail",
      "Ability to multitask effectively in a fast-paced environment"
    ],
    "how_to_apply": "Please submit a cover letter, resume, writing sample, and references to spanberger.inquiries@mail.house.gov with “District Coordinator” in the subject line.",
    "salary_info": null,
    "contact": "spanberger.inquiries@mail.house.gov",
    "equal_opportunity": "Representative Spanberger’s office is an equal opportunity employer. The office does not discriminate on the basis of race, color, religion, gender, sexual orientation, gender identify, national origin, age, genetic information, disability, or uniformed service."
  }
]